{"details":[{"title":"CM Siddaramaiah recounts his first state budget","content":"<blockquote class=\"twitter-tweet\" data-lang=\"en\">\n<p lang=\"en\" dir=\"ltr\">Today when I rise before the Legislature - our own Anubhava Mantapa - I picture the last person who needs a help, the farmer who needs hope & the girl who has a dream.<br \/>\n<br \/>\nIn responding to their aspirations I am guided by Basavanna, Ambedkar & Gandhi.<a href=\"https:\/\/twitter.com\/hashtag\/NavaKarnatakaBudget2018?src=hash&ref_src=twsrc%5Etfw\">#NavaKarnatakaBudget2018<\/a><\/p>\n— Siddaramaiah (@siddaramaiah) <a href=\"https:\/\/twitter.com\/siddaramaiah\/status\/964360875942461440?ref_src=twsrc%5Etfw\">February 16, 2018<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2018-02-16 11:38:16","status":"1"},{"title":"","content":"<p>Ahead of presenting budget, CM says he is guided by Basavanna, Ambedkar and Gandhi.<\/p>","date":"2018-02-16 11:39:02","status":"1"},{"title":"","content":"<p>Budget speech begins.<\/p>","date":"2018-02-16 11:39:28","status":"1"},{"title":"","content":"<p>\"It is the beauty of democracy that a farmer's son is able to rise to present his 13th budget,\" says Siddaramaiah.<\/p>","date":"2018-02-16 11:49:09","status":"1"},{"title":"","content":"<p>\"It is the right of the people to demand accountability.\"<\/p>","date":"2018-02-16 11:49:29","status":"1"},{"title":"","content":"<p>Revenue surplus is at Rs 127 crore. Fiscal deficit is at Rs. 35,127 crore.<\/p>","date":"2018-02-16 11:50:22","status":"1"},{"title":"","content":"<p>It is a 1.62 lakh crore budget outlay. Earlier expectation was for Siddaramaiah to present an over 2 lakh crore budget.<\/p>","date":"2018-02-16 11:51:05","status":"1"},{"title":"","content":"<p>This is a pro-farmer government.<\/p>","date":"2018-02-16 11:51:55","status":"1"},{"title":"","content":"<p>Frequent changes in the GST regime and glitches in the IT has affected tax collection, says Siddaramaiah.<\/p>","date":"2018-02-16 11:52:24","status":"1"},{"title":"","content":"<p>State government employees get 30 per cent hike at a cost of Rs 10,508 crore.<\/p>","date":"2018-02-16 12:02:23","status":"1"},{"title":"","content":"<p>\"I am not only a dreamer, I work to realize dreams. Karnataka today is one of the first states in the country in terms of development Interest free loans to farmers, Indira Canteens and many more schemes for people, says Siddaramaiah.\"<\/p>","date":"2018-02-16 12:04:08","status":"1"},{"title":"","content":"<p>\"Our policies have been pathbreaking for the country. Kannadigas are proud of Karnataka and the country looks at our state with pride.\"<\/p>","date":"2018-02-16 12:04:38","status":"1"},{"title":"","content":"<p>\"Demonitisation shadowed the beginning of last year, because of it, our state's financial situation was impacted. GST came in the middle of the year.\"<\/p>","date":"2018-02-16 12:05:13","status":"1"},{"title":"","content":"<p>Excise duty increased by 8 per cent.<\/p>","date":"2018-02-16 12:05:42","status":"1"},{"title":"","content":"<p>Gross state domestic product in the year grew at the rate of 8.5% as against rate of 7.5% during 2016-17.<\/p>","date":"2018-02-16 12:06:07","status":"1"},{"title":"","content":"<p>The state's consolidated fund size for 2017-18 was fixed at Rs 1,86,561 crore. This includes support of Rs. 89,957 crore.<\/p>","date":"2018-02-16 12:06:47","status":"1"},{"title":"","content":"<p>The consolidated fund size for the year is expected to be Rs. 1,89,679 crore.<\/p>","date":"2018-02-16 12:06:59","status":"1"},{"title":"","content":"<p>White-topping of 150 km of Bengaluru roads, 88 lake rejuvenation proposed in budget.<\/p>","date":"2018-02-16 12:08:44","status":"1"},{"title":"","content":"<p>\"In the last 5 years, water shed development department has developed 10.96 lakh hectares of area at an expenditure of Rs. 1841 crore,\" says Siddaramaiah.<\/p>","date":"2018-02-16 12:09:42","status":"1"},{"title":"","content":"<p>\"Agriculture is the priority sector of our Government. In each of my budgets, I have given a big share of state's income to agriculture,\" says Siddaramaiah.<\/p>","date":"2018-02-16 12:10:21","status":"1"},{"title":"","content":"<p>\"For the first time in the state, a scheme 'Raitha Belaku' will be started to give direct income assistance to mitigate miseries of dryland farmers. Rs. 5,000 per hectare till Rs. 10,000 for each farmer will be given to those growing rain-fed crops.\"<\/p>","date":"2018-02-16 12:11:29","status":"1"},{"title":"","content":"<p>\"Expenditure to state for this scheme will be Rs. 3,500 crore per year and 70 lakh farmers will benefit.\"<\/p>","date":"2018-02-16 12:11:55","status":"1"},{"title":"","content":"<p>Farm loan waiver upto the tune of Rs 1 lakh from co-operative banks on the demise of the farmer.<\/p>","date":"2018-02-16 12:12:40","status":"1"},{"title":"","content":"<p>Loans of Rs 50,000 at zero per cent interest for female fishermen.<\/p>","date":"2018-02-16 12:13:04","status":"1"},{"title":"","content":"<p>Free bus pass extended to all students across state.<\/p>","date":"2018-02-16 12:13:46","status":"1"},{"title":"","content":"<p>Reduced sales tax on ATF to small aircraft from 28 to 5 percent to support UDAN scheme.<\/p>","date":"2018-02-16 12:14:24","status":"1"},{"title":"","content":"<p>New Agricultural Research Center will be established in Muddebihala of Vijayapura District.<\/p>","date":"2018-02-16 12:20:10","status":"1"},{"title":"","content":"<p>Agriculture Department outlay of Rs 5,849 crore in 2018-19.<\/p>","date":"2018-02-16 12:20:26","status":"1"},{"title":"","content":"<p>Tree plantation programme of 1 km on either side of rivers proposed across the state.<\/p>","date":"2018-02-16 12:20:48","status":"1"},{"title":"","content":"<p>Exotic fruits like Rambutan, Durian, Dragon fruit, Litchi, Mangosteen, Apple Ber, Avocado to be given priority and promoted.<\/p>","date":"2018-02-16 12:21:39","status":"1"},{"title":"","content":"<p>Use of hydrophonics technology will be promoted for growing of tomato, capsicum, brinjal and leafy vegetables in urban and peri-urban areas.<\/p>","date":"2018-02-16 12:22:02","status":"1"},{"title":"","content":"<p>A total amount of Rs 995 crore to be provided to Horticulture department.<\/p>","date":"2018-02-16 12:22:32","status":"1"},{"title":"","content":"<p>Compensation paid on account of fire accidents caused to stacks of crop cuttings will be doubled to a maximum of Rs 20,000.<\/p>","date":"2018-02-16 12:24:42","status":"1"},{"title":"","content":"<p>\"Develop comprehensive tourism amenities in 20 heritage tourism destinations including Hampi, Beluru-Halebidu, Shravanabelagola, Nandi hills, Kalburgi,\" says Siddaramaiah.<\/p>","date":"2018-02-16 12:25:37","status":"1"},{"title":"","content":"<p>On the lines of Delhi Haat, Mysuru Haat will be developed at Karnataka Exhibition Authority in Mysuru.<\/p>","date":"2018-02-16 12:35:55","status":"1"},{"title":"","content":"<p>To provide protection to about 4000 migratory shepherds and their sheep, grant of Rs. 4 crore will be provided for procurement of temporary tent, iron wire fencing and others.<\/p>","date":"2018-02-16 12:36:52","status":"1"},{"title":"","content":"<p>\"Sheep and goat rearing is a profitable sub-occupation of farmers. Sheep rearing will be encouraged through financial assistance from National Co-operative Development Corporation. Government will give guarantee for Rs 187.5 crore loan to be given by NCDC,\" says Siddaramaiah.<\/p>","date":"2018-02-16 12:38:24","status":"1"},{"title":"","content":"<p>Total of Rs 2377 crore is provided during the year 2018-19 for Animal Husbandry Department.<\/p>","date":"2018-02-16 12:38:46","status":"1"},{"title":"","content":"<p>An amount of Rs. 7.5 crore will be spent for modernisation of 75 sheep\/goat markets in the state by providing weighing machine, water facilities and sheep yard with wire fencing.<\/p>","date":"2018-02-16 12:39:46","status":"1"},{"title":"","content":"<p>Around 50 to 60 lakh sheep and goats are being slaughtered annually for meat in the state. For value addition to the skin of sheep and goat, skin processing and tanning center will be established at a cost of Rs 2 crore.<\/p>","date":"2018-02-16 12:40:43","status":"1"},{"title":"","content":"<p>A total of Rs 1,681 crore is allocated to the commerce and industries department.<\/p>","date":"2018-02-16 12:41:29","status":"1"},{"title":"","content":"<p>To promote start ups in Karnataka, an incubation center will be established in Kalaburgi in association with the Deshapande foundation at the cost of Rs 5 crore.<\/p>","date":"2018-02-16 12:42:46","status":"1"},{"title":"","content":"<p>To promote hardware equipment and semi conductor chip design and development, semi-conductor fabless accelerator lab (SFAL) will be established with the association of India Electronic and Semiconductor Association.<\/p>","date":"2018-02-16 12:43:39","status":"1"},{"title":"","content":"<p>Centre for excellence in designers to be established to promote designs of entrepreneurs and design products.<\/p>","date":"2018-02-16 12:44:15","status":"1"},{"title":"","content":"<blockquote class=\"twitter-tweet\" data-lang=\"en\">\n<p lang=\"en\" dir=\"ltr\"><a href=\"https:\/\/twitter.com\/hashtag\/SidduBudget2018?src=hash&ref_src=twsrc%5Etfw\">#SidduBudget2018<\/a> fellowship for Students working in field of Kannada software development<\/p>\n— Rashmi Belur (@RashmiBS_TNIE) <a href=\"https:\/\/twitter.com\/RashmiBS_TNIE\/status\/964396075078492160?ref_src=twsrc%5Etfw\">February 16, 2018<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2018-02-16 12:45:34","status":"1"},{"title":"","content":"<p>Representation of women in police department enhanced by 25% in the next five years.<\/p>","date":"2018-02-16 12:47:29","status":"1"},{"title":"","content":"<p>Direct recruitment in police department for the State's athletes who have had extraordinary achievements in the field of national and international level sports.<\/p>","date":"2018-02-16 12:48:04","status":"1"},{"title":"","content":"<p>A permanent memorial will be built in Bengaluru to honour the bravery of the police.<\/p>","date":"2018-02-16 12:48:38","status":"1"},{"title":"","content":"<p>Rs 5 crore for Cyber Forensic Laboratories to help Cyber police stations to effectively investigate and prevent cyber crime.<\/p>","date":"2018-02-16 12:49:14","status":"1"},{"title":"","content":"<p>Nirbhaya kendras will be established at all police commissioner's office.<\/p>","date":"2018-02-16 12:50:02","status":"1"},{"title":"","content":"<p>Toilets for women will be constructed in all police stations and offices.<\/p>","date":"2018-02-16 12:50:25","status":"1"},{"title":"","content":"<p>Video linking system will be provided to all district prisons and courts for speedy disposal of pending trials.<\/p>","date":"2018-02-16 12:51:00","status":"1"},{"title":"","content":"<p>With a cost of Rs 85 crore, new high security prison will be constructed in Mangaluru.<\/p>","date":"2018-02-16 12:51:35","status":"1"},{"title":"","content":"<p>Karnataka Prison Development Board will be established to give skill training in various professions to prisoners.<\/p>","date":"2018-02-16 12:51:56","status":"1"},{"title":"","content":"Rs 100 crore high security branch will be established at Bengaluru Central Prison.","date":"2018-02-16 12:52:59","status":"1"},{"title":"","content":"<p>50 fire stations to be established at the newly formed taluks in the next five years.<\/p>","date":"2018-02-16 12:59:20","status":"1"},{"title":"","content":"<p>Rs 6647 crore for Home department.<\/p>","date":"2018-02-16 12:59:40","status":"1"},{"title":"","content":"<p>Total outlay of Rs 15,998 crore to Water Resources Department.<\/p>","date":"2018-02-16 01:00:45","status":"1"},{"title":"","content":"<p>Feasibility study for construction of balancing reservoir through flood flow canal near Navile.<\/p>","date":"2018-02-16 01:01:03","status":"1"},{"title":"","content":"<p>Project to fill Mantur tank of Mudhol taluk of Bagalkot district at cost of Rs 50 crore.<\/p>","date":"2018-02-16 01:01:33","status":"1"},{"title":"During 2018-19, some approved projects to be implemented:","content":"<ol>\n    <li>\n    <div><span style=\"font-size: small;\">Modernisation of canals of Karanja project of Bidar district.<\/span><\/div>\n    <\/li>\n    <li>\n    <div><span style=\"font-size: small;\">Tank filling for 17 tanks in and around Ranebennur, Byadagi and Asuni of Hirekerura taluk by lifting water from Kumudavati river.<\/span><\/div>\n    <\/li>\n    <li>\n    <div><span style=\"font-size: small;\">Modernisation of right bank canal and canal netowkr of Mullamari lower bank project.<\/span><\/div>\n    <\/li>\n    <li>\n    <div><span style=\"font-size: small;\">Works to fill Channarayapatna taluk from Amanikere of the said taluk to provide drinking water.<\/span><\/div>\n    <\/li>\n    <li>\n    <div><span style=\"font-size: small;\">Detailed project of development works of Kudala Sangama and Chikkasangama kshetra.<\/span><\/div>\n    <\/li>\n<\/ol>","date":"2018-02-16 01:03:34","status":"1"},{"title":"","content":"<p>A total of Rs 14,136 crore is allocated to the energy department.<\/p>","date":"2018-02-16 01:06:29","status":"1"},{"title":"","content":"<p>Subject to electricity supply limits and conditions, electricity consumption expenses of 7 hours per day will be reimbursed to consumers in respect of private HT and LT community to lift irrigation units of co-operative societies of members with a capacity of 10 HP and less.<\/p>","date":"2018-02-16 01:07:01","status":"1"},{"title":"","content":"<p>Rs 200 crore allocated for Christian community. Programmes for comprehensive development of Jain and Sikh communities at Rs 80 crore. Diversity and Minority study chair at Bengaluru Central University.<\/p>","date":"2018-02-16 01:07:37","status":"1"},{"title":"Five mobile apps to be developed for Survey Department","content":"<ol>\n    <li><span style=\"font-size: small;\">Samyojane - to obtain citizen service details of the department<\/span><\/li>\n    <li><span style=\"font-size: small;\">Dishank- to obtain survey number and map on spot<\/span><\/li>\n    <li><span style=\"font-size: small;\">Samikshe - for issuance of digital sketches<\/span><\/li>\n    <li><span style=\"font-size: small;\">Aadhaar Sangrahane - to collect public Aadhaar numbers<\/span><\/li>\n    <li><span style=\"font-size: small;\">Moulya - to know guidance value of any immovable property<\/span><\/li>\n<\/ol>","date":"2018-02-16 01:08:50","status":"1"},{"title":"","content":"<p>State government allocates Rs 147 crore for E-governance department.<\/p>","date":"2018-02-16 01:09:23","status":"1"},{"title":"","content":"<p>Government to upgrade Sakaala 2.0 using the modern e-governance tools like e-sing, digital locker etc.<\/p>","date":"2018-02-16 01:10:33","status":"1"},{"title":"","content":"<p>Services to be made faceless, cashless and paperless. Using the tools, citizens can submit applications for availing service to any of the citizen service centres.<\/p>","date":"2018-02-16 01:11:15","status":"1"},{"title":"","content":"<p>165 motorized and 460 country boats functional at Murdeshwara. For safe landing of these boats, an amount of Rs 1 crore given for preliminary study of outer harbour construction.<\/p>","date":"2018-02-16 01:12:01","status":"1"},{"title":"","content":"<p>A grant of Rs 2.5 crore will be provided to 2500 trawl boats at Rs 10,000 each.<\/p>","date":"2018-02-16 01:13:16","status":"1"},{"title":"","content":"<p>A total amount of Rs 457 crore for Sericulture department.<\/p>","date":"2018-02-16 01:13:40","status":"1"},{"title":"","content":"<p>A silk museum will be developed at Talghattapura's Karnataka State Silk Research and Development Institute.<\/p>","date":"2018-02-16 01:13:58","status":"1"},{"title":"","content":"<p>\"Propose to undertake bivoltine silk worm farming at 40 acres of land under Sericulture Deparment at BR Hills. Will develop mulberry tree agriculture, silk worm farming shed as well,\" says Siddaramaiah.<\/p>","date":"2018-02-16 01:15:21","status":"1"},{"title":"","content":"<p>Sericulture tourism on the Bengaluru-Mysuru corridor in collaboration with Central Silk Board. An international level 'live museum' will be established in the sericulture area of Channapatna.<\/p>","date":"2018-02-16 01:16:22","status":"1"},{"title":"","content":"<p>Rs 237 crore allocated to youth empowerment and sports department.<\/p>","date":"2018-02-16 01:19:11","status":"1"},{"title":"","content":"<p>Construction of sports hostel for women athletes in five districts of the state. A youth helpline will be established to provide education and employment related information to the youth.<\/p>","date":"2018-02-16 01:20:12","status":"1"},{"title":"","content":"<p>Karnataka Sport University will be established in the state under public private partnership.<\/p>","date":"2018-02-16 01:20:23","status":"1"},{"title":"","content":"<p>750 backward class students to be sent to foreign universities for higher education in the next five years. 150 students in 2018-19.<\/p>","date":"2018-02-16 01:20:59","status":"1"},{"title":"","content":"<p>Irrigation schemes like filling of tanks of Rs 1,137 crore for Belagavi, schemes worth Rs 190 crore for Bagalkot, Rs 50 crore for Hassan.<\/p>","date":"2018-02-16 01:22:16","status":"1"},{"title":"","content":"<p>New heavy vehicle driving training centres in Bengaluru and Dharwad.<\/p>","date":"2018-02-16 01:23:12","status":"1"},{"title":"","content":"<p>Ten double decker buses through KSRTC for operation between cities.<\/p>","date":"2018-02-16 01:23:34","status":"1"},{"title":"","content":"<p>CCTV cameras in 1000 buses of BMTC under Nirbhaya scheme.<\/p>\n<p><img src=\"http:\/\/cms.newindianexpress.com\/FCKeditor\/fckeditor_img\/CCTV--image.jpg\" width=\"400\" height=\"260\" align=\"middle\" alt=\"\" \/><\/p>","date":"2018-02-16 01:25:29","status":"1"},{"title":"DPR for Metro Phase 3 for 105.55 km length line","content":"<p>Route J P Nagar to K R Puram via Hebbal, Toll Gate to Kadabagere,  Gottigere to Basavapura, R K Hedge Nagar to Aerospace Park, Kogilu Cross to Rajanakunte, Bommasandra to Attibele and Ibaluru to Karmelram will be taken up.<\/p>","date":"2018-02-16 01:27:27","status":"1"},{"title":"","content":"<p>Total amount of Rs 1,949 crore is provided to Department of Forest, Environment and Ecology.<\/p>","date":"2018-02-16 01:29:56","status":"1"},{"title":"","content":"<p>Creamy later income limit for availing reservation for backward classes enhanced from Rs 6 to Rs 8 lakh.<\/p>","date":"2018-02-16 01:30:43","status":"1"},{"title":"","content":"<p>A monthly pension of Rs 2000 for a period of 5 years will be given along with ex-gratia for Rs 5 lakh given to the family of a person killed by wild animals.<\/p>","date":"2018-02-16 01:31:38","status":"1"},{"title":"","content":"<p>11 new industrial townships at Koppal, Bellary, Yadgir, Dharwad, Tumakuru, Mysuru, Chamarajanagara, Bengaluru rural and Ramanagara districts.<\/p>","date":"2018-02-16 01:32:46","status":"1"},{"title":"","content":"<p>Mini 3D platenarium at Belagavi.<\/p>","date":"2018-02-16 01:33:09","status":"1"},{"title":"","content":"<p>Of the more than 25,000 hamalis working in APMCs now, 1000, who are homeless will be given housing.<\/p>","date":"2018-02-16 01:34:00","status":"1"},{"title":"","content":"<p>Pustaka Jatha will be organised in association with KSRTC to sell Kannada books at concessional rates.<\/p>","date":"2018-02-16 01:34:33","status":"1"},{"title":"","content":"<p>Mahakavi Kuvempu's Mysuru residence Udaya Ravi will be preserved and developed as National Poet Monument.<\/p>","date":"2018-02-16 01:35:09","status":"1"},{"title":"","content":"<p>A new study chair for comprehensive study of Daasa Sahithya.<\/p>","date":"2018-02-16 01:35:30","status":"1"},{"title":"","content":"<p>Karnataka Innovation Authority to be established.<\/p>","date":"2018-02-16 01:36:24","status":"1"},{"title":"","content":"<p>Small tree depots will be established at taluk or district centers to remove hurdles in the sale of trees grown by the farmers and to establish organized markets.<\/p>","date":"2018-02-16 01:37:46","status":"1"},{"title":"Health and Family Welfare","content":"<ol>\n    <li><span style=\"font-size: small;\">'Arogya Karnataka Yojane' will be started in February 2018 and implemented across state by end of this year. Primary and specific secondary and tertiary treatment to all people of the state.<\/span><\/li>\n    <li><span style=\"font-size: small;\">9000 health and wellness centers to be set up by upgrading existing sub-centers for every 5000 population in rural areas during next 7 years. 571 centers to be established during 2018-19.<\/span><\/li>\n    <li><span style=\"font-size: small;\">All major district and taulka hospitals to be certified under NABH to improve quality of health services.<\/span><\/li>\n    <li><span style=\"font-size: small;\">Bengaluru has five continuous air quality monitoring stations. 42 CAQMs to be set up across state for Rs 96 crore.<\/span><\/li>\n<\/ol>","date":"2018-02-16 01:42:16","status":"1"},{"title":"Higher Education","content":"<ol>\n    <li><span style=\"font-size: small;\">An outlay of Rs 4514 crore to Higher Education Department.<\/span><\/li>\n    <li><span style=\"font-size: small;\">Basava Study Center to come up at Mysore University, Mysuru with grant of Rs 2 crore.<\/span><\/li>\n    <li><span style=\"font-size: small;\">A grant of Rs. 1 crore each for establishing PG Centre at Chikkamangaluru under Kuvempu University and PG Centre at Jamkhandi of Bagalkote under Rani Channamma University.<\/span><\/li>\n    <li><span style=\"font-size: small;\">A Konkani Study chair to be established at Karnataka University, Dharwad.<\/span><\/li>\n<\/ol>","date":"2018-02-16 01:44:12","status":"1"},{"title":"Primary education","content":"<p>A total of Rs 22,350 crore outlay for Department of Primary and Secondary Education.<\/p>","date":"2018-02-16 01:46:43","status":"1"},{"title":"","content":"<p>Science committees to be started at all high schools and PU colleges and mobile science laboratories will be established in all districts in collaboration with Agasthya Foundation.<\/p>","date":"2018-02-16 01:47:19","status":"1"},{"title":"","content":"<p>\"100 primary and high schools which have completed 100 years will be reorganized as Heritage Schools and will be renovated and protected,\" Siddaramaiah says.<\/p>","date":"2018-02-16 01:47:55","status":"1"},{"title":"","content":"<p>One Athyuthama SDMC award in each taluk to best performing school development and management committee at Government primary and high schools.<\/p>","date":"2018-02-16 01:48:53","status":"1"},{"title":"","content":"<p>Digital library facility to around 10 lakh students in Government high schools and PU Colleges. Rs 5 crore allotted.<\/p>","date":"2018-02-16 01:49:17","status":"1"},{"title":"","content":"<p>CCTV cameras at Government Primary and Secondary schools in a phased manner.<\/p>","date":"2018-02-16 01:49:33","status":"1"},{"title":"","content":"<p>176 integrated schools in every Gram Panchayat have been opened. In this year, 100 integrated 'Karnataka Public Schools' will be opened at Rs 5 lakh per school. Bharat Scouts and Guides units will start in these schools.<\/p>","date":"2018-02-16 01:50:27","status":"1"},{"title":"","content":"<p>Treated water from KR Puram sewage treatment plant to be diverted to fill 30 tanks in Hosakote at Rs 100 crore.<\/p>","date":"2018-02-16 01:50:58","status":"1"},{"title":"","content":"Incentive amount will be increased from existing Rs 2 lakh to Rs 3 lakh for SC boy marrying a girl from other caste and from Rs 3 lakh to Rs 5 lakh for SC girl marrying a boy from another caste.","date":"2018-02-16 01:55:48","status":"1"},{"title":"","content":"<p>To empower landless Devadasis, priority will be given in sanctioning loan and subsidy under land purchase and Ganga Kalyana scheme.<\/p>","date":"2018-02-16 01:57:06","status":"1"},{"title":"","content":"<p>2000 candidates will be given special coaching to appear for IAS, KAS, Banking and other competitive examinations.<\/p>","date":"2018-02-16 01:57:44","status":"1"},{"title":"","content":"<p>Rs 100 crore allotted for economic development of backward class communities of Savitha Samaja, Thigala, Madivala and Kumbara.<\/p>","date":"2018-02-16 01:58:15","status":"1"},{"title":"","content":"<p>Rs 100 crore for overall development of Budabudke, Golla, Helava, Gondali, Jogi, Shikkalgar, Dombidasa and other nomadic\/semi nomadic tribes.<\/p>","date":"2018-02-16 01:59:02","status":"1"},{"title":"","content":"<p>100 mobile Anganwadi Centers\/Creches in areas of working of construction labourers to take care of their children. Rs 10 crore earmarked.<\/p>","date":"2018-02-16 02:00:00","status":"1"},{"title":"","content":"<p>Survey to measure nutrition level of the children of anganwadis in the state.<\/p>\n<p><img src=\"http:\/\/cms.newindianexpress.com\/FCKeditor\/fckeditor_img\/education-4-EPS.jpg\" width=\"400\" height=\"200\" alt=\"\" \/><\/p>","date":"2018-02-16 02:01:52","status":"1"},{"title":"","content":"<p>1000 buildings of Aanganwadis under SC sub plan and Tribal sub plan. Rs 20 crore earmarked for this.<\/p>","date":"2018-02-16 02:02:25","status":"1"},{"title":"","content":"<p>An outlay of Rs 5371 crore to Women and Child Welfare Department.<\/p>","date":"2018-02-16 02:03:02","status":"1"},{"title":"","content":"<p>Construction of hospitals in medical colleges of Gadag, Koppal, Chamarajanagar with an estimated cost of Rs 100 crore.<\/p>","date":"2018-02-16 02:03:44","status":"1"},{"title":"","content":"<p>State Mental health programme to be reorganised in line with the Mental Healthcare Act 2017.<\/p>","date":"2018-02-16 02:04:37","status":"1"},{"title":"","content":"<p>An outlay of 2,177 crore to Medical Education Department.<\/p>","date":"2018-02-16 02:05:13","status":"1"},{"title":"Bengaluru gets Rs 2500 crore","content":"<ol>\n    <li><span style=\"font-size: small;\">Development of 14 roads providing alternative connectivity to ITPL to mitiagate the inconvenience caused by high vehicular density due to Metro work at Whitefield<\/span><\/li>\n    <li><span style=\"font-size: small;\">Comprehensive development of 100 km of major roads<\/span><\/li>\n    <li><span style=\"font-size: small;\">Development of 250 km length of footpaths of different roads<\/span><\/li>\n    <li><span style=\"font-size: small;\">Development of roads in 110 villages recently included to the corporation limit<\/span><\/li>\n    <li><span style=\"font-size: small;\">Multi-storied parking at PPP model in Gandhibazar, near jayanagara Complex<\/span><\/li>\n    <li><span style=\"font-size: small;\">Rs 50 crore for rejuvenation of Bellandur Lake<\/span><\/li>\n<\/ol>","date":"2018-02-16 02:09:44","status":"1"},{"title":"","content":"<p>It is proposed to digitise records and documents of Gram Panchayats and Rs 5 crore will be provided to implement it on pilot basis in selected Gram Panchayats in the current year.<\/p>","date":"2018-02-16 02:12:36","status":"1"},{"title":"","content":"<p>A total amount of Rs 14,268 Crore is provided to the Department of Rural Development and Panchayat Raj.<\/p>","date":"2018-02-16 02:13:07","status":"1"},{"title":"","content":"<p>Under \"Mukhyamantri Anila Bhagya Yojana\", free gas connection with twin burners stove and two refills will be given to 30 lakh beneficiaries with an expenditure of Rs 1,350 crore.<\/p>","date":"2018-02-16 02:13:59","status":"1"},{"title":"","content":"<p>A total amount of Rs 3,882 Crore is provided to the Department of Food, Civil Supplies and Consumer Affairs.<\/p>","date":"2018-02-16 02:14:22","status":"1"},{"title":"","content":"<p>\"Our Government has been proactive by establishing 112 new Government Industrial Training Institutes which has enabled 10,770 additional candidates to get skill training and employment,\" says Siddaramaiah.<\/p>","date":"2018-02-16 02:15:28","status":"1"},{"title":"","content":"<p>A total amount of Rs 794 crore is allocated to Skill Development, Entrepreneurship and Livelihood Department.<\/p>","date":"2018-02-16 02:16:26","status":"1"},{"title":"","content":"<p>A scheme will be implemented at a cost of Rs 25 crore under 'Ambedkar Karmika Sahaya Hastha scheme', for issuance of smart cards along with contributory provident fund pension scheme to unorganized labourers.<\/p>","date":"2018-02-16 02:19:00","status":"1"},{"title":"","content":"<p>Develop slums in the corporation areas by providing transfer of development rights and additional floor area with PPP model.<\/p>","date":"2018-02-16 02:19:50","status":"1"},{"title":"","content":"<p>20 lakh houses in next five years in rural and urban areas.<\/p>","date":"2018-02-16 02:20:12","status":"1"},{"title":"","content":"<p>Water supply connection will be made available to all individual households in ten cities during 2018-19.<\/p>","date":"2018-02-16 02:50:16","status":"1"},{"title":"","content":"<p>To reduce the escalating problem of solid waste management, power generation plants will be introduced in 4 divisions of the State.<\/p>","date":"2018-02-16 02:55:26","status":"1"},{"title":"","content":"<p>New scheme to replace conventional street lights with LED lights having Centralized Control & Monitoring System (CCMS) in all smart city\/urban local bodies of Karnataka.<\/p>","date":"2018-02-16 02:59:09","status":"1"},{"title":"","content":"<p>Japan government assisted programme to improve  traffic management in selected areas of Bengaluru.<\/p>","date":"2018-02-16 03:00:52","status":"1"},{"title":"","content":"<p>A total amount of Rs 17,196 crore allocated to Urban Development Department.<\/p>","date":"2018-02-16 03:01:33","status":"1"},{"title":"","content":"<p>Rs 5 crore grant will be provided with 50% subsidy to develop and encourage new sugarcane breeds among farmers.<\/p>","date":"2018-02-16 03:02:49","status":"1"},{"title":"","content":"<p>A total amount of Rs 1,681 crore is allocated to the Commerce and Industries Department.<\/p>","date":"2018-02-16 03:03:43","status":"1"},{"title":"","content":"<p><img src=\"http:\/\/cms.newindianexpress.com\/FCKeditor\/fckeditor_img\/students.jpg\" width=\"400\" height=\"159\" alt=\"\" \/><\/p>\n<p>Rs.1 crore grant will be alloted to provide Department of Science and Technology Scholarship for research students of PHD in Science and Engineering.<\/p>","date":"2018-02-16 03:07:16","status":"1"},{"title":"","content":"<p>“Nirbhaya kendras” will be established in all the police commissioner’s offices of the state.<\/p>","date":"2018-02-16 03:08:13","status":"1"},{"title":"","content":"<p>A permanent Police Services Recruitment Board will be established to manage police recruitment.<\/p>","date":"2018-02-16 03:09:01","status":"1"},{"title":"","content":"<p><img src=\"http:\/\/cms.newindianexpress.com\/FCKeditor\/fckeditor_img\/FEWER_WOMEN.jpg\" width=\"400\" height=\"189\" alt=\"\" \/> <\/p>\n<p>The representation of women in the state police force will be enhanced by 25% in the next 5 years.<\/p>","date":"2018-02-16 03:11:33","status":"1"},{"title":"","content":"Karnataka Tax on Professions, Trades, Callings and Employment Act, 1976 to be amended.","date":"2018-02-16 03:40:11","status":1}]}