{"details":[{"title":"BJP Parliamentary party meeting headed by PM Narendra Modi underway","content":"<p>Prime minister Narendra Modi, Amit Shah, LK Advani, Rajnath Singh and Sushma Swaraj at the BJP Parliamentary party meeting at parliament House. (Photo | EPS\/ Shekhar Yadav)<\/p>\n<p><img src=\"http:\/\/cms.newindianexpress.com\/FCKeditor\/fckeditor_img\/Parliament modi.jpg\" width=\"500\" height=\"271\" alt=\"\" \/><\/p>","date":"2018-07-31 10:14:32","status":"1"},{"title":"Bills to be taken up in Rajya Sabha","content":"<ul>\n    <li> The DNA Technology (Use and Application) Regulation Bill, 2018.<\/li>\n    <li> The National Council for Teacher Education (Amendment) Bill, 2018.<\/li>\n    <li> The Trafficking of Persons (Prevention, Protection and Rehabilitation) Bill, 2018.<\/li>\n    <li> The Right of Children to Free and Compulsory Education (Amendment) Bill, 2018.<\/li>\n<\/ul>","date":"2018-07-31 10:26:01","status":"1"},{"title":"Bills likely to be taken up for discussion in Lok Sabha ","content":"<ul>\n    <li>The National Sports University Bill, 2018.<\/li>\n    <li> Insolvency and Bankruptcy Code, 2016.<\/li>\n<\/ul>","date":"2018-07-31 10:30:44","status":"1"},{"title":"BJP Parliamentary party meeting underway","content":"<blockquote class=\"twitter-tweet\" data-lang=\"en\">\n<p lang=\"en\" dir=\"ltr\">BJP MP from Etawah Ashok Kumar Dohre touching feet of PM <a href=\"https:\/\/twitter.com\/narendramodi?ref_src=twsrc%5Etfw\">@narendramodi<\/a> before the BJP Parliamentary party meeting at Parliament house in New Delhi on Tuesday. <a href=\"https:\/\/twitter.com\/NewIndianXpress?ref_src=twsrc%5Etfw\">@NewIndianXpress<\/a> <a href=\"https:\/\/twitter.com\/hashtag\/MonsoonSession2018?src=hash&ref_src=twsrc%5Etfw\">#MonsoonSession2018<\/a> <a href=\"https:\/\/t.co\/qk3C7tV0Ao\">pic.twitter.com\/qk3C7tV0Ao<\/a><\/p>\n— Shekhar Yadav (@Shekharyadav02) <a href=\"https:\/\/twitter.com\/Shekharyadav02\/status\/1024155624240762882?ref_src=twsrc%5Etfw\">July 31, 2018<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2018-07-31 10:31:13","status":"1"},{"title":"RJD's Jay Prakash Narayan Yadav submits adjournment notice","content":"<p>RJD MP Jay Prakash Narayan Yadav has given an adjournment motion notice in Lok Sabha over the issue of waterlogging in Patna's Nalanda Medical College Hospital (NMCH). <em>(ANI)<\/em><\/p>","date":"2018-07-31 10:34:26","status":"1"},{"title":"TMC MPs stage protest in front of Gandhi statue in Parliament over NRC Assam draft list","content":"<p> <img src=\"http:\/\/cms.newindianexpress.com\/FCKeditor\/fckeditor_img\/parliament(1).jpg\" width=\"500\" height=\"375\" alt=\"\" \/><\/p>","date":"2018-07-31 10:41:08","status":"1"},{"title":"TDP MPs continue their protest","content":"<p>TDP MPs continue their protest in Parliament demanding special status for Andhra Pradesh. (Photo | EPS\/ Shekhar Yadav)<\/p>\n<p><img src=\"http:\/\/cms.newindianexpress.com\/FCKeditor\/fckeditor_img\/special status_TDP(1).jpg\" width=\"500\" height=\"343\" alt=\"\" \/><\/p>","date":"2018-07-31 10:50:42","status":"1"},{"title":"All eyes on the DNA profiling Bill today","content":"<p>India has been attempting for the past several years to pass the bill which allows the use the DNA technology for crime investigation.<\/p>\n<p>If the Rajya Sabha passes the bill, National DNA Data bank and certain regional DNA Data banks will store DNA profiles received from DNA labs in a specified format.<\/p>","date":"2018-07-31 11:00:57","status":"1"},{"title":"","content":"<p><strong> Rajya Sabha has been adjourned till 12pm.<\/strong><\/p>","date":"2018-07-31 11:10:15","status":"1"},{"title":" Rohingyas are illegal migrants: Kiren Rijiju","content":"<p>Rohingyas are not refugees they are illegal migrants. The government won't provide any legal aid to illegal migrants, our duty is to prioritize people of this country, said Union Minister Kiren Rijiju at the Lok Sabha.<\/p>","date":"2018-07-31 11:12:10","status":"1"},{"title":"Protest over Assam NRC draft list inside, outside the Parliament ","content":"<p>Samajwadi Party members jtoday joined the Trinamool congress MPs to protest against the issue of several lakhs on names not being included in the draft National Register of Citizens released in Assam.<\/p>","date":"2018-07-31 11:14:37","status":"1"},{"title":"Security beefed up to stop Rohingya infiltration: Rajnath Singh","content":"<p>Border Security Force and Assam Rifles are deployed to stop further infiltration of Rohingyas. Have issued advisory to states to monitor those who have already come and keep them at one place and not let them spread. States also have right to deport them, says Home Minister Rajnath Singh in Lok Sabha.<\/p>","date":"2018-07-31 11:18:42","status":"1"},{"title":"We can't let anyone walk in and claim rights: Kiren Rijiju ","content":"<p>We can't let anyone to walk inside our country and claim rights, says Kiren Rijiju while responding to TMC MP Sougata Bose's comment on India showing cold shoulder to migrants.<\/p>","date":"2018-07-31 11:21:32","status":"1"},{"title":"","content":"<p><strong>We have immigrants coming to this country from Tamil Nadu, says Kiren Rijiju. Later he corrects it by saying slip of tongue while Oppsoition creates ruckus.<\/strong><\/p>","date":"2018-07-31 11:25:46","status":"1"},{"title":"Farmers' suicide raised in Lok Sabha","content":"<p> BJP MP from Karnataka  raised the issue of farmers's suicide in Lok Sabha and said, \"more than 4 thousand people commited suicide in Karnataka, what has the Fasal Bima Yojna done for farmers?\" <\/p>\n<p>To which, Agriculture Minister Gajendra Singh Shekhawat said,\"10 crore have registered themselves under the scheme and more than 5.8 crore farmers have benifited from the yojna\".<\/p>","date":"2018-07-31 11:52:05","status":"1"},{"title":"After Assam, Kailash Vijayvargiya wants NRC to be done in West Bengal","content":"<p>BJP Bengal in-charge Kailash Vijayvargiya wants NRC to be done in West Bengal too, says identify illegal migrants from Bangladesh. <\/p>","date":"2018-07-31 11:57:53","status":"1"},{"title":"Assam NRC to be discussed in Rajya Sabha","content":"<p>The Upper House reconvened and Deputy Chairman Venkaiah Naidu suspends the question hour to take up discussion on Assam NRC draft list.<\/p>","date":"2018-07-31 12:04:14","status":"1"},{"title":"NRC list taken up in Rajya Sabha, Ghulam Navi Azad asks parties not to use these left out people for votes","content":"<p>Leader of the Opposition Ghulam Nabi Azad, said that onus of identity proof should not only be on individuals but also on the government. He added that individuals should not be harassed because of this NRC.<\/p>","date":"2018-07-31 12:11:39","status":"1"},{"title":"","content":"<p><strong>As far as National Register of Citizens (NRC) for West Bengal is concerned, the decision will be taken by Home Ministry: Mos PMO Jitendra Singh - <em>(ANI)<\/em><\/strong><\/p>","date":"2018-07-31 12:25:44","status":"1"},{"title":"Names of Indians  who are left out of Assam NRC draft, where will they go? asks MPs","content":"<p>Opposition partes raised the concern over names of people from various parts of India being left out from the list and asks where will they go? AIADMK MP Vijila Sathyananth said most people are Indians and 40 lakh people whose names have been left out are having sleepless nights. TMC MP Sukhendu Shekar Roy shared the concern since many Bengalis are left out of the list.<\/p>","date":"2018-07-31 12:38:59","status":"1"},{"title":"BSP chief Mayawati condemns Assam NRC list","content":"<blockquote class=\"twitter-tweet\" data-lang=\"en\">\n<p lang=\"en\" dir=\"ltr\">Citizenships of 40 lakhs minorities have been almost seized in NRC draft in BJP-ruled Assam. If ppl living for a long time in Assam haven't been able to provide proof about their citizenship, it doesn't mean they should be thrown out of the country: BSP chief Mayawati. <a href=\"https:\/\/twitter.com\/hashtag\/NRCAssam?src=hash&ref_src=twsrc%5Etfw\">#NRCAssam<\/a> <a href=\"https:\/\/t.co\/RNekdiZZIp\">pic.twitter.com\/RNekdiZZIp<\/a><\/p>\n— ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1024190066007138305?ref_src=twsrc%5Etfw\">July 31, 2018<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2018-07-31 12:41:02","status":"1"},{"title":" Ruckus in Rajya Sabha","content":"<p>Uproar in Rajya Sabha during Amit Shah's specch. The Opposition came to the well of the house and raised slogans against the NDA government for the Assam NRC draft list.<\/p>","date":"2018-07-31 12:57:38","status":"1"},{"title":"Rajya Sabha adjourned till 1.10 pm","content":"<p>The Upper House has been adjourned till 1.10 pm as Opposition raise their slogan on Assam NRC row during Amit Shah's speech.<\/p>","date":"2018-07-31 01:00:26","status":"1"},{"title":"NDA has done what UPA government couldn't: Amit Shah","content":"<p>BJP President Amit Shah says 'Rajiv Gandhi signed Assam accord in 1985, which was similar to NRC. They did not have courage to implement it, we did.' Congress MPs protest in the well of the house.<\/p>","date":"2018-07-31 01:04:15","status":"1"},{"title":"","content":"<p><strong> Rajya Sabha adjourned till 11 am tomorrow.<\/strong><\/p> READ FULL STORY HERE: http:\/\/www.newindianexpress.com\/nation\/2018\/jul\/31\/rajya-sabha-proceedings-disrupted-by-noisy-protests-over-assam-nrc-draft-house-adjourned-to-tomorrr-1851107.html","date":"2018-07-31 01:25:10","status":"1"},{"title":"","content":"<p>Lok Sabha adjourned till 2.20 pm<\/p>","date":"2018-07-31 02:13:45","status":"1"},{"title":"","content":"<blockquote class=\"twitter-tweet\" data-lang=\"en\">\n<p lang=\"en\" dir=\"ltr\">If these Rohingyas and Bangladeshi illegal immigrants do not leave India respectfully, then they should be shot & eliminated. Then only our country will be safe: BJP Telangana MLA Raja Singh on <a href=\"https:\/\/twitter.com\/hashtag\/NRCAssam?src=hash&ref_src=twsrc%5Etfw\">#NRCAssam<\/a> <a href=\"https:\/\/t.co\/bOwQ0An9KA\">pic.twitter.com\/bOwQ0An9KA<\/a><\/p>\n— ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1024201803859017728?ref_src=twsrc%5Etfw\">July 31, 2018<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2018-07-31 02:14:07","status":"1"},{"title":"","content":"<blockquote class=\"twitter-tweet\" data-lang=\"en\">\n<p lang=\"en\" dir=\"ltr\"><a href=\"https:\/\/twitter.com\/hashtag\/WATCH?src=hash&ref_src=twsrc%5Etfw\">#WATCH<\/a>: Union Minister Ashwini Choubey and Congress MP Pradip Bhattacharya argue in Parliament premises over <a href=\"https:\/\/twitter.com\/hashtag\/NRCAssam?src=hash&ref_src=twsrc%5Etfw\">#NRCAssam<\/a> issue <a href=\"https:\/\/t.co\/lr5JPZ9uvK\">pic.twitter.com\/lr5JPZ9uvK<\/a><\/p>\n— ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1024208970381025281?ref_src=twsrc%5Etfw\">July 31, 2018<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2018-07-31 02:14:58","status":"1"},{"title":"Amit Shah's Rajiv Gandhi reference to attack the Congress on the NRC draft publication leads to uproar","content":"<blockquote class=\"twitter-tweet\" data-lang=\"en\">\n<p lang=\"en\" dir=\"ltr\">NRC is the soul of same Assam accord signed by former PM Rajiv Gandhi in 1985. Congress did not have the courage to implement it and now Modi government is doing what Congress could not. <a href=\"https:\/\/t.co\/7bKXAFhjN8\">pic.twitter.com\/7bKXAFhjN8<\/a><\/p>\n— Amit Shah (@AmitShah) <a href=\"https:\/\/twitter.com\/AmitShah\/status\/1024215878525767680?ref_src=twsrc%5Etfw\">July 31, 2018<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2018-07-31 02:30:18","status":"1"},{"title":"","content":"<p>BJP chief Amit Shah will hold a press conference at the BJP headquarters in Delhi today.<\/p>","date":"2018-07-31 02:30:28","status":"1"},{"title":"The process of filing objection should be fair: SC on NRC draft","content":"<blockquote class=\"twitter-tweet\" data-lang=\"en\">\n<p lang=\"en\" dir=\"ltr\">Supreme Court today said, the process (of filing of an objection by those whose names are not in the list) should be fair. The standard operating procedure should be applied. <a href=\"https:\/\/twitter.com\/hashtag\/NRCAssam?src=hash&ref_src=twsrc%5Etfw\">#NRCAssam<\/a><\/p>\n— ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1024221259314257921?ref_src=twsrc%5Etfw\">July 31, 2018<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script> SC directs Centre to frame standard operating procedure to deal with claims and objections regarding Assam's NRC; says no coercive action be taken against those whose names are not there in the NRC of Assam as it is only a draft.","date":"2018-07-31 02:52:33","status":"1"},{"title":"The Insolvency and Bankruptcy Code Bill is laid on the table","content":"<p>Union Finance Minister Piyush Goyal presents the Insolvency and Bankruptcy Code (Second Amendment) Bill in the Lok Sabha<\/p>\n <blockquote class=\"twitter-tweet\" data-lang=\"en\"><p lang=\"en\" dir=\"ltr\">Minister <a href=\"https:\/\/twitter.com\/PiyushGoyal?ref_src=twsrc%5Etfw\">@PiyushGoyal<\/a> speaking at Lok Sabha on The Insolvency and Bankruptcy Code. <br>Watch <a href=\"https:\/\/twitter.com\/hashtag\/LIVE?src=hash&ref_src=twsrc%5Etfw\">#LIVE<\/a> <a href=\"https:\/\/t.co\/nwLjCaaiKa\">https:\/\/t.co\/nwLjCaaiKa<\/a><\/p>— Piyush Goyal Office (@PiyushGoyalOffc) <a href=\"https:\/\/twitter.com\/PiyushGoyalOffc\/status\/1024216271070539776?ref_src=twsrc%5Etfw\">July 31, 2018<\/a><\/blockquote>\n<script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>\n","date":"2018-07-31 02:53:29","status":"1"},{"title":"","content":"<blockquote class=\"twitter-tweet\" data-lang=\"en\"><p lang=\"en\" dir=\"ltr\">After Rajya Sabha was adjourned for the day, Chairman M Venkaiah Naidu called Leader of Opposition Ghulam Nabi Azad to his chamber and 'conveyed his unhappiness over the way a good discussion on NRC in Assam was derailed towards the end.' (File pics) <a href=\"https:\/\/t.co\/wawR60AAwc\">pic.twitter.com\/wawR60AAwc<\/a><\/p>— ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1024223785417932800?ref_src=twsrc%5Etfw\">July 31, 2018<\/a><\/blockquote>\n<script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>\n","date":"2018-07-31 02:58:26","status":"1"},{"title":"What is the Insolvency and Bankruptcy Code Bill about?","content":"<p>The IBC introduced by the government in 2016 lays down a time-bound and transparent framework for resolving cases of insolvency by balancing the interest of all stakeholders and maximising the value of stressed assets, post unloading it by way of insolvency resolution or liquidation as the case may be.<\/p>","date":"2018-07-31 02:59:47","status":"1"},{"title":"What are the amendments to the IBC?","content":"<p>1. The amendments to the IBC is intended to give relief to the home buyers by recognising their status as financial creditors, thus giving them due representation in the Committee of Creditors (CoC) and making them an integral part of the decision-making process.    2. It also proposes to reduce the minimum voting threshold for the CoC to 66 per cent, from 75 per cent for key decisions.    3. Micro, Small and Medium Enterprises (MSME) sector would get a special dispensation under the Code.    4. The amendments also do not disqualify the promoter to bid for his enterprise undergoing Corporate Insolvency Resolution Process (CIRP) provided he is not a wilful defaulter and does not attract other disqualifications not related to default.     5. It also lays down a strict procedure for withdrawal of a case by an applicant after admission under the Code.<\/p>","date":"2018-07-31 03:20:11","status":"1"},{"title":"","content":"<p>Deputy Speaker M. Thambidurai is in the Chair.<\/p>","date":"2018-07-31 03:20:47","status":"1"},{"title":"","content":"","date":"2018-07-31 03:23:20","status":"0"},{"title":"","content":"<p><img src=\"http:\/\/cms.newindianexpress.com\/FCKeditor\/fckeditor_img\/thambidurai speaker.JPG\" width=\"470\" height=\"324\" alt=\"\" \/>\n\nVeerappa Moily slams the existing Insolvency and Bankruptcy Code; says it has 'nothing on business or investment'.<\/p>","date":"2018-07-31 03:27:30","status":"1"},{"title":"","content":"Veerappa Moily tells the BJP: “Your stock answer is that NPA (bad loans) is a problem passed down to you, but what have you done about this problem other than just raise your hands? Your solution to every problem in the banking industry is the NLCT. But what solution has been found?","date":"2018-07-31 03:33:03","status":"1"},{"title":"","content":"Congress member Moily says the National Company Law Tribunal (NCLT) has become an easy instrument now (for the government).","date":"2018-07-31 03:33:41","status":"1"},{"title":"Moily says the existing IBC Bill has not done anything; why call for another one then","content":"Veerappa Moily: An indiscriminate hunting down will intimidate even the honest lenders. The IBC Bill has not served any purpose whatsoever. 81 crores have already been waived under this government. You have not done anything under the existing law but you want an additional law.","date":"2018-07-31 03:39:08","status":"1"},{"title":"","content":"Veerappa Moily ends his speech. ","date":"2018-07-31 03:43:21","status":"1"},{"title":"","content":"DR P Venugopal (AIADMK leader from Tiruvallur constituency of Tamil Nadu) speaks on the IBC Bill.","date":"2018-07-31 03:44:53","status":"1"},{"title":"","content":"<p><strong>READ HERE | <\/strong><a href=\"http:\/\/www.newindianexpress.com\/nation\/2018\/jul\/31\/opposition-mps-oppose-ordinance-on-amendment-to-insolvency-and-bankruptcy-code-bill-finance-ministe-1851169.html\" target=\"_blank\">Opposition MPs oppose Ordinance on amendment to<strong> Insolvency and Bankruptcy Code Bill<\/strong>; Finance Minister Piyush Goyal defends <\/a><\/p>","date":"2018-07-31 03:50:58","status":"1"},{"title":"","content":"AIADMK's Venugopal welcomes the amendment to the IBC Bill. ","date":"2018-07-31 03:54:16","status":"1"},{"title":"TMC leader Saugata Ray speaks","content":"TMC leader Prof. Saugata Roy begins his speech by seeking clarification on whether Piyush Goyal is the caretaker finance minister or the full-time finance minister. Deputy Speaker M Thambidurai says that Goyal had already asserted in the House that Arun Jaitley is the finance minister. Roy responds: \"At the back of the bill it is written, 'Piyush Goyal Minister of Railways, Finance.' Why are you (Thambidurai) speaking on his behalf? I want to hear it from him.\" ","date":"2018-07-31 03:56:56","status":"1"},{"title":"","content":"Roy wants to know why just two years after the IBC Bill was created, so many amendments were being sought on it. Why the hurry, he asks. But welcomes the provision of home buyers being classified as financial creditors; brings up the JayPee real estate issue in Greater Noida in reference. The debt-ridden Jaypee group is facing a huge crisis because of significant delay in completion of its real estate projects that forced buyers to approach courts seeking either flats or refund of their hard-earned money. ","date":"2018-07-31 03:59:28","status":"1"},{"title":"","content":"<p><img src=\"http:\/\/cms.newindianexpress.com\/FCKeditor\/fckeditor_img\/saugata ray.JPG\" width=\"445\" height=\"200\" alt=\"\" \/> \n<\/p>","date":"2018-07-31 04:07:14","status":"0"},{"title":"","content":"<p>\"Banks have lost Rs. 21,000 crores. The dues to the banks are Rs. 13,600 crores. Banks sacrifice Rs. 25,000 crores. IBC is a good law. But the IBC is not a panacea for all the ills of the banking system\", says Prof. Saugata Ray while welcoming certain provisions.<\/p>\n<p><img src=\"http:\/\/cms.newindianexpress.com\/FCKeditor\/fckeditor_img\/saugata ray tmc.JPG\" width=\"445\" height=\"200\" align=\"middle\" alt=\"\" \/><\/p>\n\n\"IBC is leading to what Mr. Venugopal mentioned - crony capitalism.\"","date":"2018-07-31 04:10:20","status":"1"},{"title":"","content":"Biju Janata Dal leader Bhartruhari Mahtab (Cuttack constituency of Odisha) speaks.","date":"2018-07-31 04:12:33","status":"1"},{"title":"","content":"<p><img src=\"http:\/\/cms.newindianexpress.com\/FCKeditor\/fckeditor_img\/mahtab.JPG\" width=\"430\" height=\"283\" align=\"middle\" alt=\"\" \/>   \n\nMahtab asks: Why were all these (amendments) not thought of in the beginning itself when the Bill was made. He makes a dig at the government; calls it a 'thinking government', referring to the various notifications that followed the demonetisation announcement.<\/p>","date":"2018-07-31 04:18:35","status":"1"},{"title":"","content":"Insolvency and Bankruptcy Code provides a forum for businesses. If a company has defaulted, surely, admitting such a case should be an administrative matter. Similarly, if a checklist approach is adopted, surely the process of admission would be quicker. What if there in an error in the calculation. For all this, the apex court has said, judicial bench should hear out parties. A template approach is made to reduce the time drastically: Bhartruhari Mahtab","date":"2018-07-31 04:34:03","status":"1"},{"title":"","content":"Raman Deka in the Deputy Speaker chair. Interim Finance Minister Piyush Goyal starts address.","date":"2018-07-31 04:37:24","status":"1"},{"title":"Interim FM Piyush Goyal speaks:","content":"<p><img src=\"http:\/\/cms.newindianexpress.com\/FCKeditor\/fckeditor_img\/piyush goyal.JPG\" width=\"400\" height=\"293\" align=\"textTop\" alt=\"\" \/><\/p>","date":"2018-07-31 04:41:49","status":"1"},{"title":"","content":"<p>The honourable members of the House are casting aspersions on the judiciary, the NLCT without understanding the facts. The report of the Insolvency Law Committee came on 26th March 2018. Almost every clause of the report has been considered, accepted and brought into this amendment. Since many ministers have raised this issue, I'd like to talk about it. Because of a small minority, because the threshold was kept high, it may lead to liquidation. There is no resolution which is complete as yet: Piyush Goyal<\/p>","date":"2018-07-31 04:41:53","status":"1"},{"title":"","content":"<p>Shiv Sena leader Vinayak Bhaurao Raut (Ratnagiri-Sindhudurg constituency, Mumbai) speaks: \"What is there for common man? There is a possibility of the NPA of cooperative credit societies. But it doesn't happen. Be it Mumbai, Kolkata or Pune, advertisements are being put up and people tend to believe them and buy houses. But even after booking in housing society or apartment complexes, they don't get the houses.\"<\/p>","date":"2018-07-31 04:42:56","status":"1"},{"title":"","content":"<p>TDP MP Jayadev Galla welcomes the provision of home buyers being classified as financial creditors 'owing to the unique nature of financing in the real estate sector'; seeks clarity from the Finance Minister if they would be secured or unsecured financial creditors.<\/p>","date":"2018-07-31 04:56:22","status":"1"},{"title":"","content":"<p><img src=\"http:\/\/cms.newindianexpress.com\/FCKeditor\/fckeditor_img\/jayadev galla.JPG\" width=\"488\" height=\"314\" align=\"middle\" alt=\"\" \/> <\/p>","date":"2018-07-31 04:56:38","status":"1"},{"title":"","content":"Jayadev Galla says he is apprehensive if both Houses of the Parliament will hear modifications to the clauses in the Bill; justifies it using an example: Sec 6 (A) 7 of The Inter-states Water Act says all clauses will be laid before both Houses but during the Cauvery river water distribution Act hearing, this procedure was not followed before making modifications; asks \"How can we believe it (amendments to the IBC) will be heard as stated when we are not doing so in other such acts.\"","date":"2018-07-31 04:59:47","status":"1"},{"title":"Jayadev Galla brings up the Andhra Pradesh Special Category Status issue","content":"Galla manages to bring up the Andhra Pradesh special category status, says 'the residual state of Andhra Pradesh suffers from a finance deficit'; seeks a solution from the FM.","date":"2018-07-31 05:01:20","status":"1"},{"title":"TRS leader Konda Vishweshwar Reddy (Chevalla MP) speaks","content":"<p> <img src=\"http:\/\/cms.newindianexpress.com\/FCKeditor\/fckeditor_img\/konda reddy.JPG\" width=\"481\" height=\"283\" align=\"middle\" alt=\"\" \/><\/p>\n\n \"We've accumulated bad karma in the form of insolvency. Ease of doing business is important, but equally important is ease of resolution. The nature of the frauds triggering insolvency has increased. Why is there such a stark difference. We are by and large honest people. This Bill is also used to protecting the honest people. Are we a nation of fraudsters and thieves? I don't think so. But our laws treat honest people the way we treat our fraudsters. Should the law be tight, should it be liberal. I agree with Mr. Goyal because in some cases, 76% threshold is very harmful. The ordinance route definitely raises eyebrows and voices in the Parliament.\"","date":"2018-07-31 05:04:01","status":"1"},{"title":"CPI-M Kerala's P Karunakaran speaks","content":"<p><img src=\"http:\/\/cms.newindianexpress.com\/FCKeditor\/fckeditor_img\/cpi m.JPG\" width=\"473\" height=\"286\" align=\"middle\" alt=\"\" \/> <\/p>\n\"What is the objective of this ordinance? Here we can see that it is not a social or administrative demand? But only one committee is moving this, so I strongly oppose this. Insolvency is a situation where individuals or companies are unable to pay their debt. Here, the government has to clarify for whom the amendment has been made. As stated by other members, it is clear. It is not for social or economical purpose. It is only for one committee.\"","date":"2018-07-31 05:06:01","status":"1"},{"title":"","content":"Deputy Speaker Thambidurai back in the chair.","date":"2018-07-31 05:16:18","status":"1"},{"title":"YSRCP MP Butta Renuka (Kurnool) speaks: Insolvency and bankruptcy laws make recovery of debt a cumbersome process. But these amendments provide relief to home buyers. Reduction of voting threshold is aimed at quick dispersal. I support the amendment.","content":"<p> <img src=\"http:\/\/cms.newindianexpress.com\/FCKeditor\/fckeditor_img\/ysrcp mp renuka.JPG\" width=\"462\" height=\"313\" align=\"middle\" alt=\"\" \/>","date":"2018-07-31 05:17:42","status":"1"},{"title":"BJP MP Subhash Chandra Baheria speaks","content":"<p><img src=\"http:\/\/cms.newindianexpress.com\/FCKeditor\/fckeditor_img\/baheria mp bjp.JPG\" width=\"498\" height=\"321\" align=\"middle\" alt=\"\" \/> <\/p>","date":"2018-07-31 05:21:25","status":"0"},{"title":"","content":"<p>Prem Singh Chandumajra, SAD, Punjab speaks: \"Is there any bill for farmers like this IBC bill? To avoid their bankruptcy and suicides. It would be great if measures are being taken for farmers.\"<\/p>","date":"2018-07-31 05:50:08","status":"1"},{"title":"RJD leader Jay Prakash Narayan Yadav begins speech","content":"<p>Jay Prakash Narayan Yadav, RJD, Banka, Bihar speaks: \"A goat doesn't make friendship with grass.\" <\/p>\n<p>Members oppose his remark. Mr. Jay Prakash says, \"Please listen to my words. Nirav Modi, Vijay Mallya, Lalit Modi are all gone. But Dalits are not spared. Farmers are not spared. Demonetisation, GST, spoiled the common man's jobs and lives. An association should be made and justice should be given to all.\"<\/p>","date":"2018-07-31 05:51:02","status":"1"},{"title":"","content":"","date":"2018-07-31 06:12:23","status":"0"},{"title":"Deputy Speaker M Thambidurai extends Lok Sabha proceedings to continue the discussion. Piyush Goyal speaks again:","content":"<p><img src=\"http:\/\/cms.newindianexpress.com\/FCKeditor\/fckeditor_img\/piyush goyal - ls tv.JPG\" width=\"495\" height=\"322\" align=\"middle\" alt=\"\" \/> <\/p>","date":"2018-07-31 06:24:03","status":"1"},{"title":"","content":"<p>Finance and Corporate Affairs Minister Piyush Goyal: All the proposed amendments were accepted. We tightened our own powers. Committee had given a suggestion for a big power but we said Centre shouldn't get the power. Bringing an ordinance became necessary.<\/p>","date":"2018-07-31 06:24:15","status":"1"},{"title":"","content":"Piyush Goyal: \"10 years earlier, resolutions were never over but after the IBC Bill, the mumbers have become higher. 55% more recovery has happened\"; adds \"For common man, underprivileged, youth and women, Mujra loans and Pradhan Mantri Yojanas has helped and given strength to the lower and middle class to own a house\".","date":"2018-07-31 06:28:16","status":"1"},{"title":"","content":"Piyush Goyal: When it comes to haircuts, it is not 66%. All these cases that worry the nation and banks, maybe 99% are older than 2014. When it comes to loans, restructuring keeps happening over the years. After this law came to force, people came forth to pay off their Rs. 1380 crores of money. We have changed the situation and now bank loans are being paid off by the people. Now, the loans are coming back to the banks.","date":"2018-07-31 06:29:51","status":"1"},{"title":"Revolutionary Socialist Party's NK Premachandran speaks","content":"<p><img src=\"http:\/\/cms.newindianexpress.com\/FCKeditor\/fckeditor_img\/nks.JPG\" width=\"457\" height=\"315\" align=\"middle\" alt=\"\" \/> <\/p>\n\nWhat has happened from June 6 till the day this monsoon session started? We can see that promulgation of ordinance was a necessity. I had raised a point that even a minor default will leave the company to be dissolved. At the time of passing and consideration of the Bill, I had moved the amendment in the case of creditors. But I don't see the amendment. We are challenging the credibility of the government. We oppose the amendment.\"","date":"2018-07-31 06:34:46","status":"1"},{"title":"Congress leader Mallikarjun Kharge speaks","content":"<p><img src=\"http:\/\/cms.newindianexpress.com\/FCKeditor\/fckeditor_img\/kharge m.JPG\" width=\"492\" height=\"282\" align=\"middle\" alt=\"\" \/> <\/p>","date":"2018-07-31 06:39:10","status":"0"},{"title":"Congress stages walkout","content":"Congress MP Mallikarjun Kharge: \"BJP leader Kirit Somaiya said that UPA government is behind the NPA. You have the record, according to it, today the amount stands at 12 lakh crore. The reason for it is that the BJP is patting its back to claim they have done a good job.\"\n\n<p><img src=\"http:\/\/cms.newindianexpress.com\/FCKeditor\/fckeditor_img\/kharge m.JPG\" width=\"492\" height=\"282\" align=\"middle\" alt=\"\" \/> <\/p>","date":"2018-07-31 06:50:20","status":"1"},{"title":"Insolvency and Bankruptcy Code (Second Amendment) Bill, 2018 passed in Lok Sabha.","content":"<p>The House will meet on August 1, 2018 at 11 am. The House stands adjourned.<\/p>","date":"2018-07-31 06:50:45","status":"1"}]}