{"details":[{"title":"Bills for introuduction in Rajya Sabha ","content":"<ul>\n    <li><strong>The Universal Health Insurance and Healthcare Coverage Bill<\/strong><\/li>\n    <li><strong>   The Illegal Immigrants (Identification and Deportation) Bill <\/strong><\/li>\n    <li><strong>  The Information Technology (Amendment) Bill <\/strong><\/li>\n    <li><strong>  The National Capital Territory of Delhi Laws (Special Provisions) Bill<\/strong><\/li>\n    <li><strong>   The Protection of Farmers Families Bill <\/strong><\/li>\n    <li><strong>  The Prevention of Contamination of Groundwater Bill <\/strong><\/li>\n    <li><strong>  The Compulsory Yoga and Soirts Education in Schools Bill <\/strong><\/li>\n    <li><strong>  The Constitution (Amendment) Bill 2018 (amendment of article 19) <\/strong><\/li>\n    <li><strong> The Criminal Law (Amendment) Bill <\/strong><\/li>\n    <li><strong> The Agricultural and other Rural Workers (Protection and Welfare) Bill <\/strong><\/li>\n    <li><strong> The Downtrodden, Backward and Oppressed Youth (Development and Welfare) Bill <\/strong><\/li>\n    <li><strong> The Scheduled Castes and Scheduled Tribes Sub Plans (Budgetary Allocation and Special Schemes) Bill  <\/strong><\/li>\n    <li><strong>The Exploited, Indebted and Poverty Stricken Farmers (Protection, Prevention of Suicides and Welfare) Bill <\/strong><\/li>\n    <li><strong> The Parliament (Enhancement of Productivity) Bill, 2017 <\/strong><\/li>\n    <li><strong>  The Constitution (Amendment) Bill, 2016 (amendment of articles 109,117, 198 and 207)<\/strong><\/li>\n    <li><strong> The Abolition of Capital Punishment Bill<\/strong><\/li>\n<\/ul>","date":"2018-08-03 11:33:41","status":"1"},{"title":"","content":"TMC MP Saugata Roy moves adjournment motion in Lok Sabha over detention of TMC delegation at Silchar airport yesterday.","date":"2018-08-03 11:34:28","status":"1"},{"title":"","content":"<blockquote class=\"twitter-tweet\" data-lang=\"en\">\n<p lang=\"en\" dir=\"ltr\">Mamata Banerjee is agitating as 40 lakh people are left out. In 2005,Didi had brought adjournment motion against illegal migrants by warning of disastrous consequences in India if they are not thrown out.She changes tracks like chameleon:Adhir Ranjan Chowdhary, Congress <a href=\"https:\/\/twitter.com\/hashtag\/NRCAssam?src=hash&ref_src=twsrc%5Etfw\">#NRCAssam<\/a> <a href=\"https:\/\/t.co\/Utiv9khrQI\">pic.twitter.com\/Utiv9khrQI<\/a><\/p>\n— ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1025251887673692165?ref_src=twsrc%5Etfw\">August 3, 2018<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2018-08-03 11:34:50","status":"1"},{"title":"","content":"<p>Uproar in Lok Sabha by Trinamool Congress MPs after TMC delegation was <a href=\"http:\/\/www.newindianexpress.com\/nation\/2018\/aug\/02\/nrc-issue-tmc-mps-mlas-roughed-up-detained-at-assam-airport-mamata-banerjee-claims-even-women-1852205.html\" target=\"_blank\">detained at Silchar airport <\/a>yesterday, reports ANI. <\/p>\n<p> <\/p>\n<p><a href=\"http:\/\/ http:\/\/www.newindianexpress.com\/nation\/2018\/aug\/03\/nrc-issue-tmc-delegation-leave-assam-after-overnight-detention-at-silchar-airport%E2%80%8B-1852637.html\" target=\"_blank\"><strong>READ HERE- NRC issue: TMC delegation leave Assam after overnight detention at Silchar airport​<\/strong><\/a><\/p>","date":"2018-08-03 11:37:03","status":"1"},{"title":"Union Home Minister makes a statement on NRC draft list ","content":"<p>Whole procedure of NRC Assam was undertaken under supervision of Supreme Court. I would like to repeat that its a draft and not final, everyone will get chance to appeal. Its a totally fair process. Unwarranted accusations are unfortunate: HM Rajnath Singh in Rajya Sabha<\/p>","date":"2018-08-03 11:39:32","status":"1"},{"title":"","content":"<blockquote class=\"twitter-tweet\" data-lang=\"en\">\n<p lang=\"en\" dir=\"ltr\">I am saying this again, that no coercive action will be taken against anyone in any situation. Attempts to create an atmosphere of fear are condemnable:HM Rajnath Singh in Rajya Sabha <a href=\"https:\/\/t.co\/hVEUwBL8U9\">pic.twitter.com\/hVEUwBL8U9<\/a><\/p>\n— ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1025259543117197312?ref_src=twsrc%5Etfw\">August 3, 2018<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2018-08-03 11:39:55","status":"1"},{"title":"","content":"<h2>Lok Sabha proceeding in session amid noisy scenes<\/h2>","date":"2018-08-03 12:04:02","status":"1"},{"title":"","content":"<p><img src=\"http:\/\/cms.newindianexpress.com\/FCKeditor\/fckeditor_img\/Parliament Session.jpeg\" width=\"600\" height=\"400\" alt=\"\" \/> <\/p>\n<p> <\/p>\n<p>TMC MP Idris Ali taken to hospital from parliament House in New Delhi on Friday. (Photo | Shekhar Yadav\/EPS)<\/p>","date":"2018-08-03 12:05:19","status":"1"},{"title":"","content":"<p>TMC's Derek O'Brien seeks clarification from the Home Minister over the Centre's double standard on Assam's NRC.\n\"If there are 16 documents needed to prove citizenship, higher authorities also need to produce a document of a higher education,\" he says. <\/p>","date":"2018-08-03 12:11:31","status":"1"},{"title":"","content":"<p>Senior Congress leader Anand Sharma raises the \"dare\" accepted by TRAI chairman RS Sharma who last week had made his Aadhaar number public.<\/p>","date":"2018-08-03 12:22:42","status":"1"},{"title":"","content":"<p>In response to Sharma's statement, Law minister Ravi Shankar Prasad says TRAI has issued a statement. The biometrics, iris or the fingerprints weren't breached, he reiterates.<\/p>","date":"2018-08-03 12:24:20","status":"1"},{"title":"","content":"<p style=\"text-align: center;\"><img src=\"http:\/\/cms.newindianexpress.com\/FCKeditor\/fckeditor_img\/Poonam Mahajan_EPS.jpeg\" width=\"400\" height=\"536\" alt=\"\" \/> <\/p>\n<p>BJP MP Poonam Mahajan with her daughter Avika at Parliament House during the ongoing Monsoon Session in New Delhi on Friday. (Photo | Shekhar Yadav\/EPS)<\/p>","date":"2018-08-03 12:26:26","status":"1"},{"title":"","content":"<p>Minister of Electronics and IT Ravi Shankar Prasad makes a statement on fake news on social media and cyber security.<\/p>","date":"2018-08-03 12:29:34","status":"1"},{"title":"","content":"<p>Question on Illegal diversion of urea by fertilizer companies being taken up in Rajya Sabha. <\/p>","date":"2018-08-03 12:33:31","status":"1"},{"title":"","content":"<p> Home Minister makes a statement on the <a href=\"http:\/\/www.newindianexpress.com\/nation\/2018\/aug\/02\/nrc-issue-tmc-mps-mlas-roughed-up-detained-at-assam-airport-mamata-banerjee-claims-even-women-1852205.html\" target=\"_blank\">detainment of TMC delegation<\/a> at Silchar Airport Yesterday. <\/p>","date":"2018-08-03 12:40:19","status":"1"},{"title":"TMC delegation was detained due to 'unruly behaviour'","content":"<p>TMC delegation was received as per protocol and were apprised about Section 144. The delegation members indulged in \"unruly behaviour\" which inconvnienced the passengers at Silchar Airport, says Rajnath Singh.<\/p>","date":"2018-08-03 12:44:19","status":"1"},{"title":"","content":"<p>Senior Leader Mallikarjun Kharge raises concern over media gag issue in Lok Sabha. <\/p>","date":"2018-08-03 12:49:22","status":"1"},{"title":"","content":"<p>Kharge brought the House's attention to a private television editor quitting to which Communication Minister Rajyavardhan Rathore says the government has got nothing to do with the issue and the ministry has not sent any showcause notice to the said TV channel.<\/p>","date":"2018-08-03 12:59:08","status":"1"},{"title":"","content":"<h3> Rajya Sabha adjourns. To resume session at 2.30 PM. <\/h3>","date":"2018-08-03 12:59:58","status":"1"},{"title":"","content":"<h3>Lok Sabha chaired by Pralhad Joshi. <\/h3>","date":"2018-08-03 01:01:06","status":"1"},{"title":"'Undeclared Emergency'","content":"<p>Earlier, TMC's Kalyan Banerjee raised the issue of 40 lakh people who were left out in the NRC draft. He further claimed the arrest was made as per the SC directives. Pointing to the manhandled of women MPs which was aired on every news channel, he calls it a breach of privilege of parliamentarians and asks \"is this not an undeclared emergency\"<\/p>","date":"2018-08-03 01:07:26","status":"1"},{"title":"","content":"<p style=\"text-align: center;\"><img src=\"http:\/\/cms.newindianexpress.com\/FCKeditor\/fckeditor_img\/PTI8_3_2018_000017B.jpg\" alt=\"\" \/> <\/p>\n<p>TRS MP K. Kavitha during the Monsoon session of Parliament in New Delhi on Friday (Photo | PTI)<\/p>","date":"2018-08-03 01:14:17","status":"1"},{"title":"","content":"<p>Ex-BCCI chief Anurag Thakur continues the speech lauding the Sports Ministry to choose Manipur as the place for the University. <\/p>","date":"2018-08-03 01:18:07","status":"1"},{"title":"","content":"<p>Sports Minister Rajyavardhan Singh Rathore had on Wednesday introduced the National Sports University Bill, 2018 on Wednesday which was seeking to establish a National Sports University in Manipur.<\/p>","date":"2018-08-03 01:23:23","status":"1"},{"title":"","content":"","date":"2018-08-03 02:09:39","status":"0"},{"title":"BJD MP Kalikesh Narayan Singh Deo says the government needs to provide minimalist facilities. ","content":"<p>We need to have one center of excillence in every state. Main issue of the bill is the curricullum. I would like to know what the curriculum is when the minister answers the question. The government should also tell us what will be funding of these institutes.  We have seen the instances of sexual assault on women sportsperson. It is a failure of the sports bodies. We need to have clearly defined roles for gender appreciation and gender sensitivity.<\/p>\n<p><img src=\"http:\/\/cms.newindianexpress.com\/FCKeditor\/fckeditor_img\/image\/Kalikesh%20Narayan%20Singh%20Deo,%20BJD.JPG\" width=\"609\" height=\"425\" align=\"middle\" alt=\"\" \/><\/p>","date":"2018-08-03 02:28:32","status":"1"},{"title":"The story of hockey has become a story of lost glory says M B Rajesh of CPI-M","content":"<p>Recently we a small country like Croatia reached final of football world cup. We are not able to succeed due to lack of priority. There is film called 'Soorma'. The story of Hockey has become a story of lost glory.<\/p>\n<p><img src=\"http:\/\/cms.newindianexpress.com\/FCKeditor\/fckeditor_img\/image\/M%20B%20Rajesh%20CPI.JPG\" width=\"623\" height=\"464\" align=\"middle\" alt=\"\" \/><\/p>","date":"2018-08-03 02:37:29","status":"1"},{"title":"","content":"<p><strong> Rajya Sabha reconvenes afer lunch.<\/strong><\/p>","date":"2018-08-03 02:38:56","status":"1"},{"title":"","content":"<p><strong> Enhancement of Parliament Productivity Bill introduced by Naresh Gujral of SAD in Rajya Sabha.<\/p>","date":"2018-08-03 02:42:21","status":"0"},{"title":"Enhancment of Parliament Productivity Bill introduced by Naresh Gujral of SAD in Rajya sabha","content":"<p>Parliament should meet at least 120 days. Today when we would add the number of hours disrupted to the session there would be no disruption. Because the session is not long enough the small parties suffer. We can only get adequate time if the session is long enough.<\/p>\n<p><img src=\"http:\/\/cms.newindianexpress.com\/FCKeditor\/fckeditor_img\/image\/Naresh%20Gujral%20of%20SAD.JPG\" width=\"532\" height=\"419\" align=\"middle\" alt=\"\" \/><\/p>","date":"2018-08-03 02:47:03","status":"1"},{"title":"","content":"Today we spent less time than what we used to in the 1950s and 60s: Jairam Ramesh, INC in Rajya Sabha","date":"2018-08-03 02:50:34","status":"1"},{"title":"Disruptive members should not be given salary says YSRC MP Vijaysai Reddy in Rajya Sabha","content":"<p>Once a member enters a house irrespective of the political party he\/she should be given equal time. The time lost in the house disruptions should be compensated and the members who are involved in the disruptions should not be given salary.<\/p>\n<p><img src=\"http:\/\/cms.newindianexpress.com\/FCKeditor\/fckeditor_img\/image\/V%20Vijayasai%20Reddy%20YSRC.JPG\" width=\"639\" height=\"413\" align=\"middle\" alt=\"\" \/><\/p>","date":"2018-08-03 03:06:56","status":"1"},{"title":"Vijila Satyanath of AIADMK speaks in Rajya Sabha","content":"We have to make space for Private Members Bill. We passed the Transgenders Bill brought in by Tiruchi Siva. But what happened to it. The government brought in a new bill and the old Bill was replaced. So private members bill should be given more space.\n\n\n","date":"2018-08-03 03:27:49","status":"1"},{"title":"","content":"<p><strong>Rajyawardhan Singh Rathore replies to the questions raised by members during the discussion<\/strong><\/p>","date":"2018-08-03 03:30:14","status":"0"},{"title":"","content":"<p><strong>Rajyawardhan Singh Rathore replies to the questions raised by members during the disscussion.\n<\/strong><\/p> <p><strong><img src=\"http:\/\/cms.newindianexpress.com\/FCKeditor\/fckeditor_img\/image\/Rajya%20wardhan%20Singh%20Rathod.JPG\" width=\"607\" height=\"401\" align=\"middle\" alt=\"\" \/><\/strong><\/p>","date":"2018-08-03 03:31:56","status":"1"},{"title":"The MoS for Sports, Colonel Rajyavardhan Singh Rathore says they increased the allowances of players","content":"\"I would like to put here three things, Stipend of the player which is increased to Rs 2000 per month. The food allowance: We have increased it to Rs 690 per day. Supplement allowance is raised to Rs 700 per day and this is for under training players. For international players we have increased the stipend to Rs 50000 per month  This is the first time Prime Minister has introduced an Olympic task force. A national coach is now paid 2 lakh an increase of 100%\"<\/p>","date":"2018-08-03 03:48:52","status":"1"},{"title":"","content":"<p><strong>The National Sports University Bill has been unanimously passed in the Lok Sabha.<\/strong><\/p>","date":"2018-08-03 03:53:30","status":"1"},{"title":"","content":"","date":"2018-08-03 03:53:31","status":"0"},{"title":"","content":"Private Member's Bills are being introduced in the Lok Sabha","date":"2018-08-03 03:57:00","status":"1"},{"title":"","content":"<p>Shashi Tharoor introduces Bills to abolish death penalty, prohibit stalking.<\/p>","date":"2018-08-03 04:03:00","status":"1"},{"title":"Congress MP Husain Dalwai speaks ","content":"<p>Gauri Lankesh, Kalburgi, Pansare all were killed but nothing happened. Maharashtra government was going to bring a Bill which would allow police to check what is cooking in one's kitchen. So these kinds of issues need to be addressed. We enter the well only when our issues are not being heard.  But the working of the house is the responsibility of the government. And this has been told to us by Arum Jaitleyji, which is right.<\/p>","date":"2018-08-03 04:14:56","status":"1"},{"title":"","content":"<p><strong> Lok Sabha takes up Private Members Bill. More than 80 private members bills were introduced today.<\/p>","date":"2018-08-03 05:16:19","status":"1"},{"title":"","content":"<p>Rakesh Sinha's maiden speech paused due to lack of time, he will continue on Monday. Private Member's Bills are being introduced in the Rajya Sabha.<\/p>","date":"2018-08-03 05:27:56","status":"1"},{"title":"","content":"<p><strong>Rajya Sabha Adjourned till Monday 11:00 am.<\/strong><\/p>","date":"2018-08-03 05:30:18","status":"1"},{"title":"Lok Sabha discusses Private Member's bill amendments to the Sixth Schedule in the Constitution Bill 2015","content":"The Bill is introduced by Vincent Pala. It grants more power to the District and Regional Councils.\nThe Sixth Schedule of the Indian Constitution is for the administration of tribal areas of the four North Eastern States. Under this schedule,\nTribal areas in these states had been constituted as an autonomous district.\nPresident at any time by order may direct the formation or termination of any area under tribal area.\nEach autonomous district has a district council of 30 members and also contains separate regional councils.\nGovernor can appoint a commission to examine and report any matter relating to the administration of autonomous district of regions.","date":"2018-08-03 05:48:04","status":"1"},{"title":"","content":"<p>Matters of urgent public importance are being heard in Lok Sabha.<\/p>","date":"2018-08-03 06:07:39","status":"1"},{"title":"","content":"<p> Lok Sabha adjourned till Monday 6 august 11:00 am.<\/p>","date":"2018-08-03 06:39:28","status":"1"},{"title":"","content":"<p><strong>Lok Sabha adjourned sine die.<\/strong><\/p>","date":"2018-08-10 03:45:49","status":1}]}