{"details":[{"title":"Bills to be taken up in Rajya Sabha","content":"<ul>\n    <li>The Right of Children to Free and Compulsory Education (Amendment) Bill, 2018.<\/li>\n    <li>The Insolvency and Bankruptcy Code (Second Amendment) Bill, 2018.<\/li>\n    <li>The National Council for Teacher Education (Amendment) Bill, 2018.<\/li>\n    <li>The DNA Technology (Use and Application) Regulation Bill, 2018.<\/li>\n<\/ul>","date":"2018-08-02 10:39:08","status":"1"},{"title":"TDP MP Naramalli Sivaprasad dressed up as magician continues with their protest","content":"<p><img src=\"http:\/\/cms.newindianexpress.com\/FCKeditor\/fckeditor_img\/tdp_protest_eps.jpg\" width=\"500\" height=\"273\" alt=\"\" \/> <\/p>\n<p>TDP MPs protesting outside the Parliament house demanding special Status for Andhra Pradesh.  TDP MP Naramalli Sivaprasad has dressed up as a magician today. (Photo| Shekhar Yadav)<\/p>","date":"2018-08-02 10:47:54","status":"1"},{"title":" Rajya Sabha reconvenes","content":"<p>Chairman Venkaiah Naidu commences the proceedings of the Upper House of the Parliament by praising the winners of 'Best Parliamentarian Award' held on Wednesday. The mood of the houses seems to be relatively light compared to the past week.<\/p>","date":"2018-08-02 11:05:24","status":"1"},{"title":"Rajya Sabha to discuss MSP, farmers' income","content":"<p>Rajya Sabha will discuss MSP, farmers' issues today. The Opposition and BJP will lock horns over farmers issue when it takes up a short duration discussion on the recent government announcement on increase in minimum support prices (MSP) for Kharif crops.<\/p>","date":"2018-08-02 11:08:41","status":"1"},{"title":"Ruckus in Lok Sabha","content":"<p>Trinamool and Congress MPs can be seen trooping the Well of the House and raising slogans against the BJP government.<\/p>","date":"2018-08-02 11:13:34","status":"1"},{"title":"Kerala UDF MPs protest outside the Parliament","content":"<p><img src=\"http:\/\/cms.newindianexpress.com\/FCKeditor\/fckeditor_img\/kerala_mp_protest.jpg\" width=\"500\" height=\"338\" alt=\"\" \/> <\/p>\n<p>Kerala UDF MPs protesting outside the Parliament House for their version demands. (Photo | EPS\/ Shekhar Yadav)<\/p>","date":"2018-08-02 11:16:32","status":"1"},{"title":"We will keep fighting until justice is given to Andhra Pradesh: Galla","content":"<p>We approached parliament,debated in the parliament,had a no-confidence motion against PM & council of ministers, met President & today we met vice president, we are contemplating going to SC also. We will keep fighting until justice is given to Andhra Pradesh: TDP MP Jayadev Galla      - <em>(ANI)<\/em><\/p>","date":"2018-08-02 11:25:08","status":"1"},{"title":"ST status for Adivasis raised in Rajya Sabha","content":"<p>The tribals have been given Scheduled Tribe status in all the states but Assam has been bereft of this. This is a very sensitive issue for the state, the six tribal communities have been fighting for the status for long, says Assam MP Santiuse Kujur.<\/p>","date":"2018-08-02 11:41:52","status":"1"},{"title":"Rampant killings of journalists, press freedom raised in Rajya Sabha","content":"<p>CPI (M) MP from Tripura Jharna Das Baidya  speaks about the killing of five journalists, two from her state in the recent times. She alleges that after the BJP government took over the State earlier this year, the press freedom has been drastically curbed. Journalists have to be allowed to do their work freely, adds Derek O'Brien.<\/p>","date":"2018-08-02 11:56:52","status":"1"},{"title":"Congress raises dilution SC\/ST Act in Lok Sabha ","content":"<p>Congress leader Mallikarjun Kharge raised the dilution of Scheduled Caste and Scheduled Tribe (Prevention of Atrocities) Act, 1989 in the Lok Sabha. Kharge asks for an ordinance on the diluted Act. <\/p>. The government has not done anything to nullify the Supreme Court order, he claims.","date":"2018-08-02 12:14:43","status":"1"},{"title":"Home Minister counters Congress' attack on SC\/ST Act","content":"<p>Home Minister Rajnath Singh: I'm surprised why he brought up this topic today when the Narendra Modi government, yesterday, approved the SC\/ST Bill.  Will bring stricter Bill against the atrocities of SC\/ST if needed.<\/p>","date":"2018-08-02 12:18:40","status":"1"},{"title":"Assam NRC raised in Lok Sabha by TMC","content":"<p>TMC MP from West Bengal Saugata Roy, raises the NRC issue again in the Lok Sabha. He says the Mathuvas are blockading rails since their names are excluded in the draft NRC. However, Speaker Sumitra Mahajan objected him and said, \"one issue cannot be taken up everyday\".<\/p>\n<p><img src=\"http:\/\/cms.newindianexpress.com\/FCKeditor\/fckeditor_img\/sougata roy.JPG\" width=\"575\" height=\"553\" alt=\"\" \/><\/p>","date":"2018-08-02 12:40:21","status":"1"},{"title":"Scheduled Caste and Scheduled Tribe (Prevention of Atrocities) Bill likely to be tabled during the Monsoon Session","content":"<p>Home Minister Rajnath Singh said the Union Cabinet has approved the restoration of the existing SC\/ST Act and  Prime Minister Narendra Modi had already assured that the government will not allow dilution of the Act. He said the NDA government will be tabled during the ongoing Monsoon Session. <\/p>\n<p>Congress leader Mallikarjun Kharge while taking a dig at the Central government asked the existing Bill to be tabled in the Lower House. He added, once tabled, the House will make sure that the Bill is passed.<\/p>","date":"2018-08-02 12:45:49","status":"1"},{"title":"Rajya Sabha has been adjourned till 2 pm","content":"<p><img src=\"http:\/\/cms.newindianexpress.com\/FCKeditor\/fckeditor_img\/rajya sabha 2.JPG\" width=\"500\" height=\"215\" alt=\"\" \/> <\/p>","date":"2018-08-02 01:03:02","status":"1"},{"title":"","content":"<p><strong> Lok Sabha has been adjourned to meet at 2 pm.<\/strong><\/p>","date":"2018-08-02 01:04:46","status":"1"},{"title":"BJP's Dalit leaders, allies welcome bill on SC\/ST atrocities law","content":"<p>JP allies and the party's Dalit leaders hailed today Prime Minister Narendra Modi after the Union Cabinet gave its nod to a bill to overturn a Supreme Court order on a law on atrocities against Dalits with LJP chief Ram Vilas Paswan terming the decision \"historic. <\/p>\n<p><strong>READ MORE | <\/strong><a href=\"http:\/\/www.newindianexpress.com\/nation\/2018\/aug\/02\/bjps-dalit-leaders-allies-welcome-bill-on-scst-atrocities-law-1852144.html\" target=\"_blank\"><strong>BJP's Dalit leaders, allies welcome bill on SC\/ST atrocities law<\/strong><\/a><\/p>","date":"2018-08-02 01:23:58","status":"1"},{"title":"","content":"<p>Rajya Sabha adjourned for the day following opposition over NRC issue<\/p>","date":"2018-08-02 02:43:54","status":"1"},{"title":"OBCs are the backbone of the country: Dr Boora Narsaiah Goud, TRS","content":"<p>OBCs are the backbone of the country. Most of the MSME sector is run by OBCs. The Congress hugged the Prime Minister the other day. If the Congress would have hugged us OBCs in the last 25 years they would have known our pain. The representation of the OBCs is merely 9% in the government against the given 25% reservation.<\/p><p><img src=\"http:\/\/cms.newindianexpress.com\/FCKeditor\/fckeditor_img\/image\/Dr%20Boora%20Narsaiah%20Goud%20TRS.JPG\" width=\"493\" height=\"245\" align=\"middle\" alt=\"\" \/><\/p>","date":"2018-08-02 03:06:02","status":"1"},{"title":"The government should consider this 50% limt: Rammohan Naidu Kinjarapu, TDP","content":"If the government is not able to fulfill the 27% given reservation then why is the creamy layer section present? Demographics have changed OBCs, SC, ST, now 80% then how can you limit the reservations to 50%. Even the Supreme Court is not definite about the 50% limit. Tamil Nadu already has crossed that limit. There should be a caste based census as the demographics have changed. Hence I propose a separate a discussion on this 50% limit. We support the bill.<img src=\"http:\/\/cms.newindianexpress.com\/FCKeditor\/fckeditor_img\/image\/Rammohan%20Naidu%20Kinjarapu.JPG\" width=\"493\" height=\"245\" align=\"middle\" alt=\"\" \/><\/p>","date":"2018-08-02 03:16:10","status":"1"},{"title":"","content":" ","date":"2018-08-02 03:26:34","status":"0"},{"title":"The Mandal Commission has done justice to all the castes: Nityanand Rai","content":"<p> Congress has always worked against the backward classes. The Kaka Kalelkar commissions report was neglected by Jawaharlal Nehru. Some castes which are backward in one state but are well off in other. The Mandal Commission has done justice to all the castes. But the next Rajiv Gandhi led Congress government didn't allow the commission's recommendations to put into practice. Mandal Commission has merely become a law and nothing less.<\/p>","date":"2018-08-02 03:36:31","status":"1"},{"title":"Geeta Kothupalli, YSRCP: Creamy Layer is a big hurdle.","content":"<img src=\"http:\/\/cms.newindianexpress.com\/FCKeditor\/fckeditor_img\/image\/Geeta%20Kothupalli_.JPG\" width=\"468\" height=\"306\" align=\"middle\" alt=\"\" \/><p>SC\/ST does not have creamy layer but the OBCs have creamy layer. This is proving to be a big hurdle in the OBCs. I know some of the families which have many IAS officers but. If my son competes with a tribal child my child gets selected and the poor boy suffers. The entire creamy layer is enjoyed by only 2% of the caste population<\/p>","date":"2018-08-02 03:47:38","status":"1"},{"title":"Tamradwaj Sahu, INC: Why has the government brought this bill now?","content":"<p> Why has the government brought this bill now when there are just 8 months for the General Elections? Congress never opposed the reservations. There is a ministry for castes with 2% to 3% of the population then why not for the OBCs.<\/p>\n<p>When PV Narasimha Rao government was in power we gave OBCs 27% reservation. This bill has been brought now after four years so it should not happen that it simply remains a promise with OBCs not getting their rights.<\/p>","date":"2018-08-02 03:55:50","status":"1"},{"title":"Neither Congress nor the BJP can take the credit of Mandal Commission: Dharmendra Yadav, SP","content":"<img src=\"http:\/\/cms.newindianexpress.com\/FCKeditor\/fckeditor_img\/image\/Dharmendra%20Yadav,%20SP.JPG\" width=\"480\" height=\"311\" align=\"middle\" alt=\"\" \/><p>This is the same government which had brought down the VP Singh Government after the Mandal Commission recommendations were accepted by the then government. This is a technical government so it would hardly take two months for the caste-based census. We would like to ask here how many OBC officers are there in the PMO? Can you tell? You told us 70% of the country is under BJP, please tell us how many Chief Ministers are OBCs. If you will fool people just for votes we will expose you.<\/p>","date":"2018-08-02 04:15:03","status":"1"},{"title":"OBC Students have left their engineering education: Madhukarrao Y Kukade, NCP","content":"<p>OBC Students have left their engineering education in Maharashtra because they are not getting scholarships. Every month the students are just getting Rs 100 scholarship. This is just not enough. They should get at least Rs 1000 scholarship.<\/p>","date":"2018-08-02 04:23:21","status":"1"},{"title":"OBC students in Jharkhand are being left out: BJP MP Ram Tahal Chowdhary","content":"<p>In my home state Jharkhand the OBC students have to renew the caste certificate every year. This is  big problem for students. OBC students are being left out  because of this problem. After Jharkhand got seperated from Bihar the 27% reservation got reduced to 14% while the population is above 50%.<\/p>","date":"2018-08-02 05:11:31","status":"1"},{"title":"LJP MP Ram Vilas Paswan speaks","content":"<img src=\"http:\/\/cms.newindianexpress.com\/FCKeditor\/fckeditor_img\/image\/Ram%20Vilas%20Paswan.JPG\" width=\"445\" height=\"285\" align=\"middle\" alt=\"\" \/><p>Until and unless OBCs talk of Dalits, upper caste people wont talk about OBC, Hindu wont talk about Muslims, development cannot take place.<\/p>","date":"2018-08-02 05:21:35","status":"1"},{"title":"Ram Vilas Paswan thanks BJP","content":"<p>We thank the government for bringing this Constitutional amendment bill and also bringing the extremely backward castes under this commission. All the middle class castes have never supported the Congress. Because they never talked about it. The one who talked about it was Ram Manohar Lohia.<\/p>","date":"2018-08-02 05:31:05","status":"1"},{"title":"AIMIM MP Assadudin Owaisi speaks","content":"<p><img src=\"http:\/\/cms.newindianexpress.com\/FCKeditor\/fckeditor_img\/image\/Assadudin%20Owaisi%20speaks.JPG\" width=\"700\" height=\"500\" align=\"middle\" alt=\"\" \/>Why are we keeping 90% population under 50%? I request Ram Vilas Paswanji to implewment hte Indira Sahni judgment and allow 90% reservation. If Marathas, Patels would get reservations Muslims should also get reservation there.<\/p>","date":"2018-08-02 05:37:59","status":"1"},{"title":"Minister of Social Justice and Empowerment Thawarchand Gehelot speaks","content":"<p>The government has achieved remarkable progress in every field. Our review petition for reservations in promotion was accepted by the Supreme Court.\n\nFor the SC\/ST atrocities act we have yesterday brought a legislation which was told to the house by the Honorable Home Minister. \n\nAligarh Muslim university and Jamia Milia are  central universities and reservation should also apply there and I hope we will be successful in doing it.<\/p>","date":"2018-08-02 06:19:37","status":"1"},{"title":"Minister explains on the students scholarships takes a dig at Congress","content":"<p>We have increased the income limit for the scholarship to OBCs from 44,000 to 2.5 lakh. For SC\/ST also we have increased the limit in rural was 98000 in rural and 1.2 lakh in urban which have been increased to 2.5 lakh in both urban and rural.<\/p> ","date":"2018-08-02 06:31:33","status":"1"},{"title":"","content":"<p><strong>Lok Sabha takes the bill for voting<\/strong><\/p>","date":"2018-08-02 06:33:41","status":"1"},{"title":"","content":"<p><strong>Discussion on 123 Constitutional amendment bill ends. Lok Sabha gears up for voting on the constitutional amendment bill.<\/strong><\/p>","date":"2018-08-02 06:40:19","status":"1"},{"title":"","content":"<p> <strong>Voting on the amendments begins.<\/strong><\/p>","date":"2018-08-02 06:42:35","status":"1"},{"title":"","content":"<p><strong>The 123 constitutional amendments bill is passed. <img src=\"http:\/\/cms.newindianexpress.com\/FCKeditor\/fckeditor_img\/image\/Voting2.JPG\" width=\"650\" height=\"471\" align=\"middle\" alt=\"\" \/><\/strong><\/p>","date":"2018-08-02 06:58:18","status":"1"},{"title":"","content":"<p><strong> Lok Sabha ajourned till 3 August 11:00 am.<\/strong><\/p>","date":"2018-08-02 07:00:03","status":"1"}]}