{"details":[{"title":"PM Narendra Modi, Amit Shah arrive at the Parliament house ","content":"<p><img src=\"http:\/\/cms.newindianexpress.com\/FCKeditor\/fckeditor_img\/Narendra Modi.jpg\" width=\"500\" height=\"245\" alt=\"\" \/> <\/p>\n<p>Prime Minister Narendra Modi and BJP President Amit Shah greeted by OBC and Prrvanchal MP's during BJP party parliamentary meeting earlier today. (Photo| EPS\/ Shekhar Yadav)<\/p>","date":"2018-08-07 10:43:39","status":"1"},{"title":"Bills to be taken up for discussions and passing in Rajya Sabha","content":"<ul>\n    <li>Sports Minister Rajyavardhan Singh Rathore to initiate the discussion on <strong>The National Sports   University Bill, 2018.<\/strong><\/li>\n    <li>Union Minister of State Shripad Naik will initiate the discussion on <strong>The Homoeopathy Central Council   (Amendment) Bill, 2018<\/strong>.<\/li>\n    <li>Finance Minister Piyush Goyal will bring forward <strong>The Insolvency and Bankruptcy Code (Second Amendment) Bill, 2018.<\/strong><\/li>\n<\/ul>","date":"2018-08-07 10:51:47","status":"1"},{"title":"CPI leaders join RJD MPs in protest","content":"<blockquote class=\"twitter-tweet\" data-lang=\"en\">\n<p lang=\"en\" dir=\"ltr\">Delhi: RJD, SP and CPI MPs protest in the Parliament premises over <a href=\"https:\/\/twitter.com\/hashtag\/DeoriaShelterHomeCase?src=hash&ref_src=twsrc%5Etfw\">#DeoriaShelterHomeCase<\/a> and <a href=\"https:\/\/twitter.com\/hashtag\/MuzaffarpurShelterHome?src=hash&ref_src=twsrc%5Etfw\">#MuzaffarpurShelterHome<\/a> issue. <a href=\"https:\/\/t.co\/f6ClYBD4Wz\">pic.twitter.com\/f6ClYBD4Wz<\/a><\/p>\n— ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1026699411038994432?ref_src=twsrc%5Etfw\">August 7, 2018<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2018-08-07 10:58:20","status":"1"},{"title":"Rajya Sabha convenes, mourns former Congress MP RK Dhawan's demise","content":"<p>The Rajya Sabha convened today with Chairman Venkaiah Naidu paying homage and mourning the death of veteran Congress leader and Rajya Sabha MP RK Dhawan.<\/p>","date":"2018-08-07 11:04:41","status":"1"},{"title":"Rahul Gandhi arrives at the Parliament House","content":"<p><img src=\"http:\/\/cms.newindianexpress.com\/FCKeditor\/fckeditor_img\/rahul gandhi(1).jpg\" width=\"500\" height=\"247\" alt=\"\" \/> <\/p>\n<p>Congress working President Rahul Gandhi arrive at the Parliament building (Photo| EPS\/ Shekhar Yadav)<\/p>","date":"2018-08-07 11:12:29","status":"1"},{"title":"Rajya Sabha adjourned till 12 noon","content":"<p> <img src=\"http:\/\/cms.newindianexpress.com\/FCKeditor\/fckeditor_img\/rajya.JPG\" width=\"500\" height=\"212\" alt=\"\" \/><\/p>\n<p>Chairman Venkaiah Naidu adjourned the Upper House till 12 noon after RJD MPs raised their voice agaist the Chair for not accepting the adjournment motion raised for the Deoria Shelter Home Case and the Muzaffarpur Shelter Home issue.<\/p>","date":"2018-08-07 11:16:57","status":"1"},{"title":"Discussion on E-NAM platform underway in Lok Sabha ","content":"<p>Haryana MP Dhyshyant Chautala raised the credibilty of National Agriculture Market (e-NAM), an online trading platform for agricultural commodities in Lok Sabha. Refuting Center's claim that 21 lakh farmers from the Haryana state is going to benifit from the platform, he said, Haryana only has 16 lakh farmers and they are not befitting from the app.<\/p>","date":"2018-08-07 11:42:42","status":"1"},{"title":"Adhir Ranjan Chowdhury shows concern about West Bengal farmer's enrollment in e-NAM","content":"<p>In West Bengal, only 3,224 farmers have registered for e-NAM platform. Everyday 35 farmers kill themselves despite there being such platforms. What is the government doing, asks Congress MP  Adhir Ranjan Chowdhury.<\/p>","date":"2018-08-07 11:51:29","status":"1"},{"title":"MP Mohammed PP Faizal takes up issues pertaining to Lakshadweep in Lok Sabha","content":"<p><img src=\"http:\/\/cms.newindianexpress.com\/FCKeditor\/fckeditor_img\/lakshadeep.JPG\" width=\"500\" height=\"322\" alt=\"\" \/><\/p>\n<p>Sharing the dismal condition of the fire services in Lakshadweep islands, Mohammed PP Faizal asks, whether the Government is going to  any to ensure the smooth functioning of the fire and emergency services or  create a separate Fire Department. He says on two fire offices are operational at the moment and the officers are bereft of any official training, He also added that the fire personnel are being asked to take care of law and order too.<\/p>","date":"2018-08-07 12:02:00","status":"1"},{"title":"Rajnath Singh assures help for Lakshadweep","content":"<p><img src=\"http:\/\/cms.newindianexpress.com\/FCKeditor\/fckeditor_img\/rajnath singh.JPG\" width=\"500\" height=\"341\" alt=\"\" \/><\/p>\n<p>Union Home Minister Rajnath Singh assures help, says 10 new tenders have been ordered and will be deployed soon.<\/p>","date":"2018-08-07 12:04:50","status":"1"},{"title":"","content":"<p><big><strong>Lok Sabha withdraws the Financial Resolution and Deposit Insurance Bill, 2017<\/strong><\/big><\/p>","date":"2018-08-07 12:19:40","status":"1"},{"title":"Uproar in Lok Sabha over Deoria Shelter home case","content":"<p>Dharmendra Yadav of Samajwadi Party rakes up issue of Deoria shelter home rape case in Uttar Pradesh. Congress leader Mallikarjun Kharge demands formation of standing commitee to run checks on shelter homes across the country.<\/p>\n<p> <\/p>","date":"2018-08-07 12:26:32","status":"1"},{"title":"Won't spare the culprits: Rajnath Singh","content":"<p>\"I congratulate Chief Minister Yogi Adityanath for taking quick action on the issue. The District Planning officer was immediately suspended.   I assure that none of the accused involved will go unarrested. An advisory has been sent to all the states to investigate the existing shelter homes,\" says Home Minister Rajnath Singh.<\/p>","date":"2018-08-07 12:28:51","status":"1"},{"title":"Sougata Roy pays homage to Netaji Subhas Chandra Bose","content":"<p>Trinamool MP Sougata Roy pays homage to Netaji Subhas Chandra Bose on the 75th anniversary of the Azad Hind movement, Lok Sabha applauds.<\/p>","date":"2018-08-07 12:55:06","status":"1"},{"title":" Rajya Sabha adjourned till 2 pm","content":"<p> The Upper House has been adjourned to meet again at 2 pm.<\/p>","date":"2018-08-07 01:01:43","status":"1"},{"title":"MPs from RJD demand justice for Deoria Shelter Home Rape ","content":"<p><img src=\"http:\/\/cms.newindianexpress.com\/FCKeditor\/fckeditor_img\/rjd protest.jpg\" width=\"500\" height=\"295\" alt=\"\" \/> <\/p>\n<p>(Photo| EPS\/ Shekhar Yadav)<\/p>","date":"2018-08-07 01:05:09","status":"1"},{"title":"MPs from RJD demand justice for Deoria Shelter Home Rape ","content":"<p><img src=\"http:\/\/cms.newindianexpress.com\/FCKeditor\/fckeditor_img\/rjd protest.jpg\" width=\"500\" height=\"295\" alt=\"\" \/> <\/p>\n<p>(Photo| EPS\/ Shekhar Yadav)<\/p>","date":"2018-08-07 01:05:13","status":"0"},{"title":"TDP members demand separate railway zone in Visakhapatnam","content":"<p>Telugu Desam Party MPs raised the deamnd of creation of a  separate railway zone in Visakhapatnam. Other MPs from the party begin to show placards, but Speaker asks them to refrain from doing so.<\/p>","date":"2018-08-07 01:16:04","status":"1"},{"title":"Sukhdev S Dhindsa of Akali Dal alleges that JD(U) filed nomination for RS deputy chairman polls without notice","content":"<blockquote class=\"twitter-tweet\" data-lang=\"en\">\n<p lang=\"en\" dir=\"ltr\">We don't have any problem with candidate as JDU is our friend but 1st they told our candidate Naresh Gujral to prepare. He was preparing&suddenly they nominated JDU's candidate without informing us: Sukhdev S Dhindsa after Shiromani Akali Dal's meeting over RS Vice chairman polls <a href=\"https:\/\/t.co\/fujeLODZQ2\">pic.twitter.com\/fujeLODZQ2<\/a><\/p>\n— ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1026731490707689473?ref_src=twsrc%5Etfw\">August 7, 2018<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2018-08-07 01:18:53","status":"1"},{"title":"Amit Shah initiates discussion on MSP as Rajya Sabha reconvenes, TMC protests","content":"<p>&nbsp;<img src=\"http:\/\/cms.newindianexpress.com\/FCKeditor\/fckeditor_img\/protest.JPG\" width=\"500\" height=\"219\" alt=\"\" \/><\/p>\n<p>Uproar in Rajya Sabha as BJP President Amit Shah rejects agrarian crisis and says Narendra Modi government is working very hard to double farmers' income. The NDA government has the increased 65 percent of the Agriculture budget during 2014-2019, he said. The Trinamool members trooped the Well of the House and raised their voice against the Union government.<\/p>","date":"2018-08-07 02:12:56","status":1},{"title":"","content":"<p><big><strong>&nbsp;Rajya Sabha adjourned for 10 minutes.<\/strong><\/big><\/p>","date":"2018-08-07 02:15:32","status":1},{"title":"","content":"<p>Opposition continues intense attack on government over higher support for farmers.<\/p>","date":"2018-08-07 02:50:12","status":1},{"title":"","content":"<p>Congress MP from Kerala, KC Venugopal attacks government over the pricing of the Rafale deal.<\/p>","date":"2018-08-07 02:52:46","status":1},{"title":"","content":"<p><strong>Rajya Sabha adjourned till 3 pm over clash on Minimum Support Price for farmers.<\/strong><\/p>","date":"2018-08-07 02:54:12","status":1},{"title":"","content":"<p>Uproar in Lok Sabha over the Rafale deal as Congress attacks government calling it a 'scam'.<\/p>","date":"2018-08-07 02:56:17","status":1},{"title":"","content":"<p>Rajya Sabha resumes as Chairman Venkaiah Naidu appeals for a calm discussion on important issues, including agrarian crisis.<\/p>","date":"2018-08-07 03:02:10","status":1},{"title":"","content":"<p><span style=\"color: rgb(255, 0, 0);\"><strong>After many adjournments in the day due to disruptions in the house, Rajya Sabha is adjourned till 11 am on Wednesday.<\/strong><\/span><\/p>","date":"2018-08-07 03:05:32","status":1}]}