{"details":[{"title":"Congress submits Adjournment notice in Lok Sabha","content":"<p>Congress Leader Ranjeet Ranjan has given adjournment motion notice in Lok Sabha over Muzaffarpur shelter home case's main witness missing from Bihar's Madhubani.<em> (ANI)<\/em><\/p>","date":"2018-08-06 10:09:30","status":"1"},{"title":" Bills to be considered in Rajya Sabha:","content":"<ul>\n    <li>The Constitution (One Hundred and Twenty-third Amendment) Bill, 2017.<\/li>\n    <li>The National Commission for Backward Classes (Repeal) Bill, 2017.<\/li>\n    <li>The Criminal Law (Amendment) Bill, 2018.<\/li>\n<\/ul>","date":"2018-08-06 10:11:37","status":"1"},{"title":"Bills to be introduced in Lok Sabha:","content":"<ul>\n    <li>The Scheduled Castes and the Scheduled Tribes (Prevention of Atrocities) Amendment Bill, 2018.<\/li>\n    <li>The Juvenile Justice (Care and Protection of Children) Amendment Bill, 2018.<\/li>\n    <li>The Banning of Unregulated Deposit Schemes Bill, 2018.<\/li>\n<\/ul>","date":"2018-08-06 10:14:48","status":"1"},{"title":"Trinamool MPs stage protest outside Parliament","content":"<p> <img src=\"http:\/\/cms.newindianexpress.com\/FCKeditor\/fckeditor_img\/Trinamool.jpg\" width=\"500\" height=\"375\" alt=\"\" \/><\/p>\n<p>(Photo| AITC)<\/p>\n<p> <\/p>","date":"2018-08-06 10:54:18","status":"1"},{"title":"TDP MPs continue their protest for the 13th day","content":"<blockquote class=\"twitter-tweet\" data-lang=\"en\">\n<p lang=\"en\" dir=\"ltr\">TDP MP Naramalli Sivaprasad dresses up as Lord Ram to protest in Parliament over the demand of special status for Andhra Pradesh. He has earlier dressed up as a magician, a woman, a washerman & a school boy among others. <a href=\"https:\/\/twitter.com\/hashtag\/Delhi?src=hash&ref_src=twsrc%5Etfw\">#Delhi<\/a> <a href=\"https:\/\/t.co\/jeCQin153A\">pic.twitter.com\/jeCQin153A<\/a><\/p>\n— ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1026336413887815680?ref_src=twsrc%5Etfw\">August 6, 2018<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2018-08-06 10:55:37","status":"1"},{"title":"Lok Sabha remembers Hiroshima day","content":"<p>Lok Sabha reconvened after mourning for the people killed during Hiroshima Nagasaki bombings in 1945.<\/p>\n<p><img src=\"http:\/\/cms.newindianexpress.com\/FCKeditor\/fckeditor_img\/sumitra Mahajan.JPG\" width=\"500\" height=\"431\" alt=\"\" \/><\/p>","date":"2018-08-06 11:05:20","status":"1"},{"title":"Suresh Prabhu responds to questions on job crunch in Lok Sabha","content":"<p>Be happy that many companies find it necessary to come to India: Minister of Commerce and Industry, Suresh Prabhu<\/p>","date":"2018-08-06 11:20:06","status":"1"},{"title":" India is the highest growing tourism country in the world: Alphons Kannanthanam","content":"<p>India saw an hike of 14.4% last year in terms of foreign tourism in India. 27 billion dollars came to the country through foreign tourism. We have outdone all the prior governments in the tourism sector, alleges Minister of States (Tourism) Alphons Kannanthanam.<\/p>","date":"2018-08-06 11:27:28","status":"1"},{"title":"Former Prime Minister Manmohan Singh is present in Rajya Sabha","content":"<p> <img src=\"http:\/\/cms.newindianexpress.com\/FCKeditor\/fckeditor_img\/Manmohan Singh.JPG\" width=\"500\" height=\"212\" alt=\"\" \/><\/p>","date":"2018-08-06 11:32:46","status":"1"},{"title":"Derek O'Brian raises UIDAI issue in Rajya Sabha.","content":"<p>UIDAI is getting involved in controversies, few days back their helpline number popped up in millions of mobile phone. This raises the issue of privacy and deprivation, says Trinamool MP Derek O' Brian. He also asked the Union government to not make Aadhaar compulsory and to guard  private data.<\/p>","date":"2018-08-06 11:49:10","status":"1"},{"title":"","content":"<h3 style=\"color: red;\">Election for the post of Deputy Chairman of Rajya Sabha to be held on Thursday, Aug 9, Chairman Venkaiah Naidu announces. Nominations to be filed by Aug 8. <\/h3>","date":"2018-08-06 12:02:38","status":"0"},{"title":"","content":"<h3 style=\"color: red;\">Election for the post of Deputy Chairman of Rajya Sabha to be held on Thursday, August 9, Chairman Venkaiah Naidu announces. Nominations to be filed by August 8.<\/h3>","date":"2018-08-06 12:03:13","status":"1"},{"title":"","content":"<p><strong>Question hour in both the houses of the Parliament commences.<\/strong><\/p>\n<p><img src=\"http:\/\/cms.newindianexpress.com\/FCKeditor\/fckeditor_img\/rajya sabha1.JPG\" width=\"500\" height=\"213\" alt=\"\" \/><\/p>","date":"2018-08-06 12:07:32","status":"1"},{"title":"Uproar in Lok Sabha over Muzaffarpur rape case","content":"<p>Slogans were raised in the lower house of the house after Congress MP Ranjeet Ranjan brought uop the Muzaffarpur shelter home rape case. She said, \"why the 14 institutions are not being investigated. Why wasn't the security of the children not looked into earlier?\"  RJD MP Jay Prakash Narayan Yadav joined the protest and said, the girls were being played like toys and the onus is on the government.\"<\/p>","date":"2018-08-06 12:17:59","status":"1"},{"title":"Lok Sabha adjourned till 12.30 pm","content":"<p>The lower house has been adjourned till 12.30 pm over protest on Muzaffarpur shelter home rape case. The TDP MPs  joined Bihar MPs in trooping the well of the House and raising slogans against the Union government.<\/p>","date":"2018-08-06 12:21:24","status":"1"},{"title":" Saugata Roy moves privilege motion","content":"<p>Trinamool MP Saugata Roy moves Privilege Motion in Lok Sabha after a delegation of Trinamool lawmakers were heckled in Silchar Airport.<\/p>","date":"2018-08-06 12:33:02","status":"1"},{"title":"Lok Sabha resumes ","content":"<p>Lok Sabha reconvenes amidst protest from RJD members.<\/p>","date":"2018-08-06 12:37:31","status":"1"},{"title":"Andhra Pradesh Special Status raised in Lok Sabha","content":"<p>Release promised Rs 350 crore for the backward districts of Andhra Pradesh, demands Telugu Desam Party MP Rammohan Naidu Kinjarapu.<\/p> Speaker Sumitra Mahajan criticises TDP MPs holding placards in Lok Sabha.","date":"2018-08-06 12:39:40","status":"1"},{"title":"TDP MP Siva Prasad dressed as Lord Ram","content":"<p><img src=\"http:\/\/cms.newindianexpress.com\/FCKeditor\/fckeditor_img\/TDP_EPS.jpg\" width=\"500\" height=\"319\" alt=\"\" \/> <\/p>\n<p>TDP MP Siva Prasad dressed as Lord Rama with TMC MP Dinesh Trivedi and  Derek O'Brien during a protest demonstration demanding Special Status for Andhra Pradesh. (Photo | EPS\/ Shekhar Yadav)<\/p>","date":"2018-08-06 12:53:28","status":"1"},{"title":"17 Opposition parties will get together to demand ballot papers: Trinamool MP Sougata Roy","content":"<p>Advanced countries like Germany and America use ballot papers for elections. We know that Electronic Voting Machines (EVM) can be compromised. Thus I'll like to urge to the Union government to scrape EVMs, says Trinamool MP Sougata Roy in Lok Sabha.<\/p>","date":"2018-08-06 12:58:37","status":"1"},{"title":" Rajya Sabha adjourned till 2pm","content":"<p>The Upper House has been adjourned to meet again at 2pm. Post lunch, the House will take up the The National Commission for Backward Classes (Repeal) Bill, 2017 for consideration.<\/p>","date":"2018-08-06 01:01:06","status":"1"},{"title":"","content":"<blockquote class=\"twitter-tweet\" data-lang=\"en\">\n<p lang=\"en\" dir=\"ltr\">JD(U) MP Harivansh will be the candidate of NDA for Rajya Sabha deputy chairman: Sources <a href=\"https:\/\/t.co\/A5t7RDZ1Pk\">pic.twitter.com\/A5t7RDZ1Pk<\/a><\/p>\n— ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1026372866336411648?ref_src=twsrc%5Etfw\">August 6, 2018<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2018-08-06 01:12:54","status":"1"},{"title":"","content":"<p><strong>Lok Sabha adjourned till 2 pm.<\/strong><\/p>","date":"2018-08-06 01:48:57","status":"1"},{"title":"Rajya Sabha reconvenes","content":"<p>MoS Social Justice and Empowerment Thaawar Chand Gehlot introduces The Constitution (One Hundred and Twenty-third Amendment) Bill, 2017. The amendment pertains to creating a National Commission for Backward Classes. <\/p>\n<p>Discussion underway<\/p>","date":"2018-08-06 02:26:18","status":"1"},{"title":"SC\/ST Bill taken up for discussion in Lok Sabha","content":"<p>The SC\/ST Bill has been takes up for discussion in Lok Sabha, the Amendment Bill seeks to overturn the Supreme Court order that laid down certain safeguards in the law to prevent atrocities against people of scheduled castes and tribes.<\/p>","date":"2018-08-06 02:37:02","status":"1"},{"title":" The SC\/ST bill could have been brought as an Ordinance: Mallikharjun Kharge","content":"<p>Congress leader Mallikharjun Kharge said that the SC\/ST Act amendment bill could have been brought as an Ordinance. Kharge also stated that the government brought in the Bill in the fear of losing the elections.<\/p>","date":"2018-08-06 03:21:09","status":"1"},{"title":"The atrocity Act must be included in Schedule Nine of the Constitution: Mallikharjun Kharge","content":"<p>Mallikharjun Kharge said that there are about 24 lakh vacancies in government sectors. He also said that first these vacancies are to be filled. This was in response to the statement made by Union minister Nitin Gadkari that reservation itself is not enough to get government jobs as there is a shrink in jobs.<\/p>","date":"2018-08-06 03:32:09","status":"1"},{"title":" The findings of socio-economic caste census must be made public: Narendra Jadhav in Rajya Sabha","content":"<p>Narendra Jadhav said that there is a need to compare the Rohini Commission's report and the census data a prepare a fresh OBC list.<\/p>","date":"2018-08-06 03:38:12","status":"1"},{"title":"Congress couldn't award the Bharat Ratna to B.R. Ambedkar: Vinod Kumar Sonkar in Lok Sabha","content":"Vinod Kumar Sonkar(BJP) criticised the Supreme Court ruling seeking arrest only after a preliminary enquiry by the police. He also criticised Congress leader Mallikharjun Kharge and said Congress couldn't award the Bharat Ratna to B.R. Ambedkar.","date":"2018-08-06 04:02:25","status":"1"},{"title":"Once people were reluctant to call themselves backward, but today everyone wants to take the benefits of reservation: Sanjay Raut in Rajya Sabha","content":"<p>Sanjay Raut said that the country will only develop when the reservation comes to an end. He also said that once people were reluctant to call themselves backward, but today everyone wants to take the benefits of reservation.<\/p>","date":"2018-08-06 04:30:12","status":"1"},{"title":"Socially backward community has never got enough opportunities to go forward: T.K.S Elangovan in Rajya Sabha","content":"T.K.S Elangovan (DMK) said that the socially backward class has never got enough opportunities to go forward. He also stated an instance when even after proper training non-brahmins were not allowed to be made the Priests.","date":"2018-08-06 04:45:51","status":"1"},{"title":"Rajya Sabha passed the Backward Classes (Repeal) Bill","content":"The National Commission for Backward Classes (Repeal) Bill, 2017 has been passed in Rajya Sabha. ","date":"2018-08-06 05:53:38","status":"1"},{"title":"Criminal Law (Amendment) Bill has been taken up in Rajya Sabha","content":"<p>Criminal Law (Amendment) Bill, 2018 has been taken up in Rajya Sabha . Minister of State for Home Affairs Kiren Rijiju moves the Bill, which has been passed by the Lok Sabha. The Bill seeks to amend the criminal law to award death penalty for child rape convicts.<\/p>","date":"2018-08-06 05:57:43","status":"1"},{"title":"Rajya Sabha extended for three hours for the bill to be passed","content":"<p>The House is extended for three hours for the bill to be passed.The congress leader Rajeev Gowda said that the death penalty clause has to be reconsidered. He also said that compensation to the victims has to be discussed.<\/p>","date":"2018-08-06 06:11:40","status":"1"},{"title":"If the punishment for murder and rape is the same, that gives a reason for rapists to kill their victims: Prof. Manoj Kumar in Rajya Sabha","content":"Prof. Manoj Kumar ( RJD) stated that there is also a need to consider the sexual abuse on boys. He also said that if the punishment for murder and rape is the same, that gives a reason for rapists to kill their victims.\n\nK.T.S Thulsi stated the need to have special court where the girls can feel protected and they can give statements against the criminals ","date":"2018-08-06 06:46:54","status":"1"},{"title":"Human and psychological impacts of the victims and their family members should be taken into consideration: Binoy Viswam in Rajya Sabha","content":"<p>Senior CPI leader Binoy Viswam while supporting the bill said that there is this patriarchal attitude in our society which has to be changed. He also added that the human impacts of the victims and their family members should be taken into consideration.<\/p>","date":"2018-08-06 07:13:23","status":"1"},{"title":"Specific helplines and awareness about these crimes have been set up: Kiren Rijiju in Rajya Sabha","content":"Union Minister of State for Home Affairs of India Kiren Rijiju said that a centrally-funded scheme to set up fast track courts is initiated to address the issue of case pile-up.","date":"2018-08-06 07:27:49","status":"1"},{"title":"Criminal Law (Amendment) Bill, 2018 has been passed ","content":"The Criminal Law (Amendment) Bill, 2018 has been passed and Rajya Sabha is adjourned for the day.\n","date":"2018-08-06 07:33:46","status":"1"},{"title":" The discussion on the SC\\ST act continues in Lok Sabha","content":"<p>The discussion on the SC\\ST act continues in Lok Sabha.The House has extended its discussion to another one hour.<\/p>","date":"2018-08-06 07:45:15","status":"1"},{"title":"","content":"<p><strong>Lok Sabha passes Bill to restore the provisions of SC\/ST( Prevention of Atrocities)Act, 1989.<\/strong> Lok Sabha adjourned till  7 August 11:00 am.<\/p>","date":"2018-08-06 08:25:50","status":"1"}]}