{"details":[{"title":"","content":"<p>Today is the last day of the Parliament's monsoon session.<\/p>","date":"2018-08-10 11:27:21","status":"1"},{"title":"Triple Talaq Bill to face the Rajya Sabha test","content":"<p>The Muslim Women (Protection of rights on marriage) Bill, 2017, which has already been passed by the Lok Sabha, is awaiting the nod of the Rajya Sabha where the ruling NDA is short of the halfway mark to push a legislative bill on its own.<\/p>","date":"2018-08-10 11:29:19","status":"1"},{"title":"","content":"<p>The Lok Sabha had yesterday approved amendments to the Triple Talaq Bill including: 1. Provision of bail for the accused before trial; 2. Only a woman or her family members could lodge a complaint against a husband for practising instant talaq. Besides, there would be scope for a compromise between the two parties.<\/p>","date":"2018-08-10 11:32:48","status":"1"},{"title":"","content":"<p>Sonia Gandhi with Congress MPs protesting against the Rafale deal demanding a Joint Parliamentary Committee probe outside Parliament House in New Delhi on Friday. (Photo | Shekhar Yadav\/EPS)<img src=\"http:\/\/cms.newindianexpress.com\/FCKeditor\/fckeditor_img\/rafale.jpg\" width=\"500\" height=\"300\" align=\"middle\" alt=\"\" \/><\/p>","date":"2018-08-10 11:39:07","status":"1"},{"title":"","content":"<p>Newly elected Rajya Sabha Deputy Chairman Harivansh Singh on the chair.<\/p>","date":"2018-08-10 11:42:22","status":"1"},{"title":"","content":"<blockquote class=\"twitter-tweet\" data-lang=\"en\">\n<p lang=\"en\" dir=\"ltr\">Uproar by Opposition in Rajya Sabha over <a href=\"https:\/\/twitter.com\/hashtag\/RafaleDeal?src=hash&ref_src=twsrc%5Etfw\">#RafaleDeal<\/a> issue. <a href=\"https:\/\/t.co\/JflHuL1ssU\">pic.twitter.com\/JflHuL1ssU<\/a><\/p>\n— ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1027794895069577216?ref_src=twsrc%5Etfw\">August 10, 2018<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2018-08-10 11:42:27","status":"1"},{"title":"","content":"<p> <img src=\"http:\/\/cms.newindianexpress.com\/FCKeditor\/fckeditor_img\/siva prasad sonia gandhi.jpg\" width=\"500\" height=\"509\" align=\"middle\" alt=\"\" \/><\/p>\n<p>TDP MP Siva Prasad with Congress leader Sonia Gandhi during a protest demonstration demanding special Status for Andhra Pradesh at Parliament house in New Delhi on Friday. (Photo | Shekhar Yadav\/EPS)<\/p>","date":"2018-08-10 11:43:36","status":"1"},{"title":"","content":"<p>Tiruchi Siva requests government to award Bharat Ratna to late Tamil Nadu chief minister and DMK chief Karunanidhi.<\/p>","date":"2018-08-10 11:49:33","status":"1"},{"title":"SP leader Ram Gopal Yadav speaks","content":"<p>Ram Gopal Yadav (SP) talks about atrocities against Dalits in Uttar Pradesh. He raises the issue of a Dalit boy harassed in a police station. He seeks probe into the incident.<\/p>","date":"2018-08-10 11:50:32","status":"1"},{"title":"TMC's Derek O' Brien says Fridays are for Private Members Bills alone","content":"<p>Derek O'Brien says the parliamentary convention is Friday's are dedicated for Private Member's Bills. The government cannot introduce Bills today, he says. Others counter. Bhupendra Yadav (BJP) says as per the Rules the government can table Bills on Friday.<\/p>","date":"2018-08-10 11:51:32","status":"1"},{"title":"MoS Vijay Goel appeals for calm","content":"<blockquote class=\"twitter-tweet\" data-lang=\"en\">\n<p lang=\"en\" dir=\"ltr\">Spoke at the parliament today, requesting opposition parties not to hurl allegations. Adopt people first policy. Help the parliament function and pass bills which are in the best interest of the people.<a href=\"https:\/\/twitter.com\/hashtag\/RajyaSabha?src=hash&ref_src=twsrc%5Etfw\">#RajyaSabha<\/a> <a href=\"https:\/\/twitter.com\/hashtag\/MonsoonSession2018?src=hash&ref_src=twsrc%5Etfw\">#MonsoonSession2018<\/a> <a href=\"https:\/\/t.co\/YRtSWlJN9I\">pic.twitter.com\/YRtSWlJN9I<\/a><\/p>\n— Vijay Goel (@VijayGoelBJP) <a href=\"https:\/\/twitter.com\/VijayGoelBJP\/status\/1027800486110535680?ref_src=twsrc%5Etfw\">August 10, 2018<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2018-08-10 11:55:19","status":"1"},{"title":"","content":"<p> Question Hour round underway in the Lok Sabha. Sumitra Mahajan is on the chair.<\/p>","date":"2018-08-10 11:56:49","status":"1"},{"title":"Kerala floods brought up","content":"<p>CPI Kerala's Binoy Viswam tries to talk about the worsening flood situation in the state amid uproar in the House. Dy Chairman Harivansh Singh appeals for calm.<\/p>","date":"2018-08-10 12:01:21","status":"1"},{"title":"Binoy Viswam terms the Kerala floods a 'national emergency'","content":"<p>Binoy Viswam urges the government of India to support Kerala and the state government.<img src=\"http:\/\/cms.newindianexpress.com\/FCKeditor\/fckeditor_img\/binoy.JPG\" width=\"500\" height=\"365\" align=\"middle\" alt=\"\" \/><\/p>","date":"2018-08-10 12:05:23","status":"1"},{"title":"","content":"<p> READ HERE | <a href=\"http:\/\/www.newindianexpress.com\/states\/kerala\/2018\/aug\/10\/kerala-rain-fury-two-more-shutters-of-idukki-dam-opened-toll-touches-27-army-and-coast-guard-swin-1855883.html\" target=\"_blank\">Kerala rain fury: <\/a>Two more shutters of Idukki dam opened, toll touches 27; army and coast guard swing into action.<\/p>","date":"2018-08-10 12:09:25","status":"1"},{"title":"","content":"<p>The Rajya Sabha was adjourned twice within minutes during the pre-lunch session today amid protest by Congress members over their demand for a JPC probe into the alleged scam in the Rafale jet deal. The Deputy Chairman then adjourned the House a few minutes before the Zero hour was to end. When the House met for the Question Hour at noon, Congress members again raised their demand. Chairman M Venkaiah Naidu then adjourned the House till noon.<\/p>","date":"2018-08-10 12:10:04","status":"1"},{"title":"Rajya Sabha adjourned till 2:30 pm","content":"<blockquote class=\"twitter-tweet\" data-partner=\"tweetdeck\">\n<p lang=\"en\" dir=\"ltr\"><a href=\"https:\/\/twitter.com\/hashtag\/RajyaSabha?src=hash&ref_src=twsrc%5Etfw\">#RajyaSabha<\/a> adjourned till 2:30 pm after uproar by Opposition in Rajya Sabha over <a href=\"https:\/\/twitter.com\/hashtag\/RafaleDeal?src=hash&ref_src=twsrc%5Etfw\">#RafaleDeal<\/a> issue. <a href=\"https:\/\/t.co\/5uD66DK2yO\">pic.twitter.com\/5uD66DK2yO<\/a><\/p>\n— ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1027807037072105473?ref_src=twsrc%5Etfw\">August 10, 2018<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2018-08-10 12:11:53","status":"1"},{"title":"Congress, CPM demand special package for Kerala floods","content":"<p>P Karunakaran of the CPM and KC Venugopal of Congress bring the issue of Kerala floods in Lok Sabha; seek Centre and military assistance for relief and rescue as well as a special financial package for the state.<\/p>","date":"2018-08-10 12:38:25","status":"1"},{"title":"","content":"<p>AIADMK's Ashok Kumar brings up the Salem airport expansion row.<\/p>","date":"2018-08-10 12:40:01","status":"1"},{"title":"","content":"<p>Mentions of issues during the ongoing Zero Hour is barely heard over the din in the Lok Sabha.<\/p>","date":"2018-08-10 12:44:38","status":"1"},{"title":"","content":"<p>The plight of Tamil Nadu fishermen in Sri Lanka is brought up.<\/p>","date":"2018-08-10 12:48:32","status":"1"},{"title":"","content":"<p>AIADMK's Dr P Venugopal (Thiruvvalur MP) says that Tamil Nadu has an arrear pending worth 579.58 crore from Central government funds.<\/p>","date":"2018-08-10 12:51:55","status":"1"},{"title":"","content":"<p>Kaushalendra Kumar of Janata Dal (United) talks about the Lohar community for whom the Bihar government proposed scheduled tribe (ST) category status in 2017 but it is still pending. Other issues brought up include: proper health facilities, blood banks, lack of technicians to the issuance of Aadhaar for opening bank accounts for girls in Jharkhand.<\/p>","date":"2018-08-10 12:56:25","status":"1"},{"title":"","content":"<p>Lok Sabha is adjourned. To meet again at 2:05 pm.<\/p>","date":"2018-08-10 01:17:38","status":"1"},{"title":"Kerala floods: Rajnath Singh assures state of assistance","content":"<blockquote class=\"twitter-tweet\" data-lang=\"en\">\n<p lang=\"en\" dir=\"ltr\">I spoke to Kerala CM, he is fully satisfied with the assistance of the central govt & he has told me that every department is cooperating well. If he needs any other assistance he will inform me: Union Home Minister Rajnath Singh on <a href=\"https:\/\/twitter.com\/hashtag\/KeralaFloods?src=hash&ref_src=twsrc%5Etfw\">#KeralaFloods<\/a> <a href=\"https:\/\/t.co\/54sIA61rji\">pic.twitter.com\/54sIA61rji<\/a><\/p>\n— ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1027825015545364481?ref_src=twsrc%5Etfw\">August 10, 2018<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2018-08-10 01:28:51","status":"1"},{"title":"Congress MPs continue protest over Rafale deal","content":"<blockquote class=\"twitter-tweet\" data-conversation=\"none\" data-lang=\"en\">\n<p lang=\"en\" dir=\"ltr\">MPs protest at Parliament seeking a Joint Parliamentary Committee probe into PM Modi's Rafale deal. <a href=\"https:\/\/t.co\/FkRTYeGLVE\">pic.twitter.com\/FkRTYeGLVE<\/a><\/p>\n— Congress (@INCIndia) <a href=\"https:\/\/twitter.com\/INCIndia\/status\/1027823541570265088?ref_src=twsrc%5Etfw\">August 10, 2018<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2018-08-10 02:08:48","status":"1"},{"title":"Lok Sabha reconvenes. Kalraj Mishra in the chair.","content":"<p><strong>Union Minister of State for Law and Justice PP Chaudhury introduces The Arbitration and Conciliation (Amendment) Bill, 2018.<\/strong><\/p>","date":"2018-08-10 02:10:55","status":"1"},{"title":"The Arbitration and Conciliation (Amendment) Bill, 2018","content":"<p>It seeks to amend the Arbitration and Conciliation Act, 1996.  The Act contains provisions to deal with domestic and international arbitration, and defines the law for conducting conciliation proceedings. The amendment provides for creation of an independent body namely the Arbitration Council of India (ACI) which will grade arbitral institution and accredit arbitrators. The ACI will be an independent body.<\/p>","date":"2018-08-10 02:28:15","status":"1"},{"title":"","content":"<p>President of Punjab Pradesh Congress Committee Sunil Kumar Jakhar likens the Rafale deal with a popular Hindi proverb: chor ki dad mine tinka i.e., the thief is his own worst accuser.<\/p>","date":"2018-08-10 02:30:31","status":"1"},{"title":"","content":"<p><img src=\"http:\/\/cms.newindianexpress.com\/FCKeditor\/fckeditor_img\/sunil jakhar.JPG\" width=\"424\" height=\"326\" align=\"middle\" alt=\"\"\/p><p>Sunil Jhakar asks if the Rafale Deal will make it to the proposed arbitration panel.  He wonders how a company formed just days before the Prime Minister's France visit, bagged the Rafale deal.<\/p>","date":"2018-08-10 02:45:38","status":"1"},{"title":"Chairperson M Venkaiah Naidu informs Rajya Sabha that triple talaq Bill wouldn't be taken up in the House today.","content":"<\/p> <blockquote class=\"twitter-tweet\" data-lang=\"en\"><p lang=\"en\" dir=\"ltr\"><a href=\"https:\/\/twitter.com\/hashtag\/TripleTalaqBill?src=hash&ref_src=twsrc%5Etfw\">#TripleTalaqBill<\/a> will not be taken up today because no consensus could be built around it: Vice President and Rajya Sabha Chairman M Venkaiah Naidu <a href=\"https:\/\/t.co\/dVcllNp3qY\">pic.twitter.com\/dVcllNp3qY<\/a><\/p>— ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1027852480611143681?ref_src=twsrc%5Etfw\">August 10, 2018<\/a><\/blockquote>\n<script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>\n","date":"2018-08-10 02:55:08","status":"1"},{"title":"","content":"<p>With there being no consensus among the different parties regarding the triple talaq bill, the legislation will not be tabled in the Rajya Sabha on Friday. It has been deferred to the Winter Session.<\/p>","date":"2018-08-10 03:13:11","status":"1"},{"title":"","content":"<p>The Arbitration and Conciliation (Amendment) Bill, 2018 goes for voting.\n\nThe Bill is passed.<\/p>\n","date":"2018-08-10 03:39:00","status":"1"},{"title":"","content":"<p> Lok Sabha Speaker Sumitra Mahajan addresses the Lower House in the valedictory address. She says that the monsoon session was more productive than the previous sessions.<\/p>","date":"2018-08-10 03:49:09","status":"1"},{"title":"","content":"<p><strong>Monsoon Session of the Lok Sabha which began on July 18 adjourned Sine Die.<\/strong><\/p>","date":"2018-08-10 03:52:36","status":"1"},{"title":"","content":"<p>Minister for Social Justice Taawar Chaand Gehlot says there is a procedure laid to add, delete or modify the Scheduled Caste lists. He agrees there is discrepancies over the spellings of castes and assures the House it will be looked into.<\/p>","date":"2018-08-10 04:14:35","status":"1"},{"title":"Rajya Sabha discusses need for uniform reservation system in India","content":"<p>. The deputy chairman finds the \"Noes\" in majority; some BJP MPs demand for a division of vote. After holding the electronic voting, the deputy chairman announces that the resolution stood negated in the House. Ruckus erupts over this in the Rajya Sabha. <\/p>","date":"2018-08-10 04:20:08","status":"1"},{"title":"Tiruchi Siva (DMK) brings a private member's resolution on the plight of widows in India","content":"<p>Tiruchi Siva says even if he is from Tamil Nadu, he wants to talk about the condition of Vrindavan's widows as they are also his sisters. He says I am a widower but do not have any marks indicating so. On the contrary, a woman has to remove her kumkum and in some places shave her head to let the world know she is a widow. Widows in India alone are being stigmatised; says his mother was 29 and he was three when his father died. He recalls how his mother was discriminated then and how it continues to this day. <\/p>","date":"2018-08-10 04:35:15","status":"1"},{"title":"","content":"<p>Tiruchi Siva quotes Periyar to say women and men are the same: If an upper caste person tries to suppress a lower caste, I will be for the lower caste; if the lower caste tries suppressing labourers at his factory, I will be with the labourers; if the labourer beats his wife, I will be with the woman.<img src=\"http:\/\/cms.newindianexpress.com\/FCKeditor\/fckeditor_img\/tiruchi siva.JPG\" width=\"600\" height=\"400\" align=\"middle\" alt=\"\" \/><\/p>","date":"2018-08-10 04:37:03","status":"1"},{"title":"Tiruchi Siva praises Periyar, Annadurai, Karunanidhi for following the ideals of the Dravidian movement","content":"<p>Tiruchi Siva says widows in Periyar's time were entitled to get remarried and job reservation was there for men who married widows. Also talks about how self respect marriages were legalised in Tamil Nadu; says former CM Annadurai first conducted a widow remarriage upon taking power.<\/p>","date":"2018-08-10 04:43:56","status":"1"},{"title":"In India, to be a widow was a curse: Tiruchi Siva","content":"<p>Tiruchi Siva says a person could live without food but not without dignity. According to the Census of 2011, the population of widows in India is 4,32,61,278 which accounts for 7.37 percent of the female population in India, which is the largest population of widows in the entire world, he says.<\/p>","date":"2018-08-10 04:46:40","status":"1"},{"title":"","content":"<p><img src=\"http:\/\/cms.newindianexpress.com\/FCKeditor\/fckeditor_img\/sonal.JPG\" width=\"500\" height=\"262\" align=\"middle\" alt=\"\" \/><\/p>\n<p>Renowned dancer and newly elected member of Rajya Sabha Sonal Mansingh appreciates Tiruchi Siva's resolution on the plight of widows; repeats CPI leader D Raja's statement who had quoted Periyar: Men are born from women.<\/p>","date":"2018-08-10 04:50:05","status":"1"},{"title":"","content":"<p><img src=\"http:\/\/cms.newindianexpress.com\/FCKeditor\/fckeditor_img\/lok sabha.JPG\" width=\"600\" height=\"321\" align=\"middle\" alt=\"\" \/> <\/p>\n<p>Dr Amee Yagnik (Congress) says India has over 40 million widows and most of them lack social security cover; though legal protections are available, the widows don't have support to knock court doors.<\/p>","date":"2018-08-10 05:05:55","status":"1"},{"title":"Union Minister of State for Law and Justice PP Choudhary lays the Insolvency and Bankruptcy Code (Second Amendment) Bill, 2018. ","content":"<p>The Bill amends the Insolvency and Bankruptcy Code, 2016 to clarify that home buyers under a real estate project should be treated as financial creditors.<\/p>","date":"2018-08-10 05:07:42","status":"1"},{"title":"Jairam Ramesh questions high proportion of active cases under the Insolvency and Bankruptcy Code","content":"<p>Congress'Jairam Ramesh speaks:  \"I rise to support the bill which is converting the ordinance into a Bill. I have five very specific questions. Some of these questions the officiating finance minister might have to answer. In the last 2 years, there are 700 cases under this IBC. Out of 700 cases, over 500 cases are active. The court says within 270 the process must be completed. My first question is: isn't this a high proportion of case?\"<\/p>","date":"2018-08-10 05:34:25","status":"1"},{"title":"","content":"<p>Jairam Ramesh points out that the bid value is lower than the liquidation value in some cases and this shouldn't be accepted.<\/p>","date":"2018-08-10 05:34:52","status":"1"},{"title":"Jairam Ramesh questions government's move against RBI over circular on stressed assets","content":"<p>\"The circular said that even if you default by one day, the asset becomes a stressed asset. I welcome this, but I am amazed that the Government of India has challenged the RBI in the Allahabad High Court. The finance minister has given a statement in court which actually dilutes the circular. I would like the officiating finance minister to clarify on this.\"<img src=\"http:\/\/cms.newindianexpress.com\/FCKeditor\/fckeditor_img\/jairam ramesh.JPG\" width=\"450\" height=\"300\" align=\"middle\" alt=\"\" \/><\/p>","date":"2018-08-10 05:37:59","status":"1"},{"title":"","content":"<p>Congress MP Anand Sharma interrupts; asks if officiating finance minister was an actual designation. Chairman Venkaiah Naidu responded by saying that the term was being used by Jairam Ramesh and Piyush Goyal is in fact a Cabinet minister.<\/p>","date":"2018-08-10 05:39:54","status":"1"},{"title":"CPI's D Raja says Insolvency and Bankruptcy Code being amended to help corporate houses","content":"<p>CPI's D Raja: \"I am of the view that this bill is to help the corporate houses. So many changes are being made to help the defaulters. What should be the priority of the government? The government wants to bail out defaulters. Why this soft corner for defaulters? The government should bail out poor people from poverty. This is not fair.\"<\/p>","date":"2018-08-10 06:09:50","status":"0"},{"title":"JD(U)'s Kahkashan Perween speaks","content":"<blockquote class=\"twitter-tweet\" data-lang=\"en\">\n<p lang=\"en\" dir=\"ltr\">Smt. Kahkashan Perween's remarks | The Insolvency and Bankruptcy Code (Second Amendment) Bill, 2018: <a href=\"https:\/\/t.co\/ey75zllfUm\">https:\/\/t.co\/ey75zllfUm<\/a> via<\/p>\n— Rajya Sabha TV (@rajyasabhatv) <a href=\"https:\/\/twitter.com\/rajyasabhatv\/status\/1027893518256156674?ref_src=twsrc%5Etfw\">August 10, 2018<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2018-08-10 06:10:24","status":"1"},{"title":"CPI's D Raja says Insolvency and Bankruptcy Code being amended to help corporate houses","content":"<p>CPI's D Raja: \"I am of the view that this bill is to help the corporate houses. So many changes are being made to help the defaulters. What should be the priority of the government? The government wants to bail out defaulters. Why this soft corner for defaulters? The government should bail out poor people from poverty. This is not fair.\"<img src=\"http:\/\/cms.newindianexpress.com\/FCKeditor\/fckeditor_img\/d raja.JPG\" width=\"700\" height=\"491\" align=\"middle\" alt=\"\" \/><\/p>","date":"2018-08-10 06:12:39","status":"1"},{"title":"Finance Minister Piyush Goyal speaks","content":"<p> <img src=\"http:\/\/cms.newindianexpress.com\/FCKeditor\/fckeditor_img\/Piyush Goyal.jpg\" width=\"600\" height=\"350\" align=\"middle\" alt=\"\" \/><\/p>","date":"2018-08-10 06:16:36","status":"1"},{"title":"","content":"<p> Voting begins on the clasues in the amendments to the IBC Bill.<\/p>","date":"2018-08-10 06:17:18","status":"1"},{"title":"","content":"<p><strong>The Insolvency and Bankruptcy Code (Second Amendment) Bill, 2018 is passed.<\/strong><\/p>","date":"2018-08-10 06:19:41","status":"1"},{"title":"","content":"<p>The Upper House hears arguments on the Commercial Courts, Commercial Division and Commercial Division of High Courts (Amendment) Bill, 2018.<\/p>","date":"2018-08-10 06:36:57","status":"1"},{"title":"","content":"<p>The Commercial Courts, Commercial Division and Commercial Appellate Division of High Courts (Amendment) Bill, 2018 amends The Commercial Courts Act, 2015, which provides for commercial courts and commercial divisions of high courts to adjudicate commercial disputes to adjudicate commercial disputes with a value of at least one crore rupees.  The Bill reduces this limit to three lakh rupees.<\/p>","date":"2018-08-10 06:37:46","status":"1"},{"title":"","content":"<p>Law Minister Ravi Shankar Prasad rakes up the Triple Talaq Bill issue and lashes out at the Congress for its non-passage.<\/p>","date":"2018-08-10 06:46:30","status":"1"},{"title":"","content":"<p> <strong> the Commercial Courts, Division & Appellate Division of High Courts (Amendment) Bill, 2018 is passed. <\/strong> <\/p>","date":"2018-08-10 06:52:10","status":"1"},{"title":"","content":"<p><img src=\"http:\/\/cms.newindianexpress.com\/FCKeditor\/fckeditor_img\/naidu 2.JPG\" width=\"600\" height=\"323\" align=\"middle\" alt=\"\" \/> <\/p>\n\nRS Chairman Venkaiah Naidu in his valedictory address adds a little humour: \"I'm glad all of you who have been telling me that I should not get so emotional (referring to House disruptions) are so concerned about my health. I ask you to be concerned not for my health but for the health of our democracy. I will take disruptions seriously, even if they are strategies to stall proceedings, because legislature is a matter of serious business.\"","date":"2018-08-10 06:58:15","status":"1"},{"title":"","content":"<p>Venkaiah Naidu says 14 Bills were passed in this session as opposed to 10 Bills in the last session, says he is still 'not happy' with performance. Says he is happy the House managed to have 17 sittings, despite the prediction of a washout by the media. \"The media forecast for this session was that this session too would be a washout. I am glad that media has been proved wrong.\"<\/p>","date":"2018-08-10 07:01:12","status":"1"},{"title":"","content":"<p><strong>Rajya Sabha adjourned sine die.<\/strong><\/p>","date":"2018-08-10 07:14:37","status":"1"}]}