{"details":[{"title":"It's pouring in Pampa","content":"<P>The rain has become intense. But it is being said that the police and Manju might brave the rain and head towards the shrine anytime now. Manju has said that she has come as a devotee wanting a darshan of Lord Ayyappa, not as an activist.","date":"2018-10-20 03:29:47","pin":"0","status":"0"},{"title":"Dalit activist Manju to make Sabarimala attempt on rainy afternoon","content":"<p>Manju will be the fifth lady to make an attempt since the Supreme Court ruled that women of all ages must be allowed into the hill shrine. The previous four - New York Times journalist Suhasini Raj, Mojo TV's Kokila Jakkal, activist Rehana Fatima and 46-year-old Mary Sweety had all been made to return. Devaswom Minister Kadakampally Surendran said he will react to the latest attempt only after finding out details.<\/p>","date":"2018-10-20 03:34:27","pin":"0","status":"1"},{"title":"It's pouring in Pampa","content":"The rain has become intense. But it is being said that the police and Manju might brave the rain and head towards the shrine anytime now. Manju has said that she has come as a devotee wanting a darshan of Lord Ayyappa, not as an activist.","date":"2018-10-20 03:44:42","pin":"0","status":"1"},{"title":"Manju's attempt on a day when Rajinikanth said temple traditions should be honoured","content":"Manju's wish to head to the shrine comes on a day when actor Rajinikanth stated that 'every temple has its time-honoured rituals, besides traditions being followed for a long time. My humble opinion is that no one should interfere in that.' ","date":"2018-10-20 03:50:16","pin":"0","status":"1"},{"title":"Heavy rush despite the rain at Sabarimala","content":"There are quite a number of people queuing up to enter Sabarimala despite the rain, according to the reporters on the ground. The indications are that police will be escorting Manju to the shrine, though the deliberations on the how and when are still on, according to reports.","date":"2018-10-20 03:57:14","pin":"0","status":"1"},{"title":"Will 100 cops be enough? ","content":"<p>The rain is less intense now. But the decision on how to escort Manju to the shrine and when is yet to be made, say reporters. The big question before the police is whether 100 cops will be enough. There are more devotees on Saturday than on Day 3 and this has led to deliberations on whether more cops will be needed, according to those on the ground.<\/p>","date":"2018-10-20 04:16:27","pin":"0","status":"1"},{"title":"Watch: 52-year-old woman blocked on her way to the shrine on Saturday morning","content":"<p><iframe width=\"100%\" height=\"450\" src=\"https:\/\/www.youtube.com\/embed\/Td2eSizOHOY\" frameborder=\"0\" allow=\"autoplay; encrypted-media\" allowfullscreen=\"\"><\/iframe><br \/>\nEarlier in the day, 52-year-old Latha from TN was stopped on her way to the shrine after devotees suspected that she was younger than 50. Latha had to furnish proofs before she was finally allowed to go in for a darshan.<\/p>","date":"2018-10-20 04:30:21","pin":"0","status":"1"},{"title":"Sabarimala stand-off hitting my business, says hotelier","content":"<p>Salim, who is running a hotel at Sannidhanam, has been worried the last three days. He had invested Rs 1.71 crore in the recent tender to get the rights of operating his hotel for the next one year.\n\n<p>After earning over Rs 1 lakh a day in the last year, he is now struggling to find money to meet the day-to-day expenses of the hotel. This includes the salary of his employees. \n\n<p>All of this happened due to the drop in the number of devotees making their way to the Sannidhanam after the Supreme Court's verdict to allow the entry of women of all ages to Sabarimala.\n\n<p>\"We are really worried about this season. The controversial order has stopped people from entering the hill shrine. If we could have earned over Rs 1 lakh in a day in the last year we are now getting nearly Rs 30000 per day (now). The Supreme court's order has made the devotees to step back. They are really scared of visiting Sabarimala. The agitation that took place at Nilakkal has stopped people from coming here,\" Salim told <i>Express<\/i>.","date":"2018-10-20 04:39:49","pin":"0","status":"1"},{"title":"Heavy rain at Sabarimala again","content":"<p>Our reporter at Sabarimala Anil Kumar T reports that the rain has intensified again.<\/p>","date":"2018-10-20 04:48:24","pin":"0","status":"1"},{"title":"Manju denied special security as she has been named in 12 cases?","content":"<p>It is emerging that Manju (38) who wished to go to Sabarimala has been denied the security cordon for now since she has criminal cases pending against her, according to initial reports.<\/p>\n<p>There are as many as 14 cases pending against her and the status and nature of these cases need to be confirmed is what the intelligence department is now insisting on, these reports are saying.<\/p>","date":"2018-10-20 04:55:50","pin":"0","status":"1"},{"title":"Told Manju that we can't escort her because of the heavy rain today, says IG Sreejith","content":"<p>IG Sreejith addresses the media and tells that the decision to not escort Manju was made because of the heavy rain. Both Pamba and Sannidhanam are being lashed by heavy rain and it is going to be difficult to provide her the required security cover, he says. \n\n<p>Meanwhile, it has been confirmed that Manju has decided to head back home.<\/b>:<br><iframe width=\"100%\" height=\"450\" src=\"https:\/\/www.youtube.com\/embed\/VoRSn87m7b0\" frameborder=\"0\" allow=\"autoplay; encrypted-media\" allowfullscreen><\/iframe>","date":"2018-10-20 05:12:23","pin":"0","status":"1"}]}