{"details":[{"title":"A brief history of the controversial and discriminatory practice of Triple Talaq","content":"After the Supreme Court's historic verdict the BJP ' government had brought in an ordinance in September which banned the practice of 'Talaq-e-Biddat' or instant triple talaq and made it a penal offence. As per law, an ordinance is valid only for six months from its promulgation.","date":"2018-12-27 10:58:21","pin":"0","status":"1"},{"title":"The Muslim Women (Protection of Rights on Marriage) Bill, 2018","content":"<p>Later the Muslim Women (Protection of Rights on Marriage) Bill, 2018, was introduced in the parliament and was passed by the Rajya Sabha. According to the bill, 'Tala-e-Biddat' is illegal and is an offence punishable with imprisonment up to three years and fine, and triable by a Judicial Magistrate of the first class. The bill also makes the practice a cognizable offence which means police will have power to arrest without any warrant if it comes to the notice of in-charge of a police station.<\/p>","date":"2018-12-27 11:00:42","pin":"0","status":"1"},{"title":"Parliamentarians gear up for the session.","content":"<p> BJP president Amit Shah and Union Law minister Ravi Shankar Prasad arrives at Parliament house in New Delhi on Thursday<\/p>\n<p><img src=\"http:\/\/cms.newindianexpress.com\/FCKeditor\/fckeditor_img\/image\/12272018\/Amit%20SHah.jpeg\" width=\"450\" height=\"298\" alt=\"\" \/>  <img src=\"\/FCKeditor\/fckeditor_img\/image\/12272018\/Ravi%20Shankar%20Prasad.jpeg\" width=\"200\" height=\"111\" alt=\"\" \/><\/p>","date":"2018-12-27 11:15:24","pin":"0","status":"1"},{"title":"Lok Sabha adjourned","content":"<p>The lower house of the Parliament was adjourned after the opposition again created ruckus. Congress leader Mallikarjun Kharge said religious matters should not be interfered with.<\/p><\/p><blockquote class=\"twitter-tweet\" data-lang=\"en\"><p lang=\"en\" dir=\"ltr\">Mallikarjun Kharge, Congress on discussion on <a href=\"https:\/\/twitter.com\/hashtag\/TripleTalaqbill?src=hash&ref_src=twsrc%5Etfw\">#TripleTalaqbill<\/a> in Lok Sabha today: We will take part in the discussion and keep forward our opinion. We will appeal to the govt that it should not interfere in a religious matter. <a href=\"https:\/\/t.co\/ThQ4U5fxz5\">pic.twitter.com\/ThQ4U5fxz5<\/a><\/p>— ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1078156633035935744?ref_src=twsrc%5Etfw\">December 27, 2018<\/a><\/blockquote>\n<script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2018-12-27 11:18:34","pin":"0","status":"1"},{"title":"Opposition ruckus again stall parliament","content":"<p>The quesiton hour in progress was stalled by the opposition as MPs were asking questions to Union Civil Aviation Minister Jayant Sinha. But Mallikarjun Kharge continued to ask for JPC prob in Rafale and accused the Government of looting the public money.","date":"2018-12-27 11:23:40","pin":"0","status":"1"},{"title":"BJP leaders criticize Congress","content":"<p> GVL Narsimha Rao says that the Triple Talaq bill will bring justice to all the Muslim women. <\/p>","date":"2018-12-27 11:26:01","pin":"0","status":"1"},{"title":"Rajya Sabha adjounrned for the day","content":"Rajya Sabha started with the laying of various committee reports but was adjourned after the opposition created a ruckus over the Cauvery and other issue","date":"2018-12-27 11:53:30","pin":"0","status":"1"},{"title":"Lok Sabha resumes","content":"Opposition continues to creates ruckus","date":"2018-12-27 12:14:58","pin":"0","status":"1"},{"title":"Various Members continue to ask questions amid continuous sloganeering","content":"Speaker Sumitra Mahajan is continuously appealing the members of opposition to cooperate and let the house function.","date":"2018-12-27 12:28:40","pin":"0","status":"1"},{"title":"Shriranga Barne of Shiv Sena speaks for leprosy patients","content":"Leprosy is increasing in India. Without fingers Aadhar Card cannot be made. Without Aadhar the leprosy patients are deprived of basic amenities. He requests government to look into the matter.","date":"2018-12-27 12:29:30","pin":"0","status":"1"},{"title":"Shashi Tharoor asks for special package for Kerala fishermen","content":"<p>Kerala MP Shashi Tharoor asksfor a special package of 7000 crore for Kerala Fishermen who helped many civilians and even lost there lives during Okhi cyclone.<\/p>\n<p><img src=\"http:\/\/cms.newindianexpress.com\/FCKeditor\/fckeditor_img\/image\/12272018\/Shashi%20Tharoor.JPG\" width=\"300\" height=\"214\" alt=\"\" \/><\/p>","date":"2018-12-27 12:33:27","pin":"0","status":"1"},{"title":"Lok Sabha stands adjourned till 2 pm","content":"<p>Lok Sabha was adjourned till two in the afternoon after continuous disruption and sloganeering by the opposition.<\/p>","date":"2018-12-27 12:36:29","pin":"0","status":"1"},{"title":"Lok Sabha resumes","content":"<p>Lok Sabha resumes amid opposition ruckus <\/p>","date":"2018-12-27 02:03:47","pin":"0","status":"1"},{"title":"Congress says send the Triple Talaq bill to JSC","content":"Senior Congress leader Kharge requests the bill to be sent to Joint Select Committee. ","date":"2018-12-27 02:06:09","pin":"0","status":"1"},{"title":"Congress says send the Triple Talaq bill to JSC","content":"<p>Senior Congress leader Kharge requests the bill to be sent to Joint Select Committee.<\/p>\n<p><img src=\"http:\/\/cms.newindianexpress.com\/FCKeditor\/fckeditor_img\/image\/12272018\/Mallikarjun.JPG\" width=\"300\" height=\"173\" alt=\"\" \/><\/p>","date":"2018-12-27 02:09:27","pin":"0","status":"1"},{"title":"Opposition united on sending the bill to JSC","content":"<p> Oppsition parties support the Congress' demand. Asaduddin Owaisi says let the bill be referred to the Joint Select Committee.<img src=\"http:\/\/cms.newindianexpress.com\/FCKeditor\/fckeditor_img\/image\/12272018\/Asaduddin.JPG\" width=\"300\" height=\"201\" alt=\"\" \/><\/p>","date":"2018-12-27 02:12:03","pin":"0","status":"1"},{"title":"Government  wants discussion","content":"<p>Government insists on disscussion on the bill but the opposition wants it to send to JSC<\/p>","date":"2018-12-27 02:17:35","pin":"0","status":"1"},{"title":"Ravi Shankar Prasad moves the Muslim Women (Protection of Rights on Marriage) Bill","content":"<p>Union Law minster has moved the bill in the Lok Sabha. Opposition raises Sabarimala issue.<\/p>","date":"2018-12-27 02:20:19","pin":"0","status":"1"},{"title":"Disscussion on the Triple Talaq bill begins","content":"<p> The discussion in the bill has been started. <\/p>","date":"2018-12-27 02:22:53","pin":"0","status":"1"},{"title":"Kerala MP opposes the bill","content":"<p>Kerala MP N K Premchandran opposes the bill. Says it is the bill of the minority and the move is politically motivated.<\/p>\n<p><img src=\"http:\/\/cms.newindianexpress.com\/FCKeditor\/fckeditor_img\/image\/12272018\/N%20K%20Prem.JPG\" width=\"450\" height=\"374\" alt=\"\" \/><\/p>","date":"2018-12-27 02:26:51","pin":"0","status":"1"},{"title":"Triple Talaq bill discussion ","content":"<p> Opposition continues to raise slogans. N K Premchandran supports that the bill to be sent to Joint Select Committee. He is further also opposing the provision where the marriage is not dissolved. <\/p>","date":"2018-12-27 02:31:15","pin":"0","status":"1"},{"title":"NK Premchandran cites the bill as unconstitutional","content":"<p>NK Premchandran cites clauses 3, 5, 6 of the bill are contradictory and says that the the bill is unconstitutional<\/p>","date":"2018-12-27 02:38:16","pin":"0","status":"1"},{"title":"Sushmita Dev Congress MP from Assam speaks in Lok Sabha","content":"<p>\"No where in the 300 page judgemment it is said that triple talaq be made an criminal offence. Shaira Bano has suffered from domestic violence for 15 years and she feared to go back to her husband. But the govenment's bill does not address Shiara Bano's case. The bill is nothing but a criminal case.\"<\/p>\n<p><img src=\"http:\/\/cms.newindianexpress.com\/FCKeditor\/fckeditor_img\/image\/12272018\/Sushmitas%20Dev.JPG\" width=\"450\" height=\"358\" alt=\"\" \/><\/p>","date":"2018-12-27 02:44:16","pin":"0","status":"1"},{"title":"","content":"<p><a href=\"http:\/\/images.newindianexpress.com\/uploads\/user\/resources\/pdf\/2018\/12\/27\/Parlaiment_sesssion_Triple_Talaq_bill,_2018.pdf\">Triple Talaq Bill<\/a><\/p>","date":"2018-12-27 02:45:25","pin":"0","status":"1"},{"title":"Assam MP Sushmita Dev finishes her speech","content":"\"In Islam a marraige is a contract. Today when a contract is broken it is a civil offence. The bill says it is a criminal offence.\" She quotes variopus marriages acts and cites that a women has to file for divorce. \"This law is not about Muslim women but about sending the Muslim men in jail.\"","date":"2018-12-27 02:49:59","pin":"0","status":"1"},{"title":"Triple Talaq Bill, 2018: As introduced in Lok Sabha","content":"<div data-oembed-url=\"http:\/\/images.newindianexpress.com\/uploads\/user\/resources\/pdf\/2018\/12\/27\/Parlaiment_sesssion_Triple_Talaq_bill,_2018.pdf\">\n<div style=\"max-width:320px;margin:auto;\"><!-- You're using demo endpoint of Iframely API commercially. Max-width is limited to 320px. Please get your own API key at https:\/\/iframely.com. -->\n<div style=\"left: 0; width: 100%; height: 0; position: relative; padding-bottom: 141.4227%;\"><iframe allow=\"autoplay; encrypted-media\" allowfullscreen=\"\" src=\"https:\/\/docs.google.com\/viewer?embedded=true&url=http%3A%2F%2Fimages.newindianexpress.com%2Fuploads%2Fuser%2Fresources%2Fpdf%2F2018%2F12%2F27%2FParlaiment_sesssion_Triple_Talaq_bill%2C_2018.pdf\" style=\"border: 0; top: 0; left: 0; width: 100%; height: 100%; position: absolute;\"><\/iframe><\/div>\n<\/div>\n<\/div>","date":"2018-12-27 02:50:29","pin":"0","status":"1"},{"title":"BJP MP Meenakshi Lekhi says the bill supports gender equality","content":"<p>Meenakshi Lekhi asks Sushmita Dev and opposition to read the Quran and tell the parliament where Talaq-e-Biddat is mentioned in it?. Says the Sabarimala issue is very different from the Triple Talaq issue.<\/p>\n<p> <\/p>\n<p><img src=\"http:\/\/cms.newindianexpress.com\/FCKeditor\/fckeditor_img\/image\/12272018\/Meenakshi.JPG\" width=\"450\" height=\"357\" alt=\"\" \/><\/p>","date":"2018-12-27 02:56:33","pin":"0","status":"1"},{"title":"Meenakshi Lekhi takes jibe at Congress","content":"<p>\"Hum shadi chalane ki baat karte hai .\" (We always talk of preserving the marriage). <\/p>","date":"2018-12-27 02:58:48","pin":"0","status":"1"},{"title":"Meenakshi Lekhi cites Quran in the parliament","content":"Triple Talaq is not accepted in Islam but only in some sects of Muslims.","date":"2018-12-27 03:03:18","pin":"0","status":"1"},{"title":"AIADMK wants amendments to the bill","content":"AIADMK opposes the bill in the present form. The party asks the government why is the husband severely punished in the law. \"This is against the human rights, barbaric and unjust to Muslim men.\" says AIADMK MP A Anwhar Raajhaa ","date":"2018-12-27 03:20:12","pin":"0","status":"1"},{"title":"AIADMK asks is Triple Talaq reason for backwardness of the Muslims","content":"<p>AIADMK MP A Anwhar Raajhaa: Triple Talaq has never been a reason for the backwardness of the Muslims as there hasn't been any survey to prove it otherwise.<\/p>\n<p><img src=\"http:\/\/cms.newindianexpress.com\/FCKeditor\/fckeditor_img\/A Rajhaa.JPG\" width=\"450\" height=\"340\" alt=\"\" \/><\/p>","date":"2018-12-27 03:26:26","pin":"0","status":"1"},{"title":"AIADMK says that the bill is undemocratic","content":"<p> AIADMK asks that the bill be sent to parliamentary committee.<\/p>","date":"2018-12-27 03:27:43","pin":"0","status":"1"},{"title":"Sudip Bandopadhyay of Trinamul Congress speaks","content":"<p>\"I think one part of the bill which says that the Talaq-e-Biddat be made illegal. But we strongly oppose the imprisonment of husbands. A husband cannot send any money if he is in jail. We are totally against the criminalisation.\"<\/p>\n<p><img src=\"http:\/\/cms.newindianexpress.com\/FCKeditor\/fckeditor_img\/image\/12272018\/sudip.JPG\" width=\"450\" height=\"354\" alt=\"\" \/><\/p>","date":"2018-12-27 03:42:32","pin":"0","status":"1"},{"title":"BJP MP and Minority Affairs Minister Mukhtar Abbas Naqvi speaks","content":"<p>\"I met some of the Muslim parent who has six daughters one of whom is married. He told me that if she comes back to him, he won't be able to sustain his and her livlihood.\" <\/p>\n<p><img src=\"http:\/\/cms.newindianexpress.com\/FCKeditor\/fckeditor_img\/Muqtar Abbas Naqvi.JPG\" width=\"450\" height=\"286\" alt=\"\" \/><\/p>","date":"2018-12-27 03:47:45","pin":"0","status":"1"},{"title":"BJP says Triple Talaq is gender issue and a religious issue","content":"Naqvi says, \"Practices like sati and child marriages were also against the religion. But the house was united against such socially backward practices. Immediately after the independence Pakistan banned Talaq-e-Biddat. Ulema and AIMPLB is also very positive on this issue. As far as the punishment is concerned if it is illegal then there has to be punishment. And the law is not for victimisation but for justice of Muslim women.\"","date":"2018-12-27 03:58:28","pin":"0","status":"1"},{"title":"Congress questions government","content":"<p>Senior Congress leader Mallikarjun Kharge asks government does the provision of imprisonment also lies in Hindu marriage acts?<\/p>","date":"2018-12-27 04:01:21","pin":"0","status":"1"},{"title":"Country is governed by constitution and not Sharia","content":"Naqvi continues: \"Nowadays some people have opened shops of fatwas. Nation is not governed by Sharia but constitution and even Sharia also doesn't allow the practice of Triple Talaq.\" ","date":"2018-12-27 04:05:18","pin":"0","status":"1"},{"title":"BJD opposes Triple Talaq bill","content":"<p>BJD MP from Odisha, Rabindra Kumar Jena says, \"We are against the practice of Triple Talaq but oppose the punishment to the husband. If the bill is brought in present form it has full potential that it will backfire.\"<\/p>\n<p> <\/p>","date":"2018-12-27 04:18:49","pin":"0","status":"1"},{"title":"TDP MP Jaydev Galla oppose the bill in its current form","content":"<p>\"It is bizzare that Triple Talaq is been given to Muslim women via WhatsApp, Post Card, Telephones, WeChat and what not. Hence the practice of Talaq-e-Biddat is against women. But we want the government to answer that why the offence is made a  criminal offence. It may be a sin to divorce your wife but such a man belongs in jail especially when such provision is not for other religions.\"<\/p>\n<p><img src=\"http:\/\/cms.newindianexpress.com\/FCKeditor\/fckeditor_img\/Jaydev Galla.JPG\" width=\"450\" height=\"316\" alt=\"\" \/><\/p>","date":"2018-12-27 04:26:43","pin":"0","status":"1"},{"title":"Why does bill excludes J&K? Asks Jaydev Galla","content":"Jaydev says, \"We demand that the law be extended to the state of Jammu and Kashmir and the practice of Talaq-e-Biddat be banned as the state has majority of its population as Muslims.\"","date":"2018-12-27 04:28:51","pin":"0","status":"1"},{"title":"Shiv Sena asks what is the need of such bill?","content":"Shiv Sena MP Arvind Sawant says \"We need a Uniform Civil Code Bill not Triple Talaq bill. We also demand that the law be extended to J&K. But the article 370 stops you there. We demand that article 370 should also be removed.\"","date":"2018-12-27 04:36:41","pin":"0","status":"1"},{"title":"TRS opposes the bill in present form","content":"<p>TRS MP Jitendra Reddy says,\"We question the intent and timing of the bill. The government should refrain from interfering in anyone particular religion. This bill is a clear violation of article 14 of the Indian Constitution. It is not our but the duty judiciary that the religious law adhere to the constitution.\"<\/p>\n<p><img src=\"http:\/\/cms.newindianexpress.com\/FCKeditor\/fckeditor_img\/Jitendra Reddy.JPG\" width=\"450\" height=\"348\" alt=\"\" \/><\/p>","date":"2018-12-27 04:47:12","pin":"0","status":"1"},{"title":"CPI-M opposes the bill","content":"<p>Mohommad Salim says,\"We had only demand that a civil offence should not be criminalised. This bill is used as a political weapons. If you really want to help Muslim women help them with education and health care.\"<\/p>\n<p><img src=\"http:\/\/cms.newindianexpress.com\/FCKeditor\/fckeditor_img\/image\/12272018\/Mohammad%20Salim%20CPI.JPG\" width=\"450\" height=\"319\" alt=\"\" \/><\/p>","date":"2018-12-27 04:54:16","pin":"0","status":"1"},{"title":"Union Textile Minister Smriti Irani speaks ","content":"<p>\"Islamic jursprudence also says that Talaq-e-Biddat is a criminal offence.\" <\/p>\n<p><img src=\"http:\/\/cms.newindianexpress.com\/FCKeditor\/fckeditor_img\/Smriti Irani.JPG\" width=\"450\" height=\"381\" alt=\"\" \/><\/p>","date":"2018-12-27 04:58:00","pin":"0","status":"1"},{"title":"Union Textile Minister Smriti Irani speaks ","content":"<p>\"Islamic jursprudence also says that Talaq-e-Biddat is a criminal offence.\" <\/p>\n<p><img src=\"http:\/\/cms.newindianexpress.com\/FCKeditor\/fckeditor_img\/Smriti Irani.JPG\" width=\"450\" height=\"381\" alt=\"\" \/><\/p>","date":"2018-12-27 04:58:00","pin":"0","status":"0"},{"title":"Why the ordinance route? Asks NCP MP Supriya Sule","content":"<p>Supriya says, \"Nobody is against the social change but we are against the bill be politicised. Instead of putting husband in jail we should work to empower women. This bill is not about you and me but it is about a women at the bottom. It should have been brought through consensus and not via ordinance. Please rethink on this bill as  elections will come and go but social change takes time.\"<\/p>\n<p><img src=\"http:\/\/cms.newindianexpress.com\/FCKeditor\/fckeditor_img\/Supriya Sule(1).jpg\" width=\"450\" height=\"318\" alt=\"\" \/><\/p>","date":"2018-12-27 05:07:13","pin":"0","status":"1"},{"title":"Samajwadi Party condemns practice of Triple Talaq but oppose bill","content":"<p>SP MP Rajendra Pradhan accuses the government of communalism citing Bulandshahr mob lynching, says we oppose bill as the supreme court verdict only said that the practice of Talaq-e-Biddat is illegal it didn't made it criminal. <\/p>\n<p><img src=\"http:\/\/cms.newindianexpress.com\/FCKeditor\/fckeditor_img\/image\/12272018\/Dharemendra%20Pradhan.JPG\" width=\"450\" height=\"303\" alt=\"\" \/><\/p>","date":"2018-12-27 05:24:51","pin":"0","status":"1"},{"title":"BJP's NDA ally Shiromani Akali Dal supports bill","content":"<p>SAD MP Prem Singh Chnadumajra says, \"We need such a bill. Many members said that Triple Talaq is a wrong practice but said that it should not be mad e criminal practice. This is not done. A perpetrator has to be punished.\"<\/p>","date":"2018-12-27 05:38:07","pin":"0","status":"1"},{"title":"AAP opposes bill in current form","content":"<p>AAP MP from Punjabm, Dharm Veer Gandhi says \"We want this bill to be passed but the three points opposition parties are making should be addressed. Firstly the criminal povision should be removed. Secondly the time for reconcialiation should be given and thidly the woman should get equal remuneration.\"<\/p>\n<p><img src=\"http:\/\/cms.newindianexpress.com\/FCKeditor\/fckeditor_img\/dharamveer.JPG\" width=\"450\" height=\"317\" alt=\"\" \/><\/p>","date":"2018-12-27 05:53:53","pin":"0","status":"1"},{"title":"Asaduddin Owaisi takes a jibe at M J Akbar, opposes the bill","content":"<p>In Hindu marriage act a person gets 1 year of jail then why three years of  jail for a Muslim man. Yes marriage is a contract oin Islam. But then there is also provision for remuneration. When sexual minorites has a right then why not religious minority. Where is that Minister who was named in the MeToo. Such persons should be thrown out.\"<\/p>\n<p> <\/p>\n<p><img src=\"http:\/\/cms.newindianexpress.com\/FCKeditor\/fckeditor_img\/image\/12272018\/Asaduddin.JPG\" width=\"450\" height=\"302\" alt=\"\" \/><\/p>","date":"2018-12-27 06:10:55","pin":"0","status":"1"},{"title":"Law Minister Ravi Shankar Prasad responds to opposition queries ","content":"<p>\"We do not understand the logic that it is wrong but culprit should not be punished. We also do not understand the reason for sending this bill to Joint Selective Committee.\" The Union Law Minister cites laws against dowry and domestic violence in response to the questions raised against making Triple Talaq a non cognizable offence.\"We are not targeting anyone. The 1986 act which is being cited has provisions which has only limited remuneration for the wife.\" Ravi Shankar Prasad cites SC judgement, says the verdict itself says that what is wrong in theology cannot be valid law. <img src=\"http:\/\/cms.newindianexpress.com\/FCKeditor\/fckeditor_img\/Ravi Shankar Prasad.jpeg\" width=\"450\" height=\"279\" alt=\"\" \/><\/p>","date":"2018-12-27 06:13:18","pin":"0","status":"1"},{"title":"Ravi Shankar Prasad is explaining the legal complexities in the Parliament","content":"Prasad says, \"We have said that only the victim woman's complaint will be considered. We have given more right to magistrate and urged them to apply their wisdom here.\"","date":"2018-12-27 06:17:40","pin":"0","status":"1"},{"title":"India is a secular nation and we should regulate Triple Talaq.","content":"\"If 20 Islamic states can regulate Triple Talaq then why can't it be done in India? Based on our law even Pakistan is also thinking on making Triple Talaq an offence.\"","date":"2018-12-27 06:21:25","pin":"0","status":"1"},{"title":"Congress  and opposition parties stage walkout over demand of sending the bill to Joint Select Committee","content":"Mallikarjun Kharge: This bill will divide the society. It is also against article 14 and 15. It is also article 21 which is right to life. Hence this bill is unconstitutional. Hence we are demanding that the bill be sent to JSC. If it is not happening then we are walking out.","date":"2018-12-27 06:36:31","pin":"0","status":"1"},{"title":"Triple Talaq bill is being taken up for voting","content":"MPs are made aware of the voting procedure. ","date":"2018-12-27 06:41:54","pin":"0","status":"1"},{"title":"","content":"<p><strong>Lok Sabha has considered Triple Talaq motion with 238 ayes.<\/strong><\/p>","date":"2018-12-27 06:43:04","pin":"0","status":"1"},{"title":"Voting on Asaduddin Owaisi's amendments","content":"<p>Asaduddin Owaisi has asked for division<\/p>","date":"2018-12-27 06:47:06","pin":"0","status":"1"},{"title":"","content":"<p><strong>Owaisi's amendments are rejected in the parliament<\/strong><\/p>","date":"2018-12-27 06:50:01","pin":"0","status":"1"},{"title":"","content":"<p><strong>Lok Sabha clears the Muslim Women (Protection of Rights on Marriage) Bill, 2018 with 245 Ayes<\/strong><\/p>","date":"2018-12-27 07:08:48","pin":"0","status":"1"},{"title":"","content":"<p><strong> House stands adjourned till 11 AM Friday.<\/strong><\/p>","date":"2018-12-27 07:09:39","pin":"0","status":"1"}]}