{"details":[{"title":"Siddaramaiah extends support to Mamata Banerjee","content":"<p>\"I support it, Mamata Banerjee did the right thing. She'll face court later but nobody should misuse ED, IT or any agency.Narendra Modi is creating anarchy. Can anybody raid your house?They have rights to work as per law.They didn't have any order or warrant,\" said former Karnatala Chief Minsiter Siddaramaiah.<\/p>","date":"2019-02-05 10:44:34","pin":"0","status":"1"},{"title":"Supreme Court proceedings underway","content":"<p>CBI files affidavit in the Supreme Court alleging there are several incriminating material\/correspondence that was collected during the investigation by the CBI against the senior police officials as well as senior politicians. (ANI)<\/p>","date":"2019-02-05 10:45:40","pin":"0","status":"1"},{"title":"Electronic evidences were handed over to WB police investigating officer: CBI","content":"<p>CBI affidavit says investigation was being done by SIT&crucial evidence such as laptops, mobile phones etc were handed over to the main accused in Saradha scam case by the investigating officer of WB police working under direct supervision of Police Commissioner Rajeev Kumar.<\/p>","date":"2019-02-05 10:47:17","pin":"0","status":"1"},{"title":"Chandrababu Naidu to visit Mamata in Bengal today","content":"<p><img src=\"http:\/\/cms.newindianexpress.com\/FCKeditor\/fckeditor_img\/Chandrababu_Naidu_PTI1.jpg\" width=\"600\" height=\"300\" alt=\"\" \/> <\/p>\n<p> Andhra Pradesh Chief Minister N Chandrababu Naidu will be going to West Bengal today to meet WB CM Mamata Banerjee.<\/p>","date":"2019-02-05 10:50:22","pin":"0","status":"1"},{"title":"Calcutta HC postpones hearing of Rajeev Kumar's plea","content":"<p>Yesterday Kolkata Police Commissioner Rajeev Kumar had filed petition in Kolkata HC seeking interim relief. Today court postponed the case as the matter between WB Police & CBI is sub-judice in SC. Next hearing on Thursday, 7 February.<\/p>","date":"2019-02-05 10:53:25","pin":"0","status":"1"},{"title":"KK Venugopal pleads before SC to initiate contempt of court","content":"<p>Attorney General KK Venugopal pleads before the Supreme Court to initiate contempt of court proceedings against the alleged contemnors.<\/p>","date":"2019-02-05 10:54:21","pin":"0","status":"1"},{"title":"Rajeev Kumar must join CBI probe, rules CJI Ranjan Gogoi","content":"<p>Rajeev Kumar must co-operate and join CBI probe.  We will deal with contempt petition later, observed CJI.<\/p>","date":"2019-02-05 10:58:51","pin":"0","status":"1"},{"title":"Rajeev Kumar will appear before the Central Bureau of Investigation (CBI) in Shillong","content":"<p><img src=\"http:\/\/cms.newindianexpress.com\/FCKeditor\/fckeditor_img\/Rejeev_Kumar.jpg\" width=\"600\" height=\"390\" alt=\"\" \/> <\/p>\n<p>The Police Commissioner of Kolkata Rajeev Kumar will appear before the Central Bureau of Investigation (CBI) in Shillong, Meghalaya as a neutral place.<\/p>","date":"2019-02-05 11:11:11","pin":"0","status":"1"},{"title":"SC issues notice to Rajeev Kumar, DGP,  Mamata govt on contempt plea","content":"<p>The Apex Court issues notice to Commissioner Of Police Kolkata, DGP and West Bengal govt on contempt plea. The Court has also scheduled the next hearing on February 20.<\/p>","date":"2019-02-05 11:14:18","pin":"0","status":"1"},{"title":"'We're so obliged'","content":"<p>West Bengal CM Mamata Banerjee on SC order that no coercive steps would be taken against Rajeev Kumar: It’s a moral victory. We have great respect for judiciary&all institutions. We are so grateful. We're so obliged. (ANI)<\/p>","date":"2019-02-05 11:18:15","pin":"0","status":"1"},{"title":"","content":"<p>Rajeev Kumar never said he will not be available. He said we want to meet at mutual place, if you want to ask for any clarification, you can come and we can sit: Mamata Banerjee on SC order<\/p>","date":"2019-02-05 11:27:11","pin":"0","status":"1"},{"title":"'CBI was on a secret op'","content":"<p>But what they started doing? They wanted to arrest him. They went to his house, on a secret operation, on Sunday, without any notice. That court said ‘no arrest’. We are so obliged. It will strengthen the morale of the officers. <\/p>","date":"2019-02-05 11:42:46","pin":"0","status":"1"},{"title":"We're fighting against Government's attempt to discredit autonomous bodies: Kharge","content":"<blockquote class=\"twitter-tweet\" data-lang=\"en\">\n<p lang=\"en\" dir=\"ltr\">Mallikarjun Kharge, Congress: The govt is settling scores with opposition after interfering in autonomous bodies. We are fighting against those elements. It is not about an individual, an officer or a party, we are fighting against govt's attempt to discredit autonomous bodies. <a href=\"https:\/\/t.co\/h177v5o3fm\">pic.twitter.com\/h177v5o3fm<\/a><\/p>\n— ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1092664836960501760?ref_src=twsrc%5Etfw\">February 5, 2019<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2019-02-05 11:43:33","pin":"0","status":"1"},{"title":"'I don't go alone'","content":"<p>Let me talk to my leaders, I don’t go alone. Today Chandrababu Naidu is also coming, I will consult other leaders also. I will also consult Naveen Patnaik Ji, then I will let you know: Mamata on continuing her dharna<\/p>","date":"2019-02-05 12:03:06","pin":"0","status":"1"},{"title":"","content":"<blockquote class=\"twitter-tweet\" data-lang=\"en\">\n<p lang=\"en\" dir=\"ltr\">Union Min RS Prasad: This order was given by SC to investigate the conspiracy angle & also money laundering angle. This investigation must be done in a fair manner. Let's not politicise it. This is a great moral victory for CBI. <a href=\"https:\/\/t.co\/ddzBmQGCEv\">https:\/\/t.co\/ddzBmQGCEv<\/a><\/p>\n— ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1092668641609502720?ref_src=twsrc%5Etfw\">February 5, 2019<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2019-02-05 12:03:51","pin":"0","status":"1"},{"title":" ","content":"<p>The BJP and its president Amit Shah, are most corrupt in India, Andhra Pradesh Chief Minister N Chandrababu Naidu alleged on Monday. <strong><a href=\"http:\/\/www.newindianexpress.com\/nation\/2019\/feb\/05\/bjp-amit-shah-most-corrupt-in-india-says-andhra-pradesh-cm-chandrababu-naidu-1934606.html\" target=\"_blank\">READ FULL REPORT <\/a><\/strong><\/p>","date":"2019-02-05 12:25:12","pin":"0","status":"1"},{"title":"","content":"<p>Ask Yogi to take care of Uttar Pradesh first. So many people have been killed, even police were murdered, so many people were lynched. He himself will lose if he contests elections. He doesn’t have a place to stand in UP that’s why he's roaming around in Bengal: Mamata Banerjee <\/p>","date":"2019-02-05 12:54:05","pin":"0","status":"1"},{"title":"","content":"<p><iframe src=\"https:\/\/www.facebook.com\/plugins\/post.php?href=https%3A%2F%2Fwww.facebook.com%2Fnotes%2Farun-jaitley%2Fthe-kleptocrats-club%2F956950797826802%2F&width=500\" width=\"500\" height=\"444\" style=\"border:none;overflow:hidden\" scrolling=\"no\" frameborder=\"0\" allowtransparency=\"true\" allow=\"encrypted-media\"><\/iframe><\/p>","date":"2019-02-05 01:13:55","pin":"0","status":"1"},{"title":"'I have not denied any permission for Yogi Adityanath's rally'","content":"<p>“I have not denied any permission. Amit Shah was unwell, even then came and addressed rallies, then why are they claiming that we are not letting them hold rallies,\" said TMC supremo Mamata Banerjee<\/p>","date":"2019-02-05 03:03:01","pin":"0","status":"1"},{"title":"WATCH| Mamata slams Yogi Adityanath, asks him to look after UP first","content":"<blockquote class=\"twitter-tweet\" data-lang=\"en\">\n<p lang=\"en\" dir=\"ltr\"><a href=\"https:\/\/twitter.com\/hashtag\/WATCH?src=hash&ref_src=twsrc%5Etfw\">#WATCH<\/a> WB CM Mamata Banerjee:Ask Yogi to take care of Uttar Pradesh first. So many ppl have been killed,even police were murdered,so many ppl were lynched,he himself will lose if he contests elections.He doesn’t have a place to stand in UP that’s why he's roaming around in Bengal <a href=\"https:\/\/t.co\/ijtBwTHdvX\">pic.twitter.com\/ijtBwTHdvX<\/a><\/p>\n— ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1092680344250150912?ref_src=twsrc%5Etfw\">February 5, 2019<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2019-02-05 03:12:40","pin":"0","status":"1"},{"title":"","content":"<p>Uttar Pradesh Chief Minister Yogi Adityanath is going to Ranchi in Jharkhand by flight. He will then proceed to Bokaro in a chopper from where he is likely to take road route to Purulia in West Bengal, an aide of the chief minister told PTI. The BJP had on Monday said Adityanath's proposed rally in Bankura district scheduled for Tuesday was cancelled as the Trinamool Congress (TMC) government was \"dilly-dallying\" on giving permission for the landing of his helicopter. <\/p>\n<p><a href=\"http:\/\/www.newindianexpress.com\/nation\/2019\/feb\/05\/yogi-adityanath-to-travel-to-bengal-by-road-from-jharkhand-to-address-purulia-rally-1934671.html\" target=\"_blank\"><strong>READ FULL STORY<\/strong><\/a><\/p>","date":"2019-02-05 03:41:15","pin":"0","status":"1"},{"title":"Not in touch with TMC since a year: Naveen Patnaik","content":"<p>No one from TMC has been in contact with us for at least a year. Our party <strong><a href=\"http:\/\/www.newindianexpress.com\/states\/odisha\/2019\/feb\/04\/bjd-yet-to-support-mamata-but-says-centre-using-agencies-to-silence-political-opponents-1934206.html\" target=\"_blank\">statement yesterday<\/a><\/strong> had to do with events in our state. We would like CBI to do a professional and non-political job: Odisha CM Naveen Patnaik when asked if there has been any communication with WB CM over CBI matter. <\/p>","date":"2019-02-05 03:45:02","pin":"0","status":"1"},{"title":"Smriti Irani slams Mamata Banerjee","content":"There exists a state of lawlessness in WB, the anarchist CM intervened in the process of collection of evidence by officers, upon whose instructions officers were heckled, manhandled and detained, their families harassed, their homes surrounded,\" said Union Minister Smriti Irani","date":"2019-02-05 04:09:35","pin":"0","status":"1"},{"title":"Two BJP leaders whose names figure in the Saradha chit fund case","content":"<p><img src=\"http:\/\/cms.newindianexpress.com\/FCKeditor\/fckeditor_img\/mamata_vs_cbi_.jpg\" width=\"100%\" height=\"450\" alt=\"\" \/><a href=\"http:\/\/www.newindianexpress.com\/nation\/2019\/feb\/05\/is-bjp-trying-to-shield-mukul-roy-and-hemanta-biwa-sarma-1934639.html\" target=\"_blank\"><strong>READ HERE<\/strong><\/a>| Mukul Roy (once Mamata's go-to man) and Himanta Biswa Sarma (the Assam Deputy CM) were both among the accused and had been questioned in connection with chit fund scams.<\/p>","date":"2019-02-05 04:29:23","pin":"0","status":"1"},{"title":"Yogi lashes out at TMC","content":"<blockquote class=\"twitter-tweet\" data-lang=\"en\">\n<p lang=\"en\" dir=\"ltr\">UP CM Yogi Adityanath on his way to Purulia, WB from Bokaro, Jharkhand: This (West Bengal) government is embroiled in undemocratic and unconstitutional activities and that is the reason why a 'sanyasi' and 'yogi' like me is not being allowed to step on the soil of Bengal. <a href=\"https:\/\/t.co\/pgS64tqz2T\">pic.twitter.com\/pgS64tqz2T<\/a><\/p>\n— ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1092740294368346113?ref_src=twsrc%5Etfw\">February 5, 2019<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2019-02-05 04:39:09","pin":"0","status":"1"},{"title":"","content":"<blockquote class=\"twitter-tweet\" data-lang=\"en\">\n<p lang=\"in\" dir=\"ltr\">West Bengal: Andhra Pradesh CM and Telugu Desam Party (TDP) chief N Chandrababu Naidu arrives in Kolkata. <a href=\"https:\/\/t.co\/CofuHnaYXu\">pic.twitter.com\/CofuHnaYXu<\/a><\/p>\n— ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1092734869917044736?ref_src=twsrc%5Etfw\">February 5, 2019<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2019-02-05 04:40:11","pin":"0","status":"1"},{"title":"Didi holds helipcopter company responsible","content":"<blockquote class=\"twitter-tweet\" data-lang=\"en\">\n<p lang=\"en\" dir=\"ltr\">West Bengal CM Mamata Banerjee: I won't take names, we had got into an agreement with a helicopter company. We had done advance booking, agreement was signed on Jan 15. It is sad that they informed us on Feb 1 that they will not provide us the helicopters, they backed out. <a href=\"https:\/\/t.co\/ihhcbMcper\">pic.twitter.com\/ihhcbMcper<\/a><\/p>\n— ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1092735855142170624?ref_src=twsrc%5Etfw\">February 5, 2019<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2019-02-05 04:41:54","pin":"0","status":"1"},{"title":"Chandrababu meets Mamata on her dharna stage ","content":"<blockquote class=\"twitter-tweet\" data-lang=\"en\">\n<p lang=\"en\" dir=\"ltr\">Kolkata: Andhra Pradesh CM N Chandrababu Naidu meets West Bengal CM Mamata Banerjee at the stage where she has been sitting on 'Save the Constitution' dharna since February 3 over CBI issue. <a href=\"https:\/\/t.co\/JNZ6BpCuyJ\">pic.twitter.com\/JNZ6BpCuyJ<\/a><\/p>\n— ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1092745232930783232?ref_src=twsrc%5Etfw\">February 5, 2019<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2019-02-05 04:52:58","pin":"0","status":"1"},{"title":"Yogi calls Mamata's Dharna shameful","content":"<blockquote class=\"twitter-tweet\" data-lang=\"en\">\n<p lang=\"en\" dir=\"ltr\">Uttar Pradesh Chief Minister Yogi Adityanath in Purulia, West Bengal: Nothing can be more shameful for a democracy than a Chief Minister sitting on a dharna. <a href=\"https:\/\/t.co\/5HKFsKDbmx\">pic.twitter.com\/5HKFsKDbmx<\/a><\/p>\n— ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1092745360030629890?ref_src=twsrc%5Etfw\">February 5, 2019<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2019-02-05 04:53:40","pin":"0","status":"1"},{"title":"Take action against Kolkata Police Commissioner: Centre to Mamata government","content":"<p>In a communication on Tuesday, the Home Ministry said that as per information received by it, Kumar sat in a dharna along with some police officers with Chief Minister of West Bengal Mamata Banerjee which is prima facie in contravention of the extant provisions of the All India Services (Conduct) rules, 1968 and All India Services (Discipline and Appeal) Rules, 1969.<\/p>","date":"2019-02-05 05:03:42","pin":"0","status":"1"},{"title":"Adhir Ranjan Chowdhury calls top Rajeev Kumar CM's servant","content":"<p>There is no democracy in Bengal, it’s with the help of ruling govt that people were looted off in the Chit Fund Scam. This Police Commissioner is Mamata’s servant, he will do whatever she says: Congress MP Adhir Ranjan Chowdhury<\/p>","date":"2019-02-05 05:17:05","pin":"0","status":"1"},{"title":"TMC not in touch with us: Naveen Patnaik","content":"<p>Odisha Chief Minister and Biju Janata Dal (BJD) president Naveen Patnaik on Tuesday said the CBI should do non-political jobs and that nobody from the Trinamool Congress (TMC) had spoken to him on any issue, including the recent standoff between the central probe agency and the Kolkata Police.<\/p>","date":"2019-02-05 05:34:35","pin":"0","status":"1"},{"title":"West Bengal developments cause of concern for all: Akhilesh Yadav","content":"<p>Terming the developments in West Bengal a cause of concern for all citizens regardless of their political affiliation, Samajwadi Party chief Akhilesh Yadav Tuesday wrote an open letter to the people urging them \"protect and preserve\" constitutional values and the institutions charged with upholding them.<\/p>","date":"2019-02-05 05:43:07","pin":"0","status":"1"},{"title":"Here is all you need to know about Kolkata top cop Rajeev Kumar ","content":"<p>Kumar, the Kolkata police commissioner, known for his impeccable investigating and electronic surveillance skills, was once a blue-eyed boy of former West Bengal chief minister Buddhadeb Bhattacharya. <a href=\"http:\/\/www.newindianexpress.com\/nation\/2019\/feb\/05\/centre-vs-mamata-west-bengal-cm-turns-street-fighter-for-cop-she-once-refused-to-trust-1934718.html?page=preview\" target=\"_blank\"><strong>(Read More here)<\/strong><\/a><\/p>","date":"2019-02-05 05:50:48","pin":"0","status":"1"},{"title":"After three days Mamata Banerjee ends dharna","content":"<p> Chief Minister Mamata Banerjee ended her three-day long dharna on Tuesday. \"This dharna (Save the Constitution) is victory for the Constitution and democracy, so, let us end it today,\" she said.<\/p>","date":"2019-02-05 06:24:01","pin":"0","status":"1"}]}