{"details":[{"title":"Airports in India, Pakistan shut down ","content":"Several airports in India - Srinagar, Pathankot, Jammu,  Leh, Amritsar and Dehradun - and in Pakistan -  Lahore, Multan, Faisalabad, Sialkot and Islamabad - have been shut down after Wednesday's developments.","date":"2019-02-27 01:07:19","pin":"0","status":"1"},{"title":"Modi being briefed on situation","content":"Prime Minister Narendra Modi is being briefed on the fast developing situation. The Prime Minister had cut short an address at Vigyan Bhavan in New Delhi to review the security arrangements.","date":"2019-02-27 01:08:56","pin":"0","status":"1"},{"title":"Rajnath chairs meeting of top officials","content":"Union home minister Rajnath Singh is chairing a meeting at New Delhi's North Block with the National Security Advisor, RAW chief, Home Secretary and other top officials","date":"2019-02-27 01:12:39","pin":"0","status":"1"},{"title":"Army, BSF on high alert along border","content":"The Army and BSF have been put on high alert along the border in Jammu after strikes across the LoC by Pakistan. Authorities have ordered temporary closure of educational institutions in a 5-km radius along the Line of Control (LoC) in Rajouri and Poonch districts.","date":"2019-02-27 01:27:25","pin":"0","status":"1"},{"title":"Mi-17 chopper crashes in Budgam","content":"An Indian Mi-17 chopper has crashed in Budgam in Jammu & Kashmir. Three people have reportedly died in the crash. The cause of the crash has not been established","date":"2019-02-27 01:37:04","pin":"0","status":"1"},{"title":"Two IAF pilots arrested, says Pakistan","content":"The Pakistan Army spokesman said one of the pilots was injured and has been shifted to hospital, while the other one is safe.\n","date":"2019-02-27 01:42:17","pin":"0","status":"1"},{"title":"Pakistan releases video of 'Indian pilot' ","content":"\"I am Wing Commander Abhinandan, I am IAF officer. My service No is 27981,\" one pilot says in a video issued by the Pakistan army, reported PTI. However, the veracity of the video could not be ascertained.","date":"2019-02-27 01:47:06","pin":"0","status":"1"},{"title":"Entire airspace north of Delhi vacated","content":"The entire airspace north of Delhi has been vacated, says PTI, quoting official sources. This means no civilian flights will be allowed to operate here.\n\n","date":"2019-02-27 02:09:27","pin":"0","status":"1"},{"title":"Flight operations at Shimla aiport suspended","content":"<p>Himachal Pradesh: Flight operations temporarily suspended at Shimla, Bhuntar and Gagal airports<\/p>","date":"2019-02-27 02:25:01","pin":"0","status":"1"},{"title":"China asks India, Pakistan to exercise restraint","content":"<p>China’s Foreign Ministry has reiterated its call for India and Pakistan to exercise restraint, according to Reuters.<\/p>","date":"2019-02-27 02:29:21","pin":"0","status":"1"},{"title":"Air India to avoid Pakistan air space route","content":"<p>Air India will be avoiding route of Pakistan air space with immediate effect, an Air India official said. India use Pakistan airspace for flights to Gulf countries, Europe and USA.<\/p>","date":"2019-02-27 02:33:49","pin":"0","status":"1"},{"title":"IAF pilot Abhinandan has not returned yet","content":"IAF pilot Wing Commander Abhinandan took off in a MiG 21 Bison jet on Wednesday, he is yet to return, says ANI quoting sources. ","date":"2019-02-27 02:45:06","pin":"0","status":"1"},{"title":"Internet services suspended in PoK","content":"<p>Internet services have been suspended in Pakistan-occupied-Kashmir. Schools, colleges and offices shut in PoK<\/p>","date":"2019-02-27 02:48:52","pin":"0","status":"1"},{"title":"Pakistan closes airspace for all civilian flights","content":"Pakistan has closed its airspace for all civilian flights and suspended flight operations across its airports, including those in Islamabad, Lahore and Karachi, for an indefinite period in the wake of escalating tensions with India, reports PTI.","date":"2019-02-27 02:57:13","pin":"0","status":"1"},{"title":"Jaitley says India can do an Abbottabad","content":"Earlier today, Union Minister Arun Jaitley referred to the 2011 US operation in Pakistan to eliminate Osama bin Laden at his hideout in Abbottabad and suggested India can also do something similar. \"This used to be only an imagination, a wish. It is possible today,\" he said. ","date":"2019-02-27 03:00:32","pin":"0","status":"1"},{"title":"Nine airports reopened for civilian flights","content":"<p>Orders on the <strong><a href=\"http:\/\/www.newindianexpress.com\/nation\/2019\/feb\/27\/srinagar-jammu-and-leh-among-five-airports-closed-for-civilian-flights-officials-1944408.html\" target=\"_blank\">shutdown of nine airports<\/a><\/strong> in North India have been withdrawn, says the DGCA. Operations at all the airports have resumed as of now<\/p>","date":"2019-02-27 03:04:49","pin":"0","status":"1"},{"title":"Foreign Secretary to brief media","content":"Foreign Secretary Vijay Gokhale will brief the media at 3:15 pm\n","date":"2019-02-27 03:06:18","pin":"0","status":"0"},{"title":"NIA raids houses of separatist leaders in South Kashmir","content":"<p>NIA carries out searches at 11 locations in South Kashmir including houses of separatist leaders in connection with the Pulwama terror attack on CRPF convoy, killing over 40 jawans on February 14.<\/p>","date":"2019-02-27 03:15:03","pin":"0","status":"1"},{"title":"Indian Railways issues security alert across network","content":"Indian Railways has issued a security alert across its network in view of the escalating tensions with Pakistan, a senior official of the Railway Protection Force said on Wednesday, according to PTI. Security has been beefed up on board all trains operating in border areas and on railway premises. No trains to Jammu and Kashmir have been cancelled so far.","date":"2019-02-27 03:16:13","pin":"0","status":"1"},{"title":"","content":"<blockquote class=\"twitter-tweet\" data-lang=\"en\">\n<p lang=\"en\" dir=\"ltr\">MEA spokesperson and Air Vice Marshal RGK Kapoor address media in Delhi <a href=\"https:\/\/t.co\/0RGtbUu7VB\">pic.twitter.com\/0RGtbUu7VB<\/a><\/p>\n— ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1100694429730570241?ref_src=twsrc%5Etfw\">February 27, 2019<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2019-02-27 03:19:22","pin":"0","status":"1"},{"title":"","content":"<p>Aerial engagement resulted in the grounding of Pakistan aircraft by Indian MiGs which fell on the Pakistan side: MEA<\/p>","date":"2019-02-27 03:22:06","pin":"0","status":"0"},{"title":"One pilot is lost in action: MEA","content":"<p>One Pakistan Air Force fighter aircraft was shot down by Indian Air Force. In this engagement we have lost one MiG 21. Pilot is missing in action. Pakistan claims he is in their custody. We are ascertaining the facts.<\/p>","date":"2019-02-27 03:23:32","pin":"0","status":"0"},{"title":"One pilot is missing in action: MEA","content":"<p><ul><li>Pakistan used its Air Force to target military installations on the Indian side, but their attempts were foiled successfully due to our high state of readiness and alertness.<\/li>\n<li>One Pakistani F-16 was shot down by an Indian Air Force Mig-21 Bison.<\/li>\n<li>In this engagement, we have lost one MiG 21 and one pilot is missing in action. Pakistan claims he is in their custody. We are still ascertaining the facts.<\/li><\/ul><\/p>","date":"2019-02-27 03:27:16","pin":"0","status":"1"},{"title":"Read the detailed MEA press release ","content":"India had informed about Counter Terrorism (CT) action it took yesterday against a training camp of Jaish-e-Mohammed (JeM) in Pakistan based on credible evidence that JeM intended to launch more attacks. Against this Counter Terrorism Action, Pakistan has responded this morning by using its Air Force to target military installations on the Indian side. Due to our high state of readiness and alertness, Pakistan’s attempts were foiled successfully.\n\nThe Pakistan Air Force was detected and the Indian Air Force responded instantly. In that aerial engagement, one Pakistan Air Force fighter aircraft was shot down by a MiG 21 Bison of the Indian Air Force. The Pakistani aircraft was seen by ground forces falling from the sky on the Pakistan side. In this engagement, we have unfortunately lost one MiG 21. The pilot is missing in action. Pakistan has claimed that he is in their custody. We are ascertaining the facts.","date":"2019-02-27 03:33:07","pin":"0","status":"1"},{"title":"Nepal expresses concern about escalating tensions between India and Pakistan","content":"<p>The Government of Nepal is concerned about the escalating tensions between India and Pakistan following the terrorist attack on security convoy in Pulwama on February 14, 2019: Nepal Ministry of Foreign Affairs.<\/p>","date":"2019-02-27 04:00:08","pin":"0","status":"1"},{"title":"Let's settle this with talks: Imran Khan to India","content":"<p>\"If this (situation) escalates, it will no longer be in my control or in Narendra Modi's. All wars in world history have been miscalculated, those who started the wars did not know where it will end. So, I want to ask India, with the weapons you and we have, can we afford miscalculation, says Pakistan PM Imran Khan.<\/p>","date":"2019-02-27 04:10:12","pin":"0","status":"1"},{"title":"Let's settle this with talks: Imran Khan to India","content":"<p>\"If this (situation) escalates, it will no longer be in my control or in Narendra Modi's. All wars in world history have been miscalculated, those who started the wars did not know where it will end. So, I want to ask India, with the weapons you and we have, can we afford miscalculation,\" says Pakistan PM Imran Khan.<\/p>","date":"2019-02-27 04:10:13","pin":"0","status":"0"},{"title":"Missing IAF pilot is son of retired Air Marshal ","content":"The missing IAF pilot Wing Commander Abhinandan Varthaman is the son of retired Param Vishisht Seva Medal winner Air Marshal Simhakutty Varthaman, according to sources. In an ironic twist of fate,  Abhinandan's father worked as a consultant for the Mani Ratnam movie Kaatru Veliyidai where the pilot hero was captured by Pakistan. \n\n<br><br>DMK leader MK Stalin was among those who tweeted his support for Abhinandan and his family. \"My thoughts are with the family and friends of Wing Commander Abhinandan Varthaman. I urge the Government of India to do everything necessary to get him safely back home at the earliest,\" he wrote. \n","date":"2019-02-27 05:03:05","pin":"0","status":"1"},{"title":"","content":"<p>Pakistan Deputy High Commissioner Syed Haider Shah summoned by Ministry of External Affairs<\/p>","date":"2019-02-27 05:12:20","pin":"0","status":"1"},{"title":"14 Pakistan prisoners segregated","content":"<p>In Kolkata on Wednesday, 14 Pakistan prisoners were segregated from Indians  - a direct result of the escalation of the tensions between India and Pakistan on Wednesday, reports our correspondent there.<\/p>","date":"2019-02-27 06:14:30","pin":"0","status":"1"},{"title":"WATCH | Imran Khan talks peace","content":"<p><iframe width=\"100%\" height=\"450\" src=\"https:\/\/www.youtube.com\/embed\/ca6CO0aunJs\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\"><\/iframe><\/p>","date":"2019-02-27 06:16:21","pin":"0","status":"1"},{"title":"Modi holds key meeting","content":"<p>Prime Minister Narendra Modi is holding a key meeting with security and intelligence officials after Pakistan Air Force violated Indian airspace on Wednesday.<\/p>","date":"2019-02-27 06:20:52","pin":"0","status":"1"},{"title":"Not two, only one pilot in custody: Pakistan ","content":"Now Pakistan confirms it has only one IAF pilot in its custody. Earlier Pakistan military had claimed that it had taken two pilots into its custody.","date":"2019-02-27 06:33:43","pin":"0","status":"1"},{"title":"Mumbai on high alert amid escalating Indo-Pak tension","content":"State of high alert has been sounded across the city of Mumbai as the security situation aggravates across the country's north-west border. The security vigil across the city including major public domains like bus depots and railway stations has been stepped up while ensuring that the ongoing board examinations do not suffer in anyway.","date":"2019-02-27 06:37:59","pin":"0","status":"1"},{"title":"India issues demarche to Pak over act of aggression","content":"<p> <\/p>\n<ul>\n    <li>The Acting High Commissioner of Pakistan was summoned this afternoon by MEA to lodge a strong protest at the unprovoked act of aggression by Pakistan against India earlier today, including by violation of the Indian air space by Pakistan Air Force and  targeting of Indian military posts.<\/li>\n    <li>This is in contrast to the India’s non-military anti-terror pre-emptive strike at a JeM terrorist camp in Balakot on 26 February 2019. It is unfortunate that instead of fulfilling its international obligation and bilateral commitment to take credible action against terrorist entities and individuals operating from its soil, Pakistan has acted with aggression against India.<\/li>\n    <li>It was clearly conveyed that India reserves the right to take firm and decisive action to protect its national security, sovereignty and territorial integrity against any act of aggression or cross-border terrorism.<\/li>\n    <li>India also strongly objected to Pakistan’s vulgar display of an injured personnel of the Indian Air Force in violation of all norms of International Humanitarian Law and the Geneva Convention. It was made clear that Pakistan would be well advised to ensure that no harm comes to the Indian defence personnel in its custody.   India also expects his immediate and safe return.<\/li>\n    <li>Regret was expressed at continuing denial by Pakistan’s political and and military leadership at the presence of terrorist infrastructure in territories under its control. A dossier was handed over to Pakistan side with specific details of JeM complicity in Pulwama terror attack and the presence of JeM terror camps and its leadership in Pakistan. It was conveyed that India expects Pakistan to take immediate and verifiable action against terrorism emanating from  territories under its control.<\/li>\n<\/ul>\n<p> <\/p>","date":"2019-02-27 07:03:02","pin":"0","status":"1"},{"title":"India demands immediate return of Wing Commander Abhinandan","content":"<p>India tells Pakistan envoy to ensure that no harm is caused to its IAF pilot Abhinandan in latter's custody. Demands immediate and safe return of pilot. <\/p>","date":"2019-02-27 07:09:20","pin":"0","status":"1"},{"title":"Punjab Chief Minister reviews situation in border areas","content":"<p>Punjab Chief Minister Amarinder Singh met top officials of army, paramilitary and the police to review the current situation in border areas.<\/p>","date":"2019-02-27 07:10:53","pin":"0","status":"1"},{"title":"India objects to 'vulgar display' of injured IAF officer: MEA","content":"<p>India strongly objects to Pakistan's 'vulgar display' of an injured IAF officer in violation of all international norms: MEA<\/p>","date":"2019-02-27 07:36:04","pin":"0","status":"1"},{"title":"Who is IAF pilot Abhinandan? ","content":"All you need to know about Wing Commander Abhinandan, who is in Pakistan's custody now ","date":"2019-02-27 07:40:18","pin":"0","status":"0"},{"title":"Who is IAF pilot Abhinandan?","content":"<p> Wing Commander Abhinandan, son of a retired Air Marshal, who is in Pakistan's custody now is from Chennai. <a href=\"http:\/\/www.newindianexpress.com\/nation\/2019\/feb\/27\/wg-cdr-abhinandan-a-chennai-boy-son-of-highly-decorated-air-marshal-1944482.html\" target=\"_blank\"><strong>[CLICK HERE TO READ MORE]<\/strong><\/a><\/p>","date":"2019-02-27 07:44:31","pin":"1","status":"1"},{"title":"UK reacts on the standoff","content":"<p>\"We are working closely with international partners including through the UN Security Council to de-escalate tensions and are monitoring developments closely and considering implications for British nationals. UK is deeply concerned about rising tensions between India & Pakistan and urgently calls for restraint on both sides to avoid further escalation. We're in regular contact with both countries, urging dialogue and diplomatic solutions to ensure regional stability,\" said PM Theresa May.<\/p>","date":"2019-02-27 08:48:57","pin":"0","status":"1"},{"title":"PM's meeting with Service Chiefs ends","content":"Meeting of the three Service Chiefs with PM Narendra Modi at 7 Lok Kalyan Marg ends.","date":"2019-02-27 08:49:53","pin":"0","status":"1"},{"title":"Fresh firing from Pakistani side along LoC in Poonch Sector","content":"Ceasefire violation by Pakistan in Krishna Ghati and Mendhar sector of Poonch.","date":"2019-02-27 08:50:31","pin":"0","status":"1"},{"title":"Manmohan hopes saner counsel prevails","content":"I hope saner counsel will prevail between the leaderships of India and Pakistan, says former Prime Minister Manmohan Singh amid growing India-Pakistan tensions","date":"2019-02-27 09:03:25","pin":"0","status":"1"},{"title":"Railway Minister's latest statement on Samjhauta Express","content":"<blockquote class=\"twitter-tweet\" data-lang=\"en\">\n<p lang=\"en\" dir=\"ltr\">Railway Minister Piyush Goyal: We have not yet received any instructions from the authorities about any change to the current running of the Samjhauta Express, we will follow whatever directions are received in this regard. <a href=\"https:\/\/t.co\/kgbQtVwrbs\">pic.twitter.com\/kgbQtVwrbs<\/a><\/p>\n&mdash; ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1100778863330652160?ref_src=twsrc%5Etfw\">February 27, 2019<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2019-02-27 09:14:11","pin":"0","status":1},{"title":"Air Canada supends operations in India","content":"Due the closure of Pakistani airspace by its government, Air Canada has temporarily suspended service to India.","date":"2019-02-27 09:39:31","pin":"0","status":1},{"title":"Bring Wing Commander Abhinandan back: Former IAF officials","content":"India, having sent its message with Tuesday's air strike, should now refrain from any escalation and tread carefully keeping all diplomatic channels open as a Wing Commander of the Indian Air Force (IAF) was in Pakistan's custody, former IAF officers said on Wednesday.","date":"2019-02-27 09:40:21","pin":"0","status":1},{"title":"Schools near International Border to remain closed","content":"All government and private schools within a range of 0 to 5 Kms from International Border in J&K's Samba to remain closed tomorrow.","date":"2019-02-27 09:47:20","pin":"0","status":1},{"title":"Jaitley appeals Opposition to introspect their joint statement on border standoff","content":"<p>In a series of tweets late night, Jaitley questioned that when the whole nation has spoken in one voice, then why is &quot;India's opposition alleging that the government is politicising our Anti-Terror Operations.&quot;<\/p>","date":"2019-02-27 10:54:48","pin":"0","status":1},{"title":"Pakistan resorts to ceasefire violation for sixth consecutive day","content":"<p>On Wednesday, Pakistan troops resorted to heavy mortar shelling and small arms firing on forward posts and civilian areas along the LoC in Mendhar, Balakote and Krishnagati sub-sector in Poonch district since 7 pm, officials said.<\/p>","date":"2019-02-27 10:57:23","pin":"0","status":1},{"title":"Hope saner counsels shall prevail between leadership of India, Pakistan: Manmohan Singh","content":"<p>&quot;I do hope that saner counsels will prevail between the leadership of the two countries and we will get back to the economic development, which is the basic requirement of India and Pakistan,&quot; the former PM said.<\/p>","date":"2019-02-27 10:58:29","pin":"0","status":1},{"title":"I-T searches premises of head of prominent organistaion in Kashmir, Delhi in terror financing case","content":"<p>Without providing specific details, the department said it unearthed clinching evidence of &quot;huge unaccounted expenditure having been incurred in cash on the reconstruction and remodelling of the residential premises presently being used by the tax evader's family.&quot;<\/p>","date":"2019-02-27 10:59:58","pin":"0","status":1},{"title":"Airlines reroute flights as Pakistan closes its airspace","content":"<p>Various airlines such as Air India, Jet Airways, Qatar Airways and Singapore Airlines Wednesday announced they were rerouting their flights as Pakistan closed its airspace in the wake of escalating tensions with India.<\/p>","date":"2019-02-27 11:00:55","pin":"0","status":1},{"title":"India hands over dossier to Pakistan on Pulwama terror attack","content":"<p>The dossier was handed over to the Acting High Commissioner of Pakistan, who was summoned by the Ministry of External Affairs to lodge a strong protest over Pakistan Air Force targeting Indian military installations, a day after the Indian counter-terror action against the JeM.<\/p>","date":"2019-02-27 11:01:44","pin":"0","status":1},{"title":"Please Don't share videos of Wing Commander Abhinandan: Security officials","content":"<p>Five videos were shot by Pakistani army and released on WhatsApp, Twitter, Facebook and Instagram as part of a psychological operation against the country, the officials said. &quot;It is aimed to demoralise the forces and people,&quot; they said.<\/p>","date":"2019-02-27 11:05:00","pin":"0","status":1},{"title":"Panic in Rajasthan villages near border","content":"<p>People in two villages in this border area in Rajasthan saw cylindrical wreckage of metal objects falling from sky on Wednesday evening, with some claiming to have heard even explosions, leading to a panic situation in the wake of the ongoing confrontation between India and Pakistan, officials said.<\/p>","date":"2019-02-27 11:09:01","pin":"0","status":1},{"title":"Delhi-Lahore bus service continuing: DTC Official","content":"<p>&quot;The service is continuing. Even today, 10 persons boarded the Lahore-bound bus,&quot; Manoj Kumar, the managing director of the Delhi Transport Corporation (DTC), told PTI.<\/p>","date":"2019-02-27 11:47:42","pin":"0","status":1},{"title":"Four Indian passengers stranded at Lahore airport","content":"\"The PIA's PK-270 Lahore to Delhi was to leave for its destination on Wednesday but due to the suspension of flight operations the four Indian passengers are stranded at Allama Iqbal International Airport,\" an official of CAA told PTI.","date":"2019-02-27 11:48:11","pin":"0","status":1},{"title":"UK minister holds talks with Sushma Swaraj, Qureshi","content":"<p>Britain's foreign secretary Jeremy Hunt Wednesday held talks with External Affairs Minister Sushma Swaraj and her Pakistani counterpart Shah Mehmood Qureshi to prevent a further escalation of tensions between the two nuclear-armed neighbours following the Pulwama attack.<\/p>","date":"2019-02-27 11:49:19","pin":"0","status":1},{"title":"Air India caps fares to J&K at Rs 5,000; other waive off cancellation fees","content":"<p>Budget carrier Goair said it will allow rescheduling and cancellations for free up to March 15 to the defence personnel, and full-service airline Vistara said it will offer free cancellations with full refund for tickets booked to or from Amritsar, Jammu, Leh or Srinagar for travel up to Match 31.<\/p>","date":"2019-02-28 12:24:46","pin":"0","status":1},{"title":"Pakistan military top brass apprise lawmakers about the border standoff","content":"The briefing was arranged by the government at the Parliament House in order to take the opposition parties into confidence about the current security situation.","date":"2019-02-28 12:48:38","pin":"0","status":1},{"title":"US urge India, Pakistan to take steps to de-escalate tensions","content":"<p>&quot;The United States is deeply concerned about rising tensions between India and Pakistan and calls on both sides to take immediate steps to de-escalate the situation,&quot; said an official of the National Security Council (NSC) of the White House.<\/p>","date":"2019-02-28 12:49:54","pin":"0","status":1}]}