{"details":[{"title":"","content":"<p>\n\t<strong>Thousands stranded in Thailand after Pakistan closes airspace<\/strong>\n\t<ul>\n\t\t<li>Thousands of travellers were stranded in Bangkok on Thursday when Thai Airways cancelled all flights over Pakistan after Islamabad closed its airspace in response to soaring tensions with India.<\/li>\n\t\t<li>Nearly thirty flights -- the majority to and from European routes -- were initially affected, the airline said, with three aircraft forced to return to Bangkok's Suvarnabhumi airport and others cancelled or set to be re-routed.<\/li>\n\t\t<li>The travel disruption spun out across the region, with Singapore Airlines' usually direct flights to Europe forced to re-fuel on Wednesday, while a flight to Frankfurt was cancelled.<\/li>\n\t<\/ul>\n<\/p>\n<p>\n\t<strong>Pakistani airspace to remain closed till Thursday midnight<\/strong>\n\t<ul>\n\t\t<li>Pakistan's airspace for commercial flights will remain closed till Thursday midnight, the civil aviation authority announced as thousands of passengers have been stranded after flight operations were suspended across major airports in the country in the wake of the escalating tensions with India.<\/li>\n\t\t<li>The aviation authority on Wednesday had announced that Pakistani airspace had been shut due to the prevailing security situation.<\/li>\n\t<\/ul>\n<\/p>\n<p>\n\t<strong>BJP members call for more military action<\/strong>\n\t<ul>\n\t\t<li>Members of  BJP have called for more military action against Pakistan as tensions dramatically escalated this week between the two nuclear-armed neighbours.<\/li>\n\t\t<li>Modi is to address tens of thousands of workers and volunteers of Bharitiya Janata Party across the country on Thursday afternoon, rallying support ahead of elections this spring in an event being billed as the \"world's largest videoconference.\" Opposition parties slammed BJP's programme saying the time is not conducive to conduct such a programme.<\/li>\n\t<\/ul>\n<\/p>\n<p>\n\t<strong>Schools in Pakistan-controlled Kashmir closed<\/strong>\n\t<ul>\n\t\t<li>Authorities in Pakistani-controlled Kashmir have closed all schools and educational institutions in the region and are urging parents to keep their children at home amid mounting tension with neighbouring India.<\/li>\n\n\t<\/ul>\n<\/p>\n<p>\n\t<strong>Further military activity will escalate situation: <\/strong><strong>US<\/strong><strong> on India-Pakistan tensions<\/strong>\n\t<ul>\n\t\t<li>The US has asked Pakistan to abide by its UN Security Council commitments to deny terrorists safe haven and block their access to funds. This US statement came after India on Wednesday handed over to Pakistan a dossier on specific details”of involvement of the Jaish-e-Muhammed (JeM) in the Pulwama terror attack on Central Reserve Police Force (CRPF) as also the presence of camps of the UN-proscribed terror outfit in that country.<\/li>\n\t<\/ul>\n<\/p>\n\t\t\n<p>\n\t<strong>Pakistan suspends Samjhauta Express train service <\/strong>\n\t<ul>\n\t\t<li>Pakistani authorities have suspended the Samjhauta Express train service between Pakistan and India until further notice, a media report said Thursday, amidst tense bilateral ties in the aftermath of the Pulwama terror attack.<\/li>\n\t\t<li>The train departs on Monday and Thursday from Lahore.<\/li>\n\t\t<li>The Samjhauta Express train service between Pakistan and India has been suspended until further notice, DawnNewsTV reported on Thursday citing railway authorities. <a href=\"http:\/\/www.newindianexpress.com\/world\/2019\/feb\/28\/pakistan-suspends-samjhauta-express-train-service-1944832.html\" target=\"_blank\">(<strong>Read more<\/strong><\/a>)<\/li>\n\t<\/ul>\n<\/p>\n<p>\n\t<strong>Support<\/strong><strong> India's air strike on JeM terror camps in Pakistan: US Secretary to NSA Ajit Doval<\/strong>\n\t<ul>\n\t\t<li>National Security Advisor Ajit Doval and US Secretary of State Mike Pompeo had a telephonic conversation late on Wednesday night, where the latter asserted that the US supports India’s decision to take action against  Jaish-e-Mohammed terror camp on Pakistani soil,\" sources said. <\/li>\n\t\t<li>\"NSA Ajit Doval and US Secretary of State Mike Pompeo had a telephonic conversation late Wednesday night, Pompeo said that the US supported India’s decision to take action against JeM terror camp on Pakistani soil,\" sources told ANI. (<strong><a href=\"http:\/\/www.newindianexpress.com\/nation\/2019\/feb\/28\/support-indias-air-strike-on-jem-terror-camps-in-pakistan-us-secretary-to-nsa-ajit-doval-1944823.html\" target=\"_blank\">Read more<\/a><\/strong>)<\/li>\n\t\t<li><strong><a href=\"http:\/\/www.newindianexpress.com\/nation\/2019\/feb\/28\/here-is-all-you-need-to-know-about-the-ongoing-india-pakistan-crisis-1944839.html\" target=\"_blank\">Here is an explanation of the events so far, and the possible next steps <\/a><\/strong><\/li>\n\t<\/ul>\n\t\n<\/p>\n\n<p>\n\t<strong>US, UK, France ask UNSC to ban JeM chief Masood Azhar <\/strong>\n\t<ul>\n\t\t<li>US, UK and France have moved a fresh proposal in the UN Security Council to designate Pakistan-based terror group JeM chief Masood Azhar as a global terrorist. The proposal is the fourth such bid at the UN in the last 10 years to list Azhar as a global terrorist. (<strong><a href=\"http:\/\/www.newindianexpress.com\/world\/2019\/feb\/28\/us-uk-and-france-ask-un-security-council-to-ban-jem-chief-masood-azhar-in-fresh-proposal-1944819.html\" target=\"_blank\">Read More<\/a><\/strong>)<\/li>\n\t<\/ul>\n<\/p>","date":"2019-02-28 01:25:49","pin":"0","status":"1"},{"title":"Army, Navy, IAF to brief media together at 5 pm","content":"<p>All three division of India's armed forces will be giving a joint press briefing at 5 pm amidst heightened tension at the Indo-Pak border.<\/p>","date":"2019-02-28 01:28:54","pin":"0","status":"1"},{"title":"We have reasonably decent news from Pakistan and India, says US President Donald Trump","content":"<p>We have some reasonably decent news, hopefully it's going to be coming to an end, this has been going on for a long time, decades and decades, US President Trump said while addressing media.<\/p>","date":"2019-02-28 01:42:16","pin":"0","status":"1"},{"title":"Indian Air Force Pilot was ill treated by Pakistan Army in violation of Geneva convention: Defence Ministry Officials","content":"","date":"2019-02-28 01:45:14","pin":"0","status":"1"},{"title":"Pakistan willing to return Indian pilot if it means de-escalation","content":"<p>Pakistan Foreign Minister Shah Mehmood Qureshi on Thursday said Pakistan is willing to consider returning the Indian pilot if it means de-escalation, according to Pakistan's Geo News. (<a href=\"http:\/\/www.newindianexpress.com\/world\/2019\/feb\/28\/willing-to-consider-returning-iaf-pilot-if-it-leads-to-de-escalation-pakistan-foreign-minister-qu-1944885.html\" target=\"_blank\"><strong>READ MORE<\/strong><\/a>)<\/p>","date":"2019-02-28 02:31:44","pin":"0","status":"1"},{"title":"IAF pilot has to repatriated immediately, no question of any deal with Pakistan: Government sources","content":"<p>PTI quoting sources has said that India is waiting for immediate, credible and verifiable action against terrorists and their proxies.Sources also said that the  IAF pilot has to be repatriated unconditionally and immediately and there is no question of any deal.<\/p>","date":"2019-02-28 03:00:42","pin":"0","status":"1"},{"title":"India won't make any 'deal' with Pakistan on captured pilot Abhinandan","content":"<p style=\"text-align: justify;\">There is no question of any deal with Pakistan and India expects Wing Commander Abhinandan Vartaman to be returned immediately. If Pakistan thinks they have a got a card in form of the Indin pilot to negotiate with then they are mistaken. India expects the Wing Commander to be treated in a humane manner. (<strong><a href=\"http:\/\/www.newindianexpress.com\/nation\/2019\/feb\/28\/have-not-asked-for-consular-access-to-iaf-pilot-want-him-back-immediately-india-1944877.html\" target=\"_blank\">READ MORE<\/a><\/strong>)<\/p>","date":"2019-02-28 03:21:59","pin":"0","status":"1"},{"title":"Reasonably attractive news from Pakistan & India: Donald Trump","content":"<blockquote class=\"twitter-tweet\" data-lang=\"en\">\n<p dir=\"ltr\" lang=\"en\"><a href=\"https:\/\/twitter.com\/hashtag\/WATCH?src=hash&ref_src=twsrc%5Etfw\">#WATCH<\/a>: US President says, \"I think reasonably attractive news from Pakistan & India, they've been going at it & we have been involved and have them stop, we have some reasonably decent news,hopefully its going to be coming to an end, going on for a long time, decades & decades.\" <a href=\"https:\/\/t.co\/ivSLN3I5ZI\">pic.twitter.com\/ivSLN3I5ZI<\/a><\/p>\n— ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1101052122244833280?ref_src=twsrc%5Etfw\">February 28, 2019<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2019-02-28 03:31:42","pin":"0","status":"1"},{"title":"OIC is not the forum for talks with Sushma Swaraj: Pakistan Foreign Minister","content":"<p>On being asked if he is open to meeting Indian EAM Sushma Swaraj on sidelines of the Organisation of Islamic Cooperation(OIC) meet. Pakistan Foreign Minister SM Qureshi said he will not hesitate to meet but OIC is not the forum for talks with Swaraj.<\/p>","date":"2019-02-28 03:33:23","pin":"0","status":"1"},{"title":"Pakistan Foreign Minister: Is Narendra Modi ready for peace talks?","content":"<p>\"Prime Minister Imran Khan is ready to talk to Indian PM Narendra Modi over the telephone to offer him peace. Is Modi ready for it?\" asked Foreign Minister Shah Mahmood Qureshi<\/p>","date":"2019-02-28 03:38:38","pin":"0","status":"1"},{"title":"The India-Pakistan standoff: What we know","content":"<p>A string of violent escalations have pushed India and Pakistan to the brink of conflict, sparking global alarm and calls for restraint between the nuclear-armed neighbours. (<a href=\"http:\/\/www.newindianexpress.com\/nation\/2019\/feb\/28\/the-india-pakistan-crisis-what-we-know-1944831.html\" target=\"_blank\"><strong>READ MORE<\/strong><\/a>)<\/p>","date":"2019-02-28 03:42:38","pin":"0","status":"1"},{"title":"Saudi Foreign Minister to arrive in Pakistan today","content":"Saudi Foreign Minister Adel al Jubeir will be visiting Pakistan later in the day carrying an important message from the Saudi Crown Prince Muhammad Bin Salman: Pakistan Foreign Minister","date":"2019-02-28 03:46:59","pin":"0","status":"1"},{"title":"","content":"<blockquote class=\"twitter-tweet\" data-lang=\"en\">\n<p lang=\"en\" dir=\"ltr\">Delhi: Visuals from outside Ministry of External Affairs. Meeting of Foreign Secy with diplomats from 10 countries, including Germany, Dominican Republic, Nigeria, South Africa & Belgium, has concluded. The Foreign Secy briefed them on updates in situation b\/w India & Pakistan. <a href=\"https:\/\/t.co\/vGD1Z7hVpY\">pic.twitter.com\/vGD1Z7hVpY<\/a><\/p>\n— ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1101064264352178176?ref_src=twsrc%5Etfw\">February 28, 2019<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2019-02-28 04:04:25","pin":"0","status":"1"},{"title":"Pakistan makes spoof calls to Rajasthan seeking info on Indian Army","content":"<p>Residents of Rajasthan's Bikaner were receiving spoof calls from Pakistan seeking information about the Indian Army alongside the international border, amid escalating tensions between New Delhi and Islamabad. (<a href=\"http:\/\/www.newindianexpress.com\/nation\/2019\/feb\/28\/pakistan-makes-spoof-calls-to-rajasthans-bikaner-seeking-info-on-indian-army-1944894.html\" target=\"_blank\"><strong>ALSO READ<\/strong><\/a>)<\/p>","date":"2019-02-28 04:06:12","pin":"0","status":"1"},{"title":"Pakistan to evaluate India's dossier on Pulwama attack with 'open heart': Shah Mehmood Qureshi","content":"<p>Pakistan said it will evaluate with an open heart the dossier handed over by India on specific details of the involvement of the JeM in the Pulwama terror attack on CRPF and the presence of camps of the UN-proscribed terror outfit in the country. (<strong><a href=\"http:\/\/www.newindianexpress.com\/world\/2019\/feb\/28\/pakistan-to-evaluate-indias-dossier-on-pulwama-attack-with-open-heart-shah-mehmood-qureshi-1944898.html\" target=\"_blank\">ALSO READ<\/a><\/strong>)<\/p>","date":"2019-02-28 04:10:40","pin":"0","status":"1"},{"title":"Pakistan violates ceasefire second time in a day in Poonch","content":"<p>Pakistan violated ceasefire for the second time on Thursday and resorted to unprovoked firing and heavy shelling of mortars along the LoC in Krishna Ghati sector. (<a href=\"http:\/\/www.newindianexpress.com\/nation\/2019\/feb\/28\/pakistan-violates-ceasefire-second-time-in-a-day-in-poonch-1944899.html\" target=\"_blank\"><strong>ALSO READ<\/strong><\/a>)<\/p>","date":"2019-02-28 04:15:40","pin":"0","status":"1"},{"title":"Pakistan has been sponsoring a proxy war against India: Manish Tewari","content":"<blockquote class=\"twitter-tweet\" data-lang=\"en\">\n<p lang=\"en\" dir=\"ltr\">Manish Tewari, Congress: Pakistan has been sponsoring a proxy war against India since 1979-1980. First recipient of that cross border terror using semi state actors was Punjab. For 15 long years Punjab suffered because of the terror unleashed by  the ISI. <a href=\"https:\/\/t.co\/FxVbElcArW\">pic.twitter.com\/FxVbElcArW<\/a><\/p>\n— ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1101070128425316354?ref_src=twsrc%5Etfw\">February 28, 2019<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2019-02-28 04:18:04","pin":"0","status":"1"},{"title":"Japan condemns Pulwama terror attack, calls on India and Pakistan to hold dialogue amid rising tensions","content":"<p>Japan on Thursday expressed concerns about the deteriorating situation in Kashmir after the death of 40 security personnel in Pulwama and urged Pakistan to take stringent measures to curb the menace of terrorism. (<strong><a href=\"http:\/\/www.newindianexpress.com\/world\/2019\/feb\/28\/japan-condemns-pulwama-terror-attack-calls-on-india-and-pakistan-to-hold-dialogue-amid-rising-tensi-1944902.html\" target=\"_blank\">READ MORE<\/a><\/strong>)<\/p>","date":"2019-02-28 04:22:36","pin":"0","status":"1"},{"title":"Current atmosphere is not conducive: Manish Tewari","content":"<p>There is a time to act and a time to talk, dialogue can only take place when the atmosphere is conducive for it, current atmosphere is not conducive: Manish Tewari<\/p>","date":"2019-02-28 04:25:01","pin":"0","status":"1"},{"title":"","content":"<p>Pakistan's armed forces on high alert, ready for any eventuality: ISPR<\/p>","date":"2019-02-28 04:26:43","pin":"0","status":"1"},{"title":"","content":"<p>I had warned India against violating our sovereignty: Imran Khan<\/p>","date":"2019-02-28 04:30:02","pin":"0","status":"1"},{"title":"Offered dialogue to India but response not good: Pakistan PM Imran Khan","content":"<p>PM Imran Khan said Pakistan had offered dialogue to India but the response was \"not good\".<\/p>","date":"2019-02-28 04:32:22","pin":"0","status":"1"},{"title":"Closure of Pakistan air space slows down flights across Asia","content":"<p>A temporary closure of air space over Pakistan snarled air traffic Thursday, especially between Asia and Europe, though some airlines adjusted by rerouting their flights. (<strong><a href=\"http:\/\/www.newindianexpress.com\/business\/2019\/feb\/28\/india-pakistan-standoff-closure-of-pakistan-air-space-slows-down-flights-across-asia-1944904.html\" target=\"_blank\">ALSO READ<\/a><\/strong>)<\/p>","date":"2019-02-28 04:34:19","pin":"0","status":"1"},{"title":"Pakistan violates ceasefire","content":"<p>Pakistan violates ceasefire by shelling with mortars and firing of small arms in Sunderbani, Mankote, Khari Karmara and Degwar sectors today. Shelling and firing which started at 6 am paused, and resumed at 3 pm.<\/p>","date":"2019-02-28 04:34:47","pin":"0","status":"1"},{"title":"IT Ministry asks YouTube to remove video links of IAF pilot","content":"<p>The IT Ministry has asked YouTube to remove 11 video links pertaining to Wing Commander Abhinandan Varthaman, who was captured by Pakistan during air combat on Wednesday, according to sources. (<strong><a href=\"http:\/\/www.newindianexpress.com\/nation\/2019\/feb\/28\/it-ministry-asks-youtube-to-remove-video-links-of-iaf-pilot-1944905.html\" target=\"_blank\">READ MORE<\/a><\/strong>)<\/p>","date":"2019-02-28 04:36:55","pin":"0","status":"1"},{"title":"Pakistan targeted Indian Military Installation, violated Geneva Convention: Defence Ministry","content":"<p>India believes that the air intrusion by Pakistan on Wednesday was an attack on the military installation on the Indian side, while adding that Islamabad also violated the Geneva Convention by mistreating the captured Indian Air Force pilot, Defence Ministry officials said. (<strong><a href=\"http:\/\/www.newindianexpress.com\/nation\/2019\/feb\/28\/pakistan-targeted-indian-military-installation-violated-geneva-convention-defence-ministry-1944906.html\" target=\"_blank\">ALSO READ<\/a><\/strong>)<\/p>","date":"2019-02-28 04:38:12","pin":"0","status":"1"},{"title":"Pakistan targeted Indian Military Installation, violated Geneva Convention: Defence Ministry","content":"<p>India believes that the air intrusion by Pakistan on Wednesday was an attack on the military installation on the Indian side, while adding that Islamabad also violated the Geneva Convention by mistreating the captured Indian Air Force pilot, Defence Ministry officials said. (<strong><a href=\"http:\/\/www.newindianexpress.com\/nation\/2019\/feb\/28\/pakistan-targeted-indian-military-installation-violated-geneva-convention-defence-ministry-1944906.html\" target=\"_blank\">ALSO READ<\/a><\/strong>)<\/p>","date":"2019-02-28 04:38:13","pin":"0","status":"1"},{"title":"","content":"<p><strong>As a peace gesture we are releasing Wing Commander Abhinandan tomorrow: Pakistan PM Imran Khan<\/strong><\/p>","date":"2019-02-28 04:39:00","pin":"0","status":"1"},{"title":"","content":"<p>Pakistan PM Imran Khan says escalation is not in our interests nor in India's.<\/p>","date":"2019-02-28 04:53:26","pin":"0","status":"1"},{"title":"Pakistan to release IAF pilot Abhinandan tomorrow: Imran Khan","content":"<p>Pakistan Prime Minister Imran Khan told a joint session of Parliament that IAF's captured pilot Wing Commander Abhinandan Varthaman will be released on Friday as a gesture of peace. (<strong><a href=\"http:\/\/www.newindianexpress.com\/world\/2019\/feb\/28\/pakistan-to-release-iaf-pilot-tomorrow-pm-imran-khan-1944909.html\" target=\"_blank\">READ MORE<\/a><\/strong>)<\/p>","date":"2019-02-28 05:06:41","pin":"0","status":"1"},{"title":"Hope he returns home safe, says father of IAF pilot held by Pakistan","content":"<p>The father of Indian pilot Wing Commander Abhinandan Varthaman, captured by Pakistan after air combat, on Thursday said he was proud of his son's bravery and hoped for his safe return home, as he thanked citizens for their support and good wishes. (<strong><a href=\"http:\/\/www.newindianexpress.com\/nation\/2019\/feb\/28\/hope-he-returns-home-safe-father-of-iaf-pilot-held-by-pakistan-1944911.html\" target=\"_blank\">ALSO READ<\/a><\/strong>)<\/p>","date":"2019-02-28 05:15:43","pin":"0","status":"1"},{"title":"","content":"<p><strong>Joint press briefing by Army, Navy and Air Force in New Delhi that was scheduled for 5 pm today has been postponed to 7 pm.<\/strong><\/p>","date":"2019-02-28 05:17:40","pin":"0","status":"1"},{"title":"Pilot Abhinandan to be released says Pakistan shortly after proud father thanks Indians","content":"<p>Pakistan Prime Minister Imran Khan has announced in a joint session of his country's Parliament that captured IAF pilot Wing Commander Abhinandan Varthaman will be released Friday as a gesture of peace. (<strong><a href=\"http:\/\/www.newindianexpress.com\/nation\/2019\/feb\/28\/wing-commander-abhinandan-to-be-released-says-pakistan-shortly-after-proud-father-thanks-indians-1944916.html\" target=\"_blank\">ALSO READ<\/a><\/strong>)<\/p>","date":"2019-02-28 05:35:39","pin":"0","status":"1"},{"title":"","content":"<blockquote class=\"twitter-tweet\" data-lang=\"en\">\n<p lang=\"en\" dir=\"ltr\">Punjab Chief Minister Captain Amarinder Singh on Wing Commander <a href=\"https:\/\/twitter.com\/hashtag\/AbhinandanVarthaman?src=hash&ref_src=twsrc%5Etfw\">#AbhinandanVarthaman<\/a> to be released by Pakistan: I'm very happy, I had demanded his release earlier too. This is going to be a step towards goodwill and I hope this will be lasting. <a href=\"https:\/\/t.co\/s1wWOI5hZu\">pic.twitter.com\/s1wWOI5hZu<\/a><\/p>\n— ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1101088624039194624?ref_src=twsrc%5Etfw\">February 28, 2019<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2019-02-28 05:45:25","pin":"0","status":"1"},{"title":"","content":"<blockquote class=\"twitter-tweet\" data-lang=\"en\">\n<p lang=\"en\" dir=\"ltr\"><a href=\"https:\/\/twitter.com\/hashtag\/WATCH?src=hash&ref_src=twsrc%5Etfw\">#WATCH<\/a>: Robert Vadra reacts on the release of Wing Commander <a href=\"https:\/\/twitter.com\/hashtag\/AbhinandanVarthaman?src=hash&ref_src=twsrc%5Etfw\">#AbhinandanVarthaman<\/a> by Pakistan, says, \"It is the best news for his family and every citizen of India...\" <a href=\"https:\/\/t.co\/Q4ZNj4osWj\">pic.twitter.com\/Q4ZNj4osWj<\/a><\/p>\n— ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1101092527409692673?ref_src=twsrc%5Etfw\">February 28, 2019<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2019-02-28 05:45:39","pin":"0","status":"1"},{"title":"Indo-Pak standoff: US Secretary of State Pompeo speaks to Ajit Doval","content":"<p>US Secretary of State Mike Pompeo has talked to India's National Security Advisor Ajit Doval amidst tense ties between India and Pakistan in the aftermath of the Pulwama terror attack and New Delhi's air strike against JeM terror training camp in Balakot. (<strong><a href=\"http:\/\/www.newindianexpress.com\/nation\/2019\/feb\/28\/indo-pak-standoff-us-secretary-of-state-pompeo-speaks-to-ajit-doval-1944918.html\" target=\"_blank\">READ MORE<\/a><\/strong>)<\/p>","date":"2019-02-28 05:59:12","pin":"0","status":"1"},{"title":"Russia offers to help mediate between India and Pakistan","content":"Russia is ready to mediate between India and Pakistan to try to calm tensions between the two nuclear powers, Russian government officials said on Thursday, warning of the risk of further clashes between the two countries, says Reuters report.","date":"2019-02-28 06:01:41","pin":"0","status":"1"},{"title":"Mamata prays for safe return of captured IAF pilot Abhinandan ","content":"<blockquote class=\"twitter-tweet\" data-lang=\"en\">\n<p lang=\"en\" dir=\"ltr\">Along with his family members and all our countrymen, we are anxiously waiting for the safe return of our pilot <a href=\"https:\/\/twitter.com\/hashtag\/Abhinandhan?src=hash&ref_src=twsrc%5Etfw\">#Abhinandhan<\/a><\/p>\n— Mamata Banerjee (@MamataOfficial) <a href=\"https:\/\/twitter.com\/MamataOfficial\/status\/1101081347756417024?ref_src=twsrc%5Etfw\">February 28, 2019<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2019-02-28 06:06:43","pin":"0","status":"1"},{"title":"We want to open airspace at earliest: Pakistan","content":"<p>Pakistan wants its shut commercial aviation airspace to open fully at the earliest, Foreign Minister Shah Mehmood Qureshi said on Thursday. Several airlines, including Emirates, Air Canada and Qatar Airways, had earlier suspended flights to Pakistan. Etihad, Flydubai, Gulf Air, SriLankan Airlines and Air Canada also suspended services to the country. Singapore Airlines, British Airways and others were forced to reroute flights.<\/p>","date":"2019-02-28 06:22:13","pin":"0","status":"1"},{"title":"Greatly relieved by Imran Khan's announcement: Omar Abdullah","content":"<blockquote class=\"twitter-tweet\" data-lang=\"en-gb\">\n<p lang=\"en\" dir=\"ltr\">Very glad to know that <a href=\"https:\/\/twitter.com\/hashtag\/WingCommandarAbhinandan?src=hash&ref_src=twsrc%5Etfw\">#WingCommandarAbhinandan<\/a> will be heading home. I’ll wait for him to be back on Indian soil before I welcome him back but I’m greatly relieved that PM <a href=\"https:\/\/twitter.com\/ImranKhanPTI?ref_src=twsrc%5Etfw\">@ImranKhanPTI<\/a> has announced the imminent release of our pilot.<\/p>\n— Omar Abdullah (@OmarAbdullah) <a href=\"https:\/\/twitter.com\/OmarAbdullah\/status\/1101092091046871040?ref_src=twsrc%5Etfw\">28 February 2019<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2019-02-28 06:35:54","pin":"0","status":"1"},{"title":"After Pakistan, India also cancels Samjhauta Express ","content":"<p>Railways has decided to cancel operations of the Indo-Pak Samjhauta Express on its side due to drastic decline in occupancy, especially after the Pulwama terror attack, and the suspension of services from across the border, sources said. No date of resumption of services has been fixed so far, they said.<\/p>\n<p>(<a href=\"http:\/\/www.newindianexpress.com\/nation\/2019\/feb\/28\/lack-of-occupancy-after-pakistan-india-also-cancels-samjhauta-express-operations-1944926.html\" target=\"_blank\"> READ MORE<\/a>)<\/strong><\/p>","date":"2019-02-28 06:57:49","pin":"0","status":"1"},{"title":"Pak PM exhibited real statesmanship: Mehbooba Mufti ‏","content":"<blockquote class=\"twitter-tweet\" data-lang=\"en-gb\">\n<p lang=\"en\" dir=\"ltr\">Pak PM has exhibited real statesmanship today. It is time for our political leadership to step up & take measures to de escalate the current situation. People of J&K are living under unimaginable duress. How much longer will we suffer for?<\/p>\n— Mehbooba Mufti (@MehboobaMufti) <a href=\"https:\/\/twitter.com\/MehboobaMufti\/status\/1101092222345404417?ref_src=twsrc%5Etfw\">28 February 2019<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2019-02-28 07:03:42","pin":"0","status":"1"},{"title":"","content":"<p>The joint briefing by the Army, Navy and Air Force begins<\/p>","date":"2019-02-28 07:04:36","pin":"0","status":"1"},{"title":"WATCH | Pakistan tried to target military installations, we foiled them; F16 were used","content":"<blockquote class=\"twitter-tweet\" data-lang=\"en-gb\">\n<p lang=\"en\" dir=\"ltr\">LIVE Now: Joint <a href=\"https:\/\/twitter.com\/hashtag\/PressBriefing?src=hash&ref_src=twsrc%5Etfw\">#PressBriefing<\/a> <a href=\"https:\/\/t.co\/PguPoUpEpC\">https:\/\/t.co\/PguPoUpEpC<\/a><\/p>\n— PIB India (@PIB_India) <a href=\"https:\/\/twitter.com\/PIB_India\/status\/1101114034890276864?ref_src=twsrc%5Etfw\">28 February 2019<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2019-02-28 07:13:56","pin":"0","status":"1"},{"title":" There is enough evidence to show that F-16s were used by Pak: Air Vice Marshal RGK Kapoor","content":"<p>There is enough evidence to show that F-16s were used by Pakistan through their electronic signatures. Parts of AMRAAM - the air-to-air missile - that can only be carried on the Pakistani F-16s was recovered east of Rajouri (India), says Air Vice Marshal RGK Kapoor<\/p>","date":"2019-02-28 07:20:39","pin":"0","status":"1"},{"title":"India shows evidence of F-16 intrusion in its airspace","content":"<blockquote class=\"twitter-tweet\" data-lang=\"en\">\n<p lang=\"en\" dir=\"ltr\">Visuals of cover of AARAM missile fired from Pakistani F-16 aircraft found near the LoC in India <a href=\"https:\/\/t.co\/qHdOm5cDqN\">pic.twitter.com\/qHdOm5cDqN<\/a><\/p>\n— ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1101118888375451650?ref_src=twsrc%5Etfw\">February 28, 2019<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2019-02-28 07:32:30","pin":"0","status":"1"},{"title":"As long as Pakistan continues to harbour terrorists, we will continue to target the terror camps","content":"<p>Pakistan army responded to the IAF strike in Balakot through cease fire violations. This was responded by the Indian Army in a befitting manner. Pak efforts to target logistic installations and a battalion headquarters was foiled by the IAF. The Indian Army continued to maintain strict vigil along LOC and our ground base weapon systems are on high alert along the LoC. I wish to assure the nation that we are fully aware and ready to respond to any provocation by Pakistan, he said.<\/p>","date":"2019-02-28 07:37:40","pin":"0","status":"1"},{"title":"We are ready for any misadventure by Pakistan: Navy Rear Admiral DS Gujral","content":"<p>The Indian Navy is  deployed in state of readiness. We will detect, deter and defeat any misadventure by Pakistan. Swift and strong response in assured,Rear Admiral Gujral said.<\/p>","date":"2019-02-28 07:40:32","pin":"0","status":"1"},{"title":"PM Modi holds high-level security meeting","content":"<blockquote class=\"twitter-tweet\" data-lang=\"en\">\n<p lang=\"en\" dir=\"ltr\">Delhi: Visuals from the high level meeting on security chaired by Prime Minister Narendra Modi at 7 Lok Kalyan Marg <a href=\"https:\/\/t.co\/y9DDv8UA04\">pic.twitter.com\/y9DDv8UA04<\/a><\/p>\n— ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1101120911887998977?ref_src=twsrc%5Etfw\">February 28, 2019<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2019-02-28 07:43:06","pin":"0","status":"1"},{"title":"Happy to have Wing Commander Abhinandan back: IAF ","content":"<blockquote class=\"twitter-tweet\" data-lang=\"en\">\n<p lang=\"en\" dir=\"ltr\"><a href=\"https:\/\/twitter.com\/hashtag\/WATCH?src=hash&ref_src=twsrc%5Etfw\">#WATCH<\/a> Air Vice Marshal RGK Kapoor: We are happy that our pilot who had fallen across the Line of Control and was in custody of Pakistan is being released, we're extremely happy to have him back. We only see it as a gesture which is in consonance with all Geneva conventions. <a href=\"https:\/\/t.co\/Dg5Cpel4Lw\">pic.twitter.com\/Dg5Cpel4Lw<\/a><\/p>\n— ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1101122802227175424?ref_src=twsrc%5Etfw\">February 28, 2019<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2019-02-28 07:44:44","pin":"0","status":"1"},{"title":"IAF happy, looking forward to Abhinandan's return: Air Vice Marshal RGK Kapoor","content":"<p>Pakistan has been giving many factually incorrect statements. They first claimed that two aircraft of the IAF were shot down, but later had to revise it, he added.<\/p>","date":"2019-02-28 07:45:14","pin":"0","status":"1"},{"title":"WATCH | Wing Commander Abhinandan's safe return: IAF responds","content":"<p><iframe width=\"100%\" height=\"450\" src=\"https:\/\/www.youtube.com\/embed\/QogksOEj8I8\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\"><\/iframe><\/p>","date":"2019-02-28 08:45:58","pin":"0","status":"1"},{"title":"China non-committal about move in UN to list Masood Azhar as global terrorist ","content":"<p>China, a close ally of Pakistan, has consistently blocked moves first by India and later by the US, the UK and France to designate Azhar as a global terrorist by the 1267 Committee by putting technical holds.<\/p>","date":"2019-02-28 08:47:34","pin":"0","status":"1"},{"title":"Closure of Pakistani airspace unlikely to affect operations: Lufthansa","content":"Following the Pakistan government's decision to shut its airspace Wednesday in the wake of developments along the Western borders of India, the German airlines are rerouting the West-bound traffic to and from India.","date":"2019-02-28 08:48:22","pin":"0","status":"1"},{"title":"Heavy shelling, air intrusions give way to fear psychosis among border residents","content":"<p>Intense shelling and air intrusions by Pakistan jets have left hundreds of people living in villages along the LoC in Jammu and Kashmir in the grip of fear. Locals said the nights are the worst as the shelling is the most severe then.<\/p>","date":"2019-02-28 08:49:01","pin":"0","status":"1"},{"title":"Sushma Swaraj leaves for OIC Conclave","content":"<blockquote class=\"twitter-tweet\" data-lang=\"en\">\n<p lang=\"en\" dir=\"ltr\">Delhi: External Affairs Minister Sushma Swaraj emplanes for the UAE. She will attend a conclave of the Organisation of Islamic Cooperation (OIC) there as the Guest of Honour. <a href=\"https:\/\/t.co\/nMeb72ZomG\">pic.twitter.com\/nMeb72ZomG<\/a><\/p>\n— ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1101141395723567104?ref_src=twsrc%5Etfw\">February 28, 2019<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2019-02-28 09:14:15","pin":"0","status":"1"},{"title":"Abu Dhabi Crown Prince calls PM Modi, Imran Khan","content":"The Crown Prince, also the Deputy Supreme Commander of the UAE Armed Forces, in a tweet said he talked to Prime Minister Modi and Prime Minister Khan.","date":"2019-02-28 09:28:49","pin":"1","status":"1"},{"title":"Jaish-e-Mohammad resolved to continue 'holy war against India': Intelligence report","content":"<p>Citing a report, officials said the conference organised in Okara district in Pakistan on November 27, 2017, saw more than 2,000 participants showering praise on organisational activities of JeM and the role played by its chief Masood Azhar, the mastermind of February 14 Pulwama strike in Jammu &amp; Kashmir, among other terror attacks in India.<\/p>","date":"2019-02-28 09:29:53","pin":"0","status":1},{"title":"Airstrip on Uttar Pradesh expressways war ready as back up for IAF jets","content":"<p>The airstrip on Agra-Lucknow Expressway can come handy in meeting any exigency as far as taking off and touching down of fighter jets are concerned. In order to ensure preparedness of the airstrip for fighter jets under in the prevailing conditions, a public response vehicle has been stationed near its permanently.<\/p>","date":"2019-02-28 09:30:34","pin":"0","status":1},{"title":"Nation wants to know what happened in Balakot: Mamata","content":"Citing foreign media reports that not much damage was done by the Indian Air Force's pre-emptive strike on terror camps at Balakot, The West Bengal CM and TMC chief said, \"The Force should be given an opportunity to come up with facts.\" ","date":"2019-02-28 10:06:48","pin":"0","status":1},{"title":"Union Cabinet approves the Jammu and Kashmir Reservation (Amendment) Ordinance, 2019.","content":"Once the Ordinance is issued, it would pave the way for bringing persons residing in the areas adjoining International Border within the ambit of reservation at par with persons living in areas adjoining Actual Line of Control.","date":"2019-02-28 10:08:16","pin":"0","status":1},{"title":"Cabinet also approves the Constitution (Application to Jammu & Kashmir) Amendment Order, 2019","content":"<p>Union Minister Arun Jaitley: Once notified this will pave the way for giving benefit of promotion in service to the SCs, STs &amp; also extend the reservation of upto 10% for economically weaker sections in educational institutions &amp; public employment in addition to the existing reservation in Jammu &amp; Kashmir.<\/p>","date":"2019-02-28 10:09:42","pin":"0","status":1},{"title":"Youtube took down 'humiliating' videos of Wing Commander Abhinandan: Government","content":"<blockquote class=\"twitter-tweet\" data-lang=\"en\">\n<p lang=\"en\" dir=\"ltr\">RS Prasad: We had received complaints...y'day an unfortunate instance had come up where humiliating videos of the Wing Commander (Abhinandan) had been uploaded on YouTube from Pakistan side. We had sent a notice to YouTube &amp; complying with the same they took down 11 such videos. <a href=\"https:\/\/t.co\/sFdYZnos82\">pic.twitter.com\/sFdYZnos82<\/a><\/p>\n&mdash; ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1101160594747596800?ref_src=twsrc%5Etfw\">February 28, 2019<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2019-02-28 10:25:38","pin":"0","status":1},{"title":"Centre declares Jamaat-e-Islami as an unlawful association","content":"<blockquote class=\"twitter-tweet\" data-lang=\"en\">\n<p lang=\"en\" dir=\"ltr\">Under section 3 of Unlawful Activities (Prevention) Act, 1967, Central Government declares the Jamaat-e-Islami (JeI), Jammu and Kashmir as an &quot;unlawful association&quot;. <a href=\"https:\/\/t.co\/74hNtFwZFP\">pic.twitter.com\/74hNtFwZFP<\/a><\/p>\n&mdash; ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1101164262158872576?ref_src=twsrc%5Etfw\">February 28, 2019<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2019-02-28 10:26:25","pin":"0","status":1},{"title":"Turkish President Erdogan calls Imran Khan, praises his gesture to release Wing Commander Abhinandan","content":"The Prime Minister's Office said in a statement that Erdogan congratulated the Prime Minister on his speech in the Parliament and \"his statesman-like offers to India for de-escalating the situation and working towards peace\".","date":"2019-02-28 11:23:10","pin":"0","status":1},{"title":"IAF to receive Wing Commander Abhinandan Varthaman at Wagah border: Sources","content":"<p>A delegation of IAF team will on Friday receive Wing Commander Abhinandan Varthaman, captured by Pakistan during an aerial combat, at the Wagah border, official sources said.<\/p>","date":"2019-02-28 11:41:56","pin":"0","status":1},{"title":"Putin dials PM Modi, reaffirms Russia's solidarity in India's fight against terror","content":"In their telephonic conversation, PM Modi also renewed India's commitment to strengthening bilateral cooperation in countering terrorism as a pillar of privileged and special strategic partnership.","date":"2019-02-28 11:48:53","pin":"0","status":1}]}