{"details":[{"title":"Scores throng Wagah border to welcome IAF pilot Abhinandan ","content":"<ul>\n    <li>People started arriving in Attari, around 30 km from the Sikh holy city of Amritsar, since 6 a.m. Their numbers swelled by 9 a.m.<\/li>\n    <li>Border Security Force on High alert<\/li>\n    <li>Punjab Police, security agencies stationed additional personnel<\/li>\n<\/ul>","date":"2019-03-01 12:38:25","pin":"0","status":"1"},{"title":"How Abhinandan's release is likely to happen","content":"<ul>\n    <li>Abhinandan, who is in cantontment town of Rawalpindi, is expected to be taken by air to Lahore<\/li>\n    <li>From Lahore he will be taken by road to the Wagah border.<\/li>\n    <li>Sources said that the pilot is likely to be handed over first to the International Committee of Red Cross (ICRC) under rules of the Geneva Convention<\/li>\n    <li>Abhinandan will then be brought to the Attari Joint Check Post on Friday afternoon where he would be allowed to cross over to India.<\/li>\n    <li>The IAF pilot will be debriefed by defence and security officials after his return<\/li>\n<\/ul>\n<p> <\/p>\n<p> <\/p>","date":"2019-03-01 12:40:41","pin":"0","status":"1"},{"title":"WATCH | IAF pilot Abhinandan's parents get standing ovation on board flight to Delhi","content":"<p>Air Marshal (retd) S Varthaman and Dr Shobha Varthaman were given a standing ovation as passengers made way for them in the early hours of Friday, ensuring that the couple gets off first. They are expected to be in Wagah border to welcome their son back home.(<a href=\"http:\/\/www.newindianexpress.com\/nation\/2019\/mar\/01\/watch--iaf-pilot-abhinandans-parents-get-standing-ovation-on-board-flight-to-delhi-1945298.html\" target=\"_blank\"><strong>Read here<\/strong><\/a>)<\/p>\n<blockquote class=\"twitter-tweet\" data-lang=\"en\">\n<p dir=\"ltr\" lang=\"en\">Parents of <a href=\"https:\/\/twitter.com\/hashtag\/Abhinandan?src=hash&ref_src=twsrc%5Etfw\">#Abhinandan<\/a> welcomed with big Applause in flight.!!<br \/>\nWe all are proud of you and your son Abhinandan.!<a href=\"https:\/\/twitter.com\/hashtag\/FirSeMosi2019?src=hash&ref_src=twsrc%5Etfw\">#FirSeMosi2019<\/a><br \/>\n<br \/>\n<a href=\"https:\/\/t.co\/3Q9mQTIkAq\">pic.twitter.com\/3Q9mQTIkAq<\/a><\/p>\n— BoundToNation (@boundtonation) <a href=\"https:\/\/twitter.com\/boundtonation\/status\/1101354493696851968?ref_src=twsrc%5Etfw\">March 1, 2019<\/a><\/blockquote>","date":"2019-03-01 12:44:22","pin":"0","status":"1"},{"title":"Chennai prays for its son Abhinandan's release","content":"<p>Special thanks giving prayer was organised by Police personnel at Kalikambal Temple in Chennai ahead of Wing Commander Abhinandan Varthaman's release by Pakistan.<img src=\"http:\/\/cms.newindianexpress.com\/FCKeditor\/fckeditor_img\/Abhinandan_Prayer_EPS1216.jpg\" alt=\"Abhinandan Prayer\" width=\"100%\" \/><\/p>\n<p>(Photo | Debadatta Mallick\/ EPS)<\/p>","date":"2019-03-01 12:51:36","pin":"0","status":"1"},{"title":"IAF team from Delhi to receive Abhinandan","content":"<p>Wing Commander Abhinandan Varthaman will cross the border today, can't tell you exact time since there are certain formalities. A senior Indian Air force team from Delhi is here, they will be the ones to receive him: Deputy Commissioner Shiv Dular Singh Dhillon, Amritsar<img src=\"http:\/\/cms.newindianexpress.com\/FCKeditor\/fckeditor_img\/D0jiya6U0AAANMK.jpg\" width=\"100%\" alt=\"\" \/><\/p>\n<p><strong>(Photo: Twitter\/ ANI)<\/strong><\/p>","date":"2019-03-01 01:00:06","pin":"0","status":"1"},{"title":"Pakistan Foreign minister boycotts OIC meet over India's presence","content":"<p>Shah Mahmood Qureshi said on Friday that he would not participate in the Council of Foreign Ministers' meet of the Organisation of Islamic Cooperation (OIC) in Abu Dhabi, citing India's presence at the same. Indian's External Affairs minister Sushma Swaraj is attending the summit as the guest of honour.<\/p>","date":"2019-03-01 01:16:24","pin":"0","status":"1"},{"title":"Empty Pakistani chair at OIC as Guest of Honour Sushma Swaraj gives her speech","content":"<p><img src=\"http:\/\/cms.newindianexpress.com\/FCKeditor\/fckeditor_img\/D0jpceiUwAAobHQ.jpg\" width=\"100%\" alt=\"\" \/> <\/p>","date":"2019-03-01 01:19:59","pin":"0","status":"1"},{"title":"WATCH | Chennai cops pray at Kaalikambal temple for Abhinandan","content":"<p><iframe width=\"100%\" height=\"315\" src=\"https:\/\/www.youtube.com\/embed\/3XQ4I73deG0\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\"><\/iframe><\/p>","date":"2019-03-01 01:35:42","pin":"0","status":"0"},{"title":"Muslim brothers and sisters are a microcosm of the diversity of India, says Sushma at OIC","content":"<p>I carry the greetings of 1.3 billion Indians, including more than 185 million Muslim brothers and sisters. Our Muslims brothers and sisters are a microcosm of the diversity of India itself: Sushma Swaraj<\/p>\n<p><img src=\"http:\/\/cms.newindianexpress.com\/FCKeditor\/fckeditor_img\/D0joeskWkAA6faH.jpg\" width=\"100%\" alt=\"\" \/>I carry the greetings of 1.3 billion Indians, including more than 185 million Muslim brothers and sisters. Our Muslims brothers and sisters are  a microcosm of the diversity of India itself.<\/p>\n<p>(Photo | MEAIndia, Twitter)<\/p>","date":"2019-03-01 01:40:04","pin":"0","status":"1"},{"title":"Terrorism is driven by distortion of religion, says Sushma at OIC","content":"<p>Terrorism and extremism bear  different names and labels. It uses diverse causes. But in each case,  it is driven by distortion of religion, and  a misguided belief in its power to succeed.: Sushma Swaraj<\/p>","date":"2019-03-01 01:46:26","pin":"0","status":"1"},{"title":"Pakistan ignores India's request to send back Abhinandan by air","content":"<p>India had requested Abhinandan's return by air hours after Pakistan announced its decision to release the Indian Air Force pilot   India conveyed to Islamabad that it wants him to be sent back via aerial route and not through the Wagah land border, official sources said.<\/p>\n<p>However, late in the night, Pakistan communicated to India that he will be returned through the Attari-Wagah border.<\/p>\n<p>The Indian defence establishment was also mulling over sending a special aircraft to Pakistan to bring back Wing Commander Varthaman. (<a href=\"http:\/\/www.newindianexpress.com\/nation\/2019\/mar\/01\/pakistan-ignores-indias-request-to-sent-back-iaf-pilot-by-air-1945330.html\" target=\"_blank\"><strong>Read here<\/strong><\/a>)<\/p>","date":"2019-03-01 01:56:05","pin":"0","status":"1"},{"title":"Petition filed in Pakistan court to stop the release of Abhinandan","content":"<ul>\n    <li>A Pakistani citizen on Friday filed a petition in the Islamabad High Court to stop the imminent release of the captured Indian Air Force pilot Wing Commander Abhinanadan Varthaman, saying he committed crime against the country and should be put on trial here.<\/li>\n    <li> IHC chief justice Athar Minhallah will hear the petition ahead of the Indian pilot's handing over to India.<\/li>\n<\/ul>","date":"2019-03-01 01:59:09","pin":"0","status":"1"},{"title":"Fight against terrorism is not confrontation against any religion, says Sushma at OIC meet","content":"<p>The fight against terrorism is  not a confrontation against any religion.  It cannot be. Just as Islam literally means peace,none of the 99 names of Allah mean violence. Similarly, every religion in the world  stands for peace, compassion & brotherhood: Sushma<img src=\"http:\/\/cms.newindianexpress.com\/FCKeditor\/fckeditor_img\/D0jxzh_WkAA_Pef.jpg\" width=\"100%\" alt=\"\" \/><\/p>(Photo | MEAIndia, Twitter)","date":"2019-03-01 02:02:29","pin":"0","status":"1"},{"title":"Varthamans a MiG-21 family: Abhinandan flies it, earlier dad Simhakutty flew it","content":"<p>For the Varthamans, flying the MiG-21 fighter aircraft is a sort of family tradition.<\/p>\n<p>Wing Commander Abhinandan Varthaman downed a Pakistani F-16 plane before his MiG-21 Bison was hit during a dogfight.<\/p>\n<p>His father Air Marshal (retd) Simhakutty Varthaman also flew the MiG-21s and was an IAF test pilot, who retired five years ago, a family friend said.<\/p>\n<p>Abhinandan's grandfather was also in the IAF, he said.<\/p>","date":"2019-03-01 02:05:17","pin":"0","status":"1"},{"title":"Pakistan court dismisses plea to stop Abhinandan's release","content":"<ul>\n    <li>Islamabad High Court on Friday dismissed a plea filed by a Pakistani citizen to stop the release of the captured Indian Air Force pilot Wing Commander Abhinanadan Varthaman.<\/li>\n    <li>The plea said the Indian pilot had committed crime against Pakistan and should be put on trial.<\/li>\n<\/ul>","date":"2019-03-01 02:10:10","pin":"0","status":"1"},{"title":"Stop terrorists to save humanity: Sushma at OIC","content":"<p>If we want to save humanity,we must tell the states who provide shelter & funding to terrorists to dismantle the infrastructure of the terrorist camps based in that country, she said.<\/p>","date":"2019-03-01 02:16:31","pin":"0","status":"1"},{"title":"Senior team of the Indian Air Force will receive Abhinandan","content":"<p>The Beating the Retreat ceremony (at Attari-Wagah Border) will not be held today. Senior team of the Indian Air Force will receive Wing Commander, said Deputy Commissioner Shiv Dular Singh Dhillon at Amritsar.<\/p>","date":"2019-03-01 02:26:36","pin":"0","status":"1"},{"title":"Scenes of Patriotic fervour at the Wagah border","content":"<ul>\n    <li>Patriotic fervour prevailed at the border with border residents singing songs, beating drums and carrying the tricolour in their hands.<\/li>\n    <li>Barely one-km away from the Indo-Pak border, people sang patriotic songs and raised slogans like \"Bharat Mata ki Jai\".<\/li>\n    <li>A Sikh youth from a nearby area was seen carrying a huge garland, while an elderly man was seen beating a 'dhol'.<img src=\"http:\/\/cms.newindianexpress.com\/FCKeditor\/fckeditor_img\/Wagah border.jpg\" width=\"100%\" alt=\"\" \/><\/li>\n<\/ul>\n<p>(Photo Collage: AP, ANI)<\/p>","date":"2019-03-01 02:56:24","pin":"0","status":"1"},{"title":"Would love to receive Abhinandan but protocol must be followed: Amarinder Singh","content":"Would love to go to receive Wing Commander Abhinandan Varthaman, but there's a laid out protocol whenever anybody comes back, like what happened to PoWs in 1965 & 1971, who had to first go for a medical test & then be debriefed. I think the same process will be followed here.","date":"2019-03-01 02:58:19","pin":"0","status":"1"},{"title":"Daily retreat and flag-lowering ceremony along Indo-Pak border cancelled ahead of IAF pilot's release: BSF","content":"<p>The ceremony which regularly held at the Attari-Wagah border front along the India-Pakistan border in Punjab on Friday, has been cancelled for Friday, the BSF said.  A senior official said the martial ceremony has been called off due to administrative requirements in the wake of IAF Wing Commander Abhinandan Varthaman's release. (<strong><a href=\"http:\/\/www.newindianexpress.com\/nation\/2019\/mar\/01\/daily-retreat-ceremony-along-indo-pak-border-cancelled-bsf-1945342.html\" target=\"_blank\">Read more<\/a><\/strong>)<\/p>","date":"2019-03-01 03:18:11","pin":"0","status":"1"},{"title":"Every Indian proud that brave Abhinanadan is from Tamil Nadu","content":"Every Indian is proud that the brave Wing Commander Abhinanadan is from Tamil Nadu, says Prime Minister Narendra Modi in Kanyakumari. The PM was in the Tamil Nadu town to unveil various rail-road development projects. ","date":"2019-03-01 03:32:36","pin":"0","status":"1"},{"title":"China welcomes Pakistan's decision ","content":"<p>China welcomed Pakistan's decision to release the Indian Air Force pilot and encouraged the two countries to engage in more counter terrorism cooperation and dialogue for the regional peace and stability. (<strong><a href=\"http:\/\/www.newindianexpress.com\/world\/2019\/mar\/01\/china-welcomes-release-of-iaf-pilot-abhinandan-calls-for-more-anti-terror-cooperation-between-india-1945349.html\" target=\"_blank\">Read more<\/a><\/strong>)<\/p>","date":"2019-03-01 03:38:19","pin":"0","status":"1"},{"title":"We will return damages done by terrorists with interest: PM Modi","content":"<p>This is a new India, an India that will return the damage done by terrorists with interest: PM Modi<\/p>\n<p><img src=\"http:\/\/cms.newindianexpress.com\/FCKeditor\/fckeditor_img\/Capture(5).jpg\" width=\"500\" height=\"252\" alt=\"\" \/><\/p>\n<p><strong>(Prime Minister Narendra Modi | PTI)<\/strong><\/p>","date":"2019-03-01 03:59:40","pin":"0","status":"1"},{"title":"IAF pilot Abhinandan to return by 6 PM","content":"Wing Commander Abhinandhan Varthaman has reportedly reached Lahore on his to Wagah border. Expected to return by 6 PM, say reports. ","date":"2019-03-01 04:22:50","pin":"0","status":"1"},{"title":"Sensex rises over 196 points as Indo-Pak tension shows signs of thaw","content":"Market benchmark Sensex rose on Friday over 196 points to end at 36,064 and also posted its second straight weekly gains amid signs of easing tensions between India and Pakistan.","date":"2019-03-01 04:28:32","pin":"0","status":"1"},{"title":"Wing Commander Abhinandan homecoming: Visuals from Wagah in Lahore","content":"<p><img src=\"http:\/\/cms.newindianexpress.com\/FCKeditor\/fckeditor_img\/hero.jpg\" width=\"500\" height=\"241\" alt=\"\" \/> <\/p>","date":"2019-03-01 04:44:03","pin":"0","status":"1"},{"title":"Wing commander Varthaman to be received by IAF ","content":"<blockquote class=\"twitter-tweet\" data-lang=\"en\">\n<p lang=\"en\" dir=\"ltr\">Visuals from Attari-Wagah border; Wing Commander <a href=\"https:\/\/twitter.com\/hashtag\/AbhinandanVarthaman?src=hash&ref_src=twsrc%5Etfw\">#AbhinandanVarthaman<\/a> to be received by a team of Indian Air Force. <a href=\"https:\/\/t.co\/C4wv14AEAd\">pic.twitter.com\/C4wv14AEAd<\/a><\/p>\n— ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1101438557372076033?ref_src=twsrc%5Etfw\">March 1, 2019<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2019-03-01 04:46:38","pin":"0","status":"1"},{"title":"IAF pilot's parents reach Wagha border to receive him","content":"<p> <img src=\"http:\/\/cms.newindianexpress.com\/FCKeditor\/fckeditor_img\/WhatsApp Image 2019-03-01 at 2_26_57 PM.jpeg\" width=\"500\" height=\"375\" alt=\"\" \/><\/p>\n<p>Air Marshal S Varthaman (Left) and Shobha Varthaman (Third from left)<\/p>","date":"2019-03-01 04:54:45","pin":"0","status":"1"},{"title":"Return of pilot Varthaman in  such short span of time is diplomatic victory: Shah","content":"Creating a situation for the return of Wing Commander Abhinandan Varthaman from Pakistan in a short span of time was a diplomatic victory, says BJP president Amit Shah.","date":"2019-03-01 05:04:37","pin":"0","status":"1"},{"title":"Abhinandan reaches Wagah border post, undergoing medical checkup: Reports","content":"IAF Wing Commander Abhinandan Varthaman has reached Wagah post and is undergoing medical checkup there, according to Pakistan media. From Wagah, he is expected to be taken to Amritsar, says a report.","date":"2019-03-01 05:16:16","pin":"0","status":"1"},{"title":"Abhinandan handed over to India","content":"IAF pilot Abhinandan has been handed over to the Indian authorities.","date":"2019-03-01 05:22:45","pin":"0","status":"1"},{"title":"","content":"Wing Commander Varthaman may appear before the media: Reports","date":"2019-03-01 05:39:18","pin":"0","status":"1"},{"title":"Pilot to be de-briefed by superiors","content":"IAF pilot Abhinandan to be de-briefed by superiors. Air Vice Marshal RGK Kapoor to address the media shortly, according to reports.","date":"2019-03-01 05:48:07","pin":"0","status":"1"},{"title":"Balakot bombing: Now, Pakistan accuses India of 'eco-terrorism'","content":"Pakistan equates IAF bombing at Balakot to 'eco-terrorism', says will lodge UN complaint: Reports","date":"2019-03-01 05:56:29","pin":"0","status":"1"},{"title":"Mamata welcomes IAF hero ","content":"<p>With India's fighter pilot Abhinandan Varthaman returning to his homeland after being in Pakistan's custody for two days, West Bengal Chief Minister Mamata Banerjee welcomed his return to India.<\/p>\n<blockquote class=\"twitter-tweet\" data-lang=\"en\">\n<p lang=\"en\" dir=\"ltr\">Welcome home <a href=\"https:\/\/twitter.com\/hashtag\/AbhinandanVarthaman?src=hash&ref_src=twsrc%5Etfw\">#AbhinandanVarthaman<\/a> Welcome home sweet home<\/p>\n— Mamata Banerjee (@MamataOfficial) <a href=\"https:\/\/twitter.com\/MamataOfficial\/status\/1101440148955267072?ref_src=twsrc%5Etfw\">March 1, 2019<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2019-03-01 06:21:43","pin":"0","status":"1"},{"title":"Pakistan violates ceasefire along LoC","content":"<p>Jammu & Kashmir: Ceasefire violation by Pakistan along LoC in Mendhar, Balakote & Krishna Ghati sectors at 6 PM<\/p>","date":"2019-03-01 06:34:36","pin":"0","status":"1"},{"title":"WATCH | Hope to see you soon officer: Punjab CM Amarinder Singh to Abhinandan","content":"<blockquote class=\"twitter-tweet\" data-lang=\"en\">\n<p lang=\"en\" dir=\"ltr\">I wholeheartedly welcome <a href=\"https:\/\/twitter.com\/hashtag\/AbhinandanVartaman?src=hash&ref_src=twsrc%5Etfw\">#AbhinandanVartaman<\/a> back home. Though I would have loved to go and receive him, I did not do so in view of the existing Defence protocols. Hope to see you soon officer! <a href=\"https:\/\/twitter.com\/hashtag\/WelcomeHomeAbhinandan?src=hash&ref_src=twsrc%5Etfw\">#WelcomeHomeAbhinandan<\/a> <a href=\"https:\/\/t.co\/MIcvipqvzH\">pic.twitter.com\/MIcvipqvzH<\/a><\/p>\n— Capt.Amarinder Singh (@capt_amarinder) <a href=\"https:\/\/twitter.com\/capt_amarinder\/status\/1101466663868862464?ref_src=twsrc%5Etfw\">March 1, 2019<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2019-03-01 06:42:20","pin":"0","status":"1"},{"title":"Pakistan in conversation with US, UK, Australian military chiefs","content":"<p>Pakistan's Inter-Services Public Relations (ISPR)issued a statement saying that Chief of Armed Staff (COAS) Gen Qamar Javed Bajwa had a telephonic communication with the US, UK and Australian militaries, as well as the ambassadors over the stand-off with India, Dawn reported.<\/p>","date":"2019-03-01 06:59:03","pin":"0","status":"1"},{"title":"Northern Army commander visits border areas in Akhnoor sector amid tension","content":"<p>Amid tensions along the Line of Control, Northern Army Commander Lt Gen Ranbir Singh Friday visited forward posts in Akhnoor sector of Jammu district to review the operational preparedness and the prevailing security situation, an official spokesperson said. The Army commander was briefed on the actions taken to meet the challenges of increased ceasefire violations, the official said.<\/p>","date":"2019-03-01 07:17:13","pin":"0","status":"1"},{"title":"Jordan's King Abdullah II offers to mediate between India and Pakistan","content":"<p>King Abdullah II of Jordan made a telephone call to Pakistan Prime Minister Imran Khan and \"conveyed his concern over the escalating situation between Pakistan and India\", according to a tweet by Pakistan Tehreek-i-Insaf.<\/p>\n<blockquote class=\"twitter-tweet\" data-lang=\"en\">\n<p lang=\"en\" dir=\"ltr\">Prime Minister Imran Khan briefed King Abdullah II about his initiatives to maintain peace between Pakistan and India for the sake of the people of the two countries and the region.  <a href=\"https:\/\/twitter.com\/hashtag\/PakistanLeadsWithPeace?src=hash&ref_src=twsrc%5Etfw\">#PakistanLeadsWithPeace<\/a><\/p>\n— PTI (@PTIofficial) <a href=\"https:\/\/twitter.com\/PTIofficial\/status\/1101470065218732032?ref_src=twsrc%5Etfw\">March 1, 2019<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2019-03-01 07:19:20","pin":"0","status":"1"},{"title":"Pilot's parents await his return","content":"<p>It is raining at the Wagha border as the IAF officials and Abhinandan's parents await his return. <\/p>","date":"2019-03-01 07:33:10","pin":"0","status":"1"},{"title":"Vir Chakra likely for Pilot Varthaman","content":"<p>IAF pilot Abhinandan likely to be awarded with the Vir Chakra award, for his act of bravery, according to reports. <\/p>","date":"2019-03-01 07:42:08","pin":"0","status":"1"},{"title":"Pakistan will surely respond to any aggression in Self-Defence: Major General Asif Ghafoor","content":"<blockquote class=\"twitter-tweet\" data-lang=\"en\">\n<p lang=\"en\" dir=\"ltr\">COAS had tel comm with Comd USCENTCOM, CDS UK, CDF Australia and Ambs of US, UK & China in Pak. Prevailing stand off between Pakistan & India & its impact on peace & stability in the region & beyond discussed. “Pak shall surely respond to any aggression in self defence”, COAS.<\/p>\n— Maj Gen Asif Ghafoor (@OfficialDGISPR) <a href=\"https:\/\/twitter.com\/OfficialDGISPR\/status\/1101467968486158337?ref_src=twsrc%5Etfw\">March 1, 2019<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2019-03-01 08:06:08","pin":"0","status":"1"},{"title":"Pakistan violates ceasefire, carries out heavy shelling in areas along LoC","content":"<p>Officials said Pakistan troops used heavy guns including Howitzer 105 mm to target civilian areas in Poonch, leaving one woman injured.<\/p>","date":"2019-03-01 08:24:47","pin":"0","status":"1"},{"title":"India-Pakistan tension: Jordan's King Abdullah II speaks to Imran Khan","content":"<p>Khan briefed Abdullah II about his initiatives to maintain peace between Pakistan and India for the sake of the people of the two countries and the region, the Prime Minister's Office said in a statement.<\/p>","date":"2019-03-01 08:39:08","pin":"0","status":"1"},{"title":"Wing Commander Abhinandan's handover might happen at 9 pm","content":"<p>Pakistan has changed the timing of handover of IAF's Wing Commander Abhinandan Varthaman twice. Indian defence minister Nirmala Sitharaman is keeping a close watch on proceedings. The handover might now take place at 9 pm tonight.<\/p>","date":"2019-03-01 08:50:04","pin":"0","status":"1"},{"title":"Smiling Wing Commander Abhinandan Varthaman all set to cross over to India","content":"<blockquote class=\"twitter-tweet\" data-lang=\"en\">\n<p lang=\"en\" dir=\"ltr\">IAF Wing Commander <a href=\"https:\/\/twitter.com\/hashtag\/AbhinandanVarthaman?src=hash&ref_src=twsrc%5Etfw\">#AbhinandanVarthaman<\/a> at Wagah-Attari border, to cross border soon to enter India. <a href=\"https:\/\/t.co\/a1hVjwroVw\">pic.twitter.com\/a1hVjwroVw<\/a><\/p>\n— ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1101509422990409729?ref_src=twsrc%5Etfw\">March 1, 2019<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2019-03-01 09:19:50","pin":"0","status":"1"},{"title":"Wing Commander Abhinandan walks back into India","content":"The gates at the Wagah-Attari border open up and Wing Commander Abhinandan walks back to his motherland.","date":"2019-03-01 09:23:15","pin":"0","status":"0"},{"title":"Wing Commander Abhinandan walks back into India","content":"<p>The gates at the Wagah-Attari border open up and Wing Commander Abhinandan walks back to his motherland.<\/p>","date":"2019-03-01 09:26:37","pin":"0","status":"0"},{"title":"Wing Commander Abhinandan walks back into India","content":"<p>The gates at the Wagah-Attari border open up and Wing Commander Abhinandan walks back to his motherland.<\/p>","date":"2019-03-01 09:35:07","pin":"0","status":"1"},{"title":"Here is the first glimpse of Wing Commander Abhinandan on the Indian side of the Wagah Border","content":"<blockquote class=\"twitter-tweet\" data-lang=\"en\">\n<p lang=\"en\" dir=\"ltr\">IAF Wing Commander <a href=\"https:\/\/twitter.com\/hashtag\/AbhinandanVarthaman?src=hash&ref_src=twsrc%5Etfw\">#AbhinandanVarthaman<\/a> returns to India. <a href=\"https:\/\/t.co\/0uvWUBchcx\">pic.twitter.com\/0uvWUBchcx<\/a><\/p>\n— ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1101510830884077575?ref_src=twsrc%5Etfw\">March 1, 2019<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2019-03-01 09:37:06","pin":"0","status":"1"},{"title":"Wing Commander Abhinandan will now go through detailed medical checkup: IAF","content":"Wing Commander Abhinandan Varthaman has been handed over to us. He will now be taken for a detailed medical checkup because he had to eject from an aircraft. IAF is happy to have him back, says Air Vice-Marshal RGK Kapoor.","date":"2019-03-01 09:39:12","pin":"0","status":"1"},{"title":"PM Modi reacts","content":"<blockquote class=\"twitter-tweet\" data-lang=\"en\">\n<p lang=\"en\" dir=\"ltr\">Welcome Home Wing Commander Abhinandan!<br \/>\n<br \/>\nThe nation is proud of your exemplary courage.<br \/>\n<br \/>\nOur armed forces are an inspiration for 130 crore Indians.<br \/>\n<br \/>\nVande Mataram!<\/p>\n— Narendra Modi (@narendramodi) <a href=\"https:\/\/twitter.com\/narendramodi\/status\/1101521097323958272?ref_src=twsrc%5Etfw\">March 1, 2019<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2019-03-01 10:10:31","pin":"0","status":"0"},{"title":"PM Modi reacts","content":"<blockquote class=\"twitter-tweet\" data-lang=\"en\">\n<p lang=\"en\" dir=\"ltr\">Welcome Home Wing Commander Abhinandan!<br \/>\n<br \/>\nThe nation is proud of your exemplary courage.<br \/>\n<br \/>\nOur armed forces are an inspiration for 130 crore Indians.<br \/>\n<br \/>\nVande Mataram!<\/p>\n— Narendra Modi (@narendramodi) <a href=\"https:\/\/twitter.com\/narendramodi\/status\/1101521097323958272?ref_src=twsrc%5Etfw\">March 1, 2019<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2019-03-01 10:10:31","pin":"0","status":"1"},{"title":"Hail India and Pakistan's choices of restraint and responsibility: France","content":"Jean-Yves Le Drian,French Minister for Europe and Foreign Affairs: Welcome the easing of tensions between India and Pakistan and release of IAF pilot. I hail the two governments’ choice of restraint and responsibility and urge them to resume bilateral dialogue.","date":"2019-03-01 10:11:44","pin":"0","status":"1"},{"title":"Pakistani F-16 pilot was mistaken to be an Indian, lynched by his own: Report","content":"<p>On the day Pakistan handed back IAF fighter pilot Abhinandan Varthaman to India at Wagah, news has emerged that the Pakistan F-16 pilot Wing Commander Shahaz-ud-Din, downed on Wednesday, ended up being lynched by a mob in Pakistan occupied Kashmir (PoK) after being mistaken for an Indian. <a href=\"http:\/\/www.newindianexpress.com\/world\/2019\/mar\/01\/pakistani-f-16-pilot-was-mistaken-to-be-an-indian-lynched-by-his-own-report-1945428.html\" target=\"_blank\"><strong>(READ MORE HERE)<\/strong><\/a><\/p>","date":"2019-03-01 10:50:55","pin":"0","status":"1"},{"title":"Good to be back in my country: Wing Commander Abhinandan","content":"<p>&quot;It is good to be back in my country,&quot; was the first reaction of IAF pilot Wing Commander Abhinandan Varthaman as he set his foot back on Indian soil.<\/p>","date":"2019-03-01 11:05:33","pin":"0","status":1},{"title":"Politicos welcome Wing Commander Abhinandan back to India","content":"<p>Leaders cutting across party lines welcomed the return of Indian Air Force pilot Abhinandan Varthaman from captivity in Pakistan on Friday and lauded him for his poise and courage and for making the country proud. <a href=\"http:\/\/www.newindianexpress.com\/nation\/2019\/mar\/01\/politicos-welcome-wing-commander-abhinandan-back-to-india-hail-his-courage-1945437.html\" target=\"_blank\">(READ MORE HERE)<\/a><\/p>","date":"2019-03-01 11:19:42","pin":"0","status":1},{"title":"Documentation, procedural delays held up Wing Commander Abhinandan's release: Sources","content":"<p>Initially, the Indian authorities indicated that Wing Commander Varthaman would be handed over to India at around 4 PM and later they suggested that he would be released at around 6:30 PM.However, he finally emerged at 9.10 pm Indian time at the Wagah check-post on the Pakistani side, accompanied by Pakistani rangers, the Indian air attache posted in the High Commission in Islamabad.<\/p>","date":"2019-03-01 11:21:36","pin":"0","status":1},{"title":"Three villagers killed, two injured in heavy shelling by Pakistani forces along LoC ","content":"<p>Pakistani forces targeted civilian areas with mortar bombs and heavy guns, including Howitzer 105 mm, they said, adding that Indian forces retaliated effectively.<\/p>","date":"2019-03-01 11:59:58","pin":"0","status":1},{"title":"Pilot Abhinandan made to record video statement by Pakistan before being handed over to India","content":"<p>It was not clear whether he was made to record the video under duress.The video also had several jump cuts indicating that it had been edited heavily, apparently to fit Pakistani propaganda.<\/p>","date":"2019-03-02 12:18:26","pin":"0","status":1},{"title":"11 flights to and from Delhi cancelled due to Pakistan airspace closure","content":"<p>Pakistan's Civil Aviation Authority announced Friday that flight operations at Islamabad, Karachi, Peshawar and Quetta airports have resumed. However, the eastern side airports - Lahore, Multan, Sialkot, Faisalabad and Bahawalpur -- will remain closed till March 4, it added.<\/p>","date":"2019-03-02 12:22:05","pin":"0","status":1},{"title":"Happy with release of IAF pilot Abhinandan Varthaman, but Pakistan needs to do lot more: VK Singh","content":"<p>Union minister and former Army chief V K Singh on Friday said he was happy that Pakistan was releasing Wing Commander Abhinandan Varthaman, but the neighbouring country needs to do a &quot;lot more&quot;.<\/p>","date":"2019-03-02 12:24:51","pin":"0","status":1},{"title":"Go all out to explain to world reasons behind Balakot strikes: Parliamentary panel to Foreign Secretary","content":"The panel told the foreign secretary that the government should highlight the impact of the air strike and the information about the extent of damage, including casualties, suffered by the JeM.","date":"2019-03-02 12:30:05","pin":"0","status":1},{"title":"Pakistan describes Wing Commander Abhinandan as 'POW' while returning him to India","content":"<p>In a statement issued minutes after the pilot crossed over to India from the Wagah-Attari border, the FO said, &quot;While in captivity, he was treated with dignity and in line with international law.&quot;<\/p>","date":"2019-03-02 12:33:05","pin":"0","status":1},{"title":"Wing Commander Abhinandan lands in Delhi","content":"The IAF pilot landed in Delhi Friday night, hours after he was handed over to India by Pakistan after being in captivity for nearly three days. A group of people gave a rousing welcome to him at the Palam airport, from where he would be taken to a medical facility for examination.","date":"2019-03-02 12:34:58","pin":"0","status":1},{"title":"Russia offered to mediate, provide venue to India, Pakistan to hold talks","content":"Russia's Foreign Minister Sergey Viktorovich Lavrov spoke to his Pakistani counterpart Shah Mahmood Qureshi over telephone and discussed the situation in the region following escalation of tensions between the two neighbours, Pkistan Foreign Office said.","date":"2019-03-02 12:36:24","pin":"0","status":1},{"title":"Imran Khan was in Lahore to ensure 'smooth' handing over of Wing Commander Abhinandan: Sources","content":"<p>Khan arrived in Lahore on Friday afternoon, a couple of hours before IAF pilot Wing Commander Abhinandan Varthaman was brought to the Wagah border from Islamabad, amid high security.<\/p>","date":"2019-03-02 12:37:02","pin":"0","status":1}]}