{"details":[{"title":"PM to pay last respects to Parrikar","content":"<blockquote class=\"twitter-tweet\" data-lang=\"en\">\n<p lang=\"en\" dir=\"ltr\">Prime Minister Narendra Modi to leave for <a href=\"https:\/\/twitter.com\/hashtag\/Goa?src=hash&ref_src=twsrc%5Etfw\">#Goa<\/a> shortly, to offer last respects to Goa CM <a href=\"https:\/\/twitter.com\/hashtag\/ManoharParrikar?src=hash&ref_src=twsrc%5Etfw\">#ManoharParrikar<\/a> who passed away yesterday. <a href=\"https:\/\/t.co\/adrMxbKmJV\">pic.twitter.com\/adrMxbKmJV<\/a><\/p>\n— ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1107519153303416832?ref_src=twsrc%5Etfw\">March 18, 2019<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2019-03-18 11:35:18","pin":"0","status":"1"},{"title":"Options are open: Goa Forward leader Vijai Sardesai","content":"Goa Forward Party chief and state minister Vijai Sardesai late on Sunday said his party had not supported the BJP but Parrikar, who was heading the coalition government comprising the BJP, Goa Forward Party, MGP and independents, since 2017.","date":"2019-03-18 11:37:03","pin":"0","status":"1"},{"title":"Nitin Gadkari holds talks with BJP, MGP leaders to select new Goa Chief Minister","content":"The Union Minister first met with leaders of the Goa alliance partners on Sunday late night but failed to reach a consensus on the leadership issue.","date":"2019-03-18 11:41:28","pin":"0","status":"1"},{"title":"People throng outside Goa BJP headquarters to pay tributes to Parrikar","content":"<blockquote class=\"twitter-tweet\" data-lang=\"en\">\n<p lang=\"en\" dir=\"ltr\">Goa: People gather at BJP office in Panaji to pay last respects to late Goa CM <a href=\"https:\/\/twitter.com\/hashtag\/ManoharParrikar?src=hash&ref_src=twsrc%5Etfw\">#ManoharParrikar<\/a> <a href=\"https:\/\/t.co\/2jQpNMG60R\">pic.twitter.com\/2jQpNMG60R<\/a><\/p>\n— ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1107518005083172864?ref_src=twsrc%5Etfw\">March 18, 2019<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2019-03-18 11:42:22","pin":"0","status":"1"},{"title":"IIT-Bombay to hold condolence meet for alumnus Parrikar","content":"The college will hold a condolence meet on Monday evening to pay tributes to their alumnus who died after a long illness. The meeting will be held at 5 pm at the institute's P C Saxena auditorium here, an IIT-B spokesperson said. In 2017, Parrikar addressed the 55th convocation of the Mumbai-based institute where he told the graduates to take up jobs in social and development sectors.\nHe also asked students to join politics and the Army, said a former IIT-B student who was present at the convocation ceremony.","date":"2019-03-18 11:44:20","pin":"0","status":"1"},{"title":"MGP chief wants to be the Goa CM: Deputy speaker Michael Lobo","content":"\"During a meeting with Nitin Gadkari, Sudin Dhavalikar expressed his willingness to become the chief minister of Goa. He said he has sacrificed many times by supporting the BJP, he has put his demand but the BJP will not agree to that,\" Lobo told media persons after the stretched meeting \nthrough the entire night.","date":"2019-03-18 11:47:13","pin":"0","status":"1"},{"title":"Goa Congress stakes claim to form government in the state","content":"State Congress leaders G Chodankar and C Kavlekar wrote to Goa Governor staking claim to form the government in the state.\"Now, in view of Mr Parrikar's death, BJP has no allies,\" the letter read. It said that it was up to the Governor to ensure \"smooth transition and transfer of power\".\n\"Congress being the single largest party, it is submitted that the leader of the Congress party is entitled to be invited to form the next government. We, therefore, hereby once again stake our claim to form the government and request Your Excellency to extend the invitation to our leader to form the next government,\" the letter stated.","date":"2019-03-18 11:48:29","pin":"0","status":"1"},{"title":"CM post should go to BJP only: Party MLA","content":"<blockquote class=\"twitter-tweet\" data-lang=\"en\"><p lang=\"en\" dir=\"ltr\">BJP MLA Glenn Ticlo in Panaji: Definitely, one among the 12 of us BJP MLAs should lead the state, it is but obvious. <a href=\"https:\/\/twitter.com\/hashtag\/Goa?src=hash&ref_src=twsrc%5Etfw\">#Goa<\/a> <a href=\"https:\/\/t.co\/d6fcVVMlhS\">pic.twitter.com\/d6fcVVMlhS<\/a><\/p>— ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1107527471489007616?ref_src=twsrc%5Etfw\">March 18, 2019<\/a><\/blockquote>\n<script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2019-03-18 11:49:14","pin":"0","status":"1"},{"title":"Union Cabinet condoles demise of Parrikar, terms him 'CM of commoners' ","content":"After observing a two-minute silence, the Cabinet also passed a resolution which said, in his death the country has lost an able administrator who was affectionately called the \"chief minister of commoners.","date":"2019-03-18 11:55:24","pin":"0","status":"1"},{"title":"PM leaves for Goa","content":"Prime Minister Narendra Modi left for Goa on Monday morning to pay tribute to Parrikar. He left for Goa soon after the Union Cabinet meeting, which was convened to condole the demise of the former Defence Minister.","date":"2019-03-18 12:04:28","pin":"0","status":"1"},{"title":"Goa Speaker Pramod Sawant likely to emerge as Parrikar's successor","content":"<p>Sawant is a young and dynamic leader who was trusted by Parrikar with the Speaker's job in the house where defection is a usual thing. But, more than that, while he was bedridden, Parrikar always used to send Sawant to attend various public functions in his own place. <a href=\"http:\/\/www.newindianexpress.com\/nation\/2019\/mar\/18\/goa-speaker-pramod-sawant-likely-to-emerge-as-manohar-parrikars-successor-sources-1952643.html\" target=\"_blank\"><strong>(READ FULL STORY HERE)<\/strong><\/a><\/p>","date":"2019-03-18 12:18:14","pin":"0","status":"1"},{"title":"All 14 Congress MLAs in Goa to meet Governor to stake claim to form government","content":"The party had already submitted a letter to the Goa Governor Mridula Sinha saying that in view of Mr Parrikar's death, BJP has no allies to rule in the state.","date":"2019-03-18 12:32:04","pin":"0","status":"1"},{"title":"Digambar Kamat not in Goa amid rumours of him joining BJP","content":"Senior Congress leader Digambar Kamat left for New Delhi on Sunday, amid speculation that he may join the ruling BJP, though the former chief minister denied any such move. Speculations were rife that Kamat may be inducted into the BJP and given a major position in the state government.","date":"2019-03-18 12:33:52","pin":"0","status":"1"},{"title":"Decision on next CM by 2 pm; swearing in after 3 pm on Monday: Goa BJP chief","content":"<p>The development comes amid the series of meetings undertaken by Union Minister Nitin Gadkari with state alliance partners.<\/p>","date":"2019-03-18 12:52:55","pin":"0","status":"1"},{"title":"Pramod Sawant, Vishwajit Rane front-runners for Goa CM'S post: BJP sources","content":"Vishwajeet is son of former Goa CM and Congress leader Pratapsingh Rane who joined BJP before assembly elections.","date":"2019-03-18 12:59:42","pin":"0","status":"1"},{"title":"Clarity on next Goa CM by 2 pm: Goa BJP president Vinay Tendulkar","content":"<p>Tendulkar made the above statement after meeting Union minister and senior BJP leader Nitin Gadkari at a hotel near Panaji over the issue.\"The decision on chief ministerial candidate is yet to be taken. But the picture will be clear by 2 pm,\" Tendulkar said, adding that the new chief minister would be sworn in after 3 pm Monday.Tendulkar met Gadkari along with Assembly Speaker Pramod Sawant, who is a contender for the top post.<\/p>","date":"2019-03-18 01:16:55","pin":"0","status":"1"},{"title":"Congress delegation meets Goa Governor, stakes claim","content":"<blockquote class=\"twitter-tweet\" data-lang=\"en\">\n<p lang=\"en\" dir=\"ltr\"><a href=\"https:\/\/twitter.com\/hashtag\/Goa?src=hash&ref_src=twsrc%5Etfw\">#Goa<\/a>: Congress delegation meets Governor Mridula Sinha in Panaji. <a href=\"https:\/\/t.co\/pjQhHcwHxx\">pic.twitter.com\/pjQhHcwHxx<\/a><\/p>\n— ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1107552847716077568?ref_src=twsrc%5Etfw\">March 18, 2019<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2019-03-18 01:41:17","pin":"0","status":"1"},{"title":"Here is what Congress says after meeting Governor","content":"Party leader Chandrakant Kavlekar says, \"We met the Governor&staked claim to form government as we are the single largest party in the state. We have 14 MLAs and we should be given the chance to form the government. We have told that we will prove majority. Saddened by demise of Goa CM.\"","date":"2019-03-18 01:42:36","pin":"0","status":"1"},{"title":"MGP's executive committee to decide on support to Goa government","content":"<p>MGP leader Sudin Dhavalikar met Union minister and senior BJP leader Nitin Gadkari at a hotel near Panaji to discuss the political situation in the state following the death of chief minister Manohar Parrikar.<\/p>","date":"2019-03-18 02:13:50","pin":"0","status":"1"},{"title":"Looking back at BJP-MGP relationship in Goa and rise of Manohar Parrikar","content":"Maharashtravadi Gomantak Party (MGP) was the sole party to represent Hindus till 1989 and the BJP wasn't really willing to grow at the expense of the age-old party by leading a division of Hindu votes in Goa. However, a chance interaction between Manohar Parrikar and the then union minister MGP's Ramakant Khalap changed the course. (READ HERE)","date":"2019-03-18 02:14:27","pin":"0","status":"1"},{"title":"How Parrikar ended a mess workers' strike in IIT-Bombay","content":"<p>Maharashtravadi Gomantak Party (MGP) was the sole party to represent Hindus till 1989 and the BJP wasn't really willing to grow at the expense of the age-old party by leading a division of Hindu votes in Goa. However, a chance interaction between Manohar Parrikar and the then union minister MGP's Ramakant Khalap changed the course. (<a href=\"http:\/\/www.newindianexpress.com\/nation\/2019\/mar\/18\/looking-back-at-bjp-mgp-relationship-in-goa-and-rise-of-manohar-parrikar-1952674.html\" target=\"_blank\"><strong>READ HERE<\/strong><\/a>)<\/p>","date":"2019-03-18 02:15:49","pin":"0","status":"1"},{"title":"Prime Minister Narendra Modi pay last respects to Goa CM Manohar Parrikar","content":"<p> <\/p>\n<p><img src=\"http:\/\/cms.newindianexpress.com\/FCKeditor\/fckeditor_img\/D17e_5vW0AA12i7.jpg\" width=\"500\" height=\"281\" alt=\"\" \/><\/p>\n<p><img src=\"\/FCKeditor\/fckeditor_img\/D17fBAoWsAAIQZj.jpg\" width=\"500\" height=\"281\" alt=\"\" \/><\/p>","date":"2019-03-18 02:40:19","pin":"0","status":"1"},{"title":"PM Modi and Defence Minister Nirmala Sitharaman meet Parrikar's family","content":"<blockquote class=\"twitter-tweet\" data-lang=\"en-gb\">\n<p lang=\"in\" dir=\"ltr\">Prime Minister Narendra Modi, Defence Minister Nirmala Sitharaman and Governor Mridula Sinha meet family of Goa CM <a href=\"https:\/\/twitter.com\/hashtag\/ManoharParrikar?src=hash&ref_src=twsrc%5Etfw\">#ManoharParrikar<\/a>,  in Panaji. <a href=\"https:\/\/t.co\/X11DkUJofU\">pic.twitter.com\/X11DkUJofU<\/a><\/p>\n— ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1107568843399065601?ref_src=twsrc%5Etfw\">18 March 2019<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2019-03-18 02:44:52","pin":"0","status":"1"},{"title":"One of the 12 BJP MLAs should lead Goa:  BJP's Glenn Ticlo ","content":"<p>BJP MLA Glenn Ticlo opined that one of the 12 BJP MLAs should lead Goa, following the demise of Chief Minister Manohar Parrikar.  Ticlo's reaction came after the opposition Congress, which is the single largest party in the 40-member Goa assembly, <strong><a href=\"http:\/\/www.newindianexpress.com\/nation\/2019\/mar\/18\/congress-mlas-meet-goa-governor-stake-claim-to-form-government-1952680.html\" target=\"_blank\">wrote to Governor Mridula Sinha<\/a><\/strong>, the third time in past two days to stake claim to form government in the state.<\/p>","date":"2019-03-18 03:03:37","pin":"0","status":"1"},{"title":"Union Minister Smriti Irani gets emotional as she pays last respects to Goa CM Parrikar","content":"<p> <img src=\"http:\/\/cms.newindianexpress.com\/FCKeditor\/fckeditor_img\/D17lWUEVAAEGs6I.jpg\" width=\"500\" height=\"281\" alt=\"\" \/><\/p>\n<p>Smriti Irani pays last respect to Goa CM (Photo | ANI)<\/p>","date":"2019-03-18 03:08:50","pin":"0","status":"1"},{"title":"Haryana declares one-day state mourning as a mark of respect to Parrikar","content":"<p>As a mark of respect to Goa Chief Minister Manohar Parrikar, who died of pancreatic cancer on Sunday, the Haryana government declared a one-day state mourning. \"The national flag will fly at half-mast on March 18,\" an order issued by Haryana Chief Secretary's office said.<\/p>","date":"2019-03-18 03:13:27","pin":"0","status":"1"},{"title":"An artist pays his last respects to late Goa Chief Minister through charcoal portrait","content":"<blockquote class=\"twitter-tweet\" data-lang=\"en-gb\">\n<p lang=\"en\" dir=\"ltr\">An artist from Amroha, Mohammad Zuhaib, pays his last respects to late Goa Chief Minister <a href=\"https:\/\/twitter.com\/hashtag\/ManoharParrikar?src=hash&ref_src=twsrc%5Etfw\">#ManoharParrikar<\/a> by making a charcoal portrait. <a href=\"https:\/\/t.co\/QsZUuB8wYZ\">pic.twitter.com\/QsZUuB8wYZ<\/a><\/p>\n— ANI UP (@ANINewsUP) <a href=\"https:\/\/twitter.com\/ANINewsUP\/status\/1107583022356815872?ref_src=twsrc%5Etfw\">18 March 2019<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2019-03-18 03:40:54","pin":"0","status":"1"},{"title":"Shigmo festival cancelled in wake of Goa CM's death","content":"<p>The Goa Tourism Department on Monday cancelled the traditional Shigmo festivities (spring festival), scheduled to be held from March 21, in view of the demise of Chief Minister Manohar Parrikar on Sunday. <\/p>","date":"2019-03-18 04:00:45","pin":"0","status":"0"},{"title":"Goa's Shigmo festival cancelled","content":"<p>The Goa Tourism Department on Monday cancelled the traditional Shigmo festivities, scheduled to be held from March 21, in view of the demise of Chief Minister Manohar Parrikar on Sunday. (<a href=\"http:\/\/www.newindianexpress.com\/nation\/2019\/mar\/18\/goas-shigmo-festival-cancelled-in-wake-of-manohar-parrikars-death-1952684.html\" target=\"_blank\"><strong>READ HERE<\/strong><\/a>)<\/p>","date":"2019-03-18 04:02:00","pin":"0","status":"1"},{"title":" Pramod Sawant to succeed Manohar Parrikar as Goa CM","content":"Amid political turmoil in Goa following the demise of Chief Minister Manohar Parrikar, the BJP on Monday picked Speaker of the Assembly, Pramod Sawant as his successor, according to Zee News. Sawant's name has been finalised for the CM post and the party will soon announce his name officialy, state BJP leaders confirmed.","date":"2019-03-18 04:14:40","pin":"0","status":"1"},{"title":" Wikipedia designates Pramod Sawant as Goa CM","content":"<p>Wikipedia has already designated Pramod Sawant new Goa chief minister. The encyclopaedia has edited page of Pramod Sawant calling him the Goa chief minister. \"The Chief Minister who succeeded ex-CM Manohar Parikkar, Dr. Pramod Sawant was born on 24 April 1973 to Pandurang and Padmini Sawant,\" the wiki page read.<\/p>","date":"2019-03-18 04:25:56","pin":"0","status":"1"},{"title":"Will prove majority to form government: Goa Congress leader","content":"<p>Leader of Opposition in Goa Assembly Chandrakant Kavlekar, who led the Congress delegation on Monday, told Governor Mridula Sinha that the party will prove majority to form the government in the state.<\/p>\n<p>\"We met the Governor and staked claim to form the government as we are the single largest party in the state. We have 14 MLAs and we should be given the chance to form the government. We have told that we will prove majority. We are saddened by the demise of Goa Chief Minister,\" Kavlekar told media after meeting the Governor.<\/p>","date":"2019-03-18 04:49:25","pin":"0","status":"1"},{"title":"","content":"<p><strong>Parrikar's funeral procession begins; thousands in cortege to bid him farewell<\/strong><\/p>","date":"2019-03-18 04:54:14","pin":"0","status":"1"},{"title":"","content":"<p><strong>Parrikar's funeral procession from Kala Academy to Miramar; last rites shortly<\/strong><\/p>","date":"2019-03-18 04:56:14","pin":"0","status":"0"},{"title":"Talks on with alliance partners: Nitin  Gadkari","content":"<p>Union minister Nitin Gadkari said BJP has decided on legislature wing leader,  issue only of allies.<\/p>","date":"2019-03-18 05:28:10","pin":"0","status":"1"},{"title":"","content":"<blockquote class=\"twitter-tweet\" data-lang=\"en\">\n<p lang=\"en\" dir=\"ltr\">Panaji: Visuals from the last rites ceremony of late Goa Chief Minister <a href=\"https:\/\/twitter.com\/hashtag\/ManoharParrikar?src=hash&ref_src=twsrc%5Etfw\">#ManoharParrikar<\/a>. <a href=\"https:\/\/t.co\/LrdsXHmRuB\">pic.twitter.com\/LrdsXHmRuB<\/a><\/p>\n— ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1107614960396361730?ref_src=twsrc%5Etfw\">March 18, 2019<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2019-03-18 05:40:41","pin":"0","status":"1"},{"title":"No consensus between BJP, allies yet on new Goa CM ","content":"<p>A consensus eluded the BJP and its allies on the next Goa CM following the demise of Manohar Parrikar, Union minister Nitin Gadkari has said.  The BJP, Gadkari said, had zeroed in on the next CM candidate but its allies in the state were yet to get on board.  There have been a series of meetings involving the Goa Forward Party and Maharashtrawadi Gomantak Party's three MLAs each, an equal number of Independents, and BJP legislators since late Sunday night to reach a consensus on Parrikar's successor.<\/p>","date":"2019-03-18 05:44:47","pin":"0","status":"1"},{"title":"Widows cancel Holi celebrations in Vrindavan to mourn Parrikar's death","content":"<p><img src=\"http:\/\/cms.newindianexpress.com\/FCKeditor\/fckeditor_img\/holi5.jpg\" width=\"600\" height=\"300\" alt=\"\" \/> <\/p>","date":"2019-03-18 05:46:02","pin":"0","status":"1"},{"title":"Parrikar laid to rest","content":"<p>Late Goa CM Manohar Parikkar was laid to rest on Monday, the four-time Goa CM was given a state funeral with full military honours.<\/p>\n<p><img src=\"http:\/\/cms.newindianexpress.com\/FCKeditor\/fckeditor_img\/D18J1ryU0AIgw-U.jpg\" width=\"500\" height=\"281\" alt=\"\" \/><\/p>","date":"2019-03-18 06:16:46","pin":"0","status":"1"},{"title":"Amit Shah, Nitin Gadkari and Pramod Sawant to hold meeting","content":"<blockquote class=\"twitter-tweet\" data-lang=\"en\">\n<p lang=\"en\" dir=\"ltr\">BJP President Amit Shah,Union Minister Nitin Gadkari and BJP Goa MLAs including Pramod Sawant arrive at a Hotel in Panaji for a meeting <a href=\"https:\/\/t.co\/Wu1DSmE2c2\">pic.twitter.com\/Wu1DSmE2c2<\/a><\/p>\n— ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1107626574046773248?ref_src=twsrc%5Etfw\">March 18, 2019<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2019-03-18 06:28:37","pin":"0","status":"1"},{"title":"Pramod Sawant appointed as new CM ","content":"<p>Goa assembly speaker, Pramod Sawant, has been appointed as the new Goa chief minister following the demise of Manohar Parrikar. (<strong><a href=\"http:\/\/www.newindianexpress.com\/nation\/2019\/mar\/18\/goa-speaker-pramod-sawant-likely-to-emerge-as-manohar-parrikars-successor-sources-1952643.html\" target=\"_blank\">READ HERE<\/a><\/strong>)<\/p>","date":"2019-03-18 06:45:40","pin":"0","status":"1"},{"title":"National flag at half-mast to mourn Parrikar's death","content":"<p><img src=\"http:\/\/cms.newindianexpress.com\/FCKeditor\/fckeditor_img\/PTI3_18_2019_000101B(1).jpg\" width=\"500\" height=\"314\" alt=\"\" \/><\/p>\n<p>New Delhi National flag is seen at half-mast to mourn the death of Goa Chief Minister Manohar Parrikar at Rashtrapati Bhawan in New Delhi Monday March 18 2019. (Photo | PTI)<\/p>","date":"2019-03-18 07:34:30","pin":"0","status":"1"},{"title":"Swearing in at 9 pm","content":"Goa Assembly Speaker Pramod Sawanth to be sworn in as chief minister at 9 PM","date":"2019-03-18 08:14:12","pin":"0","status":"1"},{"title":"","content":"<p><strong>Two MGP leader might shift to BJP<\/strong><\/p>","date":"2019-03-18 08:51:46","pin":"0","status":"1"},{"title":"Goa to have two deputy CMs?","content":"<p>Goa Forward Blocks 's VIjay Sardesai and MGP's Dhavlikar is expected to get Deputy CM's post.<\/p>","date":"2019-03-18 08:54:41","pin":"0","status":"1"},{"title":"Sawant on the way to Raj Bhawan.","content":"<p>Goa Speaker Promod Sawant is on his way to Raj Bhawan to submit the paper and is minutes away.<\/p>","date":"2019-03-18 09:17:32","pin":"0","status":"0"},{"title":"Swearing in ceremony postponed.","content":"<p>According to latest reports the swearing in ceremony will now be held at 11 pm. <\/p>","date":"2019-03-18 09:21:06","pin":"0","status":"1"},{"title":"We will stake claim in Goa, says Amit Shah","content":"<p>BJP president Amit Shah has said that the saffron party will form government in Goa once the decision on CM face is made.<\/p>","date":"2019-03-18 09:42:15","pin":"0","status":"1"},{"title":"BJP meeting in Goa ends.","content":"<p>Gadkari soon to address press conference. <\/p>","date":"2019-03-18 10:00:32","pin":"0","status":"1"},{"title":"Sudin Dhavalikar dropped as BJP manages two others from MGP.","content":"<p>Dhavlikar's name was speculated for the Deputy CM's post along with Goa Forward's Vijay Sardesai. <\/p>","date":"2019-03-18 10:35:10","pin":"0","status":"1"},{"title":"Sawant to take oath at 11 pm.","content":"<p>BJP is set to beat the Goa Governor's mid night deadline of having CM in place as Assembly Speaker Promod Sawant will take oath at 11 pm.<\/p>","date":"2019-03-18 10:39:35","pin":"0","status":"1"},{"title":"","content":"<p><strong>Pramod Sawant arrives at Raj Bhavan  to take oath as new Goa CM.<\/strong><\/p>","date":"2019-03-18 11:53:34","pin":"0","status":"1"},{"title":"Big responsibility on my shoulders, says Pramod Sawant","content":"<p>\"Whatever I am today it is Manohar Parrikar, he was the one who brought me into politics,\" said Sawant<\/p>","date":"2019-03-19 12:12:28","pin":"0","status":"1"},{"title":"Swearing in ceremony to take place shortly","content":"<p>Nitin Gadkari from BJP and leaders from Goa Forward Block and Maharashtravadi Gomantak Party are at Raj Bhavan to stake claim in Goa.<\/p>","date":"2019-03-19 12:35:57","pin":"0","status":"1"},{"title":"","content":"<p><strong>Packed house at Goa Raj Bhawan, leaders await for Governor's arrival.<\/strong><\/p>","date":"2019-03-19 12:48:07","pin":"0","status":"1"},{"title":"Pramod Sawant sworn in as Goa CM in post-midnight ceremony","content":"<p>At a much-delayed swearing-in ceremony, held around 2 am Tuesday, BJP's Pramod Sawant was sworn in as the new chief minister of Goa.<\/p>","date":"2019-03-19 02:23:24","pin":"0","status":1},{"title":"Eleven MLAs sworn in as ministers","content":"<p>Eleven MLAs, part of Parrikar-led cabinet, also sworn in as ministers.<\/p>","date":"2019-03-19 02:25:46","pin":"0","status":1}]}