{"details":[{"title":" Jammu & Kashmir Reorganisation Bill passed by Rajya Sabha","content":"<p>The Jammu and Kashmir Reorganisation Bill, 2019 was passed by the Parliament Monday with the support of 121 MPs, paving way for the bifurcation of the state of Jammu and Kashmir into the Union Territories of Jammu and Kashmir and Ladakh.<\/p>\n<p><a href=\"http:\/\/www.newindianexpress.com\/nation\/2019\/aug\/06\/its-patel-20-2014843.html\" target=\"_blank\"><strong>READ FULL REPORT<\/strong><\/a><\/p>","date":"2019-08-06 11:22:24","pin":"0","status":"1"},{"title":"TNIE EDITORIAL: Bold attempt to change the Kashmir story","content":"<p>On the face of it, it needs to be welcomed on more than one ground though the implications will be known only as time rolls on and the fallout would largely depend on what the Indian government does to genuinely integrate Kashmiris with the rest of the Union, an objective that it says could not be achieved owing to the special privileges accorded under Article 370.<\/p>\n<p><a href=\"http:\/\/www.newindianexpress.com\/opinions\/editorials\/2019\/aug\/06\/bold-attempt-to-change-the-kashmir-story-2014819.html\" target=\"_blank\"><strong>READ FULL EDITORIAL HERE<\/strong><\/a><\/p>","date":"2019-08-06 11:24:32","pin":"0","status":"1"},{"title":"Sensex rebounds over 200 pts; Nifty above 10,900","content":"<p>Domestic equity benchmark BSE Sensex rebounded over 200 points and the NSE Nifty reclaimed the 10,900 level in early trade on Tuesday led by gains in banking and auto stocks. The 30-share index was trading 214.96 points, or 0.59 per cent, higher at 36,914.80 <\/p>\n<p>Similarly, the broader NSE Nifty was quoting 68.65 points, or 0.63 per cent, up at 10,931.25.<\/p>\n<p>In the previous session on Monday, both benchmark indices saw an intense volatility throughout the session due to multiple headwinds like escalation in US-China trade war, weak corporate earnings, rupee downfall and political tensions in Jammu and Kashmir. <\/p>","date":"2019-08-06 11:27:17","pin":"0","status":"1"},{"title":"","content":"<blockquote class=\"twitter-tweet\">\n<p lang=\"en\" dir=\"ltr\">Celebrations in Leh after Ladakh was made a Union Territory yesterday. <a href=\"https:\/\/t.co\/kAiFbDiULC\">pic.twitter.com\/kAiFbDiULC<\/a><\/p>\n— ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1158614811829317632?ref_src=twsrc%5Etfw\">August 6, 2019<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2019-08-06 11:27:50","pin":"0","status":"1"},{"title":"Congress' Adhir Ranjan Chowdhury in Lok Sabha ","content":"<p>Adhir Ranjan Chowdhury, Congress, in Lok Sabha: You say that it is an internal matter. But it is being monitored since 1948 by the UN, is that an internal matter? We signed Shimla Agreement & Lahore Declaration, what that an internal matter or bilateral?<br \/>\n <\/p>","date":"2019-08-06 11:28:35","pin":"0","status":"1"},{"title":"'Can J&K still be an internal matter'","content":"<p>Adhir Ranjan Chowdhury, Congress, in Lok Sabha: S Jaishankar told Mike Pompeo a few days before that Kashmir is a bilateral matter, so don't interfere in it. Can J&K still be an internal matter? We want to know. Entire Congress party wants to be enlightened by you. <\/p>","date":"2019-08-06 11:29:04","pin":"0","status":"1"},{"title":"Will die for Kashmir: Amit Shah","content":"<p> Amit Shah: Jammu & Kashmir is an integral part of Union of India. The border of Kashmir includes PoK too. We will die for it!<\/p>","date":"2019-08-06 11:30:20","pin":"0","status":"1"},{"title":"","content":"<p>Each time I have raised J&K in the Parliament, I have stressed upon the fact that Pakistan occupied Kashmir and Aksai Chin are a part of the state. Parliament has the right to make laws on Jammu and Kashmir: Amit Shah in LS<\/p>","date":"2019-08-06 11:36:45","pin":"0","status":"1"},{"title":"A Kashmiri writes: ‘I grew up not knowing what is the meaning of normal","content":"<p>It is a curse to be born in a place with so many uncertainties and armed militancy. Since the very beginning I developed a fear of several things. I was young and the only idea I had about Kashmir and India was through the prism of armed men, writes Rahiba R Parveen.<\/p>\n<p><a href=\"http:\/\/www.newindianexpress.com\/nation\/2019\/aug\/06\/a-kashmiri-writes-i-grew-up-not-knowing-what-is-the-meaning-of-normal-2014850.html\" target=\"_blank\"><strong>READ FULL STORY HERE <\/strong><\/a><\/p>","date":"2019-08-06 11:41:32","pin":"0","status":"1"},{"title":"Do you know about the Tamil Nadu man who drafted Article 370?","content":"<p><iframe width=\"100%\" height=\"450\" src=\"https:\/\/www.youtube.com\/embed\/TjjbpLBUX6o\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\"><\/iframe><\/p>\n<p>Not much is known about the man who drafted the controversial article of the constitution - <strong><a href=\"http:\/\/www.newindianexpress.com\/nation\/2019\/aug\/05\/do-you-know-about-the-tamil-nadu-man-who-drafted-article-370-2014452.html\" target=\"_blank\">Sir Narasimha Ayyangar Gopalaswami Ayyangar.<\/a><\/strong><\/p>","date":"2019-08-06 11:44:02","pin":"0","status":"1"},{"title":"US calls on all parties to maintain peace and stability along LoC","content":"<p>US State Dept. spokesperson Morgan Ortagus: We are closely following the events in the state of Jammu and Kashmir. We take note of India’s announcement revising the constitutional status of Jammu and Kashmir and India’s plan to split the state into two union territories. We note that Indian government described these actions as strictly an internal matter.We're concerned about reports of detentions and urge respect for individual rights and discussion with those in affected communities. Call on all parties to maintain peace and stability along LoC. <\/p>","date":"2019-08-06 11:50:49","pin":"0","status":"1"},{"title":"","content":"<blockquote class=\"twitter-tweet\">\n<p lang=\"en\" dir=\"ltr\">General Officer Commanding in Chief,Northern Command, Lt Gen Ranbir Singh chaired a meeting of the Core Group of Intelligence&Security agencies at Srinagar today,to review the operational readiness.He said,\"necessary security arrangements put in place for ensuring peace&security\" <a href=\"https:\/\/t.co\/0wEuy9yhLu\">pic.twitter.com\/0wEuy9yhLu<\/a><\/p>\n— ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1158622927434203138?ref_src=twsrc%5Etfw\">August 6, 2019<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2019-08-06 11:52:02","pin":"0","status":"1"},{"title":"","content":"<p>UPA government carried out the bifurcation of Andhra Pradesh with complete concurrence of the state legislative assembly. In the past, it was Jawaharlal Nehru's government which protected J&K from Pakistan: Congress leader Manish Tewari <\/p>","date":"2019-08-06 12:00:59","pin":"0","status":"1"},{"title":"'It's a historic decision'","content":"<p>Aditi Singh, Congress MLA from Raebareli Sadar: I'm in absolute support of the decision taken. It will help in integrating J&K into the mainstream. It's a historic decision. It should not be politicised. As an MLA, in my capacity, I welcome this decision. <\/p>","date":"2019-08-06 12:07:05","pin":"0","status":"1"},{"title":"What message are you sending to NE states: Manish Tewari","content":"<p>Indian constitution does not have only #Article370. It also has Article 371 A to I. They provide special rights to Nagaland, Assam, Manipur, Andhra, Sikkim etc. Today when you're scrapping Article 370,what message are you sending to these states: Manish Tewari <\/p>","date":"2019-08-06 12:08:47","pin":"0","status":"1"},{"title":"Will you revoke Article 371 tomorrow, asks Manish Tewari ","content":"<p>That you can revoke Article 371 tomorrow? By imposing President's rule in the north eastern states, and using the rights of their Assemblies in the Parliament, you can scrap Article 371 too? What kind of Constitutional Precedent are you setting in the country: Manish Tewari <\/p>","date":"2019-08-06 12:11:45","pin":"0","status":"1"},{"title":"Speaker should protect the members: Dayanidhi Maran","content":"<blockquote class=\"twitter-tweet\">\n<p lang=\"en\" dir=\"ltr\">DMK MP, Dayanidhi Maran in Lok Sabha: Mr Farooq Abdullah, a member of this House is missing. He is arrested. We have no intimation. You as a Speaker should protect the members. You should be neutral. <a href=\"https:\/\/t.co\/rxvBHBwGHH\">pic.twitter.com\/rxvBHBwGHH<\/a><\/p>\n— ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1158628277478670338?ref_src=twsrc%5Etfw\">August 6, 2019<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2019-08-06 12:13:31","pin":"0","status":"1"},{"title":"First time in history a state has been converted into UT: Manish Tewari","content":"<p>In last 70 yrs, several times we saw demands that union territories be converted into states but this is probably the first time in history that a state has been converted into union territory. There cannot be a bigger blow to federal structure than this: Manish Tewari <\/p>","date":"2019-08-06 12:14:46","pin":"0","status":"1"},{"title":"","content":"<p>The government should have conducted assembly polls in such a scenario in J&K. Security problems have not been solved. People on the borders are not safe,\" says DMK's T R Baalu. <\/p>","date":"2019-08-06 12:45:05","pin":"0","status":"1"},{"title":"This nation is made by its people, not plots of land: Rahul Gandhi","content":"<blockquote class=\"twitter-tweet\">\n<p lang=\"en\" dir=\"ltr\">National integration isn’t furthered by unilaterally tearing apart J&K, imprisoning elected representatives and violating our Constitution. This nation is made by its people, not plots of land.<br \/>\n<br \/>\nThis abuse of executive power has grave implications for our national security.<\/p>\n— Rahul Gandhi (@RahulGandhi) <a href=\"https:\/\/twitter.com\/RahulGandhi\/status\/1158635699186225153?ref_src=twsrc%5Etfw\">August 6, 2019<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2019-08-06 12:45:42","pin":"0","status":"1"},{"title":"","content":"<p>Ghulam Nabi Azad, when asked that some leaders of the party are supporting abrogation of  Article 370, says \"I have nothing to with those who do not know the history of either J&K or Congress. They should first read their histoty and then stay in Congress.\"<br \/>\n <\/p>","date":"2019-08-06 01:15:19","pin":"0","status":"1"},{"title":"Joint session on Kashmir disrupted as Imran Khan absent from Pakistan Parliament ","content":"<blockquote class=\"twitter-tweet\">\n<p lang=\"en\" dir=\"ltr\">Ruckus in Parliament of Pakistan as the Opposition objects to Prime Minister Imran Khan's absence from the joint session to hold a discussion on Kashmir. Session proceedings stopped even before starting as the Speaker left for his chamber. <a href=\"https:\/\/t.co\/eZrQfzvUM1\">pic.twitter.com\/eZrQfzvUM1<\/a><\/p>\n— ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1158639914944274437?ref_src=twsrc%5Etfw\">August 6, 2019<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2019-08-06 01:17:16","pin":"0","status":"1"},{"title":"","content":"<p>RSS leader Indresh Kumar Article 35A&370 revoked: Today's govt has done a Himalayan task. It is a big achievement of the country’s unity. Because the then Nehru govt took the Kashmir issue to the United Nations, this issue was escalated. It was a big mistake of Pandit Nehru&Congress <\/p>","date":"2019-08-06 01:59:29","pin":"0","status":"1"},{"title":"","content":"<blockquote class=\"twitter-tweet\">\n<p lang=\"en\" dir=\"ltr\">West Bengal CM, Mamata Banerjee: I have no information about Farooq Abdullah, Omar Abdullah and Mehbooba Mufti. I appeal to the government that they should not feel isolated. They are not terrorists. They should be released in the interest of the democratic institutions. <a href=\"https:\/\/t.co\/t6ydEA2HW5\">https:\/\/t.co\/t6ydEA2HW5<\/a><\/p>\n— ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1158649711827607552?ref_src=twsrc%5Etfw\">August 6, 2019<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2019-08-06 02:00:17","pin":"0","status":"1"},{"title":"Commoners in Kashmir have moved on: Jitendra Singh ","content":"<p>MoS Dr. Jitendra Singh says, \"The common man of Kashmir has moved on. Some of the politicians are stuck in the past.\"<\/p>\n<p>\"Kashmir issue is just a weapon in the hands of those who want the problem to continue,\" he claims. <\/p>","date":"2019-08-06 02:02:53","pin":"0","status":"1"},{"title":"","content":"<p>JDU walks out of Lok Sabha over J&K Re-organisation Bill<\/p>","date":"2019-08-06 02:03:08","pin":"0","status":"1"},{"title":"","content":"<p>Jammu and Kashmir policy planning group of Congress party to meet today. <\/p>","date":"2019-08-06 02:10:32","pin":"0","status":"1"},{"title":"","content":"<p>When the country is celebrating, Congress is speaking in the voice of Pakistan. Pakistan govt official statement said it's a dark day. Congress leaders have stated it's a dark day. What does it mean? Pakistan says it's a dark day and you're joining them, says BJP leader Pralhad Joshi. <\/p>","date":"2019-08-06 02:42:31","pin":"0","status":"1"},{"title":"","content":"<p>The situation in all three regions of Jammu and Kashmir is totally peaceful, amid unprecedented security cover and restrictions, top officials said on Tuesday. There are <strong><a href=\"http:\/\/www.newindianexpress.com\/nation\/2019\/aug\/06\/situation-totally-peaceful-in-jammu-and-kashmir-police-2014993.html\" target=\"_blank\">no untoward reports<\/a><\/strong> from anywhere in the state, Director General of Police Dilbagh Singh said from Srinagar. (PTI) <\/p>","date":"2019-08-06 02:47:44","pin":"0","status":"1"},{"title":"","content":"<blockquote class=\"twitter-tweet\">\n<p lang=\"en\" dir=\"ltr\">BSP MP Girish Chandra and TRS MP Nama Nageswara Rao support the Bill to revoke <a href=\"https:\/\/twitter.com\/hashtag\/Article370?src=hash&ref_src=twsrc%5Etfw\">#Article370<\/a> , in Lok Sabha. <a href=\"https:\/\/t.co\/LLhG3ipXYG\">pic.twitter.com\/LLhG3ipXYG<\/a><\/p>\n— ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1158667249638617089?ref_src=twsrc%5Etfw\">August 6, 2019<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2019-08-06 02:48:35","pin":"0","status":"1"},{"title":"","content":"<blockquote class=\"twitter-tweet\">\n<p lang=\"en\" dir=\"ltr\">BSP MP Girish Chandra and TRS MP Nama Nageswara Rao support the Bill to revoke <a href=\"https:\/\/twitter.com\/hashtag\/Article370?src=hash&ref_src=twsrc%5Etfw\">#Article370<\/a> , in Lok Sabha. <a href=\"https:\/\/t.co\/LLhG3ipXYG\">pic.twitter.com\/LLhG3ipXYG<\/a><\/p>\n— ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1158667249638617089?ref_src=twsrc%5Etfw\">August 6, 2019<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2019-08-06 02:48:36","pin":"0","status":"1"},{"title":"","content":"<p>Nationalist Congress Party (NCP) Supriya Sule, \"I sit on seat 462, Farooq Abdullah sits on seat 461. He's elected from J&K, we can't hear him today.This debate will be incomplete if you ask me.\"\nIn response, Home Minister says,\"Farooq Abdullah has neither been detained nor arrested. He's at his home,out of his own free will.\"<\/p>","date":"2019-08-06 02:50:54","pin":"0","status":"1"},{"title":"","content":"<p>Indian High Commission in Pakistan asks Pakistani authorities to tighten up security around its premises: Sources <\/p>","date":"2019-08-06 02:51:31","pin":"0","status":"1"},{"title":"","content":"<p>Two days ago, the Governor said he doesn't know what is going to happen. We don't know what is happening there. Are the people in the region there happy or sad? Governor says what the Centre tells him to: Samajwadi Party leader Akhilesh Yadav <\/p>","date":"2019-08-06 03:10:00","pin":"0","status":"1"},{"title":"Article 370 promoted 'disharmony', needed to be changed: Syama Prasad nephew","content":"<p>The nephew of Bharatiya Jana Sangh founder Syama Prasad Mookerjee said on Tuesday that the provisions of Article 370 of the Constitution was \"promoting disharmony\" among the people and needed to be changed. Expressing happiness at the scrapping of provisions of Article 370 that accorded special status to Jammu and Kashmir, Justice (retired) Chittatosh Mookerjee said his uncle had died for this cause and it should have happened long ago.<\/p>\n<p><a href=\"http:\/\/www.newindianexpress.com\/nation\/2019\/aug\/06\/article-370-promoted-disharmony-needed-to-be-changed-syama-prasad-mookerjee-nephew-2015007.html\" target=\"_blank\"><strong>READ FULL REPORT<\/strong><\/a><\/p>","date":"2019-08-06 03:22:56","pin":"0","status":"1"},{"title":"","content":"<blockquote class=\"twitter-tweet\">\n<p lang=\"en\" dir=\"ltr\">Kashmir’s mainstream political leaders have been jailed at secret locations. <br \/>\n<br \/>\nThis is unconstitutional & undemocratic. <br \/>\n<br \/>\nIt’s also short sighted and foolish because it will allow terrorists to fill the leadership vaccum created by GOI. <br \/>\n<br \/>\nThe imprisoned leaders must be released.<\/p>\n— Rahul Gandhi (@RahulGandhi) <a href=\"https:\/\/twitter.com\/RahulGandhi\/status\/1158674735460282368?ref_src=twsrc%5Etfw\">August 6, 2019<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2019-08-06 03:37:27","pin":"0","status":"1"},{"title":"","content":"<p>Anantnag MP Hasnain Masoodi: Article 370 abrogation is illegal. What authority the government has to do this. He informs the Lower House of a bandh in Kargil today. <\/p>","date":"2019-08-06 03:39:32","pin":"0","status":"1"},{"title":"","content":"<p>I was detained in my house. Sad that Home Minister of India can lie like this. : Former Jammu and Kashmir Chief Minister Farooq Abdullah speaks to NDTV. <\/p>","date":"2019-08-06 03:43:50","pin":"0","status":"1"},{"title":"Article 370 benefited only 2 parties: Ladakh MP","content":"<p>BJP MP from Ladakh Jamyand Namgyal: What do people know about Ladakh? People here have been asking for a UT for the last 71 years. The district presidents of PDP and NC who wanted UT were expelled from their respective parties. Ladakh never wanted to be with Kashmir. Article 370 has benefitted only two families. Only Narendra Modi gave Ladakh a Central University. <\/p>","date":"2019-08-06 03:50:05","pin":"0","status":"1"},{"title":"","content":"<p> Lok Janshakti Party (LJSP) leader Chirag Paswan says that India is finally united.<\/p>","date":"2019-08-06 04:01:55","pin":"0","status":"1"},{"title":"","content":"We all remember the last time PM unleashed a decision to the nation which was also initially applauded for his decisiveness,just like today&that was the disaster of demonetisation. Nation is still dealing with devastating consequences of that action: Shashi Tharoor <blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Shashi Tharoor, Congress: Why we think it is indeed a black day? Because two former J&K CMs Omar Abdullah&Mehbooba Mufti are under arrest & the whereabouts of our own colleague Farooq Abdullah are still unclear. We still want to know where he is? <a href=\"https:\/\/t.co\/Wdouz2LKDP\">pic.twitter.com\/Wdouz2LKDP<\/a><\/p>— ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1158687249233588225?ref_src=twsrc%5Etfw\">August 6, 2019<\/a>\n<\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2019-08-06 04:05:20","pin":"0","status":"1"},{"title":"Why would I stay inside my house on my own will when my state is being burnt: Farooq Abdullah","content":"<p>Farooq Abdullah, National Conference in Srinagar: Why would I stay inside my house on my own will when my state is being burnt, when my people are being executed in jails? This is not the India I believe in.  <\/p>","date":"2019-08-06 04:09:20","pin":"0","status":"1"},{"title":"This is not my India: Farooq Abdullah","content":"<blockquote class=\"twitter-tweet\">\n<p lang=\"en\" dir=\"ltr\"><a href=\"https:\/\/twitter.com\/hashtag\/WATCH?src=hash&ref_src=twsrc%5Etfw\">#WATCH<\/a>: National Conference leader & J&K Former CM Farooq Abdullah: Home Ministry is lying in the Parliament that I'm not house-arrested, that I am staying inside my house at my own will. <a href=\"https:\/\/twitter.com\/hashtag\/Article370?src=hash&ref_src=twsrc%5Etfw\">#Article370<\/a> <a href=\"https:\/\/t.co\/OXzHjEmTnx\">pic.twitter.com\/OXzHjEmTnx<\/a><\/p>\n— ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1158690532564111361?ref_src=twsrc%5Etfw\">August 6, 2019<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2019-08-06 04:17:20","pin":"0","status":"1"},{"title":"","content":"<p>Pakistan Army chief General Qamar Javed Bajwa on Tuesday said that his troops are prepared to \"go to any extent\" to help Kashmiris.<\/p>\n<p><a href=\"http:\/\/www.newindianexpress.com\/world\/2019\/aug\/06\/army-prepared-to-go-any-extent-to-help-kashmiris-pakistan-army-chief-general-bajwa-2015022.html\" target=\"_blank\"><strong>READ FULL REPORT <\/strong><\/a><\/p>","date":"2019-08-06 04:21:09","pin":"0","status":"1"},{"title":"My son is in jail: Farooq Abdullah","content":"<p>As soon as the gate will open & our people will be out, we will fight, we'll go to the court. We're not gun-runners, grenade-throwers, stone-throwers, we believe in peaceful resolutions. They want to murder us. My son (Omar Abdullah) is in jail. <\/p>","date":"2019-08-06 04:32:08","pin":"0","status":"1"},{"title":"Cannot bring Farooq Abdullah here on gunpoint: Amit Shah","content":"<p>Home Minister Amit Shah in Lok Sabha: I have made it clear thrice, Farooq Abdullah ji is at his home, he is not under house arrest, he is not under detention. He is in good health and spirit. If he doesn't wish to come to the Parliament, we cannot bring him here on gunpoint. <\/p>","date":"2019-08-06 04:33:57","pin":"0","status":"1"},{"title":"","content":"<p>Committee of Administrators (COA) Chief, Vinod Rai: Jammu and Kashmir will continue to play as Jammu & Kashmir and Ladakh will be a part of J&K.  <\/p>\n<p><a href=\"http:\/\/www.newindianexpress.com\/sport\/cricket\/2019\/aug\/06\/players-from-ladakh-can-represent-jammu-and-kashmir-for-now-in-ranji-vinod-rai-2014976.html\" target=\"_blank\"><strong>READ FULL REPORT<\/strong><\/a><\/p>","date":"2019-08-06 04:36:08","pin":"0","status":"1"},{"title":"","content":"<p>Telugu Desam Party MP Jayadev Galla in Lok Sabha: Our leader Chandrababu Naidu & our party support the proposed reorganisation of the state of Jammu & Kashmir. Complete integration of J&K into India will be one nation with one flag & one constitution. <\/p>","date":"2019-08-06 04:36:37","pin":"0","status":"1"},{"title":"","content":"<p>I'm saying it for the 4th time, and I've the patience to say it for the 10th time. Farooq Abdullah has neither been detained nor arrested. If he isn't well, doctors will take him to hospital. House shouldn't worry. If he wasn't well, he would not have come out: Amit Shah <\/p>","date":"2019-08-06 04:37:45","pin":"0","status":"1"},{"title":"","content":"<p>A petition was filed in the Supreme Court Tuesday challenging the Presidential order on Article 370 which revokes the special status given to Jammu and Kashmir.<\/p>\n<p><a href=\"http:\/\/www.newindianexpress.com\/nation\/2019\/aug\/06\/plea-in-supreme-court-challenging-presidential-order-on-article-370-2015040.html\" target=\"_blank\"><strong>READ FULL REPORT <\/strong><\/a><\/p>","date":"2019-08-06 05:05:39","pin":"0","status":"1"},{"title":"","content":"<p>Government of Pakistan considering to call back High Commissioner from India. High Commissioner designate of Pakistan to India is already in Pakistan, he is to take charge on 16th August. However, Acting High Commissioner to India can be called back for Consultations: Pakistan media <\/p>","date":"2019-08-06 05:20:57","pin":"0","status":"1"},{"title":"","content":"<blockquote class=\"twitter-tweet\">\n<p lang=\"en\" dir=\"ltr\">Asaduddin Owaisi in Lok Sabha: I stand to oppose the bill. Definitely BJP has lived up to electoral promise in their manifesto, but you have not lived up to your constitutional duties. You've indulged in breach of a constitutional promise <a href=\"https:\/\/twitter.com\/hashtag\/Article370?src=hash&ref_src=twsrc%5Etfw\">#Article370<\/a> <a href=\"https:\/\/t.co\/YVk7ivxgFH\">pic.twitter.com\/YVk7ivxgFH<\/a><\/p>\n— ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1158702105181458432?ref_src=twsrc%5Etfw\">August 6, 2019<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2019-08-06 05:22:12","pin":"0","status":"1"},{"title":"Should Kashmiris sacrifice themselves this Eid: Owaisi","content":"<p>What will happen on Eid? Eid is on Monday. Are you assuming that Kashmiris instead of sacrificing lamb should sacrifice themselves? If you want that I'm sure they'll do that, they've been doing that: Asaduddin Owaisi <\/p>","date":"2019-08-06 05:23:38","pin":"0","status":"1"},{"title":"Will take Kashmir case to UN: Imran Khan","content":"<p>Pakistan Prime Minister Imran Khan at the Joint Session of Parliament: We will take the case of Kashmir to the United Nations & apprise the International community of the treatment of minorities in India under the racist ideology of the BJP.  <\/p>","date":"2019-08-06 06:11:22","pin":"0","status":"1"},{"title":"","content":"<blockquote class=\"twitter-tweet\">\n<p lang=\"en\" dir=\"ltr\">RS Prasad in Lok Sabha: The Honourable President was having a bath & he said at least spare me to take my bath, don't bring ordinance at this moment (in the cartoon), we didn't do anything like that. You imposed emergency at first, then told the cabinet. 2\/2 <a href=\"https:\/\/t.co\/3vRpnSo2ZF\">https:\/\/t.co\/3vRpnSo2ZF<\/a><\/p>\n— ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1158715548571721728?ref_src=twsrc%5Etfw\">August 6, 2019<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2019-08-06 06:14:13","pin":"0","status":"1"},{"title":"","content":"<p>Ravi Shankar Prasad in Lok Sabha: Today the people from the opposition who are talking about #Article370, did they speak when Human Rights were being violated in Pak occupied Kashmir? Even today Human Rights are violated in PoK. These are bigger questions. <\/p>","date":"2019-08-06 06:14:41","pin":"0","status":"1"},{"title":"","content":"<p>BJP MP Prahlad Joshi in Lok Sabha: I request you to extend the time of the house till this Bill is completed. Also, as per schedule, you are supposed to finalise tomorrow, but since 99% of the business is over, I request you to finalise today. <\/p>","date":"2019-08-06 06:14:59","pin":"0","status":"1"},{"title":"","content":"<p>Amit Shah in Lok Sabha: Who took Kashmir to the United Nations, it was Pandit Jawaharlal Nehru. History will decide if this decision (to revoke 370) is right or not, but whenever it will be discussed, PM Narendra Modi will be remembered by the people <\/p>","date":"2019-08-06 06:15:20","pin":"0","status":"1"},{"title":"","content":"<blockquote class=\"twitter-tweet\">\n<p lang=\"en\" dir=\"ltr\">MEA: So far as India-China Boundary Question is concerned, the 2 sides have agreed to a fair, reasonable&mutually acceptable settlement of boundary question on the basis of Political Parameters & Guiding Principles for Settlement of India-China Boundary Question. <a href=\"https:\/\/t.co\/92lpq606LC\">https:\/\/t.co\/92lpq606LC<\/a><\/p>\n— ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1158721199230324736?ref_src=twsrc%5Etfw\">August 6, 2019<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2019-08-06 06:23:15","pin":"0","status":"1"},{"title":"We are correcting the historical mistake: Amit Shah","content":"<p>HM in Lok Sabha: Asaduddin Owaisi said we're going to commit a historical mistake.We're not going to commit a historical mistake, we're going to correct one. After 5 yrs, seeing development in J&K under leadership of PM Modi, ppl of valley will understand drawbacks of Article 370 <\/p>","date":"2019-08-06 06:33:35","pin":"0","status":"1"},{"title":"","content":"<p>The curfew wasn't put in place because the law and order situation has deteriorated. It is precautionary, it has been put in place so the situation doesn't deteriorate: Amit Shah <\/p>","date":"2019-08-06 06:38:04","pin":"0","status":"1"},{"title":"Resolution revoking Article 370 passed in Lok Sabha","content":"<p><strong>Result of the voting on revoking of special status of Jammu and Kashmir Reorganisation Bill: 366 supported the bill, while 66 voted against the bill.<\/strong><\/p>\n\n<blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Resolution revoking Article 370 from Jammu &amp; Kashmir passed in Lok Sabha <a href=\"https:\/\/t.co\/BhDpDJV0Bs\">pic.twitter.com\/BhDpDJV0Bs<\/a><\/p>&mdash; ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1158733287168327680?ref_src=twsrc%5Etfw\">August 6, 2019<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2019-08-06 07:20:52","pin":"0","status":"0"},{"title":"Resolution revoking Article 370 passed by Lok Sabha","content":"<p>The resolution for abrogation of special status given to Jammu and Kashmir under Article 370 was passed in Lok Sabha — with 351 members in support and 72 against it. One member abstained from voting.<\/p>","date":"2019-08-06 07:31:30","pin":"0","status":"1"},{"title":"Lok Sabha passes Jammu and Kashmir Reorganisation Bill, 2019 ","content":"<p>The Lok Sabha cleared Jammu and Kashmir Reorganisation Bill, 2019 — with 351 Ayes, and 71 Noes. After re-voting, 66 MPs voted against while as 366 MPs voted in favour to pass the Bill.<\/p>","date":"2019-08-06 07:31:41","pin":"0","status":"1"},{"title":"","content":"After another round of re-voting in Lok Sabha, the Jammu and Kashmir Reorganisation Bill, 2019 was passed with 370 votes in favour of it, and 70 votes against it.\n\n<blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">The Jammu & Kashmir Reorganization Bill, 2019 has been passed by Lok Sabha with 370 'Ayes' & 70 'Noes' <a href=\"https:\/\/t.co\/aGZLwcdT3N\">https:\/\/t.co\/aGZLwcdT3N<\/a><\/p>— ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1158738406702141441?ref_src=twsrc%5Etfw\">August 6, 2019<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2019-08-06 07:33:30","pin":"0","status":"1"},{"title":"Congress leader Scindia backs Centre","content":"<blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">I support the move on <a href=\"https:\/\/twitter.com\/hashtag\/JammuAndKashmir?src=hash&amp;ref_src=twsrc%5Etfw\">#JammuAndKashmir<\/a> &amp; <a href=\"https:\/\/twitter.com\/hashtag\/Ladakh?src=hash&amp;ref_src=twsrc%5Etfw\">#Ladakh<\/a> and its full integration into union of India.<br><br>Would have been better if constitutional process had been followed. No questions could have been raised then. Nevertheless, this is in our country’s interest and I support this.<\/p>&mdash; Jyotiraditya M. Scindia (@JM_Scindia) <a href=\"https:\/\/twitter.com\/JM_Scindia\/status\/1158729410507182080?ref_src=twsrc%5Etfw\">August 6, 2019<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2019-08-06 07:36:45","pin":"0","status":1},{"title":"Government withdraws Jammu & Kashmir Reservation (Second Amendment) Bill 2019","content":"<p>Home Minister Amit Shah said he wanted to withdraw The Jammu &amp; Kashmir Reservation (Second Amendment) Bill 2019 because the integration of Jammu and Kashmir with India would make the legislation irrelevant.<\/p>","date":"2019-08-06 07:46:48","pin":"0","status":1},{"title":"","content":"<p>Lok Sabha adjourned sine die.<\/p>","date":"2019-08-06 07:47:29","pin":"0","status":1},{"title":"Passage of Jammu and Kashmir bills momentous occasion, new dawn awaits: PM Modi","content":"<blockquote class=\"twitter-tweet\">\n<p lang=\"en\" dir=\"ltr\">Our Home Minister <a href=\"https:\/\/twitter.com\/AmitShah?ref_src=twsrc%5Etfw\">@AmitShah<\/a> Ji has  been continuously working towards ensuring a better life for the people of Jammu, Kashmir and Ladakh. His commitment and diligence is clearly visible in the passage of these Bills. I would like to specially congratulate Amit Bhai! <a href=\"https:\/\/twitter.com\/HMOIndia?ref_src=twsrc%5Etfw\">@HMOIndia<\/a><\/p>\n&mdash; Narendra Modi (@narendramodi) <a href=\"https:\/\/twitter.com\/narendramodi\/status\/1158750396275257345?ref_src=twsrc%5Etfw\">August 6, 2019<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>   <blockquote class=\"twitter-tweet\">\n<p lang=\"en\" dir=\"ltr\">I salute my sisters and brothers of Jammu, Kashmir and Ladakh for their courage and resilience. For years, vested interest groups who believed in emotional blackmail never cared for people&rsquo;s empowerment. J&amp;K is now free from their shackles. A new dawn, better tomorrow awaits!<\/p>\n&mdash; Narendra Modi (@narendramodi) <a href=\"https:\/\/twitter.com\/narendramodi\/status\/1158747764756365315?ref_src=twsrc%5Etfw\">August 6, 2019<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2019-08-06 08:45:14","pin":"0","status":1},{"title":"","content":"<blockquote class=\"twitter-tweet\">\n<p lang=\"en\" dir=\"ltr\">Watch HM Shri <a href=\"https:\/\/twitter.com\/AmitShah?ref_src=twsrc%5Etfw\">@AmitShah<\/a>&rsquo;s reply on The Jammu and Kashmir Reorganisation Bill, 2019 in Lok Sabha. <a href=\"https:\/\/t.co\/YM6hHVgbb9\">https:\/\/t.co\/YM6hHVgbb9<\/a><\/p>\n&mdash; BJP (@BJP4India) <a href=\"https:\/\/twitter.com\/BJP4India\/status\/1158714949599813632?ref_src=twsrc%5Etfw\">August 6, 2019<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2019-08-06 10:06:40","pin":"0","status":1}]}