{"details":[{"title":"After 'Howdy Modi', PM meets Donald Trump at bilateral meet on September 24","content":"<p>During their bilateral meet on Tuesday, US President Donald Trump expressed faith in PM Modi saying that he will take care of radical Islamic terrorism originating from Pakistan.<\/p>","date":"2019-09-27 06:03:40","pin":"0","status":"1"},{"title":" Pakistan PM Imran Khan meets Donald Trump","content":"At the bilateral meeting, Imran Khan also appealed to Donald Trump seeking help in Pakistan's troubles with India, Afghanistan and Iran. Moreover Trump offered to mediate between India and Pakistan for the second time, if both sides agreed and described himself as \"an extremely good arbitrator\".","date":"2019-09-27 06:07:00","pin":"0","status":"1"},{"title":"'India will soar high if Pakistan stoops low' : Syed Akbaruddin","content":"<p>India's Permanent Representative to the UN, Ambassador Syed Akbaruddin has said that India will \"soar high if Pakistan stoops low\" by raking up the Kashmir issue at the UNGA.<\/p>\n<p><a href=\"http:\/\/www.newindianexpress.com\/nation\/2019\/sep\/20\/india-will-soar-high-if-pakistan-stoops-low-by-raising-kashmir-issue-at-un-syed-akbaruddin-2036402.html\" target=\"_blank\"> <strong>CLICK HERE TO READ MORE<\/strong><\/a><\/p>","date":"2019-09-27 06:09:38","pin":"0","status":"1"},{"title":"PM Modi meets Iran President Hassan Rouhani, discusses bilateral matters","content":"Their meeting was keenly awaited as it comes amid escalating face-off between Iran and the United States on Tehran's nuclear programme. Meanwhile, PM Modi also met with the leaders of the Pacific Island countries on September 25 and demonstrated India's commitment to advancing their development priorities.","date":"2019-09-27 06:13:41","pin":"0","status":"1"},{"title":"Imran gets Erdogan to side with him on Kashmir issue","content":"<p>Imran Khan has been raising his pitch aggressively, and even got Turkish President Recep Tayyip Erdogan to speak on Kashmir. On September 25, Erdogan told the UNGA that despite the UN resolutions \"eight million people are stuck\" in Kashmir.<\/p>\n<blockquote class=\"twitter-tweet\" data-lang=\"en\">\n<p lang=\"en\" dir=\"ltr\">I thank Turkey’s President Erdogan for raising the issue of IOJK in the UN General Assembly & calling for a solution to this long-standing dispute. Referring to the siege of IOJK, he pointed out that despite UN resolutions, 8 million people are stuck in IOJK.<\/p>\n— Imran Khan (@ImranKhanPTI) <a href=\"https:\/\/twitter.com\/ImranKhanPTI\/status\/1176571732783710208?ref_src=twsrc%5Etfw\">September 24, 2019<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2019-09-27 06:19:45","pin":"0","status":"1"},{"title":"Pakistan Foreign Minister Shah Mehmood Qureshi misses EAM Jaishankar's opening speech at SAARC meet","content":"<p>Qureshi on Thursday boycotted External Affairs Minister S Jaishankar's opening statement at the meeting of the SAARC Council of Foreign Ministers, saying his country will not engage with India \"until and unless\" it lifts the \"siege\" in Kashmir.<\/p>\n<p><a href=\"http:\/\/www.newindianexpress.com\/world\/2019\/sep\/26\/shah-mahmood-qureshi-misses-s-jaishankars-opening-statement-at-saarc-meeting-in-new-york-2039596.html\" target=\"_blank\"> <strong>CLICK HERE TO READ MORE<\/strong><\/a><\/p>\n<blockquote class=\"twitter-tweet\" data-conversation=\"none\" data-lang=\"en\"><p lang=\"en\" dir=\"ltr\">Ending the briefing on a humanitarian note, SMQ called on the OIC states to collectively & individually sanction India until the curfew is not lifted. To put humanity over trade, and brotherhood over business especially over a govt that has no respect for the beliefs of the OIC. <a href=\"https:\/\/t.co\/qUTwHqHL9P\">pic.twitter.com\/qUTwHqHL9P<\/a><\/p>— PTI (@PTIofficial) <a href=\"https:\/\/twitter.com\/PTIofficial\/status\/1176907006420168704?ref_src=twsrc%5Etfw\">September 25, 2019<\/a><\/blockquote>\n<script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2019-09-27 06:29:00","pin":"0","status":"1"},{"title":"'Don't view Kashmir through communal lens': Jaishankar at SAARC meet","content":"<p>After Pakistan FM skipped EAM Jaishankar's speech at the SAARC meet on September 26, Jaishankar said that Kashmir should not be seen through a communal lens as the Jamiat-Ulema-e-Hind, one of the leading Islamic organisations in India, had backed the changes there, and the fact that India's relations with the Muslim nations of the Gulf have seen an upward trajectory in the past five years.<\/p>\n<p><a href=\"http:\/\/www.newindianexpress.com\/world\/2019\/sep\/27\/dont-view-kashmir-issue-through-communal-lens-jaishankar-at-saarc-meet-in-new-york-2039597.html\" target=\"_blank\"><strong>CLICK HERE TO READ MORE<\/strong><\/a><\/p>","date":"2019-09-27 06:38:31","pin":"0","status":"1"},{"title":"'Terror elimination a precondition for cooperation': Jaishankar reacts to Pak FM's boycott of his speech at SAARC","content":"<blockquote class=\"twitter-tweet\" data-conversation=\"none\" data-lang=\"en\"><p lang=\"en\" dir=\"ltr\">In our view, elimination of terrorism in all its forms is a precondition not only for fruitful cooperation but also for the very survival of our region itself.<\/p>— Dr. S. Jaishankar (@DrSJaishankar) <a href=\"https:\/\/twitter.com\/DrSJaishankar\/status\/1177302828169252865?ref_src=twsrc%5Etfw\">September 26, 2019<\/a><\/blockquote>\n<script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2019-09-27 06:41:57","pin":"0","status":"1"},{"title":"US seeks 'rapid action' by India to ease restrictions and release of detainees in Kashmir","content":"<p>Alice Wells, the acting US Assistant Secretary for South and Central Asia said on September 26 that the US has raised concerns on Kashmir 'at the highest levels,' without specifying whether Trump brought up Kashmir with Modi during their recent talks.<\/p>\n<p><a href=\"http:\/\/www.newindianexpress.com\/world\/2019\/sep\/27\/us-seeks-rapid-action-by-india-to-ease-restrictions-and-release-of-detainees-in-kashmir-2040015.html\" target=\"_blank\"><strong>CLICK HERE TO READ MORE<\/strong><\/a><\/p>","date":"2019-09-27 06:52:13","pin":"0","status":"1"},{"title":"Imran not optimistic about UNGA speech?","content":"Ahead of the UNGA meet, Imran Khan said in an interview he is not too \"optimistic\" about accomplishing anything with his speech at the UN as the global community's response has been lukewarm towards the matter, however also adding that \"at least the world will be aware because I fear an impending genocide.\"","date":"2019-09-27 07:00:16","pin":"0","status":"1"},{"title":"Aircraft carrying messages highlighting human rights abuses in Balochistan circles the Statue of Liberty","content":"<blockquote class=\"twitter-tweet\" data-lang=\"en\">\n<p lang=\"en\" dir=\"ltr\">United States: An aircraft circles the Statue of Liberty, New York carrying message “U.N must help end human rights abuses in Balochistan.'' <a href=\"https:\/\/t.co\/D3ievsUcu0\">pic.twitter.com\/D3ievsUcu0<\/a><\/p>\n— ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1177568256007098369?ref_src=twsrc%5Etfw\">September 27, 2019<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2019-09-27 07:05:23","pin":"0","status":"1"},{"title":"PM Modi likely to address UNGA in Hindi","content":"<blockquote class=\"twitter-tweet\" data-lang=\"en\">\n<p lang=\"en\" dir=\"ltr\">All set for the <a href=\"https:\/\/twitter.com\/UN?ref_src=twsrc%5Etfw\">@UN<\/a> General Assembly session!<br \/>\n<br \/>\nThe speech of PM <a href=\"https:\/\/twitter.com\/narendramodi?ref_src=twsrc%5Etfw\">@narendramodi<\/a> begins shortly. Do watch it LIVE. <a href=\"https:\/\/t.co\/63fWbgG0b7\">pic.twitter.com\/63fWbgG0b7<\/a><\/p>\n— PMO India (@PMOIndia) <a href=\"https:\/\/twitter.com\/PMOIndia\/status\/1177571291533987840?ref_src=twsrc%5Etfw\">September 27, 2019<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2019-09-27 07:09:46","pin":"0","status":"1"},{"title":"Here's the Prime Minister's schedule for the day","content":"PM Modi will address the UN General Assembly at 7:30 pm, which will be followed by an informal meet and greet with other delegations\/Indian community outside the GA Hall. At 9:30 pm, PM Modi will meet his Bhutanese counterpart, Dr. Lotay Tshering and at 10:05 pm, PM Modi will meet the PM of Bangladesh, Sheikh Hasina. PM Modi will board a plane for Frankfurt, Germany at 1:15 am.","date":"2019-09-27 07:13:10","pin":"0","status":"1"},{"title":"No mention of Pakistan in PM Modi's speech","content":"Terrorism, climate change will make be mentioned in Prime Minister Modi's speech, however there will be no comment on Pakistan.","date":"2019-09-27 07:19:05","pin":"0","status":"1"},{"title":"Around 2500 Indians to gather outside UNGA","content":"Around 2,500 Indians are expected to assemble in front of the United Nations General Assembly to thank the PM for the abrogation of Article 370.","date":"2019-09-27 07:20:31","pin":"0","status":"1"},{"title":"Protests by pro-Article 370 abrogation supporters, minorities from Pakistan outside UNGA","content":"People carrying posters and banners in support of the abrogation of Article 370 gather outside UNGA. Minority communities from Pakistan unhappy with the Imran Khan government also assemble outside the General Assembly. Meanwhile, Pakistani Americans in support of their PM have also gotten together.","date":"2019-09-27 07:31:00","pin":"0","status":"1"},{"title":"","content":"<blockquote class=\"twitter-tweet\" data-lang=\"en\"><p lang=\"en\" dir=\"ltr\">Backstage on the world stage  <a href=\"https:\/\/twitter.com\/hashtag\/UNGA?src=hash&ref_src=twsrc%5Etfw\">#UNGA<\/a> <a href=\"https:\/\/t.co\/t1e4li6G0n\">pic.twitter.com\/t1e4li6G0n<\/a><\/p>— Syed Akbaruddin (@AkbaruddinIndia) <a href=\"https:\/\/twitter.com\/AkbaruddinIndia\/status\/1177582665899356160?ref_src=twsrc%5Etfw\">September 27, 2019<\/a><\/blockquote>\n<script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>\n","date":"2019-09-27 07:34:20","pin":"0","status":"1"},{"title":"PM Modi begins his speech","content":"'This is a very special occasion for me'","date":"2019-09-27 07:35:45","pin":"0","status":"1"},{"title":"","content":"In five years, we have built over 11 crore toilets. Over 50 crore people will benefit from world's largest health insurance scheme, says PM Modi.","date":"2019-09-27 07:37:01","pin":"0","status":"1"},{"title":"","content":"'Message of the mandate is inspiring. We have received a greater mandate than last time,' says PM Modi.","date":"2019-09-27 07:38:40","pin":"0","status":"1"},{"title":"","content":"We are trying to eradicate the use of single-use plastic completely. In 2022, when India will complete 75 years of its independence, we will have built over 2 crore more homes for the poor, says PM Modi.","date":"2019-09-27 07:39:56","pin":"0","status":"1"},{"title":"","content":"Ayushman Bharat is a benchmark scheme for the world: PM Modi","date":"2019-09-27 07:41:03","pin":"0","status":"1"},{"title":"","content":"'Sabka saath, sabka vikaas, sabka vishvaas', is our aim, This is our duty towards our country. : PM Modi","date":"2019-09-27 07:41:51","pin":"0","status":"1"},{"title":"","content":"<blockquote class=\"twitter-tweet\" data-lang=\"en\">\n<p lang=\"en\" dir=\"ltr\">Prime Minister Narendra Modi at <a href=\"https:\/\/twitter.com\/hashtag\/UNGA?src=hash&ref_src=twsrc%5Etfw\">#UNGA<\/a> : The world's largest democracy voted for my govt & me. We came back to power with a bigger majority and because of this mandate I am here today. <a href=\"https:\/\/t.co\/7oDrtcD9xG\">pic.twitter.com\/7oDrtcD9xG<\/a><\/p>\n— ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1177586029752008706?ref_src=twsrc%5Etfw\">September 27, 2019<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2019-09-27 07:42:25","pin":"0","status":"1"},{"title":"","content":"<p>We aim to address our water shortage problem, will connect 15 crore households by tapped water.<\/p>","date":"2019-09-27 07:43:52","pin":"0","status":"1"},{"title":"","content":"By 2025, We also intend to rid India of tuberculosis,\" PM Modi says while addressing the UN General Assembly.   ","date":"2019-09-27 07:45:02","pin":"0","status":"1"},{"title":"","content":"India's contribution towards global warming has been minimal, says PM Modi.","date":"2019-09-27 07:46:04","pin":"0","status":"1"},{"title":"","content":"<blockquote class=\"twitter-tweet\" data-lang=\"en\"><p lang=\"en\" dir=\"ltr\">Working towards Global friendship and Global welfare. <a href=\"https:\/\/t.co\/J0fNqVi3jg\">pic.twitter.com\/J0fNqVi3jg<\/a><\/p>— PMO India (@PMOIndia) <a href=\"https:\/\/twitter.com\/PMOIndia\/status\/1177587510483963904?ref_src=twsrc%5Etfw\">September 27, 2019<\/a><\/blockquote>\n<script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>\n","date":"2019-09-27 07:46:49","pin":"0","status":"1"},{"title":"","content":"We have the resolve to alert the world against the threat of global terrorism. It is essential that the international community joins hands and comes together to combat terrorism. : PM Modi","date":"2019-09-27 07:49:02","pin":"0","status":"1"},{"title":"","content":"A divided world is of no use to anyone, we must unite to fight terrorism: PM Modi on terrorism","date":"2019-09-27 07:50:09","pin":"0","status":"1"},{"title":"","content":"A divided world is of no use to anyone, we must unite to fight terrorism: PM Modi on terrorism","date":"2019-09-27 07:50:09","pin":"0","status":"0"},{"title":"Harmony and peace is what the world needs","content":"Quoting Swami Vivekananda, PM Modi said that 'harmony' and 'peace' are core values that the world needs to focus on for the betterment of mankind.","date":"2019-09-27 07:51:50","pin":"0","status":"1"},{"title":"PM Modi concludes his speech, addresses climate change, jal shakti abhiyaan, jan kalyan","content":"PM Modi concluded his speech focussing on the core issues of climate change, sustainability, and also spoke about India's plans on Jan Kalyan (people's welfare) with Jan Bhaagidari (people's participation) \"New India has global aspirations,\" he further said.  Pakistan made no mention in his speech.","date":"2019-09-27 07:54:18","pin":"0","status":"1"},{"title":"PM Narendra Modi concludes his speech at UNGA","content":"<blockquote class=\"twitter-tweet\">\n<p lang=\"en\" dir=\"ltr\">This is what Backstage looks like following PM <a href=\"https:\/\/twitter.com\/narendramodi?ref_src=twsrc%5Etfw\">@narendramodi<\/a> speech @ <a href=\"https:\/\/twitter.com\/hashtag\/UNGA?src=hash&ref_src=twsrc%5Etfw\">#UNGA<\/a> <a href=\"https:\/\/t.co\/26tyMMAOd2\">pic.twitter.com\/26tyMMAOd2<\/a><\/p>\n— Syed Akbaruddin (@AkbaruddinIndia) <a href=\"https:\/\/twitter.com\/AkbaruddinIndia\/status\/1177590898324070402?ref_src=twsrc%5Etfw\">September 27, 2019<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2019-09-27 07:59:26","pin":"0","status":"1"},{"title":"PM Modi and his Greek counterpart Kyriakos Mitsotakis hold a bilateral meeting","content":"<p> <img src=\"http:\/\/cms.newindianexpress.com\/FCKeditor\/fckeditor_img\/modi-ni.jpg\" width=\"600\" height=\"500\" alt=\"\" \/><\/p>","date":"2019-09-27 08:15:07","pin":"0","status":"1"},{"title":"No other country sacrificed for peace-keeping like India: Modi","content":"<p>\"India's contribution towards United Nations Peace-keeping missions has been immense, no other country in the world has sacrificed as much as India has for these peace-keeping missions,\" said Prime Minister Narendra modi.<\/p>","date":"2019-09-27 08:19:42","pin":"0","status":"1"},{"title":" Imran Khan to address the UNGA shortly","content":"<p>Pakistan PM Imran Khan is likely to begin his speech at 8.30 PM. However, his Indian counterpart Narendra Modi had said that he will not stay for Imran Khan's speech.<\/p>","date":"2019-09-27 08:21:51","pin":"0","status":"1"},{"title":"Pakistan PM Imran Khan addresses UN","content":"<p>Islamophobia has grown substantially since 9\/11 attack because certain western leaders equated terrorism with Islam.<\/p>","date":"2019-09-27 08:31:26","pin":"0","status":"1"},{"title":"There are no militant organisations in Pakistan: Imran Khan","content":"<p>When we came to power my priority was to bring peace to Pakistan. 70,000 Pakistanis died after joining the US war on terror. I oppose joining the war. No Pakistani was involved in 9\/11 attack but we had to pay for it.  India keeps accusing us of sheltering terrorists, I urge the United Nations to check it for themselves. There are no militant organisations in Pakistan.<\/p>\n<p>When my party came to power, we reached out to India. I spoke to PM Modi and asked him to work together, says Imran Khan.<\/p>","date":"2019-09-27 08:49:41","pin":"0","status":"1"},{"title":"Balakot attack a failure, says Imran Khan","content":"<p> A 20-year-old Kashmiri boy was radicalised who blew himself up in a security convoy. India put down the blame on Pakistan. India bombed us, we retaliated and a captured pilot was released. Instead of considering it a peace gesture, he ran the election campaign based on the attacks. The attack only managed to eradicate 10 trees, says Imran Khan.<\/p>","date":"2019-09-27 08:53:20","pin":"0","status":"1"},{"title":"Imran Khan rakes up Kashmir, says Modi has locked up 8 million people","content":"<p>Modi has locked up 8 million people in Kashmir. He is arrogant and doesn't know what to do once curfew lifted. Once the curfew will be lifted there will be bloodbath. What will the 0.9 million troops present in the Valley do? asks Imran Khan<\/p>","date":"2019-09-27 08:59:55","pin":"0","status":"1"},{"title":"Once curfew lifted, the blame of radicalization will be on Pakistan: Khan","content":"<p>India's Defence Minister says Pakistan has lined up 500 terrorist across LoC to infiltrate. Why will Pakistan send 500 terrorist? What will they do in front of the military. There will be radicalization in Kashmir once the curfew is lifted and India will put the blame on us. Once they rake up Islamic terrorism, the world will forget about human rights violation, says Imran Khan.<\/p>","date":"2019-09-27 09:05:48","pin":"0","status":"1"},{"title":"UN must stop two nuclear countries from going to conventional war: Imran Khan","content":"<p>Two nuclear armed countries will come face to face again and before that happens the United Nations must act accordingly. This is why UN was formed in 1945. If a conventional war starts between two countries, we will fight till we get freedom.<\/p>","date":"2019-09-27 09:08:50","pin":"0","status":"1"},{"title":"Imran Khan urges UN to ask India to lift curfew in Kashmir","content":"<p>India must lift this 55-day long inhuman curfew in Kashmir. It must free political leaders and boys detained. And then the world community must give Kashmir the right to self determination. <\/p>","date":"2019-09-27 09:11:09","pin":"0","status":"1"},{"title":"","content":"<p> Pakistan PM Imran Khan concludes his speech.<\/p>","date":"2019-09-27 09:16:32","pin":"0","status":"1"},{"title":"Imran Khan exceeds speech time limit","content":"<p>Speech time allotted to every leader at the United Nations General Assembly is 15 minutes, which the Pakistan PM exceeded.<\/p>","date":"2019-09-27 09:21:05","pin":"0","status":"1"},{"title":"India to use the right to reply option to Imran Khan's speech","content":"<p>India to use the right to reply option, to Pakistan PM Imran Khan's speech in the United Nations General Assembly.<\/p>","date":"2019-09-27 09:35:08","pin":"0","status":1}]}