{"details":[{"title":"Bill to be tabled at 12 noon","content":"<p>No question hour on Wednesday in Rajya Sabha, Citizenship Amendment Bill debate to begin at 12 noon, according to reports.<\/p>","date":"2019-12-11 10:51:39","pin":"0","status":"1"},{"title":"Congress chief whip in Lok Sabha gives adjourment motion notice","content":"<p>Congress chief whip in Lok Sabha Kodikunnil Suresh has given adjourment motion notice on 'unrest and strife in the country over Citizenship Amendment Bill.<\/p><p><img src=\"https:\/\/images.newindianexpress.com\/images\/liveimages\/Kodukunnil Suresh.png\" width=\"100%\" height=\"382\" alt=\"\" \/> <\/p>","date":"2019-12-11 10:53:08","pin":"0","status":"1"},{"title":"Kapil Sibal, Derek O'Brien, Ramgopal Yadav to speak on Citizenship Amendment Bill","content":"<p> Congress' Kapil Sibal, Derek O'Brien of Trinamool Congress (TMC) and Ramgopal Yadav of Samajwadi Party (SP) are among the opposition leaders who will speak during the debate on the Citizenship (Amendment) Bill, 2019.<\/p>","date":"2019-12-11 10:53:53","pin":"0","status":"1"},{"title":"Citizenship Bill will give permanent relief to people who fled religious persecution: Modi","content":"<p>Citizenship Bill will be written in golden letters, will give permanent relief to people who fled religious persecution, says PM Modi at BJP meet.<\/p>","date":"2019-12-11 10:55:06","pin":"0","status":"1"},{"title":"Rahul Gandhi: Citizenship Bill an attempt to 'ethnically cleanse' Northeast","content":"<p>Rahul Gandhi again slams Citizenship Bill saying, \"The CAB is a attempt by Modi-Shah Govt to ethnically cleanse the North East. It is a criminal attack on the North East, their way of life and the idea of India. I stand in solidarity with the people of the North East and am at their service.\"<\/p>","date":"2019-12-11 10:57:40","pin":"0","status":"1"},{"title":"All you need to know about Citizenship (Amendment) Bill ","content":"<ul>\n    <li>The Citizenship (Amendment) Bill seeks to amend the Citizenship Act, 1955 in order to grant Indian citizenship to non-Muslim refugees from Pakistan, Bangladesh and Afghanistan (all Muslim-majority nations) escaping religious persecution there.<\/li>\n    <li>Once the bill is enacted, immigrants belonging to Hindu, Sikh, Christian, Buddhist, Jain and Parsi communities from the three countries will not be treated as illegal.<\/li>\n    <li>They will also be eligible to get naturalised citizenship.<\/li>\n    <li>One of the requirements for citizenship by naturalization is that the applicant must have resided in India during the last 12 months, and for 11 of the previous 14 years.<\/li>\n    <li>The Bill relaxes this 11-year requirement to six years for persons belonging to the same six religions and three countries.<\/li>\n    <li>They will also be no longer deported or jailed under the Foreigners Act of 1946 and the Passport (Entry into India) Act of 1920.<\/li>\n    <li>December 31, 2014 will be the cut-off date after which any person moving to India from these neighbouring countries will be considered for citizenship.<\/li>\n    <li>However, the new law will not apply to parts of the north-east, where the Bill has been met by protests.<\/li>\n    <li>The Bill provides that the registration of Overseas Citizen of India (OCI) cardholders may be cancelled if they violate any law.<\/li>\n<\/ul>","date":"2019-12-11 11:02:41","pin":"0","status":"1"},{"title":"CAB to be tabled at 12 noon: Parliamentary Affairs Minister Prahlad Joshi","content":"<blockquote class=\"twitter-tweet\">\n<p lang=\"en\" dir=\"ltr\">Parliamentary Affairs Minister Prahlad Joshi after BJP parliamentary party meeting: The <a href=\"https:\/\/twitter.com\/hashtag\/CitizenshipAmendmentBill?src=hash&ref_src=twsrc%5Etfw\">#CitizenshipAmendmentBill<\/a> will be tabled in Rajya Sabha at 12 pm today, and it will be passed in the house with comfortable majority (file pic) <a href=\"https:\/\/t.co\/ckHwZoXpAP\">pic.twitter.com\/ckHwZoXpAP<\/a><\/p>\n— ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1204628025658052609?ref_src=twsrc%5Etfw\">December 11, 2019<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2019-12-11 11:03:40","pin":"0","status":"1"},{"title":"BJP Parliamentary Panel meets ahead of crucial Rajya Sabha debate over CAB","content":"<p><img src=\"https:\/\/images.newindianexpress.com\/images\/liveimages\/BJP parliamentary panel_EPS.jpeg\" width=\"100%\" height=\"510\" alt=\"\" \/> <\/p>\n<p>PM Narendra Modi, Defence Minister Rajnath Singh, Health Minister Harshvardhan, Finance Minister Nirmala Sitharaman and others during the BJP parliamentary party meeting at Parliament House in New Delhi on Wednesday. (Photo | EPS\/Shekhar Yadav)<\/p>","date":"2019-12-11 11:10:32","pin":"0","status":"1"},{"title":"Opposition speaking same language as Pakistan: PM","content":"<p>According to sources, PM Modi told BJP MPs in the Parliamentary meet, \"Opposition speaking language of Pakistan on Citizenship Bill.\"<\/p>","date":"2019-12-11 11:14:14","pin":"0","status":"1"},{"title":"Express debate | CAB in no way violates Article 14, says GVL Narasimha Rao","content":"<p>Religious minority communities in Pakistan bore the brunt of Partition. India embraced Muslims whole-heartedly even while Partition of the country was done on the grounds of religion while Pakistan adopted Islam as its state religion. While India protected the rights of the minority communities, Pakistan patronised their persecution, reflecting in the near wipeout of the population of Hindu, Sikh, Parsi, Jain, Buddhist and Christians.<\/p>\n<p>Article 14 of the Constitution of India guarantees equality to all citizens. India, since Independence, has demonstrated that the citizens enjoyed unhindered the right to equality in all walks of life. The Constitution at the same time empowers the executive to frame policies for affirmative action for sections of the citizens who have faced discrimination over a long period of time leading to their socially disadvantaged status. <strong>(<\/strong><a href=\"https:\/\/www.newindianexpress.com\/nation\/2019\/dec\/11\/cab-in-no-way-violates-article-14-2074504.html\" target=\"_blank\"><strong>Read More<\/strong><\/a><strong>)<\/strong><\/p>","date":"2019-12-11 11:37:37","pin":"0","status":"1"},{"title":"Express debate | Bill will not pass the legal test, says KTS Tulsi","content":"<p>The Citizenship Amendment Bill clearly violates Article 14 of the Indian Constitution as it guarantees equality not only to its citizens but also for the non-citizens. Then there are two facets of Article 14: one is it prohibits positive discrimination on the ground of religion and the second is that it provides equal protection to all before the law.<\/p>\n<p>If this Bill, which proposes to provide protection to certain people who are mentioned in the Bill on the ground of religious persecution, then it has to also grant protection to those who have been left out. There is completely irrational discrimination.<strong> (<\/strong><a href=\"https:\/\/www.newindianexpress.com\/nation\/2019\/dec\/11\/express-debate--bill-will-not-pass-the-legal-test-says-kts-tulsi-2074505.html\" target=\"_blank\"><strong>Read More<\/strong><\/a><strong>)<\/strong><\/p>","date":"2019-12-11 11:39:07","pin":"0","status":"1"},{"title":"Govt will get Bill passed with comfortable majority: Naqvi","content":"<p>While reacting on whether the BJP has support of Shiv Sena and JD(U), Union Minister Mukhtar Abbas Naqvi said: \"Government will get the bill passed with comfortable majority.\" Sources had earlier said that the Shiv Sena will walk out of the Rajya Sabha.<\/p>","date":"2019-12-11 11:44:14","pin":"0","status":"1"},{"title":"Fresh anti-CAB protests erupt in Assam ","content":"<p>A day after total shutdown in Assam to protest against the Citizenship (Amendment) Bill, fresh protests erupted in the state on Wednesday when the legislation would be debated in the Rajya Sabha. To tackle the situation, the police had to fire rubber bullets and resort to lathi charge on the protestors in Dibrugarh district, police said.<\/p>\n<p>A journalist was injured in stone pelting by a mob and the police lobbed tear gas shells to disperse them near a polytechnic institute in Dibrugarh town, police said.<\/p>\n<p>Though no organisation has called for a bandh on Wednesday, people have come out in large numbers in Jorhat, Golaghat, Dibrugarh, Tinsukia, Sivasagar, Bongaigaon, Nagaon, Sonitpur and several other districts since morning.<\/p>\n<blockquote class=\"twitter-tweet\">\n<p lang=\"en\" dir=\"ltr\">Assam: Heavy security put in place as protests against <a href=\"https:\/\/twitter.com\/hashtag\/CitizenshipAmmendmentBill2019?src=hash&ref_src=twsrc%5Etfw\">#CitizenshipAmmendmentBill2019<\/a> continue in Dibrugarh. <a href=\"https:\/\/t.co\/rvG2X45sSS\">pic.twitter.com\/rvG2X45sSS<\/a><\/p>\n— ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1204643864667017217?ref_src=twsrc%5Etfw\">December 11, 2019<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2019-12-11 11:46:49","pin":"0","status":"1"},{"title":"Our stand in RS could be different from Lok Sabha if doubts not cleared: Shiv Sena's Sanjay Raut","content":"<p> <\/p>\n<blockquote class=\"twitter-tweet\">\n<p lang=\"en\" dir=\"ltr\">Sanjay Raut, Shiv Sena MP on <a href=\"https:\/\/twitter.com\/hashtag\/CitizenshipAmendmentBill?src=hash&ref_src=twsrc%5Etfw\">#CitizenshipAmendmentBill<\/a> in Rajya Sabha: We have to clear our doubts on this bill, if we don't get satisfactory answers then our stand could be different from what we took in Lok Sabha <a href=\"https:\/\/t.co\/OOfdwyR2xH\">pic.twitter.com\/OOfdwyR2xH<\/a><\/p>\n— ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1204637822923075584?ref_src=twsrc%5Etfw\">December 11, 2019<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2019-12-11 11:49:10","pin":"0","status":"1"},{"title":"What makes the bill contentious?","content":"<p>Those who oppose the bill say that it discriminates on the basis of religion and is, therefore, against the secular ethos of the Indian Constitution.<\/p>\n<p>Some Constitutional experts cautioned that the bill violates Article 14 of the Constitution that guarantees equality to all before the law.<\/p>\n<p>The north-eastern states are against the Bill as they believe it will lead to a greater influx of illegal migrants.<\/p>\n<p>Seeing the opposition to the Bill in the region, the BJP-led government has decided to exempt parts of the region which are under the sixth schedule of the Constitution – which deals with autonomous tribal-dominated regions in Assam, Meghalaya, Tripura and Mizoram.<\/p>\n<p>The bill will also not apply to states that have the inner-line permit regime (Arunachal Pradesh, Nagaland and Mizoram).<\/p>\n<p> <\/p>","date":"2019-12-11 11:52:41","pin":"0","status":"1"},{"title":"Amit Shah tables Citizenship Amendment Bill in Rajya Sabha","content":"<p> Home Minister Amit Shah has tabled the contentious Citizenship (Amendment) Bill 2019 in the Rajya Sabha.<\/p>","date":"2019-12-11 12:10:12","pin":"0","status":"1"},{"title":"Muslims in the country should not feel afraid: Shah","content":"<p><img src=\"https:\/\/images.newindianexpress.com\/images\/liveimages\/rajya-sabha.JPG\" width=\"600\" height=\"323\" alt=\"\" \/> <\/p>\n<p>The citizen Muslims of India will remain untouched.  Do you want us to give citizenship to Muslims from across the world? If so then how will the country survive, reiterates Amit Shah.<\/p>","date":"2019-12-11 12:16:31","pin":"0","status":"1"},{"title":"Will government pass crucial CAB test? Here are the numbers in the RS","content":"<p> <img src=\"https:\/\/images.newindianexpress.com\/images\/liveimages\/Capture(1).jpg\" width=\"200\" height=\"434\" alt=\"\" \/><\/p>","date":"2019-12-11 12:25:00","pin":"0","status":"1"},{"title":"Amit Shah concludes his opening speech","content":"<p>Shah concludes his speech, says non-Muslim minorities from three nations who came to India after Independence will be given Indian citizenship. Those who arrived before Dec 31, 2014 will not face legal action, any on going case against them to be scrapped. Provisions of bill will not be applicable to tribal areas of northeast.<\/p>","date":"2019-12-11 12:28:04","pin":"0","status":"1"},{"title":"Chairman allots six hours for debate","content":"<p>Vice President Venkaiah Naidu allotted six hours for the discussion on the Bill. <\/p>","date":"2019-12-11 12:29:43","pin":"0","status":"1"},{"title":"Congress' Anand Sharma begins his speech, opposes Bill","content":"<p><img src=\"https:\/\/images.newindianexpress.com\/images\/liveimages\/anand-sharma.JPG\" width=\"600\" height=\"292\" alt=\"\" \/> <\/p>","date":"2019-12-11 12:31:05","pin":"0","status":"1"},{"title":"Bill against the preamble of Constitution: Anand Sharma","content":"<p>Congress' Anand Sharma opens the debate on the controversial Bill. Says, the bill that was proposed in 2016 and the one tabled now have huge differences. He adds that the Bill is against the preamble of the Constitution.<\/p>","date":"2019-12-11 12:33:43","pin":"0","status":"1"},{"title":"Savarkar proposed the two-nation theory first: Anand Sharma","content":"<p>Sharma continues, \"The Home Minister had falsely claimed that Congress partitioned India on religious grounds. It was Hindu Mahasabha under Savarkar who proposed two-nation theory, and then Muslim League picked it up\".<\/p>","date":"2019-12-11 12:41:51","pin":"0","status":"1"},{"title":"Protests erupt across the country against Citizenship Bill","content":"<blockquote class=\"twitter-tweet\">\n<p lang=\"en\" dir=\"ltr\">Tamil Nadu: Congress workers hold protest against <a href=\"https:\/\/twitter.com\/hashtag\/CitizenshipAmmendmentBill2019?src=hash&ref_src=twsrc%5Etfw\">#CitizenshipAmmendmentBill2019<\/a>, in Chennai. <a href=\"https:\/\/t.co\/2v8VLSBgXl\">pic.twitter.com\/2v8VLSBgXl<\/a><\/p>\n— ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1204653438086217729?ref_src=twsrc%5Etfw\">December 11, 2019<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2019-12-11 12:48:30","pin":"0","status":"1"},{"title":"Sharma concludes his speech, rakes up Assam's protest over NRC","content":"<p>What does Assam feel about NRC? Assam is burning. If you are going good for the nation then why are people of Assam insecure? The country is ashamed of how the people are treated in the detention camps. Am all-party delegation should visit the camps. Are the detention centers going to become concentration camps?, asks Anand Sharma.<\/p>","date":"2019-12-11 12:54:13","pin":"0","status":"1"},{"title":"JP Nadda begins his speech, thanks PM Modi","content":"<p><img src=\"https:\/\/images.newindianexpress.com\/images\/liveimages\/jp- nadda.JPG\" width=\"600\" height=\"323\" alt=\"\" \/> <\/p>","date":"2019-12-11 12:56:36","pin":"0","status":"1"},{"title":"Rajya Sabha to skip lunch break","content":"<p>The Upper House is going to skip the lunch break to continue uninterrupted discussion on Citizenship Bill.<\/p>","date":"2019-12-11 01:01:09","pin":"0","status":"1"},{"title":"Minorities in India were protected post partition: JP Nadda","content":"<p>Jagat Prakash Nadda opens his speech, says minorities in India were protected after partition, but the same did not happen in Pakistan.<\/p>","date":"2019-12-11 01:04:03","pin":"0","status":"1"},{"title":"Nadda concludes his speech, says bill doesn't tamper with Article 14","content":"<p>Nadda concludes his speech, says the Bill does not tamper with Article 14 of the Constitution or the right to equality. This Bill is not in interest of any party, it is in the interest of the nation.<\/p>","date":"2019-12-11 01:15:19","pin":"0","status":"1"},{"title":"Trinamool's Derek O Brien begins his speech in Bengali","content":"<p><img src=\"https:\/\/images.newindianexpress.com\/images\/liveimages\/derek-.JPG\" width=\"600\" height=\"324\" alt=\"\" \/> <\/p>","date":"2019-12-11 01:17:58","pin":"0","status":"1"},{"title":"The Bill is anti-Bengali : Derek O Brien","content":"<p>Trinamool's Derek O Brien begins his speech in Bengali. Says, the Bill is anti-India, anti-Bengali. BJP should not try to portray itself as pro-Bengali. Don't try to teach patriotism or citizenship to Bengalis. The nation is moving towards dictatorship.<\/p>","date":"2019-12-11 01:21:31","pin":"0","status":"1"},{"title":"Scores of protesting students, others injured in Assam as police use force","content":"<p>The police resorted to lathicharge and fired teargas shells as thousands of students from various colleges of Guwahati were taking out a procession to the State Secretariat in Dispur area.<\/p>\n<p><strong>(<\/strong><a href=\"https:\/\/www.newindianexpress.com\/nation\/2019\/dec\/11\/citizenship-bill-scores-of-protesting-students-others-injured-in-assam-as-police-use-force-2074617.html\" target=\"_blank\"><strong>READ MORE HERE<\/strong><\/a><strong>)<\/strong><\/p>","date":"2019-12-11 01:29:14","pin":"0","status":"1"},{"title":"'Bill drawn from Nazi copybook'","content":"<p>Brien draws parallels with Nazi Germany, says elements of Citizenship Bill drawn from Nazi copybook.<\/p>","date":"2019-12-11 01:34:04","pin":"0","status":"1"},{"title":"Uproar in Rajya Sabha","content":"<p><img src=\"https:\/\/images.newindianexpress.com\/images\/liveimages\/rukus-.JPG\" width=\"600\" height=\"268\" alt=\"\" \/> <\/p>","date":"2019-12-11 01:40:06","pin":"0","status":"1"},{"title":"AIADMK's  SR Balasubramoniyan begins his speech","content":"<p><img src=\"https:\/\/images.newindianexpress.com\/images\/liveimages\/aiadmk-.JPG\" width=\"600\" height=\"315\" alt=\"\" \/> <\/p>","date":"2019-12-11 01:41:33","pin":"0","status":"1"},{"title":"Balasubramoniyan raises concern on Sri Lankan Tamil refugees","content":"Balasubramoniyan began his speech by raising concerns on the Sri Lankan Tamil refugees living in Tamil Nadu. He says, we are concerned about Sri Lankan refugees living for many years in India, but left out from this Bill, they are Hindus, Buddhists, some Muslims also who are entirely left out.","date":"2019-12-11 01:50:10","pin":"0","status":"1"},{"title":"Samajwadi Party's Javed Ali Khan begins his speech, opposes the Bill","content":"<p><img src=\"https:\/\/images.newindianexpress.com\/images\/liveimages\/so-.JPG\" width=\"600\" height=\"325\" alt=\"\" \/> <\/p>","date":"2019-12-11 01:51:19","pin":"0","status":"1"},{"title":"SP says government trying to fulfill dream of Jinnah","content":"<blockquote class=\"twitter-tweet\">\n<p lang=\"en\" dir=\"ltr\">Javed Ali Khan,Samajwadi Party in Rajya Sabha: Our Govt through this <a href=\"https:\/\/twitter.com\/hashtag\/CitizenshipAmendmentBill?src=hash&ref_src=twsrc%5Etfw\">#CitizenshipAmendmentBill<\/a> and <a href=\"https:\/\/twitter.com\/hashtag\/NRC?src=hash&ref_src=twsrc%5Etfw\">#NRC<\/a> is trying to fulfill the dream of Jinnah. Remember, in 1949 Sardar Patel had said 'we are laying the foundation of a truly secular democracy in India' <a href=\"https:\/\/t.co\/BGl3cP139E\">pic.twitter.com\/BGl3cP139E<\/a><\/p>\n— ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1204679258611699712?ref_src=twsrc%5Etfw\">December 11, 2019<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2019-12-11 02:16:31","pin":"0","status":"1"},{"title":"TRS opposes the Bill","content":"<p> <img src=\"https:\/\/images.newindianexpress.com\/images\/liveimages\/trs.png\" width=\"600\" height=\"426\" alt=\"\" \/><\/p>","date":"2019-12-11 02:23:27","pin":"0","status":"1"},{"title":"Keshav Rao says the Bill should be withdrawn","content":"<p>K Keshav Rao of Telangana Rashtra Samithi says, this bill challenges the very idea of India and negates every ideal of justice. This bill should be withdrawn.<\/p>","date":"2019-12-11 02:24:09","pin":"0","status":"1"},{"title":"DMK's Tiruchi Siva begins his speech, opposes the Bill","content":"<p><img src=\"https:\/\/images.newindianexpress.com\/images\/liveimages\/siva-.JPG\" width=\"600\" height=\"326\" alt=\"\" \/> <\/p>","date":"2019-12-11 02:25:38","pin":"0","status":"1"},{"title":"Why minorities from Nepal, Bhutan, Sri Lanka have been excluded from the Bill: Siva","content":"<p>\"If Afghanistan has been selected then why other neighbouring countries have not been included?  Why minorities from Nepal, Bhutan, Sri Lanka have been excluded from the Bill? They too have a state religion. Why were these countries cherry picked that too based on a religion. A sense of apprehension has come up within millions of Muslims in India,\" Siva says..<\/p>","date":"2019-12-11 02:31:25","pin":"0","status":"1"},{"title":"Nominated member Swapan Dasgupta begins his speech, cut short midway","content":"<p><img src=\"https:\/\/images.newindianexpress.com\/images\/liveimages\/swapan-.JPG\" width=\"600\" height=\"279\" alt=\"\" \/> <\/p>","date":"2019-12-11 02:34:55","pin":"0","status":"1"},{"title":"Birendra Prasad Baishya begins his speech in Assamese","content":"<p>Birendra Prasad Baishya begins his speech in Assamese. Says the citizens of Assam are scared.Assamese language and culture are facing a threat. <\/p>","date":"2019-12-11 02:44:17","pin":"0","status":"1"},{"title":"Congress leader P Chidambaram begins his speech","content":"<p> <img src=\"https:\/\/images.newindianexpress.com\/images\/liveimages\/chidambaram-.JPG\" width=\"600\" height=\"302\" alt=\"\" \/><\/p>","date":"2019-12-11 02:45:44","pin":"0","status":"1"},{"title":"Constitution is being wrecked from within: P Chidambaram","content":"<p>This will not stop here but will go to the Supreme Court. This is a slap on the Parliament. Parliamentarians are made to do something unconstitutional. The govt is rushing the Bill to push their Hindutva agenda. Thank god they are not amending the Constitution. Somebody has to take responsibility to answer the questions? <\/p>\n<p>He rakes questions:<\/p>\n<p>1.How do you group three countries?<\/p>\n<p>2. How do you group six religions and exclude others?<\/p>\n<p>3. Why have you excluded Sri Lankan Hindus and Bhutanese Christians?<\/p>\n<p>4. Why only religious persecution? Are people not persecuted based on ideology?<\/p>\n<p>5. Does or doesn't the Bill violate the three clauses of article 14.<\/p>","date":"2019-12-11 02:52:36","pin":"0","status":"1"},{"title":"Half the Parliamentarians seem to be missing from House during the crucial debate","content":"<p><img src=\"https:\/\/images.newindianexpress.com\/images\/liveimages\/rs.JPG\" width=\"600\" height=\"261\" alt=\"\" \/> <\/p>","date":"2019-12-11 02:59:47","pin":"0","status":"1"},{"title":"Sanjay Raut begins his speech; Shiv Sena's vote is crucial in passing the Bill","content":"<p><img src=\"https:\/\/images.newindianexpress.com\/images\/liveimages\/raut-.JPG\" width=\"600\" height=\"325\" alt=\"\" \/> <\/p>","date":"2019-12-11 03:05:35","pin":"0","status":"1"},{"title":"WATCH| Opposition leaders say Bill won't get passed in Rajya Sabha","content":"<p><iframe width=\"100%\" height=\"450\" src=\"https:\/\/www.youtube.com\/embed\/QfPpOYRKSH0\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\"><\/iframe><\/p>","date":"2019-12-11 03:10:18","pin":"0","status":"1"},{"title":"We are the headmaster of the school you study in: Raut hits out at BJP","content":"<p>Amidst the chants of 'shame, shame' Sanjay Raut begins his speech. We supported the govt when article 370 was revoked. But today, several parts of country have erupted in protest. We don't have to prove our Hindusim. We are the headmaster of the school you study in and the headmaster of our school is Balasaheb Thackeray.<\/p>","date":"2019-12-11 03:13:25","pin":"0","status":"1"},{"title":"Bahujan Samaj Party opposes the Bill","content":"<p>Satish Chandra Mishra of BSP says the party is opposing the Citizenship Bill. He says Muslims being excluded is the sole problem of this Bill.<\/p>","date":"2019-12-11 03:17:19","pin":"0","status":"1"},{"title":"President signs order to extend Inner line permit regime extended to Manipur","content":"<p>The inner line permit (ILP) regime was extended to Manipur on Wednesday with President Ram Nath Kovind signing the order in this effect.<\/p>\n<p>The decision comes two days after Union Home Minister Amit Shah announced in Lok Sabha that the ILP would be extended to the northeastern state.<\/p>","date":"2019-12-11 03:18:11","pin":"0","status":"1"},{"title":"RJD's Manoj Kumar Jha raises to oppose the Bill, makes a case for inclusion of atheists","content":"<p> <img src=\"https:\/\/images.newindianexpress.com\/images\/liveimages\/manoj-.JPG\" width=\"600\" height=\"324\" alt=\"\" \/><\/p>","date":"2019-12-11 03:21:46","pin":"0","status":"1"},{"title":"Majority versus morality: Sachin Pilot","content":"<blockquote class=\"twitter-tweet\">\n<p lang=\"en\" dir=\"ltr\">Sachin Pilot, Deputy Chief Minister of Rajasthan on <a href=\"https:\/\/twitter.com\/hashtag\/CitizenshipAmendmentBill2019?src=hash&ref_src=twsrc%5Etfw\">#CitizenshipAmendmentBill2019<\/a>: For the first time in independent India, issue of deciding citizenship on basis of religion has come up. I don't think the bill will pass the judicial scrutiny. This is majority versus morality. <a href=\"https:\/\/t.co\/qEHRHDA17b\">https:\/\/t.co\/qEHRHDA17b<\/a> <a href=\"https:\/\/t.co\/cSe5I5cg5p\">pic.twitter.com\/cSe5I5cg5p<\/a><\/p>\n— ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1204693836137582592?ref_src=twsrc%5Etfw\">December 11, 2019<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2019-12-11 03:34:05","pin":"0","status":"1"},{"title":"'Kashmir chose secular India over Pakistan'","content":"<p>PDP's Mir Mohammad Fayaz of PDP says Kashmir chose secular India over Pakistan. However, that faith is being shaken. He adds that only Muslims are being targeted in India.<\/p>","date":"2019-12-11 03:39:02","pin":"0","status":"1"},{"title":"You are destroying the future of India: Sibal","content":"Senior Congress leader Kapil Sibal rises to oppose the Bill. \"I don't know which history book you consult but the two-nation theory was perpetrated by Savarkar and even BR Ambedkar agreed to it. We in Congress believe in one nation.I want Home Minister to withdraw the allegations against us. I request the Home Minister to rise above politics. You are destroying the future of India,\" says senior Congress leader Kapil Sibal.","date":"2019-12-11 03:49:55","pin":"0","status":"1"},{"title":"In conclusion, Sibal says those who have no idea of India, cannot protect the idea of India","content":"<p> <img src=\"https:\/\/images.newindianexpress.com\/images\/liveimages\/kapil.JPG\" width=\"600\" height=\"335\" alt=\"\" \/><\/p>","date":"2019-12-11 03:59:09","pin":"0","status":"1"},{"title":"WATCH | Anti-Citizenship Bill intensifies in Assam, scores injured; Army on standby","content":"<p><iframe width=\"100%\" height=\"450\" src=\"https:\/\/www.youtube.com\/embed\/6jBUh9HxIaU\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\"><\/iframe><\/p>","date":"2019-12-11 04:06:35","pin":"0","status":"1"},{"title":"Future of Rohingyas in Hyderabad uncertain over Citizenship Amendment Bill","content":"<p>As Lok Sabha passed the Citizenship Amendment Bill and Union Home Minister Amit Shah made it clear that Rohingyas would not be granted citizenship, the future of around 6,000 Rohingyas in Hyderabad is uncertain.    The Rohingyas, an ethnic minority group from Myanmar, are concentrated mostly in the Balapur camp. Some others are scattered across Chandrayangutta, Salala and Barkas areas. They mostly do odd jobs, and live in unhygienic conditions. Many women are being helped out by local NGOs.<\/p>\n<p><strong>(<\/strong><a href=\"https:\/\/www.newindianexpress.com\/cities\/hyderabad\/2019\/dec\/11\/with-citizenship-amendment-bill-passed-rohingyas-in-hyderabad-want-to-stay-put-in-old-city-camps-2074378.html\" target=\"_blank\"><strong>READ MORE HERE<\/strong><\/a><strong>)<\/strong><\/p>","date":"2019-12-11 04:10:30","pin":"0","status":"1"},{"title":"MDMK's Vaiko opposes the Bill","content":"<p>\"If this obnoxious, abominable, undemocratic, unreasonable, unpardonable, unjustifiable, unconstitutional Bill is passed today in this Council of State, it will become a black chapter in the annals of this Upper House. The Bill should be thrown in the Bay of Bengal,\" says Vaiko.<\/p>","date":"2019-12-11 04:21:09","pin":"0","status":"1"},{"title":"Ritabrata Banerjee opposes the Bill","content":"<p>Ritabrata Banerjee, Independent member raises to oppose the Citizenship Bill. \"The idea of Tagore is under threat today. We must not partition our soul,\" he said.<\/p>","date":"2019-12-11 04:38:24","pin":"0","status":"1"},{"title":"Congress' Assam lawmaker Ripun Bora rises to oppose the Bill","content":"<p><img src=\"https:\/\/images.newindianexpress.com\/images\/liveimages\/BORA-.JPG\" width=\"600\" height=\"303\" alt=\"\" \/> <\/p>","date":"2019-12-11 04:51:16","pin":"0","status":"1"},{"title":"Bora rakes up protests in Assam, slams BJP for inciting violence","content":"<p>He says,\"Assam is burning. Entire Northeast is burning. You (BJP) have already finished Assam and now you want to finish the entire country. In the name of Citizenship Bill, people will be forced to run from pillar to post, they wont get citizenship\".<\/p>","date":"2019-12-11 04:56:29","pin":"0","status":"1"},{"title":"BJP's Subramanian Swamy begins his speech","content":"<p> <img src=\"https:\/\/images.newindianexpress.com\/images\/liveimages\/swamy-.JPG\" width=\"600\" height=\"308\" alt=\"\" \/><\/p>","date":"2019-12-11 04:57:45","pin":"0","status":"1"},{"title":"Northeast simmers in protest, three columns of Army deployed","content":"<p>Three Army columns requisitioned by civil Administration so far in Tripura and Assam. Two columns in Tripura are deployed and the third one in Assam is on standby. (ANI)<\/p>","date":"2019-12-11 04:59:53","pin":"0","status":"1"},{"title":"Sri Lankan Tamils didn't come to India due to religious persecution: Swamy tells Rajya Sabha","content":"<p>BJP leader Subramanian Swamy says that the Opposition is confused between CAB and NRC. \"Minorities in Pakistan, Afghanistan and Bangladesh have been oppressed. As far as Ahmadis or Shias are concerned, they would prefer going to Iran. Sri Lankan Tamils didn't come to India due to religious persecution. They came here due to a full-fledged war in the country,\" he added.<\/p>","date":"2019-12-11 05:09:19","pin":"0","status":"1"},{"title":"BJD extends support to Citizenship Bill","content":"<blockquote class=\"twitter-tweet\">\n<p lang=\"en\" dir=\"ltr\">Prasanna Acharya, BJD on <a href=\"https:\/\/twitter.com\/hashtag\/CitizenshipAmmendmentBill2019?src=hash&ref_src=twsrc%5Etfw\">#CitizenshipAmmendmentBill2019<\/a>: Our stand is the same as was in Lok Sabha. We are supporting the bill but we want certain amendments in the bill like including Sri Lanka in it. <a href=\"https:\/\/t.co\/KXYK6zJJAE\">pic.twitter.com\/KXYK6zJJAE<\/a><\/p>\n— ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1204724585670643712?ref_src=twsrc%5Etfw\">December 11, 2019<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2019-12-11 05:15:10","pin":"0","status":"1"},{"title":"Assam CM stranded at Guwahati airport","content":"<p>Assam Chief Minister Sarbananda Sonowal was left stranded at the Guwahati airport amid massive protests in the state over the Citizenship Bill.<\/p>","date":"2019-12-11 05:18:00","pin":"0","status":"1"},{"title":" Stupid attempt to make India a country for one sect: Kamal Haasan","content":"<p>\"It's stupid to attempt to make India a country for one sect. Young India will reject such plans soon. It's not primitive India for your old plans. We have a duty to amend the Constitution if there was any error, but to attempt to amend a flawless Constitution is a betrayal. Centre's law and plan is akin to a crime of attempting surgery on a healthy person,\" said Kamal Haasan.<\/p>","date":"2019-12-11 05:21:10","pin":"0","status":"1"},{"title":"Leader of the Opposition Ghulam Nabi Azad begins his speech","content":"<p><img src=\"https:\/\/images.newindianexpress.com\/images\/liveimages\/navi-.JPG\" width=\"600\" height=\"272\" alt=\"\" \/> <\/p>","date":"2019-12-11 06:09:45","pin":"0","status":"1"},{"title":"Assam and northeast states are burning: Azad","content":"<p>Ghulam Nabi Azad opens his speech, says is this problem not being faced by Hindus in Sri Lanka, or with Christians of Bhutan? Aren't Indian origin Muslims in Myanmar facing this problem? Why all these not included?<\/p>\n<p>He adds,  Assam and northeast states are burning. How can you say the country is happy?<\/p>\n<p>He later quotes Faiz Ahmed Faiz's \"Hum Dekhenge'.<\/p>","date":"2019-12-11 06:14:30","pin":"0","status":"1"},{"title":"Assam turns into tinderbox over Citizenship Bill","content":"<blockquote class=\"twitter-tweet\">\n<p lang=\"en\" dir=\"ltr\">Assam: Bus torched by protesters, near Janta Bhawan in Dispur, against <a href=\"https:\/\/twitter.com\/hashtag\/CitizenshipAmendmentBill2019?src=hash&ref_src=twsrc%5Etfw\">#CitizenshipAmendmentBill2019<\/a> <a href=\"https:\/\/t.co\/yUAkYPjWtk\">pic.twitter.com\/yUAkYPjWtk<\/a><\/p>\n— ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1204733708063784960?ref_src=twsrc%5Etfw\">December 11, 2019<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2019-12-11 06:19:56","pin":"0","status":"1"},{"title":"Amit Shah rises to reply","content":"<p><img src=\"https:\/\/images.newindianexpress.com\/images\/liveimages\/rajya-sabh-amit.JPG\" width=\"600\" height=\"292\" alt=\"\" \/> <\/p>","date":"2019-12-11 06:23:34","pin":"0","status":"1"},{"title":"Citizenship Bill was necessitated due to the partition: Amit Shah","content":"<p>\"The Citizenship Bill was necessitated due to the partition of India.  This bill was brought 50 years ago, then the situation had not been so severe today. Narendra Modi government is not just here to govern but to solve the issues of the country,\" says Amit Shah<\/p>","date":"2019-12-11 06:37:13","pin":"0","status":"1"},{"title":"Opposition creates ruckus during Amit Shah's reply in Rajya Sabha","content":"<p><img src=\"https:\/\/images.newindianexpress.com\/images\/liveimages\/ruck-.JPG\" width=\"600\" height=\"271\" alt=\"\" \/> <\/p>","date":"2019-12-11 06:54:38","pin":"0","status":"1"},{"title":"Shah slams Opposition, asks Congress why did they accept Jinnah's demand","content":"<p>The entire country knows that the reason behind partition was Jinnah and it was done due to his demand. But all I am asking is why did Congress agree to it? Why was it done on the basis of religion? It was asked that why were Rohingyas not included in the Bill? Rohingyas don't come to India directly, they go to Bangladesh and then infiltrate into India from there. <\/p>","date":"2019-12-11 07:10:26","pin":"0","status":"1"},{"title":"Amit Shah throws shade at Shiv Sena","content":"<p>Hitting out Shiv Sena's Sanjay Raut, Home Minister said, \"I am amazed at things people do to get in power\". He adds, \"Sena supported the Bill in Lok Sabha then what changed over night?\"","date":"2019-12-11 07:11:58","pin":"0","status":"1"},{"title":"'Bill meant to give citizenship, not snatch it away'","content":"Hiitng back at Congress' Kapil Sibal, Shah says,\"don't teach me the idea of India. We were born in this country and will die here\". He adds, \"The Bill is meant for providing citizenship, not to snatch it away. I want to appeal to Muslims in this country, don't get distracted by propaganda\".","date":"2019-12-11 07:19:42","pin":"0","status":"1"},{"title":"WATCH| Assam continues to burn over Citizenship Bill","content":"<p><iframe width=\"100%\" height=\"450\" src=\"https:\/\/www.youtube.com\/embed\/1s0HypqdFPk\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\"><\/iframe><\/p>","date":"2019-12-11 07:30:54","pin":"0","status":"1"},{"title":"Parliament lobby is getting cleared for division of vote","content":"<p><img src=\"https:\/\/images.newindianexpress.com\/images\/liveimages\/lobby-.JPG\" width=\"600\" height=\"262\" alt=\"\" \/> <\/p>","date":"2019-12-11 07:54:54","pin":"0","status":"1"},{"title":"Sena MPs abstain from voting","content":"<p> Shiv Sena lawmakers walk out of Rajya Sabha<\/p>","date":"2019-12-11 08:10:13","pin":"0","status":"1"},{"title":"Bill won't be sent to House committee","content":"<p>Rajya Sabha rejects motion to send Citizenship Amendment Bill to Select Committee of House; 113 votes against the motion, 92 in support<\/p>","date":"2019-12-11 08:12:38","pin":"0","status":"1"},{"title":"Sena to abstain from voting, confirms Sanjay Raut","content":"<p>Sanjay Raut, Shiv Sena's Rajya Sabha MP, on being asked if they have boycotted the voting said,\"yes, Shiv Sena has boycotted the voting\".<\/p>","date":"2019-12-11 08:35:40","pin":"0","status":"1"},{"title":"Citizenship Amendment Bill passed in Rajya Sabha with 125 Ayes","content":"","date":"2019-12-11 08:46:52","pin":"0","status":"1"},{"title":"Dark day in Indian history: Sonia Gandhi on Citizenship Bill","content":"<blockquote class=\"twitter-tweet\">\n<p lang=\"en\" dir=\"ltr\">Statement by Congress President Smt. Sonia Gandhi on the unconstitutional Citizenship Amendment Bill. <a href=\"https:\/\/twitter.com\/hashtag\/CABseBharatBachao?src=hash&ref_src=twsrc%5Etfw\">#CABseBharatBachao<\/a> <a href=\"https:\/\/t.co\/RS4OxrYsgg\">pic.twitter.com\/RS4OxrYsgg<\/a><\/p>\n— Congress (@INCIndia) <a href=\"https:\/\/twitter.com\/INCIndia\/status\/1204780493222240256?ref_src=twsrc%5Etfw\">December 11, 2019<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2019-12-11 08:49:59","pin":"0","status":"1"}]}