{"details":[{"title":"Protesters block railway track in West Bengal's Howrah, Kanchrapara","content":"<p>Following the 'Bharat Bandh' called by trade unions, protesters blocked railway tracks in Howrah and Kanchrapara in North 24 Parganas on Wednesday.  They raised anti-government slogans and criticised the Center for its policies. They were holding placards, posters and banners against the government.  Commuters faced difficulties as bus services were also affected. CPI (M) protesters also stopped the operation of state transport buses.<\/p>","date":"2020-01-08 09:55:18","pin":"0","status":"1"},{"title":"Trains halted in Odisha","content":"<p>Following trains are detained enroute at different stations --Bhadrak-Brahmapur passenger at Bhadrak, Kendujhargarh-Bhubaneswar passenger at Kendujhargarh, Bhubaneswar-Balangir InterCity at Bhubaneswar, Howrah-Yesvantpur Express at Brahmapur, Ichhapur-Cuttack MEMU at Brahmapur and Puri-Rourkela passenger at Bhubaneswar.<\/p>","date":"2020-01-08 10:31:31","pin":"0","status":"1"},{"title":"Shiv Sena extends support to Bharat Bandh","content":"<p>Shiv Sena has extended its support to trade unions' 'Bharat Bandh' call and slammed the central government for its policies and decisions.<\/p>\n<p>In its mouthpiece Saamana, Shiv Sena stated that during the \"first regime of BJP government, the industry and labour class was badly affected due to its decisions like demonetisation and Goods and Services Tax (GST).\"<\/p>","date":"2020-01-08 10:32:43","pin":"0","status":"1"},{"title":"Left leaders held during Bharat bandh protests in Andhra","content":"Police in Andhra Pradesh arrested leaders of the Left parties and trade unions as they tried to stop state-owned buses and staged road blockade on Wednesday as part of the nation-wide shutdown.\n\nProtesters were arrested in Vijayawada, Guntur, Ongole, Visakhapatnam, Kadapa and other towns when they tried to stop buses ofRoad Transport Corporation (RTC) from coming out of the depots. <\/p>\n<p><img src=\"https:\/\/images.newindianexpress.com\/images\/liveimages\/Andhra bandh_EPS(1).jpeg\" width=\"100%\" height=\"450\" alt=\"\" \/><\/p>","date":"2020-01-08 10:39:04","pin":"0","status":"1"},{"title":"Mixed response to Bharat bandh in Punjab, Haryana","content":"<p>The activists of several farmer associations were seen asking traders at several places in Punjab and Haryana to keep their shops and business establishments closed to mark the pan India protest.<\/p>\n<p>There was no report of any untoward incident from anywhere in the states.<\/p>","date":"2020-01-08 10:42:39","pin":"0","status":"1"},{"title":"Public life comes to a halt in Kerala","content":"<p>Public life has largely been paralyzed in the strike that began in Kerala at midnight .The public transport has totally been affected with the KSRTC buses remaining off the streets.<\/p>\n<p>Most of the shops remained closed. Some of the shop owners said they don't want to take unwanted risks by opening the shops. (<a href=\"https:\/\/www.newindianexpress.com\/states\/kerala\/2020\/jan\/08\/bharat-bandh-public-life-comes-to-a-halt-in-kerala-2086731.html\" target=\"_blank\">Read more<\/a>)<\/p>","date":"2020-01-08 11:06:08","pin":"0","status":"1"},{"title":"Rahul Gandhi extends support to Bharat Bandh, slams Modi govt policies ","content":"<p>Congress leader Rahul Gandhi says the BJP government's \"anti-people and anti-labour\" policies have created catastrophic unemployment in the country.  He alleged that this weakening of PSUs is being done to justify their sale to PM Narendra Modi's crony capitalists friends.<\/p>","date":"2020-01-08 11:24:33","pin":"0","status":"1"},{"title":"Little impact on normal life in Tamil Nadu, banking services partially hit.","content":"<p>The countrywide strike called by labour unions pressing for various demands on Wednesday has not disrupted normal life in Tamil Nadu so far, although banking services have been partially hit.<\/p>\n<p>Bus services and road transport were not affected, police said.<\/p>\n<p>Southern Railway sources said train services, including the suburban network here, were not impacted due to the stir.<\/p>\n<p>While shops and commercial establishments remained open, banking services were partially affected.<\/p>","date":"2020-01-08 12:18:54","pin":"0","status":"1"},{"title":"Strike will send wrong signal, says Nissan CIO","content":"<p>In a hard-hitting pun-laced facebook post, Nissan CIO Tony Thomas wondered how the delegates would be able to reach Kerala for the two-day investors meet from January 9 when there is a strike the previous day.<\/p>","date":"2020-01-08 12:19:57","pin":"0","status":"1"},{"title":"Strike affects mining activities in Jharkhand, say trade unions; officials dismiss claim","content":"<p>Trade union leaders have claimed that mining activities in Jharkhand were affected due to the Bharat Bandh. But officials assert that situation was normal in the sector.<\/p>\n<p>Normal life wasn't impacted with public transport plying as usual and markets and other commercial establishments operating normally.<\/p>","date":"2020-01-08 12:22:24","pin":"0","status":"1"},{"title":"Banking services hit as employees join all-India strike","content":"<p>The Bharat Bandh countrywide general strike on Wednesday called by trade unions has impacted front-end banking services like cheque clearing and deposits in varying degrees.<\/p>\n<p>Services like deposits and withdrawals, cheque clearing and instrument issuance are expected to be impacted further owing to the day-long strike.<\/p>","date":"2020-01-08 02:11:43","pin":"0","status":"1"},{"title":"Clashes break out between TMC and SFI members in Bengal","content":"<p>A clash broke out between the workers of Trinamool Congress (TMC) and Students' Federation of India (SFI) workers here on Wednesday during the 'Bharat Bandh' call given by trade Unions against the policies of the central government.<\/p>\n<p>Some of the protestors were seen threatening and asking commuters to leave the place. Meanwhile, a group of people attacked a person following which some girls came for his rescue. Police personnel were also present at the spot. (<a href=\"https:\/\/www.newindianexpress.com\/nation\/2020\/jan\/08\/clash-breaks-out-between-trinamool-congress-and-sfi-members-during-bharat-bandh-in-west-bengal-2086768.html\" target=\"_blank\"><strong>Read more<\/strong><\/a>)<\/p>","date":"2020-01-08 02:20:28","pin":"0","status":"1"},{"title":"Vehicles off roads, markets shut as bandh hits normal life in Assam","content":"<p>Normal life was hit in Assam on Wednesday as vehicles remained off the roads and markets were shut due to the strike called by trade unions against \"anti- people\" policies of the Centre. Shops and markets kept their shutters down though pharmacies were open, while educational institutions, especially schools remained closed. The scheduled examinations in colleges and higher educational institutions were, however, conducted normally. Public transport, both local and long distance, kept off the roads.<\/p>\n<p> <\/p>\n<p>The government had issued a directive on Tuesday to the Divisional Commissioners and district Deputy Commissioners to ensure normal functioning of its offices and services during the strike, and also warned of pay cut and other actions.<\/p>\n<p>In Guwahati, trade union activists staged demonstration in front of the Kamrup (Metro) district Deputy Commissioner's office. The strikers also held demonstration in front of the Numaligarh Refinery Ltd (NRL) in upper Assam. (PTI) <\/p>\n<p> <\/p>","date":"2020-01-08 03:05:40","pin":"0","status":"1"},{"title":"General strike evokes mixed response in Rajasthan","content":"<p>The nationwide strike call given by 10 central trade unions evoked a mixed response in Rajasthan during morning hours on Wednesday. Banking and roadways services were partially affected as members of trade unions joined the strike.<\/p>\n<p>A demonstration was held in front of the LIC Building in Jaipur.  Rajasthan roadways employees affiliated with CITU also participated in the 'Bharat bandh'. <\/p>","date":"2020-01-08 03:08:08","pin":"0","status":"1"},{"title":"Bus torched in Malda, 55 protesters held in Kolkata","content":"<p>Incidents of violence and arson were reported from various parts of West Bengal with buses, a police vehicle and government properties being vandalised by strikers who tried to enforce the 24-hour bandh on Wednesday.<\/p>\n<p>Protesters blocked a major road in Sujapur area of Malda district, set tyres on fire, ransacked government buses and torched several vehicles, including a police van.<\/p>\n<p><a href=\"https:\/\/www.newindianexpress.com\/nation\/2020\/jan\/08\/violence-arson-across-bengal-as-strikers-try-to-enforce-bharat-bandh-55-arrested-in-kolkata-2086793.html\" target=\"_blank\"><strong>(READ FULL REPORT) <\/strong><\/a><\/p>","date":"2020-01-08 03:32:47","pin":"0","status":"1"},{"title":"Banking services hit in several parts of India","content":"<p><img src=\"https:\/\/images.newindianexpress.com\/images\/liveimages\/Gujarat bank services- PTI(1).jpg\" width=\"100%\" height=\"450\" alt=\"\" \/> <\/p>\n<p>A branch of Oriental Bank of Commerce wears a deserted look during Trade unions' nationwide strike against the Union government in Bhopal Wednesday Jan. 8 2020. (Photo | PTI)<\/p>","date":"2020-01-08 03:45:10","pin":"0","status":"1"},{"title":"Tepid impact of trade union strike in Karnataka","content":"<p>The nationwide strike called by 10 trade unions in protest against the centre's 'anti- people' policies had no effect on normal life in the city and other parts of Karnataka, with most of the vehicles including government buses plying. While government buses including the Karnataka State Road Transport Corporation (KSRTC) were plying as usual, train services remained unaffected.<\/p>\n<p>Schools, colleges and business establishments also functioned.<\/p>\n<p>However, there was some impact of the strike at the Agriculture Produce Marketing Committee yards where the labourers did not turn up.<\/p>\n<p>In Mangaluru, inter-state services of Kerala State Road Transport Corporation were suspended. Some miscreants pelted a Karnataka State Road Transport Corporation bus with stones in Madikeri town in Kodagu district this morning. <\/p>","date":"2020-01-08 03:49:20","pin":"0","status":"1"},{"title":"Banking services hit in Telangana","content":"<p>Banking services across Telangana were severely hit by the nationwide strike called by various trade unions protesting the central government's 'anti-people' policies on Wednesday.<\/p>\n<p>However, most of the shops and business establishments were open while transport services remained unaffected.<\/p>\n<p>The strike by as many as three lakh employees and workers was underway with the participation of members of various trade unions in the state, senior leader of Telangana CPI, Sudhakar said.<\/p>\n<p>Operations in all public sector banks except SBI were affected. <\/p>","date":"2020-01-08 03:51:22","pin":"0","status":"1"},{"title":"Banks, financial institutions affected by strike in Tripura","content":"<p> The strike called by trade unions evoked a mixed response in BJP-ruled Tripura where banks and offices of financial institutions remained shut in most places on Wednesday, even as train services and vehicles operated as usual. (PTI)<\/p>","date":"2020-01-08 04:11:33","pin":"0","status":"1"},{"title":"No effect of strike in Goa; banking ops normal","content":"<p>Normal life remained unaffected so far in Goa on Wednesday on the day of a nationwide strike called by 10 central trade unions to protest against the government's \"anti-people\" policies. Various labour unions held a public meeting under the banner of the 'Goa Convention of Workers' at the Azad Maidan in Panaji. <\/p>","date":"2020-01-08 04:12:17","pin":"0","status":"1"},{"title":"","content":"<p> <img src=\"https:\/\/images.newindianexpress.com\/images\/liveimages\/Coimbatore protests- PTI.jpg\" width=\"100%\" height=\"450\" alt=\"\" \/><\/p>\n<p>Members of various trade unions stage a rally during the trade unions' nationwide strike over various demands in Coimbatore Wednesday. (Photo | PTI)<\/p>","date":"2020-01-08 04:13:31","pin":"0","status":"1"},{"title":"WATCH | Glimpses of Bharat Bandh","content":"<p><iframe width=\"100%\" height=\"450\" src=\"https:\/\/www.youtube.com\/embed\/oZVxgafScVw\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\"><\/iframe><\/p>","date":"2020-01-08 04:41:38","pin":"0","status":"0"},{"title":"WATCH | Glimpses of Bharat Bandh","content":"<p><iframe width=\"100%\" height=\"450\" src=\"https:\/\/www.youtube.com\/embed\/oZVxgafScVw\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\"><\/iframe><\/p>","date":"2020-01-08 04:41:38","pin":"0","status":"1"},{"title":"Mamata warns CPI (M) of strict action","content":"<p>Lashing out against the CPM for indulging in \"violence\" to enforce a general strike in West Bengal, Chief Minister Mamata Banerjee on Wednesday warned the Marxists \"not to fish in troubled waters\", and averred police would take strong action<strong><a href=\"https:\/\/www.newindianexpress.com\/nation\/2020\/jan\/08\/bharat-bandh-mamata-slams-cpm-dadagiri-says-those-damaging-property-will-face-the-music-2086828.html\" target=\"_blank\">. (READ FULL REPORT)<\/a><\/strong><\/p>\n<p> <\/p>","date":"2020-01-08 04:50:16","pin":"0","status":"1"},{"title":" Banking services partially hit in Gujarat","content":"<p>Banking services were partially hit in Gujarat on Wednesday due to the nationwide strike called by 10 central trade unions to protest against the Central government's \"anti-labour\" policies.<\/p>\n<p>Transport services are absolutely normal across the state while offices of various business establishments also remained open.<\/p>\n<p>Although trade unions claimed that factory production was hit in many parts of Gujarat, industrialists said it was business as usual.<\/p>","date":"2020-01-08 05:17:44","pin":"0","status":"1"},{"title":"","content":"<p><img src=\"https:\/\/images.newindianexpress.com\/images\/liveimages\/Tirupati trade union protests- EPS.jpeg\" width=\"100%\" height=\"450\" alt=\"\" \/> <\/p>\n\nTrade Unions took out a massive rally in Tirupati city as part of Nationwide strike (Photo | Madhav K, EPS)","date":"2020-01-08 05:21:24","pin":"0","status":"1"},{"title":"Strike evokes little response in Uttarakhand","content":"<p>The countrywide strike called by trade unions evoked little response in Uttarakhand on Wednesday even as their affiliates staged a dharna at the inter-state bus terminal here.<\/p>\n<p>Slogan-shouting unionists sat on a dharna inside the ISBT premises as a token of support to the strike but movement of buses remained largely unaffected, the Divisional Manager's office here said. Banking services in the state also remained unaffected as most banks functioned as usual. <\/p>","date":"2020-01-08 05:22:26","pin":"0","status":"1"},{"title":"National capital largely unaffected by nationwide trade union strike ","content":"<p> The national capital largely remained unaffected by the nation-wide strike called by trade unions on Wednesday, though most industrial workers stayed away from work.<\/p>\n<p>Metro and the Delhi Transport Corporation (DTC) services functioned normally despite the strike call.<\/p>\n<p>Officials said no trains have been affected in the national capital, but some Delhi-bound trains from Odisha and West Bengal could be affected.<\/p>\n<p>Widespread intermittent rains in the national capital also reduced the intensity of the strike.<\/p>\n<p>The industrial areas of Mayapuri and Wazirabad witnessed protest march.<\/p>","date":"2020-01-08 05:23:22","pin":"0","status":"1"},{"title":"","content":"<p><img src=\"https:\/\/images.newindianexpress.com\/images\/liveimages\/Trivandrum protests- EPS.jpeg\" width=\"100%\" height=\"450\" alt=\"\" \/> <\/p>\n<p>Joint Trade Union Action Council members block an autorickshaw in Thiruvananthapuram asking the passenger to alight the vehicle during the Bharat Bandh. (Photo | B P Deepu, EPS)<\/p>","date":"2020-01-08 05:30:19","pin":"0","status":"1"},{"title":"Bank operations hit in MP, other services unaffected","content":"<p>Banking services in Madhya Pradesh were affected on Wednesday due to the nationwide strike called by 10 Central trade union to protest against the Central government's \"anti-labour\" policies.<\/p>\n<p>However, transport and other services remained unaffected with markets and petrol pumps remaining open across the state.<\/p>\n<p>Several bank employees under the banner of the All India Bank Employees Association and All India Bank Officers Association among others took out a rally at MP Nagar here.<\/p>","date":"2020-01-08 05:32:29","pin":"0","status":"1"},{"title":"Over 800 workers, including MPs arrested in Coimbatore","content":"<p>Two MPs of Left parties were among 800 workers of eight trade unions who were arrested on Wednesday while attempting to stage a demonstration as part of the nationwide strike to protest the \"anti-labour\" policies of the BJP-led government at the Centre. The demonstration was led by CPI Lok Sabha MP, K Subbaryan, who is also Tamil Nadu AITUC president and CPI (M) MP, P R Natarajan. They shouted slogans against the amendment to Labour laws and economic slowdown, among others.<\/p>","date":"2020-01-08 05:35:05","pin":"0","status":"1"},{"title":"Mamata Banerjee instigated violence: CPM","content":"<p>CPI(M) politburo member Mohammed Salim on Wednesday alleged that West Bengal Chief Minister Mamata Banerjee instigated TMC cadres and police personnel to indulge in violence in the state during the one-day strike called by 10 central trade unions.<\/p>\n<p>Salim also denied claims that Left cadres and Congress workers were involved in arson in Malda district.&nbsp;<strong><a href=\"https:\/\/www.newindianexpress.com\/nation\/2020\/jan\/08\/bharat-bandh-cpm-retorts-mamata-says-bengal-cm-instigated-violence--2086844.html\" target=\"_blank\">(READ FULL STORY)<\/a><\/strong><\/p>","date":"2020-01-08 06:13:48","pin":"0","status":1},{"title":"Honda Makers, Bajaj Auto, component makers affected","content":"<p>Production at Honda Motorcycle and Scooter India's (HMSI) Manesar plant in Haryana, Bajaj Auto's Chakan unit and factories of various auto component makers was hit on Wednesday by the day-long strike called by 10 major trade unions against the Centre's &quot;anti-people&quot; policies.<\/p>\n<p>The strike, however, had no impact on the production of auto majors Maruti Suzuki India, Hero MotoCorp, Honda Cars India, Mahindra &amp; Mahindra, Tata Motors and Hyundai Motors India as their plants in various parts of the country functioned normally. <strong><a href=\"https:\/\/www.newindianexpress.com\/business\/2020\/jan\/08\/trade-union-strike-hmsi-bajaj-auto-component-makers-affected-2086864.html\" target=\"_blank\">(READ FULL STORY)<\/a><\/strong><\/p>","date":"2020-01-08 06:21:17","pin":"0","status":1},{"title":"","content":"<p><img src=\"https:\/\/images.newindianexpress.com\/images\/liveimages\/trade bandh- Hyderabad- EPS.jpg\" width=\"900\" height=\"450\" alt=\"\" \/>&nbsp;<\/p>\n<p>RBI employees staged a protest in front of RBI in Hyderabad on Wednesday. (Photo | S Senbagapandiyan, EPS)<\/p>","date":"2020-01-08 06:23:37","pin":"0","status":1},{"title":"Trade unions protest in Shimla despite heavy snow","content":"<p>Trade unions held protests in Shimla and other parts of BJP-ruled Himachal Pradesh on Wednesday despite heavy snowfall and rainfall.<\/p>\n<p>In the state capital, trade unions led by CITU state President Vijendra Mehra staged a protest and raised slogans against the Central government. CPI-M legislator Rakesh Singha and Mehra addressed the gathering.<\/p>\n<p>Banks and commercial establishments were largely open while shops in some towns were closed for sometime on the pan-India protest call. (IANS)<\/p>\n<p>However, there was no report of traffic being held up due to the strike. There was also no report of violence anywhere, police officials here said.&nbsp;<\/p>","date":"2020-01-08 06:54:24","pin":"0","status":1},{"title":"LIC employess in Lucknow participate in 'Bharat Bandh' by trade unions","content":"<p>Employees of All India Life Insurance Corporation here participated in the 'Bharat Bandh' call giving by trade unions against the policies of the central government.<\/p>\n<p>They raised slogans against the Centre and its policies.<\/p>\n<p>&quot;We are protesting against changes in labour laws, disinvestment of the public sector, taking LIC to the stock market, inflation and unemployment. We demand social protection for labours,&quot; Alok Tiwari, chief of All India LIC Employees Association told ANI.&nbsp;<\/p>","date":"2020-01-08 07:06:30","pin":"0","status":1}]}