{"details":[{"title":"Brief highlights of what happened in the last 24 hours","content":"<ul>\n    <li>236 Indians who were evacuated from Iran were brought to Jaisalmer<\/li>\n    <li>Coronavirus positive cases in Maharashtra saw a huge jump to 32<\/li>\n    <li>Tirumala Tirupati Devasthanam cancels waiting system for devotees in compartments<\/li>\n    <li>Kerala government imposes restrictions on large gatherings in Guruvayur and Kodungallur temples in Thrissur district<\/li>\n    <li>Pilgrimage to Kartarpur Sahib suspended<\/li>\n    <li>Andhra Local body polls have been postponed<\/li>\n    <li>Uttarakhand has reported its first case<\/li>\n    <li>Academic activities of University of Hyderabad suspended<\/li>\n    <li>PM Modi addressef coronavirus crisis over video conference of SAARC member countries<\/li>\n<\/ul>","date":"2020-03-16 01:01:22","pin":"0","status":"1"},{"title":"Kerala IT parks to follow strict protocols to combat COVID 19 threat","content":"<ol>\n    <li>Thermal screening is being deployed in all the buildings from tomorrow onwards. Those who have higher than normal temperatures and other symptoms like cough, cold etc will be directed to the medical facility in the IT parks for further directions. Employees may be requested to cooperate with this.<\/li>\n    <li>The Park campuses are being sanitised on a daily basis. The campuses will be fumigated and disinfected on a regular basis.<\/li>\n    <li>Work from home may be encouraged to the maximum extent possible. <\/li>\n    <li>Visitor entry to the campuses will be restricted. Only highly essential visits will be permitted to the campus.<\/li>\n    <li>All conferences and meetings of large gatherings may please be postponed <\/li>\n    <li>Large gatherings may please be avoided in the buildings \/ campuses<\/li>\n    <li>Crowd at food courts may be avoided by using appropriate time slots for floors\/ companies<\/li>\n    <li>Foreign visitors will be permitted only if they have undergone health screening at the port of entry. They may also have to undergo quarantine, if required, as per the Government guidelines.<\/li>\n    <li>Employees who have returned from Corona affected areas may also be quarantined, if required, as per the Government guidelines<\/li>\n    <li>All non-essential travel of the employees may please be avoided<\/li>\n    <li>Please make use of the Technopark\/ Infopark medical facility wherever required.<\/li>\n    <li>Employees who have fever, cold, cough, soar throat etc may avoid attending office<\/li>\n    <li>Employees may keep social distancing - keep at a suitable distance from others in gatherings, public transport etc<\/li>\n    <li>In case any employee develops any symptoms, please make use of the Park ambulance to go to hospital.<\/li>\n    <li>Gyms inside the parks will be closed until further orders<\/li>\n    <li>All games\/ matches within the IT parks have been postponed<\/li>\n    <li>All companies are requested to prepare Business Continuity plans, in case of any disruptions in the working, even though unlikely as of now<\/li>\n<\/ol>","date":"2020-03-16 01:02:37","pin":"0","status":"1"},{"title":"Jaipur doctors cure three out of four coronavirus patients via combination of medicines","content":"<p>Amid the global scare over coronavirus, a major piece of good news has surfaced in Jaipur. Three out of the four COVID-19 patients have been cured with a novel combination of medicines given to Malaria, Swine Flu and HIV positive patients at the state's biggest government hospital, the Sawai Mansingh Hospital in Jaipur.<a href=\"https:\/\/www.newindianexpress.com\/nation\/2020\/mar\/15\/jaipur-doctors-cure-three-out-of-four-coronavirus-patients-via-combination-of-medicines-2117077.html\" target=\"_blank\"><strong>(READ FULL STORY HERE) <\/strong><\/a><\/p>","date":"2020-03-16 01:03:03","pin":"0","status":"1"},{"title":"Tata Motors asks staff in office-based roles to work from home amid COVID-19 outbreak","content":"<p>Tata Motors has asked its staff in office-based roles at headquarters and regional offices to work from home with effect from Monday in the wake of the coronavirus pandemic, according to an internal memo by the company's Managing Director and CEO Guenter Butschek to its employees.  With the outbreak spreading beyond China's border, the company has constituted a team to monitor and initiate actions to reduce risk to employees and has developed a three tier response plan based on incidence of infection in cities it operates it or has manufacturing sites. <a href=\"https:\/\/www.newindianexpress.com\/business\/2020\/mar\/15\/tata-motors-asks-staff-in-office-based-roles-to-work-from-home-amid-covid-19-outbreak-2117094.html\" target=\"_blank\"><strong>(READ FULL STORY HERE)<\/strong><\/a><\/p>","date":"2020-03-16 01:20:57","pin":"0","status":"1"},{"title":"Interview with India's first coronavirus survivor","content":"<blockquote class=\"twitter-tweet\">\n<p lang=\"en\" dir=\"ltr\">India's first <a href=\"https:\/\/twitter.com\/hashtag\/Coronavirus?src=hash&ref_src=twsrc%5Etfw\">#Coronavirus<\/a> patient is not only a survivor, but also a warrior. Listen to her exclusive interview to TNIE about her fight with <a href=\"https:\/\/twitter.com\/hashtag\/COVID19?src=hash&ref_src=twsrc%5Etfw\">#COVID19<\/a>.<a href=\"https:\/\/twitter.com\/xpresskerala?ref_src=twsrc%5Etfw\">@xpresskerala<\/a> <a href=\"https:\/\/twitter.com\/gsvasu_TNIE?ref_src=twsrc%5Etfw\">@gsvasu_TNIE<\/a> <a href=\"https:\/\/twitter.com\/shailajateacher?ref_src=twsrc%5Etfw\">@shailajateacher<\/a> <a href=\"https:\/\/twitter.com\/CMOKerala?ref_src=twsrc%5Etfw\">@CMOKerala<\/a> <a href=\"https:\/\/twitter.com\/drthomasisaac?ref_src=twsrc%5Etfw\">@drthomasisaac<\/a><a href=\"https:\/\/twitter.com\/MoHFW_INDIA?ref_src=twsrc%5Etfw\">@MoHFW_INDIA<\/a> <a href=\"https:\/\/twitter.com\/drharshvardhan?ref_src=twsrc%5Etfw\">@drharshvardhan<\/a> <a href=\"https:\/\/t.co\/xN43cRQiOd\">https:\/\/t.co\/xN43cRQiOd<\/a><\/p>\n— The New Indian Express (@NewIndianXpress) <a href=\"https:\/\/twitter.com\/NewIndianXpress\/status\/1239231144962506752?ref_src=twsrc%5Etfw\">March 15, 2020<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2020-03-16 01:26:44","pin":"0","status":"1"},{"title":"Global death toll from coronavirus crosses 6400-mark with over 1,60,000 cases","content":"<p>The number of novel coronavirus cases globally stood at 163,930 with 6,420 deaths, across 141 countries and territories at 11:30 pm (IST) on Sunday, according to a tally compiled by AFP from official sources.<a href=\"https:\/\/www.newindianexpress.com\/world\/2020\/mar\/16\/global-death-toll-from-coronavirus-crosses-6400-mark-with-over-160000-cases-2117119.html\" target=\"_blank\"><strong>(READ FULL STORY HERE)<\/strong><\/a><\/p>","date":"2020-03-16 01:28:31","pin":"0","status":"1"},{"title":"","content":"<blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Union Ministry of Health and Family Welfare: A total of 110 confirmed <a href=\"https:\/\/twitter.com\/hashtag\/COVID19?src=hash&ref_src=twsrc%5Etfw\">#COVID19<\/a> cases reported across India, including 17 foreign nationals, as of 11:30 pm, 15th March. <a href=\"https:\/\/t.co\/UdaxIw5H2D\">pic.twitter.com\/UdaxIw5H2D<\/a><\/p>— ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1239258585281884160?ref_src=twsrc%5Etfw\">March 15, 2020<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2020-03-16 01:29:42","pin":"0","status":"1"},{"title":"Pune administration mulling Section 144 of CRPC to check epidemic","content":"<p>Addressing reporters, Pune Divisional Commissioner Deepak Mhaisekar said the administration has decided to change its strategy to control the spread of the coronavirus in view of the rising number of cases, which stood at 16 in Pune and Pimpri-Chinchwad, as on Sunday. <a href=\"https:\/\/www.newindianexpress.com\/nation\/2020\/mar\/16\/coronavirus-pune-administration-mulling-section-144-of-crpc-to-check-epidemic-2117189.html\" target=\"_blank\"><strong>(READ FULL STORY HERE)<\/strong><\/a><\/p>","date":"2020-03-16 02:44:21","pin":"0","status":"1"},{"title":"218 evacuated from Italy sent to ITBP quarantine facility","content":"<p>An Air India flight carrying them from Milan landed at the Indira Gandhi International Airport (IGIA) around 9.45 am. <a href=\"https:\/\/www.newindianexpress.com\/nation\/2020\/mar\/16\/coronavirus-218-evacuated-from-italy-sent-to-itbp-quarantine-facility-2117182.html\" target=\"_blank\"><strong>(READ FULL STORY HERE)<\/strong><\/a><\/p>","date":"2020-03-16 02:45:17","pin":"0","status":"1"},{"title":"Nashik schools, malls to remain shut till March 31","content":"<p>Nashik district collector has issued a notification ordering closure of cinema halls, gymnasiums, auditoriums and swimming pools in the city till March 31 as a measure to check spread of novel coronavirus.Barring SSC and HSC examinations, schools and colleges in the city will also remain closed till March 31, it stated.However, schools in rural parts will remain open.<\/p>","date":"2020-03-16 02:45:52","pin":"0","status":"1"},{"title":"135 people put in home isolation in Mizoram over coronavirus outbreak","content":"Most of them were undergoing self-quarantine and did not show symptoms of the deadly virus, state health principal director Dr F Lallianhlira said.","date":"2020-03-16 02:48:36","pin":"0","status":"1"},{"title":"Coronavirus scare: Two Nigerians in isolation ward of Assam","content":"<ul>\n    <li>During a routine check, the two Guwahati-bound foreigners were taken into custody by police personnel of the Churaibari outpost near Assam-Tripura border and sent to Karimganj Civil Hospital for necessary tests, a senior officer said.<\/li>\n    <li>They had entered India from the neighbouring country on Saturday, Churaibari outpost in-charge Mintu Seal said. The Nigerians have been admitted in the isolation ward and will remain there till the doctors give a clearance, the police officer said.<\/li>\n<\/ul>","date":"2020-03-16 02:50:11","pin":"0","status":"1"},{"title":"Nearly 170 people quarantined at south Delhi facility, says health department","content":"<ul>\n    <li>A medical team is stationed at the quarantine facility round-the-clock, it said.  A total of 1,77,203 people returning from countries affected by coronavirus have been screened at the Delhi Airport and placed under surveillance.  As many as 3,389 people were screened on Sunday, the health department said in a statement.<\/li>\n    <li>\"As many as 168 passengers, after returning from different countries, have been quarantined at a government quarantine facility in South district.  A round-the-clock medical team is stationed at the facility,\" the statement said.  All private hospitals and nursing homes have been asked to report daily about foreign nationals undergoing treatment there.<\/li>\n    <li>They have also been directed to create a 'flu corner' for screening of suspected cases of COVID-19, it added.  According to the statement, the Crisis Support and Counselling Centre at the Institute of Human Behaviour & Allied Sciences (IHBAS) has been put on standby to respond to counselling needs of quarantined persons.<\/li>\n<\/ul>","date":"2020-03-16 02:53:21","pin":"0","status":"1"},{"title":"Suspected COVID-19 patient escapes from Bihar hospital","content":"<blockquote class=\"twitter-tweet\">\n<p lang=\"en\" dir=\"ltr\">Bihar: A suspected <a href=\"https:\/\/twitter.com\/hashtag\/COVID19?src=hash&ref_src=twsrc%5Etfw\">#COVID19<\/a> patient escaped from Darbhanga Medical College & Hospital, yesterday. Rajeev Ranjan, Medical Superintendent says, \"Patient escaped while he was being taken to the isolation ward. We have informed police & district administration\". (15.03.20) <a href=\"https:\/\/t.co\/X75Kll1zow\">pic.twitter.com\/X75Kll1zow<\/a><\/p>\n— ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1239286264244797440?ref_src=twsrc%5Etfw\">March 15, 2020<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2020-03-16 02:54:06","pin":"0","status":"1"},{"title":"Patna HC to hear only urgent matters till March 31","content":"<ul>\n    <li>The decision was taken after Chief Justice Sanjay Karol held meetings with all the stakeholders, including high court judges, members of the registry and those of the bar associations, according to a notification.<\/li>\n    <li>\"The high court will hear only regular bail and most urgent matters till March 31,\" Yogesh Chandra Verma, chairman of the coordination committee of all the three lawyers' associations of the high court, told PTI.<\/li>\n    <li>\"The main purpose behind the move is to prevent the congregation of large gatherings in order to contain COVID-19,\" Verma said.  All cases, except bail matters (regular\/anticipatory), listed for hearing on Monday, will now be listed for April 6.  Each court will hear only 25 bail matters listed for Monday, the high court registry said in a notice.<\/li>\n<\/ul>","date":"2020-03-16 02:55:02","pin":"0","status":"1"},{"title":"First-person account: Being self-quarantined in the time of coronavirus","content":"<p><iframe width=\"560\" height=\"315\" src=\"https:\/\/www.youtube.com\/embed\/YcpuXtud3IE\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\"><\/iframe><\/p>","date":"2020-03-16 02:56:04","pin":"0","status":"1"},{"title":"Two coronavirus patients in Delhi discharged from hospitals","content":"<p>So far, Delhi has seen seven positive cases including a patient who died.  Of these, two persons who had earlier tested positive for COVID-19 and were admitted to hospitals have been discharged following treatment, the Delhi Health Department said in a statement.<\/p>","date":"2020-03-16 02:56:47","pin":"0","status":"1"},{"title":"Building in Mindspace complex evacuated and disinfected in Thane","content":"<ul>\n    <li>A building in the Mindspace Complex in Airoli in Navi Mumbai was evacuated and disinfected on Sunday after one of the persons working in the sprawling business park tested positive for novel coronavirus, a civic body official said.  The Covid-19 patient is being treated in Kasturba Hospital in Mumbai and all co-workers have been asked to observe home isolation, Navi Mumbai Municipal Corporation (NMMC) Medical Officer Dr Balasaheb Sonawane said.<\/li>\n    <li>\"A building in the Mindspace Complex in Airoli was evacuated and disinfected as per protocol to tackle the coronavirus outbreak,\" he said.  An official said a person from the Philippines, who was in the country on a 40-day visa, and was staying in a mosque in Vashi, also tested positive for novel coronavirus and has been quarantined in Kasturba Hospital.<\/li>\n    <li>\"He was in Vashi between March 3-12 for a religious function.  Nine people who came in contact with him have tested negative for the virus,\" the official said.<\/li>\n<\/ul>","date":"2020-03-16 02:58:46","pin":"0","status":"1"},{"title":"CISF sets up open-air security station on Delhi airport tarmac","content":"<ul>\n    <li>The security station is equipped with hand-held detectors, baggage screening x-ray machines and door-frame metal detectors to frisk passengers who are brought to the Indira Gandhi International Airport (IGIA) on way to quarantine centres created in other cities.  As these passengers cannot be brought to the main terminal area and have an onward journey, it was decided to create a security station right along the tarmac, a Central Industrial Security Force spokesperson said.<\/li>\n    <li>This open-air station cleared the first lot of 236 passengers on Sunday morning when Indian passengers evacuated from Iran landed here on way to an Army quarantine centre in Rajasthan's border town of Jaisalmer.<\/li>\n    <li>The passengers de-boarded a Mahan airlines flight at about 3 am and were transferred to two Air India charters to Jaisalmer after each passenger was frisked by CISF staff and their baggages scanned at the makeshift security station, the spokesperson said.<\/li>\n<\/ul>","date":"2020-03-16 03:00:04","pin":"0","status":"1"},{"title":"Report of Kerala woman quarantined in Goa awaited","content":"<ul>\n    <li>The 48-year-old is currently in the isolation ward of Goa Medical College and Hospital and her sample has been sent to NIV in Pune, an official said.  Another 65 people are under home observation in the state, he added.  Meanwhile, as per data available, 14,875 passengers were screened at Goa airport, including 344 on Sunday.<\/li>\n    <li>The state government has set up a 30-bed isolation ward in GMCH, while 16 beds have been kept aside at sub district hospital in Chicalim, 12 in sub district hospital in Ponda and 12 in Margao's TB Hospital in Margao.<\/li>\n<\/ul>","date":"2020-03-16 03:01:27","pin":"0","status":"1"},{"title":"Gujarat schools, theatres to be shut for 2 weeks","content":"<ul>\n    <li>The Gujarat government on Sunday ordered the closure of educational institutions, cinema halls and swimming pools for two weeks starting Monday as part of preventivemeasures against the novel coronavirus threat, a top official said.  The state has not reported a single positive case of coronavirus as yet.  An official said action would be taken against those spitting in public as part of the measures to curb the spread of the virus.<\/li>\n    <li>\"For two weeks starting from Monday, all educational institutions, including schools, colleges, tuition classes, Anganwadis etc will remain closed.  Teachers and office staff will attend the institutions but classes will remain suspended for a period of two weeks,\" Chief Secretary Anil Mukim said.<\/li>\n    <li>\"All swimming pools and cinema halls across the state will remain closed till March 29, starting with immediate effect,\" he said after a review meeting on coronavirus held in Gandhinagar.<\/li>\n    <li>\"Coronavirus is transferred through droplets of the contaminatedperson.  Considering this, the state government has banned spitting in the open.  Those who are caught spitting in the open will be fined Rs 500.  This will be enforced by municipal corporations and municipalities in urban areas and gram panchayats in rural areas,\" he said.<\/li>\n<\/ul>","date":"2020-03-16 03:03:03","pin":"0","status":"1"},{"title":"Total number of coronavirus survivors now 13: Centre","content":"<blockquote class=\"twitter-tweet\">\n<p lang=\"en\" dir=\"ltr\">Union Ministry of Health & Family Welfare: Three people from Rajasthan are now nCoronavirus-free. The total number of patients now free of <a href=\"https:\/\/twitter.com\/hashtag\/COVID19?src=hash&ref_src=twsrc%5Etfw\">#COVID19<\/a> is 13. <a href=\"https:\/\/t.co\/9eT9RtqRm5\">https:\/\/t.co\/9eT9RtqRm5<\/a> <a href=\"https:\/\/t.co\/u5iZC6sS3n\">pic.twitter.com\/u5iZC6sS3n<\/a><\/p>\n— ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1239306115604598784?ref_src=twsrc%5Etfw\">March 15, 2020<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2020-03-16 03:33:16","pin":"0","status":"1"},{"title":"Locals protest against quarantine facility being set up at Delhi's Dwarka","content":"<ul>\n    <li>A group of around 30 people gathered outside the Delhi Police Training School at Dwarka on Sunday to protest against a quarantine facility being set up in the area, police said.  A quarantine facility for coronavirus patients is being set up near the police training school, they added.<\/li>\n    <li>The residents of Dwarka Sector 9, who lived near the police training school, had apprehensions that they would get infected by the virus, a senior police official said.  \"We told them that it will not affect the area or the people and they dispersed after about an hour,\" he added.<\/li>\n<\/ul>","date":"2020-03-16 03:34:02","pin":"0","status":"1"},{"title":"Six COVID-19 cases in Mumbai and MMR above 60 years of age: BMC","content":"<ul>\n    <li>While seven of the nine patients are males, two are females, according to the official.  Dr Daksha Shah, deputy health director of BMC said that of the nine patients admitted at the civic-run Kasturba Hospital, five are from Mumbai and rest four from the Mumbai Metropolitan Region (MMR).<\/li>\n    <li>\"All six patients, who are above 60 years old, have co-morbid conditions like diabetes and hypertension,\" Dr Shah told reporters at the BMC headquarters.  Shah further said that eight of the total nine patients had a history of foreign travel while another person got infected from a close contact.  A total of 380 of the 458 patients admitted at Kasturba hospital for suspected coronavirus infection have tested negative.<\/li>\n    <li>\"All 43 samples tested today (Sunday) returned negative, which is a good thing.  The second batch of testing is going on,\" she said, adding that the laboratory at Kasturba hospital will work 24x7 henceforth.  Shah said that while 98 suspected cases were admitted at the hospital, around 1500 people have gone through the testing at the hospital until now.<\/li>\n    <li>Teams of the Brihanmumbai Municipal Corporation (BMC) comprising doctors and paramedical staff have so far visited 10,000 housing societies and apprised them about coronavirus, distributed posters and took details about travellers having a history of international travel.  Dr Shah said currently over 200 people are under home quarantine in the city.<\/li>\n    <li>\"All asymptomatic international travellers, who are advised home quarantine should strictly follow the home quarantine guidelines,\" she said.  Maharashtra has reported the hig<\/li>\n<\/ul>","date":"2020-03-16 03:35:03","pin":"0","status":"1"},{"title":"Mahinda Rajapaksa thanks Modi","content":"\"I propose setting up of SAARC ministerial-level group to deal with issues related to coronavirus. Many lessons learnt from sharing of experiences; thanks PM Modi for offering assistance to SAARC nations, the Sri Lankan President said.","date":"2020-03-16 03:40:32","pin":"0","status":"1"},{"title":"Tamil Nadu opens door to forcible hospitalisation, empowers collectors to seal areas to prevent outbreak","content":"<p>The persons who can be forcibly hospitalised or isolated include those who had travelled to any country or area, where COVID-19 has been reported in the last 28 days and those who had a history of coming in contact with anyone suspected or confirmed to be carrying COVID - 19. <a href=\"https:\/\/www.newindianexpress.com\/states\/tamil-nadu\/2020\/mar\/16\/coronavirus-tamil-nadu-opens-door-to-forcible-hospitalisation-empowers-collectors-to-seal-areas-to-p-2117209.html\" target=\"_blank\"><strong>(READ FULL STORY HERE)<\/strong><\/a><\/p>","date":"2020-03-16 04:31:24","pin":"0","status":"1"},{"title":"Edtech firms offer free access to apps after institutes shut down due to coronavirus","content":"<p>Particularly, students looking to revise topics ahead of the exam and those about to sit for campus placements are in need of these tech solutions. <a href=\"https:\/\/www.newindianexpress.com\/cities\/chennai\/2020\/mar\/16\/edtech-firms-offer-free-access-to-apps-after-institutes-shut-down-due-to-coronavirus-2117213.html\" target=\"_blank\"><strong>(READ FULL STORY HERE)<\/strong><\/a><\/p>","date":"2020-03-16 04:56:15","pin":"0","status":"1"},{"title":"Foreign Minister hails efforts to Indian Embassy, Iranian authorities","content":"<blockquote class=\"twitter-tweet\">\n<p lang=\"en\" dir=\"ltr\">External Affairs Minister, S Jaishankar: Fourth batch of 53 Indians - 52 students & a teacher - has arrived from Tehran & Shiraz, in Iran. With this, a total of 389 Indians have returned to India from Iran. Thank the efforts of Embassy of India in Iran and Iranian authorities. <a href=\"https:\/\/t.co\/4rQoOeve9G\">pic.twitter.com\/4rQoOeve9G<\/a><\/p>\n— ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1239333824711933952?ref_src=twsrc%5Etfw\">March 15, 2020<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2020-03-16 05:17:58","pin":"0","status":"1"},{"title":"Air passengers arriving in Kerala to be categorised","content":"<p>The categorisation is meant for passengers coming from China, North Korea, France, Germany, Spain, Italy and Iran. <a href=\"https:\/\/www.newindianexpress.com\/states\/kerala\/2020\/mar\/16\/coronavirus-outbreak-air-passengers-arriving-in-kerala-to-be-categorised-2117150.html\" target=\"_blank\"><strong>(READ FULL STORY HERE)<\/strong><\/a><\/p>","date":"2020-03-16 05:52:09","pin":"0","status":"1"},{"title":"Munnar resort where COVID-19-infected UK national stayed shut temporarily","content":"<p>The Idukki district administration has formed a 250-member special medical team in Munnar to carry out preventive activities in the wake of coronavirus infection being confirmed on foreign tourist. According to official sources, the infected foreigner reached Munnar on March 10. <a href=\"https:\/\/www.newindianexpress.com\/states\/kerala\/2020\/mar\/16\/munnar-resort-where-covid-19-infected-uk-national-stayed-shut-temporarily-2117152.html\" target=\"_blank\"><strong>(READ FULL STORY HERE)<\/strong><\/a><\/p>","date":"2020-03-16 06:01:59","pin":"0","status":"1"},{"title":"Kerala bars launch own safety steps against coronavirus","content":"<p>Bevco’s managing director Sparjan Kumar G said that safety precautions have been taken for the staff. Masks, gloves and sanitisers have been supplied to all shops, he said. <a href=\"https:\/\/www.newindianexpress.com\/states\/kerala\/2020\/mar\/16\/showing-true-spirit-kerala-bars-launch-own-safety-steps-against-coronavirus-2117157.html\" target=\"_blank\"><strong>(READ FULL STORY HERE)<\/strong><\/a><\/p>","date":"2020-03-16 06:08:48","pin":"0","status":"1"},{"title":"","content":"<blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Rajasthan: 53 Indians, evacuated from Tehran and Shiraz cities of Iran, arrived at Jaisalmer airport today. They were later moved to the Army Wellness Centre in the city, following preliminary screening. <a href=\"https:\/\/twitter.com\/hashtag\/COVID19?src=hash&ref_src=twsrc%5Etfw\">#COVID19<\/a> <a href=\"https:\/\/t.co\/Fnrr0nLfMn\">pic.twitter.com\/Fnrr0nLfMn<\/a><\/p>— ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1239366525154250752?ref_src=twsrc%5Etfw\">March 16, 2020<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2020-03-16 08:30:12","pin":"0","status":"1"},{"title":"","content":"<p>Bihar: In view of Coronavirus pandemic, the functioning of the Patna High Court to be restricted to only urgent matters.<\/p>","date":"2020-03-16 08:35:50","pin":"0","status":"1"},{"title":" Footfall decreased in parks in Nagpur","content":"<blockquote class=\"twitter-tweet\">\n<p lang=\"en\" dir=\"ltr\">Maharashtra: Footfall decreased in parks and gardens in Ramdaspeth area of Nagpur over <a href=\"https:\/\/twitter.com\/hashtag\/coronavirus?src=hash&ref_src=twsrc%5Etfw\">#coronavirus<\/a> concerns. <a href=\"https:\/\/t.co\/je7Escujr7\">pic.twitter.com\/je7Escujr7<\/a><\/p>\n— ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1239387779370381315?ref_src=twsrc%5Etfw\">March 16, 2020<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2020-03-16 08:41:55","pin":"0","status":"1"},{"title":"Maharashtra has 32 confirmed cases of coronavirus","content":"<p>According to Union Ministry of Health and Family Welfare, Maharashtra has 32 confirmed cases of #coronavirus, the highest in the country.<\/p>","date":"2020-03-16 09:28:10","pin":"0","status":"1"},{"title":"","content":"<p>Sensex plunges <strong>1609.52 points<\/strong>, at <strong>32,493.96<\/strong><\/p>","date":"2020-03-16 09:29:09","pin":"0","status":"1"},{"title":"IIM-K postpones convocation in wake of coronavirus scare","content":"<p>In the wake of the coronavirus scare, the Indian Institute of Management, Kozhikode (IIM-K) has indefinitely postponed its annual convocation, which was to be held on April 4.<\/p>","date":"2020-03-16 09:31:29","pin":"0","status":"1"},{"title":"Fourth batch of 53 Indians evacuated from Iran: Jaishankar","content":"<p>The fourth batch of 53 Indians returned to India from Iran on Monday, taking the total number of people evacuated from the coronavirus-hit country to 389. <strong>(<a href=\"https:\/\/www.newindianexpress.com\/nation\/2020\/mar\/16\/coronavirus-outbreak-fourth-batch-of-53-indians-evacuated-from-iran-says-jaishankar-2117327.html\" target=\"_blank\">READ MORE<\/a>)<\/strong><\/p>","date":"2020-03-16 09:37:34","pin":"0","status":"1"},{"title":"One positive case of coronavirus detected in Odisha","content":"One positive case of coronavirus detected in Odisha. He has travel history to Italy. He later took a train from Delhi to Bhubaneswar. The patient is admitted at a Bhubaneswar hospital: Dr. CBK Mohanty, Director, Health & Education Training, Odisha","date":"2020-03-16 09:41:02","pin":"0","status":"1"},{"title":"31-year-old man with travel history to Italy becomes Odisha's first coronavirus positive case","content":"<p>Odisha on Sunday reported the first COVID-19 confirmation with a 31-year-old man from the Capital City, who had recently returned from Italy, testing positive for the virus. <strong>(<a href=\"https:\/\/www.newindianexpress.com\/states\/odisha\/2020\/mar\/16\/31-year-old-man-with-travel-history-to-italy-becomes-odishas-first-coronavirus-positive-case-2117262.html\" target=\"_blank\">READ MORE<\/a>)<\/strong><\/p>","date":"2020-03-16 09:42:09","pin":"0","status":"1"},{"title":"","content":"<p>Sensex further plunges <strong>2015.13<\/strong> points, at <strong>32,088.35<\/strong><\/p>","date":"2020-03-16 09:51:27","pin":"0","status":"1"},{"title":"","content":"Delhi: A meeting of a group of Union Ministers on coronavirus to be held today at Nirman Bhawan.","date":"2020-03-16 10:15:46","pin":"0","status":"1"},{"title":"Delhi CM Arvind Kejriwal to take review meetings","content":"<p>Delhi CM Arvind Kejriwal to take review meetings via video conferencing of all district authorities today on containment measures against the spread of COVID-19. Deputy CM, Health Minister, Chief Secretary & Health Secretary to also join from Delhi Secretariat.<\/p>","date":"2020-03-16 10:16:25","pin":"0","status":"1"},{"title":"Sensex tanks over 2,000 points in global equity carnage; Nifty gives up 9,400","content":"<p>Equity benchmark Sensex plummeted over 2,000 points and the Nifty gave up the 9,400 level in the opening session on Monday after the Federal Reserve's rate cut fanned concerns over the impact of Covid-19 on the world economy.<\/p>\n<p>The rupee too depreciated 41 paise to 74.16 against US dollar in the morning session. Resuming its downward spiral, domestic BSE Sensex sank 2004.20 points or 5.88 per cent to 32,099.28 in the morning session.<\/p>\n<p><strong>(<a href=\"https:\/\/www.newindianexpress.com\/business\/2020\/mar\/16\/sensex-tanks-over-2000-points-in-global-equity-carnage-nifty-gives-up-9400-2117338.html\" target=\"_blank\">READ MORE<\/a>)<\/strong><\/p>","date":"2020-03-16 10:27:02","pin":"0","status":"1"},{"title":"Investor wealth erodes by Rs 6.25 lakh crore on coronavirus scare ","content":"<p>Investor wealth worth Rs 6.25 lakh crore was wiped off in early morning trade on Monday as markets witnessed<strong><a href=\"https:\/\/www.newindianexpress.com\/business\/2020\/mar\/16\/sensex-tanks-over-2000-points-in-global-equity-carnage-nifty-gives-up-9400-2117338.html\" target=\"_blank\"> yet another sell-off<\/a><\/strong>, with the BSE benchmark plunging 2,182.41 points as Covid-19 scare continued to hit sentiment.<\/p>\n<p>The market capitalisation of BSE-listed companies dropped by Rs 6,25,501.8 crore to Rs 1,23,00,741.02 crore in the opening trade.<\/p>\n<p><img src=\"https:\/\/images.newindianexpress.com\/images\/liveimages\/WhatsApp_Image_2018-12-12_at_11.jpeg\" width=\"600\" height=\"300\" alt=\"\" \/><\/p>\n<p><em>For representational purpose. (Photo | EPS)<\/em><\/p>","date":"2020-03-16 10:44:21","pin":"0","status":"1"},{"title":"Passengers arriving at four international airports in Kerala to get categorized","content":"<blockquote class=\"twitter-tweet\">\n<p lang=\"en\" dir=\"ltr\">Passengers arriving at the four international airports in <a href=\"https:\/\/twitter.com\/hashtag\/Kerala?src=hash&ref_src=twsrc%5Etfw\">#Kerala<\/a> will now get categorized. The precautionary measure is part of heightening the vigil against <a href=\"https:\/\/twitter.com\/hashtag\/COVID%E3%83%BC19?src=hash&ref_src=twsrc%5Etfw\">#COVIDー19<\/a>. According to <a href=\"https:\/\/twitter.com\/KeralaHealth?ref_src=twsrc%5Etfw\">@KeralaHealth<\/a> passengers will get categorized as A, B and C <a href=\"https:\/\/twitter.com\/xpresskerala?ref_src=twsrc%5Etfw\">@xpresskerala<\/a> <a href=\"https:\/\/twitter.com\/NewIndianXpress?ref_src=twsrc%5Etfw\">@NewIndianXpress<\/a> <a href=\"https:\/\/t.co\/w7WNuGoP0t\">pic.twitter.com\/w7WNuGoP0t<\/a><\/p>\n— Dileep V Kumar (@dileepvk_TNIE) <a href=\"https:\/\/twitter.com\/dileepvk_TNIE\/status\/1239407149387669507?ref_src=twsrc%5Etfw\">March 16, 2020<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2020-03-16 10:46:34","pin":"0","status":"1"},{"title":"","content":"<p>Those who returned from abroad in the last 28 days should inform the district administration, directs Thiruvananthapuram district collector K Gopalakrishnan. They should call toll free numbers 1077 or 1056.<\/p>","date":"2020-03-16 11:08:11","pin":"0","status":"1"},{"title":"25 doctors at Sree Chitra Institute of Medical Sciences under observation","content":"<p>The doctor who returned from Spain on March 2 after a study programme has been tested positive on Sunday. About 30 doctors and some paramedical staff are under home quarantine now. Frantic efforts are on to identify the patients, staff and others who had come into contact with him.<\/p>","date":"2020-03-16 11:09:02","pin":"0","status":"1"},{"title":"All Tiger reserves  to remain closed between March 17 to 29","content":"<p>All Tiger reserves, sanctuaries & national parks in the State to remain closed between March 17 to 29, to avoid the spread of coronavirus: Assam Government<\/p>","date":"2020-03-16 12:09:16","pin":"0","status":"1"},{"title":"Thermal screening of lawyers, litigants, journalists at Supreme Court","content":"<p>Lawyers, litigants and media personnels were thermal-screened in the Supreme Court on Monday amid coronavirus scare. The top court, which has taken several precautionary measures in wake of the pandemic has allowed only restricted entry of lawyers, litigants and journalists in the courtroom. <strong>(<a href=\"https:\/\/www.newindianexpress.com\/nation\/2020\/mar\/16\/coronavirus-scare-thermal-screening-of-lawyers-litigants-journalists-at-supreme-court-2117358.html\" target=\"_blank\">READ MORE<\/a>)<\/strong><\/p>","date":"2020-03-16 12:10:42","pin":"0","status":"1"},{"title":"Shares of multiplex operators fall sharply","content":"<p>Shares of multiplex operators plunged on Monday after various states announced closure of cinema halls till March 31 in view of Covid-19 outbreak.<\/p>\n<p>PVR tumbled 18.85 per cent to its 52-week low of Rs 1,045.85, and INOX Leisure plunged 14.77 per cent to hit its day's low of Rs 270 on the BSE.<\/p>\n<p><a href=\"https:\/\/images.newindianexpress.com\/images\/liveimages\/PVR and INOX.jpg\" target=\"_blank\"><img src=\"https:\/\/images.newindianexpress.com\/images\/liveimages\/PVR and INOX.jpg\" width=\"600\" height=\"300\" alt=\"\" \/><a><\/p>","date":"2020-03-16 12:13:54","pin":"0","status":"1"},{"title":"We've made all arrangement including screening of tourists: Secretary of Tourism in Assam","content":"<blockquote class=\"twitter-tweet\">\n<p lang=\"en\" dir=\"ltr\">M Anganuthu, Secretary of Tourism in <a href=\"https:\/\/twitter.com\/hashtag\/Assam?src=hash&ref_src=twsrc%5Etfw\">#Assam<\/a>: There are over 500 international&about 40,000 domestic tourists in Assam. We've made all arrangement including screening of tourists & they should not fear of anything. We will provide them all possible assistance. <a href=\"https:\/\/twitter.com\/hashtag\/coronavirus?src=hash&ref_src=twsrc%5Etfw\">#coronavirus<\/a> <a href=\"https:\/\/t.co\/eP7zpmtwor\">pic.twitter.com\/eP7zpmtwor<\/a><\/p>\n— ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1239427835464306689?ref_src=twsrc%5Etfw\">March 16, 2020<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2020-03-16 12:24:51","pin":"0","status":"1"},{"title":"Latest updates on COVID-19 crisis around the world","content":"<p style=\"text-align: justify;\">Here are the latest updates on the coronavirus crisis in India and other parts of the world on Monday.<\/p>\n<p><strong>11:35 a.m:<\/strong><\/p>\n<p>Odisha reports first confirmed case of coronavirus as researcher returning from Italy tests positive for COVID-19, government spokesperson says.<\/p>\n<p><strong>11:28 a.m:<\/strong><\/p>\n<p>Amusement park operator Wonderla Holidays says it has decided to temporarily close its Hyderabad park from 15-21 March due to rising coronavirus scare in Telangana.<\/p>\n<p><strong>11:09 a.m:<\/strong><\/p>\n<p>A health worker in Rajasthan's Dausa district was arrested and his services were terminated for allegedly spreading fake news about coronavirus, police say.<\/p>\n<p><strong>11:09 a.m:<\/strong><\/p>\n<p>Lawyers, litigants and media personnels were thermal-screened in the Supreme Court on Monday amid coronavirus scare.<\/p>\n<p><strong>10:45 a.m:<\/strong><\/p>\n<p>Due to coronavirus, most airlines in the world will be bankrupt by the end of May, unless there is coordinated govt-industry action, says global aviation consultancy firm CAPA.<\/p>\n<p><strong>10:32 a.m:<\/strong><\/p>\n<p>Three people of the 236 who were evacuated from Iran on Sunday were checked for coronavirus and tested negative, officials say.<\/p>\n<p><strong>10:11 a.m:<\/strong><\/p>\n<p>Ukrainian-born actor-model Olga Kurylenko says she has tested positive for coronavirus.<\/p>\n<p>The coronavirus death toll in China rose to 3,213 with 14 new fatalities, while the imported cases climbed to 123 after 12 new infections were reported.<\/p>\n<p>New York closes public schools, limits services at restaurants to combat COVID-19.<\/p>\n<p><strong>09:39 a.m:<\/strong><\/p>\n<p>Sylvester Stallone-starrer 'Samaritan' on two-week hiatus over coronavirus outbreak.<\/p>\n<p><strong>09:13 a.m:<\/strong><\/p>\n<p>The US Centers for Disease Control (CDC) recommends to postpone or cancel events having a gathering of 50 people or more for next eight weeks amid stepped up efforts to contain the spread of the coronavirus.<\/p>\n<p><strong>09:10 a.m:<\/strong><\/p>\n<p>Fourth batch of 53 Indians return to India from Iran, taking the total number of people evacuated from the coronavirus-hit country to 389.<\/p>\n<p><strong>04:04 a.m:<\/strong><\/p>\n<p>Three of the biggest annual charity and cultural events in South Africa organised by the local Indian community cancelled.<\/p>\n<p><strong>03:42 a.m:<\/strong><\/p>\n<p>South Africa announces a National State of Disaster over the coronavirus crisis as the number of people infected by the disease in the country reached 61.<\/p>\n<p><strong>12:02 a.m:<\/strong><\/p>\n<p>US Secretary of State Mike Pompeo and India's External Affairs Minister S Jaishankar have held a discussion on the coronavirus crisis over the phone, the US State Department said.<\/p>","date":"2020-03-16 12:27:02","pin":"0","status":"1"},{"title":"Photocopy shops in Court premises and cash counters should also accept digital payments: Ashwini Upadhyay","content":"<p>BJP leader & lawyer Ashwini Upadhyay mentions before Delhi High Court that photocopy shops in the Court premises and the cash counters should also accept digital payments as a matter of precaution to prevent the spreading of coronavirus.<\/p>","date":"2020-03-16 12:49:37","pin":"0","status":"1"},{"title":"","content":"<blockquote class=\"twitter-tweet\">\n<p lang=\"en\" dir=\"ltr\">Delhi: A meeting of a group of Union Ministers on <a href=\"https:\/\/twitter.com\/hashtag\/Coronavirus?src=hash&ref_src=twsrc%5Etfw\">#Coronavirus<\/a> held today at Nirman Bhawan <a href=\"https:\/\/t.co\/AMbY2LessF\">pic.twitter.com\/AMbY2LessF<\/a><\/p>\n— ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1239437785326440453?ref_src=twsrc%5Etfw\">March 16, 2020<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2020-03-16 12:50:28","pin":"0","status":"1"},{"title":"Government not doing enough to combat coronavirus: P Chidambaram","content":"<p>Government is not doing enough to combat coronavirus. I've no quarrel if PM wants to call meeting of SAARC or G-20. States are taking bold measures whereas Centre is very diffident&seems to be behind the curve. There should be a video conference between PM & CMs: P Chidambaram<\/p>","date":"2020-03-16 12:51:33","pin":"0","status":"1"},{"title":"","content":"<p>Chhattisgarh Assembly session adjourned till March 25th in view of coronovirus.<\/p>","date":"2020-03-16 12:52:00","pin":"0","status":"1"},{"title":"","content":"<blockquote class=\"twitter-tweet\">\n<p lang=\"en\" dir=\"ltr\">Delhi CM Arvind Kejriwal takes review meetings with all district authorities on containment measures against the spread of <a href=\"https:\/\/twitter.com\/hashtag\/COVID19?src=hash&ref_src=twsrc%5Etfw\">#COVID19<\/a>. Deputy CM, Health Minister, Chief Secretary & Health Secretary to also join from Delhi Secretariat. <a href=\"https:\/\/t.co\/JTNEUxGjWL\">pic.twitter.com\/JTNEUxGjWL<\/a><\/p>\n— ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1239443160738062336?ref_src=twsrc%5Etfw\">March 16, 2020<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2020-03-16 12:52:27","pin":"0","status":"1"},{"title":"","content":"<p>Delhi Chief Minister Arvind Kejriwal has directed to install portable handwash stations in various parts of Delhi.<\/p>","date":"2020-03-16 12:53:04","pin":"0","status":"1"},{"title":"Officials request tourists to leave Puri","content":"<blockquote class=\"twitter-tweet\">\n<p lang=\"en\" dir=\"ltr\">Odisha: Officials request tourists to leave Puri as all educational institutions, gyms, cinema halls&swimming pools have been closed to contain <a href=\"https:\/\/twitter.com\/hashtag\/CoronavirusOutbreak?src=hash&ref_src=twsrc%5Etfw\">#CoronavirusOutbreak<\/a>. Regional Transport Officer SK Roy says, \"We are convincing tourists, foreign & domestic, to not enter the city\". <a href=\"https:\/\/t.co\/0VVgN3BXC9\">pic.twitter.com\/0VVgN3BXC9<\/a><\/p>\n— ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1239449044901974016?ref_src=twsrc%5Etfw\">March 16, 2020<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2020-03-16 12:53:33","pin":"0","status":"1"},{"title":"","content":"<blockquote class=\"twitter-tweet\">\n<p lang=\"en\" dir=\"ltr\">Bhopal: Former <a href=\"https:\/\/twitter.com\/hashtag\/MadhyaPradesh?src=hash&ref_src=twsrc%5Etfw\">#MadhyaPradesh<\/a> CM and BJP leader Shivraj Singh Chouhan along with party MLAs arrive at Raj Bhavan; BJP has filed a petition in SC seeking floor test in MP Assembly. The State Assembly is adjourned till 26th March, in view of Coronavirus. <a href=\"https:\/\/t.co\/FR3w8DbvZp\">pic.twitter.com\/FR3w8DbvZp<\/a><\/p>\n— ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1239451486704136192?ref_src=twsrc%5Etfw\">March 16, 2020<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2020-03-16 12:54:38","pin":"0","status":"1"},{"title":"Health officials urge people who took part in Kuttanellur Pooram to remain cautious","content":"<p>Health officials in the district urged the people who took part in Kuttanellur Pooram which was held on March 8, to be cautious as the British man who was confirmed with corona infection had taken part in the festival.<strong> (<a href=\"https:\/\/www.newindianexpress.com\/states\/kerala\/2020\/mar\/16\/covid-19-health-officials-urge-people-who-took-part-in-kuttanellur-pooram-to-remain-cautious-2117374.html\" target=\"_blank\">READ MORE<\/a>)<\/strong><\/p>","date":"2020-03-16 13:24:47","pin":"0","status":"1"},{"title":"79 booked for organising mass reception for TV contestant at Kochi airport","content":"<p>A registered a case against 79 people for organising a mass reception for a popular reality show contestant on his arrival at the Cochin International Airport despite restrictions on such gatherings in view of the coronavirus threat. <strong>(<a href=\"https:\/\/www.newindianexpress.com\/cities\/kochi\/2020\/mar\/16\/coronavirus-outbreak-79-booked-for-organising-mass-reception-for-tv-contestant-at-kochi-airport-2117347.html\" target=\"_blank\">READ MORE<\/a>)<\/strong><\/p>","date":"2020-03-16 13:29:13","pin":"0","status":"1"},{"title":"","content":"<blockquote class=\"twitter-tweet\">\n<p lang=\"en\" dir=\"ltr\">WATCH | Lawyers, litigants and media personnel were thermal-screened in Supreme Court on Monday amid <a href=\"https:\/\/twitter.com\/hashtag\/coronavirus?src=hash&ref_src=twsrc%5Etfw\">#coronavirus<\/a> scare, as the apex court has allowed only restricted entry. <a href=\"https:\/\/twitter.com\/hashtag\/CoronavirusOutbreak?src=hash&ref_src=twsrc%5Etfw\">#CoronavirusOutbreak<\/a> <br \/>\nExpress video | <a href=\"https:\/\/twitter.com\/Shekharyadav02?ref_src=twsrc%5Etfw\">@Shekharyadav02<\/a> <a href=\"https:\/\/t.co\/XLQ2FlyFTW\">pic.twitter.com\/XLQ2FlyFTW<\/a><\/p>\n— The New Indian Express (@NewIndianXpress) <a href=\"https:\/\/twitter.com\/NewIndianXpress\/status\/1239450020543225857?ref_src=twsrc%5Etfw\">March 16, 2020<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2020-03-16 13:47:25","pin":"0","status":"1"},{"title":"Four new coronavirus positive cases were detected in Maharashtra","content":"<p>Four new coronavirus positive cases were detected in Maharashtra with three in Mumbai and one in Navi Mumbai, taking total cases in India to 117.<\/p>","date":"2020-03-16 13:52:42","pin":"0","status":"1"},{"title":"One more person, with travel history to Dubai, has been tested positive for coronavirus","content":"<p>One more person, with travel history to Dubai, has been tested positive for coronavirus. With this, total number of COVID-19 cases rises to 38 in Maharashtra: Yavatmal District Collector MD Singh<\/p>","date":"2020-03-16 13:54:13","pin":"0","status":"1"},{"title":"Market in Red: Sensex crashes 2,100 points; Nifty below 9,500","content":"<p>Coronavirus fears continue to weigh on investor sentiments as the BSE Sensex plunged over 2,100 points in mid-day trading. Nifty shed over 593 points at 9,356.50.<\/p>\n<p><img src=\"https:\/\/images.newindianexpress.com\/images\/liveimages\/Captureww.JPG\" width=\"600\" height=\"288\" alt=\"\" \/><\/p>","date":"2020-03-16 14:08:44","pin":"0","status":"1"},{"title":"","content":"<blockquote class=\"twitter-tweet\">\n<p lang=\"en\" dir=\"ltr\">Shimla: Gaiety Theatre and Indira Gandhi State Sports Complex have been closed till 31st March, in view Coronavirus pandemic <a href=\"https:\/\/t.co\/d5s5ZcNKAY\">pic.twitter.com\/d5s5ZcNKAY<\/a><\/p>\n— ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1239468601641299973?ref_src=twsrc%5Etfw\">March 16, 2020<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2020-03-16 14:31:24","pin":"0","status":"1"},{"title":"No religious, social, political gatherings, protests of over 50 in Delhi till March 31: Kejriwal","content":"<p>Delhi Chief Minister Arvind Kejriwal on Monday said religious, social, cultural and political gatherings as well as protests comprising more than 50 people will not be allowed in the national capital till March 31 in view of the coronavirus outbreak. <\/p>\n<p>Operation of theaters & weekly bazaars will remain suspended till March 31. Shopping malls to be disinfected daily in Delhi&le amount of hand sanitizers to be made available at mall entrance& shops, entry should be allowed after cleaning hands with hand sanitizer.<\/p>\n<p><a href=\"https:\/\/www.newindianexpress.com\/cities\/delhi\/2020\/mar\/16\/covid-19-no-gatherings-except-weddings-to-have-more-than-50-people-in-delhi-till-march-31-2117386.html\" target=\"_blank\"><strong>READ FULL STORY HERE <\/strong><\/a><\/p>","date":"2020-03-16 14:47:02","pin":"0","status":"1"},{"title":"Nitish Kumar apprises Bihar Assembly on Coronavirus","content":"<p>Continuous screening of people is being done at 49 locations at the India-Nepal border. State government will bear the entire expenses, under Mukhyamantri Chikitsa Sahayata Kosh Yojana, of the treatment of the patients who have contracted the virus. If someone dies due to Coronavirus then the next of the kin of the deceased will be given Rs 4 Lakh as compensation from the Chief Minister's Relief Fund: Bihar CM Nitish Kumar at state Assembly<\/p>","date":"2020-03-16 14:49:56","pin":"0","status":"1"},{"title":"Himachal Pradesh HC Bar Association has decided to list only urgent matters before courts till March 31st","content":"<p>The general house has decided that only urgent matters maybe listed before the courts and no regular and hearing matters shall be listed till 31st March, 2020. It has also been decided that the courts shall not pass any adverse orders in the absence of any of the concerned advocates. It has been resolved that only those advocates whose urgent matters are listed will be attending courts during this period: Himachal Pradesh HC Bar Association <\/p>","date":"2020-03-16 15:03:53","pin":"0","status":"1"},{"title":"Coronavirus updates ","content":"<ul>\n    <li>\n    <p>Bombay HC seeks Mumbai University's response on graduate, post graduate exams scheduled to be held amid coronavirus outbreak<\/p>\n    <\/li>\n    <li>\n    <p>Budget Session of West Bengal assembly to be cut short over coronavirus scare, no sittings after Tuesday: Speaker Biman Banerjee<\/p>\n    <\/li>\n    <li>\n    <p>Global aviation consultancy firm CAPA says most airlines will be bankrupt by May-end unless there is coordinated govt-industry action<\/p>\n    <\/li>\n    <li>\n    <p>Thermal screening of people visiting Parliament complex carried out in view of coronavirus threat <\/p>\n    <\/li>\n<\/ul>\n <\/li>\n    <li>\nBihar state legislative Assembly adjourned sine die due to","date":"2020-03-16 15:07:55","pin":"0","status":"1"},{"title":"","content":"<blockquote class=\"twitter-tweet\">\n<p lang=\"en\" dir=\"ltr\">Meerut Municipal Corporation has installed water tankers, containing chlorine, in various areas of the city for the purpose of washing hands only, in a bid to combat <a href=\"https:\/\/twitter.com\/hashtag\/Coronavirus?src=hash&ref_src=twsrc%5Etfw\">#Coronavirus<\/a>. <a href=\"https:\/\/t.co\/qlel0UYnnm\">pic.twitter.com\/qlel0UYnnm<\/a><\/p>\n— ANI UP (@ANINewsUP) <a href=\"https:\/\/twitter.com\/ANINewsUP\/status\/1239484260324499456?ref_src=twsrc%5Etfw\">March 16, 2020<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2020-03-16 15:10:42","pin":"0","status":"1"},{"title":"Supreme Court takes suo moto cognisance of overcrowding prisons ","content":"<p>The Supreme Court on Monday took suo moto cognisance of overcrowding and infrastructure of prisons across the country in the wake of the coronavirus pandemic. A bench of Chief Justice SA Bobde and LN Rao issued a notice to the Director General, Prison, and chief secretary of all states and union territories seeking their response by March 20 on steps taken for prevention of COVID-19.<\/p>\n<p><a href=\"https:\/\/www.newindianexpress.com\/nation\/2020\/mar\/16\/covid-19-supreme-court-takes-suo-moto-cognisance-of-overcrowding-prisons-2117397.html\" target=\"_blank\"><strong>READ FULL REPORT HERE<\/strong><\/a><\/p>","date":"2020-03-16 15:24:59","pin":"0","status":"1"},{"title":"AIIMS doctors complain about inadequate equipment","content":"<p>Delhi AIIMS Resident Doctors’ Association writes to AIIMS director, complaining about 'inadequate availability of personal protective equipment in AIIMS'. The letter reads, \"We urge you to ensure PPE availability round the clock for safety of doctors&nursing staff\".  <\/p>","date":"2020-03-16 15:25:54","pin":"0","status":"1"},{"title":"Maha CM Uddhav Thackeray chairs review meeting on coronavirus","content":"<p>Maharashtra CM Uddhav Thackeray and Health Minister Rajesh Tope, along with Chief Secretary of the state, are holding a review meeting at CM's official residence. All district magistrates are joining via video-conferencing.  <\/p>","date":"2020-03-16 15:27:21","pin":"0","status":"1"},{"title":"Petition in Delhi HC","content":"<p>A petition has been filed in the Delhi High Court, seeking its direction to take immediate necessary action to combat overcrowding and to arrange the cause list in such a manner that overcrowding can be avoided in the high court as well as local courts. <\/p>","date":"2020-03-16 15:29:09","pin":"0","status":"1"},{"title":"","content":"<blockquote class=\"twitter-tweet\">\n<p lang=\"en\" dir=\"ltr\">In view of the <a href=\"https:\/\/twitter.com\/hashtag\/CoronaVirus?src=hash&ref_src=twsrc%5Etfw\">#CoronaVirus<\/a> threat, the Telangana Government has ordered for closure of all educational institutions - schools, colleges, coaching centers, academies, universities, both in the govt & private sector. All board\/inter\/entrance exams will continue as scheduled. 1\/n<\/p>\n— Telangana State Education Department (@TSEduDept) <a href=\"https:\/\/twitter.com\/TSEduDept\/status\/1239471481236512769?ref_src=twsrc%5Etfw\">March 16, 2020<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2020-03-16 15:33:11","pin":"0","status":"1"},{"title":"Coronavirus updates","content":"","date":"2020-03-16 15:36:17","pin":"0","status":"0"},{"title":"","content":"<ul>\n    <li>\n    <p>Chandigarh Administration Health Department has cancelled all types of leaves in respect of Medical\/Paramedical and Ministerial staff in Health Department in view of the emergent situation due to spread of COVID19.<\/p>\n    <\/li>\n    <li>\n    <p>Meghalaya government shuts schools, colleges till March 31 in view of coronavirus.<\/p>\n    <\/li>\n    <li>\n    <p>Belur Math, global headquarters of Ramakrishna Math and Mission, stops distribution of 'bhog' among devotees for indefinite period as precautionary measure to prevent spread of coronavirus.<\/p>\n    <\/li>\n    <li>\n    <p>Pune Police have arrested one person for spreading fake video message about coronavirus. <\/p>\n    <\/li>\n<\/ul>","date":"2020-03-16 15:39:21","pin":"0","status":"1"},{"title":"Meenakshi Amman Temple in Madurai undergoes sanitisation","content":"<iframe width=\"560\" height=\"315\" src=\"https:\/\/www.youtube.com\/embed\/qcwJGOhDEOk\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen><\/iframe>","date":"2020-03-16 15:41:13","pin":"0","status":"1"},{"title":"Stalin cancels DMK party events in southern districts of TN","content":"<blockquote class=\"twitter-tweet\">\n<p lang=\"en\" dir=\"ltr\"><a href=\"https:\/\/twitter.com\/hashtag\/DMK?src=hash&ref_src=twsrc%5Etfw\">#DMK<\/a> president MK Stalin cancels all party events in the Southern districts including Theni, Kanyakumari, Tirunelveli, Tenkasi, Dindigul, and Virudhunagar.<a href=\"https:\/\/twitter.com\/hashtag\/COVID19india?src=hash&ref_src=twsrc%5Etfw\">#COVID19india<\/a> <a href=\"https:\/\/twitter.com\/xpresstn?ref_src=twsrc%5Etfw\">@xpresstn<\/a> <a href=\"https:\/\/t.co\/q4JbOFEtlH\">pic.twitter.com\/q4JbOFEtlH<\/a><\/p>\n— Vinodh Arulappan (@VinodhArulappan) <a href=\"https:\/\/twitter.com\/VinodhArulappan\/status\/1239497588203646976?ref_src=twsrc%5Etfw\">March 16, 2020<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2020-03-16 16:02:42","pin":"0","status":"1"},{"title":"Universities in Maharashtra asked to postpone examinations","content":"<p>We have asked the universities to postpone the examinations in the state. Elections to municipal corporations and panchayat have been postponed for three months: Maharashtra Health Minister Rajesh Tope <\/p>","date":"2020-03-16 16:10:44","pin":"0","status":"1"},{"title":"Schools in Tripura to remain close till March 31st","content":"<p>All schools\/ colleges\/ universities\/ cinema halls\/ swimming pools\/ gymnasiums will remain closed with effect from 17th March to 31st March. However, the Board Examinations will continue: Tripura Government <\/p>","date":"2020-03-16 16:17:04","pin":"0","status":"1"},{"title":"Health Ministry activates national helpline number ","content":"<blockquote class=\"twitter-tweet\">\n<p lang=\"en\" dir=\"ltr\"><a href=\"https:\/\/twitter.com\/hashtag\/CoronaVirusUpdates?src=hash&ref_src=twsrc%5Etfw\">#CoronaVirusUpdates<\/a>:<br \/>\n<br \/>\nA 24x7 toll free national helpline number 1075 has been activated for support, guidance, and response to health related queries on <a href=\"https:\/\/twitter.com\/hashtag\/COVID19?src=hash&ref_src=twsrc%5Etfw\">#COVID19<\/a>.<a href=\"https:\/\/twitter.com\/hashtag\/SwasthaBharat?src=hash&ref_src=twsrc%5Etfw\">#SwasthaBharat<\/a><a href=\"https:\/\/twitter.com\/hashtag\/HealthForAll?src=hash&ref_src=twsrc%5Etfw\">#HealthForAll<\/a> <a href=\"https:\/\/t.co\/bBeHMWkYlO\">pic.twitter.com\/bBeHMWkYlO<\/a><\/p>\n— Ministry of Health (@MoHFW_INDIA) <a href=\"https:\/\/twitter.com\/MoHFW_INDIA\/status\/1239502796782698496?ref_src=twsrc%5Etfw\">March 16, 2020<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2020-03-16 16:18:26","pin":"0","status":"1"},{"title":"Sensex sinks 2,713 points, Nifty gives up 9,200-marks as panic selling continues over COVID-19 fears","content":"<p> Resuming its free fall, the BSE Sensex plunged over 2,713 points on Monday, tracking a selloff in Asian peers as the coronavirus pandemic continued to wreak havoc on markets.<\/p>\n<p><a href=\"https:\/\/www.newindianexpress.com\/business\/2020\/mar\/16\/sensex-sinks-2713-points-nifty-gives-up-9200-marks-as-panic-selling-continues-over-covid-19-fears-2117417.html\" target=\"_blank\"><strong>READ FULL REPORT HERE<\/strong><\/a><\/p>","date":"2020-03-16 16:32:48","pin":"0","status":"1"},{"title":"Complaint filed against Chinese President Xi Jinping in UP court","content":"<p>A complaint was filed in a Muzaffarpur court against Chinese President Xi Jinping and China's ambassador to India, Sun Weidong, on Monday for allegedly \"hatching a conspiracy to spread coronavirus\". The matter is slated for hearing before the Court of Chief Judicial Magistrate (CJM) on April 11.<\/p>\n<p><a href=\"https:\/\/www.newindianexpress.com\/nation\/2020\/mar\/16\/complaint-filed-against-xi-chinese-president-in-up-court-for-hatching-conspiracy-to-spread-coronavi-2117419.html\" target=\"_blank\"><strong>READ FULL REPORT HERE <\/strong><\/a><\/p>","date":"2020-03-16 16:35:02","pin":"0","status":"1"},{"title":" Telangana High Court to have court proceedings only thrice a week","content":"<p>In the wake of the Coronavirus outbreak, the Telangana High Court on Monday decided to have court proceedings only for three days a week until further orders, as a precautionary measure to prevent the spread of the virus.<\/p>\n<p><a href=\"https:\/\/www.newindianexpress.com\/states\/telangana\/2020\/mar\/16\/covid-19-fear-telangana-high-court-to-have-court-proceedings-only-thrice-a-week-2117423.html\" target=\"_blank\"><strong>READ FULL REPORT HERE<\/strong><\/a><\/p>","date":"2020-03-16 16:46:11","pin":"0","status":"1"},{"title":"RBI presser addresses coronavirus impact on economy","content":"<blockquote class=\"twitter-tweet\" data-conversation=\"none\">\n<p lang=\"en\" dir=\"ltr\">RBI Governor says <a href=\"https:\/\/twitter.com\/hashtag\/COVID2019?src=hash&ref_src=twsrc%5Etfw\">#COVID2019<\/a> to impact domestic as well global growth, the top bank has several instruments at its command and stands ready to take all necessary measures to ensure that effects of <a href=\"https:\/\/twitter.com\/hashtag\/coronavirus?src=hash&ref_src=twsrc%5Etfw\">#coronavirus<\/a> on Indian economy are mitigated. <a href=\"https:\/\/t.co\/SIe79HVX2Q\">pic.twitter.com\/SIe79HVX2Q<\/a><\/p>\n— The New Indian Express (@NewIndianXpress) <a href=\"https:\/\/twitter.com\/NewIndianXpress\/status\/1239511815773548550?ref_src=twsrc%5Etfw\">March 16, 2020<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2020-03-16 16:52:49","pin":"0","status":"1"},{"title":"","content":"<p>One new case each in Ladakh, Odisha, J-K and Kerala: Health Ministry officials<\/p>","date":"2020-03-16 17:08:34","pin":"0","status":"1"},{"title":"West Bengal CM addresses presser over coronavirus","content":"<p>Over 3.24 lakh people screened in Bengal for coronavirus; 5,000 of them under watch. A Rs 200 crore fund to be created in West Bengal to tackle coronavirus. Closure of educational institutions in West Bengal extended till April 15: Mamata Banerjee <\/p>","date":"2020-03-16 17:10:40","pin":"0","status":"1"},{"title":"Coronavirus Maharashtra updates ","content":"<ul>\n    <li>\n    <p>Ajanta, Ellora caves in Maharashtra to be closed from Thursday as a precaution<\/p>\n    <\/li>\n    <li>\n    <p>Mumbai's Siddhivinayak Temple closed for devotees till further notice<\/p>\n    <\/li>\n    <li>\n    <p>Curbs on entry of people in Mantralaya, state secretariat in south Mumbai<\/p>\n    <\/li>\n    <li>\n    <p>Schools, colleges in rural Maharashtra also closed till March-end due to coronavirus <\/p>\n    <\/li>\n<\/ul>","date":"2020-03-16 17:17:21","pin":"0","status":"1"},{"title":"Govt medical colleges in Karnataka's 19 districts will be converted into war rooms: State minister for medical education","content":"<p>Government medical colleges in 19 districts of Karnataka will be converted into war rooms, with one entire floor meant for isolation of patients affected by Coronavirus. In the remaining districts, where there are no government medical colleges, private hospitals will be roped in, said Minister for Medical Education, K Sudhakar in a press meet on Monday.  <\/p>","date":"2020-03-16 17:18:58","pin":"0","status":"1"},{"title":"Coronavirus cases in Maharashtra rises to 39","content":"<blockquote class=\"twitter-tweet\">\n<p lang=\"tl\" dir=\"ltr\"><a href=\"https:\/\/twitter.com\/hashtag\/CoronaVirusUpdates?src=hash&ref_src=twsrc%5Etfw\">#CoronaVirusUpdates<\/a> total 39 Corona virus positive patients in Maharashtra <a href=\"https:\/\/twitter.com\/NewIndianXpress?ref_src=twsrc%5Etfw\">@NewIndianXpress<\/a> <br \/>\nHighest in Pimpri Chinchwad -9 cases, Pune - 7, Mumbai 6, Nagpur 4, Yawatmal 3, Kalyan 3, Navi Mumbai 3, Raigad, Thane , Nagar & Aurangabad has one each Corona patient <a href=\"https:\/\/twitter.com\/NewIndianXpress?ref_src=twsrc%5Etfw\">@NewIndianXpress<\/a> <a href=\"https:\/\/t.co\/tPSXZI3rqz\">pic.twitter.com\/tPSXZI3rqz<\/a><\/p>\n— Sudhir Suryawanshi (@ss_suryawanshi) <a href=\"https:\/\/twitter.com\/ss_suryawanshi\/status\/1239515285687689216?ref_src=twsrc%5Etfw\">March 16, 2020<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2020-03-16 17:26:29","pin":"0","status":"1"},{"title":"Baz Luhrmann, who famously directed Amitabh Bachchan, goes into self-isolation","content":"<p>Baz Luhrmann, who has previously directed Amitabh Bachchan in the Great Gatsby, had gone into self-isolation after coming into contact with actor Tom Hanks on the set of their new untitled Elvis Presley film.<\/p>\n<p>The Australian filmmaker, along with his family, are in voluntary quarantine after Hanks and his actor-wife Rita Wilson were tested positive for COVID-19 disease last week.<\/p>\n<p>The 57-year-old Lurhamann on Sunday tweeted \"I'm in isolation for the next 10 days, but the family and I are healthy and well,\" he said.<\/p>\n<p><strong><a href=\"https:\/\/www.newindianexpress.com\/entertainment\/english\/2020\/mar\/16\/baz-luhrmann-family-in-quarantine-after-tom-hanks-coronavirus-diagnosis-2117402.html\" target=\"_blank\">Read full story<\/a><\/strong><\/p>","date":"2020-03-16 17:50:30","pin":"0","status":"1"},{"title":"'It's me and my books for 14 days', says home-quarantined Kannada poet after testing negative post-Paris visit","content":"<p>Amidst COVID-19 scare, Mudnakudu Chinnaswamy, the 66-year-old Kannada poet who is synonymous with his poem 'naanondu maravagiddare... (if I were a tree...) took the risk of attending a poetry reading and reciting event in Paris. He left for Paris on March 10 and landed at Kempegowda International Airport in the city on Monday. Later, he went through five hours of procedures and health check-ups. He was tested negative for the virus and advised by the doctors to be home quarantine for the 14 days.<\/p>\n<p><a href=\"https:\/\/www.newindianexpress.com\/states\/karnataka\/2020\/mar\/16\/its-me-and-my-books-for-14-days-says-home-quarantined-kannada-poet-after-testing-negative-post-paris-visit-2117431.html\" target=\"_blank\"><strong>READ FULL STORY HERE <\/strong><\/a><\/p>","date":"2020-03-16 18:25:58","pin":"0","status":"1"},{"title":"Eight cases test negative for coronavirus in Coimbatore, two reports awaited ","content":"","date":"2020-03-16 18:30:15","pin":"0","status":"0"},{"title":"Eight cases test negative for coronavirus in Coimbatore, two reports awaited","content":"<p>No coronavirus cases were reported in the district and eight out of the 10 people screened tested negative, District Collector K Rajamani said on Monday. Results of samples of a man who returned from Thailand and a woman from Qatar have been send for testing to Chennai and expected soon.<\/p>\n<p><strong><a href=\"https:\/\/www.newindianexpress.com\/states\/tamil-nadu\/2020\/mar\/16\/eight-cases-test-negative-for-coronavirus-in-coimbatore-two-reports-awaited-2117434.html\" target=\"_blank\">READ FULL REPORT HERE <\/a><\/strong><\/p>","date":"2020-03-16 18:31:21","pin":"0","status":"1"},{"title":"WATCH: List of sports events in India affected by coronavirus","content":"<p><iframe width=\"100%\" height=\"450\" src=\"https:\/\/www.youtube.com\/embed\/8Tol_EwU2KE\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\"><\/iframe><\/p>","date":"2020-03-16 18:46:41","pin":"0","status":"1"},{"title":"Bombay HC, its benches to function for 2 hours","content":"<p>From 17 March, Bombay HC and its benches in Nagpur, Aurangabad and Goa to function for only two hours in a day until further orders in view of coronavirus outbreak.  <\/p>","date":"2020-03-16 18:49:21","pin":"0","status":"1"},{"title":"","content":"<blockquote class=\"twitter-tweet\">\n<p lang=\"en\" dir=\"ltr\"><a href=\"https:\/\/twitter.com\/hashtag\/CoronaVirusUpdate?src=hash&ref_src=twsrc%5Etfw\">#CoronaVirusUpdate<\/a>: TN government orders to close all educational institutions including colleges and universities till March 31.<\/p>\n— S Mannar Mannan (@mannar_mannan) <a href=\"https:\/\/twitter.com\/mannar_mannan\/status\/1239540213510098946?ref_src=twsrc%5Etfw\">March 16, 2020<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2020-03-16 18:55:54","pin":"0","status":"1"},{"title":"Tamil Nadu govt orders closure of all schools, colleges, malls, theatres till March 31","content":"<p>Making the announcement after chairing a review meeting with cabinet colleagues at the Secretariat, Chief Minister K Palaniswami also said amusement parks, museums, swimming pools and gymnasiums would also remain shut.<\/p>\n<p><a href=\"https:\/\/www.newindianexpress.com\/states\/tamil-nadu\/2020\/mar\/16\/tamil-nadu-govt-orders-closure-of-all-schools-colleges-malls-theatres-till-march-31-2117445.html\" target=\"_blank\"><strong>READ FULL REPORT HERE<\/strong><\/a><\/p>","date":"2020-03-16 19:15:08","pin":"0","status":"1"},{"title":"Union health ministry presser on coronavirus","content":"<ul>\n    <li>Fourth batch of 53 evacuates from Iran have arrived today & are being quarantined at the Army facility in Jaisalmer. All are reported to be asymptomatic as present and are in quarantine as per protocol.<\/li>\n    <li>Important measures including closing of schools, swimming pools, malls, allow employees to work from home,less use of public transport, 1 meter distance between people should be maintained till 31st March.<\/li>\n    <li>Travellers from the European Union, Turkey and the United Kingdom are prohibited from March 18 2020. This will be reviewed again.<\/li>\n    <li>Compulsory quarantine of 14 days has been put in place for passengers coming from UAE, Qatar, Oman, and Kuwait.<\/li>\n    <li>Contact tracing activity of these positive cases has led to the identification of more than 5,200 contacts, who are kept under surveillance. <\/li>\n    <li>Prime Minister undertook extraordinary initiative with SAARC leaders and they responded positively. The 24x7 MEA #Covid19 control room has now become operational: MEA<\/li>\n<\/ul>\n<p> <\/p>","date":"2020-03-16 19:17:20","pin":"0","status":"1"},{"title":"Karnataka reports one more COVID-19 positive case","content":"<blockquote class=\"twitter-tweet\">\n<p lang=\"en\" dir=\"ltr\">One more person tested positive for <a href=\"https:\/\/twitter.com\/hashtag\/COVID19india?src=hash&ref_src=twsrc%5Etfw\">#COVID19india<\/a> in Karnataka. 32-year-old colleague of a man previously tested positive takes total number of positive cases in Karnataka to 8 including one casualty.<a href=\"https:\/\/twitter.com\/XpressBengaluru?ref_src=twsrc%5Etfw\">@XpressBengaluru<\/a> <a href=\"https:\/\/twitter.com\/NewIndianXpress?ref_src=twsrc%5Etfw\">@NewIndianXpress<\/a> <a href=\"https:\/\/twitter.com\/santwana99?ref_src=twsrc%5Etfw\">@santwana99<\/a><\/p>\n— Anusha Ravi Sood (@anusharavi10) <a href=\"https:\/\/twitter.com\/anusharavi10\/status\/1239545299468615680?ref_src=twsrc%5Etfw\">March 16, 2020<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2020-03-16 19:18:13","pin":"0","status":"1"},{"title":"BCCI employees given option to work from home","content":"<p>All BCCI employees in Mumbai Headquarters have been given the option to work from home from tomorrow onwards. Those who want to come to the office can come. <\/p>","date":"2020-03-16 19:45:50","pin":"0","status":"1"},{"title":"PM Modi invites submissions on tech-driven solutions for coronavirus","content":"<blockquote class=\"twitter-tweet\">\n<p lang=\"en\" dir=\"ltr\">Harnessing innovation for a healthier planet. <br \/>\n<br \/>\nA lot of people have been sharing technology-driven solutions for COVID-19. <br \/>\n<br \/>\nI would urge them to share them on <a href=\"https:\/\/twitter.com\/mygovindia?ref_src=twsrc%5Etfw\">@mygovindia<\/a>. These efforts can help many. <a href=\"https:\/\/twitter.com\/hashtag\/IndiaFightsCorona?src=hash&ref_src=twsrc%5Etfw\">#IndiaFightsCorona<\/a> <a href=\"https:\/\/t.co\/qw79Kjtkv2\">https:\/\/t.co\/qw79Kjtkv2<\/a><\/p>\n— Narendra Modi (@narendramodi) <a href=\"https:\/\/twitter.com\/narendramodi\/status\/1239548003871903746?ref_src=twsrc%5Etfw\">March 16, 2020<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2020-03-16 19:47:52","pin":"0","status":"1"},{"title":"Shaheen Bagh protests to continue, say volunteers","content":"<p>The volunteers at Shaheen Bagh where anti-CAA protests have been going on since 15 December last year have said that they would wait for the Supreme Court orders rather than obey the Delhi government.<\/p>\n<p><a href=\"https:\/\/www.newindianexpress.com\/cities\/delhi\/2020\/mar\/16\/kejriwal-not-bigger-than-sc-shaheen-bagh-protest-to-continue-despite-delhi-govt-covid-19-ban-2117453.html\" target=\"_blank\"><strong>READ FULL STORY HERE<\/strong><\/a><\/p>","date":"2020-03-16 20:01:24","pin":"0","status":"1"},{"title":"WATCH | Bangalore airport feels the pinch","content":"<p><iframe width=\"100%\" height=\"450\" src=\"https:\/\/www.youtube.com\/embed\/RFO-ipwh6Io\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\"><\/iframe><\/p>","date":"2020-03-16 20:20:02","pin":"0","status":"1"},{"title":"Odisha CM appeals for people coming from abroad to register themselves through toll free number","content":"<blockquote class=\"twitter-tweet\">\n<p lang=\"en\" dir=\"ltr\">Appeal everyone who comes to <a href=\"https:\/\/twitter.com\/hashtag\/Odisha?src=hash&ref_src=twsrc%5Etfw\">#Odisha<\/a> from abroad to register themselves through toll free number (104) or online portal <a href=\"https:\/\/t.co\/dAGGzSp7jV\">https:\/\/t.co\/dAGGzSp7jV<\/a> to be part of Odisha’s effort in preventing spread of <a href=\"https:\/\/twitter.com\/hashtag\/CoronaVirus?src=hash&ref_src=twsrc%5Etfw\">#CoronaVirus<\/a>. It will help us in protecting you & your family from <a href=\"https:\/\/twitter.com\/hashtag\/COVID19?src=hash&ref_src=twsrc%5Etfw\">#COVID19<\/a>. <a href=\"https:\/\/t.co\/DtgmSz8Ih7\">pic.twitter.com\/DtgmSz8Ih7<\/a><\/p>\n— Naveen Patnaik (@Naveen_Odisha) <a href=\"https:\/\/twitter.com\/Naveen_Odisha\/status\/1239553532170080256?ref_src=twsrc%5Etfw\">March 16, 2020<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2020-03-16 20:25:02","pin":"0","status":"1"},{"title":"All national monuments, museums under ASI closed till March 31","content":"<blockquote class=\"twitter-tweet\">\n<p lang=\"en\" dir=\"ltr\">Tourism Minister Prahlad Patel to ANI: All the national monuments and museums under Archaeological Survey of India to remain closed till 31st March. (file pic) <a href=\"https:\/\/twitter.com\/hashtag\/Coronavirus?src=hash&ref_src=twsrc%5Etfw\">#Coronavirus<\/a> <a href=\"https:\/\/t.co\/1p35E9JwKD\">pic.twitter.com\/1p35E9JwKD<\/a><\/p>\n— ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1239561056541761537?ref_src=twsrc%5Etfw\">March 16, 2020<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script><p><a href=\"https:\/\/www.newindianexpress.com\/nation\/2020\/mar\/16\/monuments-museums-including-taj-mahal-closed-for-visitors-over-coronavirus-fears-2117501.html\" target=\"_blank\"><strong>(READ THE FULL REPORT HERE)<\/strong><\/a><\/p>","date":"2020-03-16 20:30:07","pin":"0","status":"1"},{"title":"Bars, sports arenas closed in Tamil Nadu till March 31","content":"<p>Tamil Nadu govt: Sports arenas, bars, clubs and other recreational facilities to remain closed till 31st March. Resorts shouldn't take booking till 31st March. People are advised to avoid travelling to other states for 15 days.<\/p>","date":"2020-03-16 20:32:52","pin":"0","status":"1"},{"title":"Telangana reports another positive case, total cases in India 121","content":"<blockquote class=\"twitter-tweet\">\n<p lang=\"en\" dir=\"ltr\">Telangana Health Ministry: Another <a href=\"https:\/\/twitter.com\/hashtag\/COVID19?src=hash&ref_src=twsrc%5Etfw\">#COVID19<\/a> positive case confirmed in Hyderabd city, positive cases toll raises to 4 in the state. The new confirmed patient has a travel history to Scotland. The person is now admitted in a hospital in Hyderabad city and undergoing treatment. <a href=\"https:\/\/t.co\/otPZ7JLbC8\">pic.twitter.com\/otPZ7JLbC8<\/a><\/p>\n— ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1239554565277540353?ref_src=twsrc%5Etfw\">March 16, 2020<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2020-03-16 20:35:17","pin":"0","status":"1"},{"title":"Bihar CM Nitish Kumar orders removal of Section 144 amid coronavirus scare","content":"<p>Kumar strongly asked officials not to create unecessary hype on the outbreak of COVID-19 in the state by resorting to enforcement like the section 144. He said that imposition of section 144 of CrPC would inculcate a sense of fear and panic among the people in masses. <a href=\"https:\/\/www.newindianexpress.com\/nation\/2020\/mar\/16\/bihar-cm-nitish-kumar-orders-removal-of-section-144-amid-coronavirus-scare-2117458.html\" target=\"_blank\"><strong>(READ FULL REPORT HERE)<\/strong><\/a><\/p>","date":"2020-03-16 20:42:51","pin":"0","status":"1"},{"title":"India set to be locked down? Government proposes extensive social distancing measures","content":"<ul>\n\t<li>\n\t<p>As the number of confirmed coronavirus cases crossed 120 in India, the Centre on Monday proposed detailed social distancing measures that included urging states to close down all schools, universities, theatres, swimming pools, gyms and museums till March 31 while exploring the possibility of postponing all examinations<\/p>\n\t<\/li>\n\t<li>\n\t<p>The government also said that ongoing examinations should be conducted after ensuring distance of one meter amongst students<\/p>\n\t<\/li>\n\t<li>\n\t<p>Students should be advised to stay at home and online education should be promoted<\/p>\n\t<\/li>\n\t<li>\n\t<p>Social distancing is a non-pharmaceutical infection prevention and control intervention implemented to avoid or decrease contact between those who are infected with a disease-causing pathogen and those who are not, so as to stop or slow down the rate and extent of disease transmission in a community: Union Ministry of Health and Family Welfare advisory<\/p>\n\t<\/li>\n<\/ul>\n\n<p><strong><a href=\"https:\/\/www.newindianexpress.com\/nation\/2020\/mar\/16\/india-set-to-be-locked-down-government-proposes-extensive-social-distancing-measures-2117459.html\" target=\"_blank\">(READ FULL REPORT HERE)<\/a><\/strong><\/p>","date":"2020-03-16 20:49:43","pin":"0","status":"1"},{"title":"Tripura govt shuts down education institutions, cinema halls till March 31","content":"<p>Schools, colleges, universities, cinemas, swimming pools, gymnasiums are shut down with immediate effect till March 31. Board exams, however, will be held as per schedule.<\/p>","date":"2020-03-16 21:14:10","pin":"0","status":"1"},{"title":"Maharashtra govt to provide television, internet access at COVID-19 isolation centres","content":"<p>CM Uddhav Thackeray said that television, food, internet access, carrom boards and other facilities will be provided at the isolation centres. \"People should not worry but come together to fight against spreading coronavirus,\" he added. <a href=\"https:\/\/www.newindianexpress.com\/nation\/2020\/mar\/16\/maharashtra-government-to-provide-television-internet-acces-at-covid-19-isolation-centres-2117455.html\" target=\"_blank\"><strong>(READ FULL STORY HERE)<\/strong><\/a><\/p>","date":"2020-03-16 21:25:01","pin":"0","status":"1"},{"title":"","content":"<blockquote class=\"twitter-tweet\">\n<p lang=\"en\" dir=\"ltr\">Maharashtra: Tiger reserves, sanctuaries and national parks in the state to remain closed from 18th March to 31st March 2020, in wake of <a href=\"https:\/\/twitter.com\/hashtag\/coronavirus?src=hash&ref_src=twsrc%5Etfw\">#coronavirus<\/a> outbreak.<\/p>\n— ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1239595370239234048?ref_src=twsrc%5Etfw\">March 16, 2020<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2020-03-16 22:38:50","pin":"0","status":"1"},{"title":"Government prohibits entry of passengers from European Union, Turkey, UK from March 18","content":"<p>Travel of passengers from member countries of the European Union, the European Free Trade Association, Turkey and United Kingdom to India is prohibited with effect from 18th March 2020,\" said Lav Aggarwal, the Joint Secretary in the ministry. <a href=\"https:\/\/www.newindianexpress.com\/nation\/2020\/mar\/16\/governmentt-prohibits-entry-of-passengers-from-european-union-turkey-uk-from-march-18-2117494.html\" target=\"_blank\"><strong>(READ FULL STORY HERE)<\/strong><\/a><\/p>","date":"2020-03-16 22:44:18","pin":"0","status":"1"},{"title":"Devotees at Vaishno Devi shrine checked with thermometer guns","content":"<blockquote class=\"twitter-tweet\">\n<p lang=\"en\" dir=\"ltr\">Jammu&Kashmir: Devotees at Vaishno Devi are being checked with thermometer guns at the entry gate. Shrine Board had yesterday issued an advisory to NRIs\/ foreigners&other visitors to not to visit Shrine for 28 days after landing in India as a precautionary measure. <a href=\"https:\/\/twitter.com\/hashtag\/Coronavirus?src=hash&ref_src=twsrc%5Etfw\">#Coronavirus<\/a>. <a href=\"https:\/\/t.co\/aOfYdyR4Qz\">pic.twitter.com\/aOfYdyR4Qz<\/a><\/p>\n— ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1239602658496790528?ref_src=twsrc%5Etfw\">March 16, 2020<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2020-03-16 22:54:45","pin":"0","status":"1"},{"title":"Lockdowns, stocks down as virus fight shifts away from China","content":"<p>The global battle to contain the new coronavirus breached a new level of urgency Monday, as governments locked down borders, millions of workers, students and worshipers were ordered to stay home, and pleas went out to funnel masks and ventilators to places struggling with soaring caseloads.  The shifting fronts in the battle were made clear by figures showing that cases outside China — where the virus originated — surpassed those inside its borders for the first time. On Wall Street, financial markets plunged by more than 8 percent, surpassing drops in Asia and Europe, as worried investors struggled to estimate the outbreak's rippling economic fallout.<a href=\"https:\/\/www.newindianexpress.com\/world\/2020\/mar\/16\/lockdowns-stocks-down-as-virus-fight-shifts-away-from-china-2117497.html\" target=\"_blank\"><strong>(READ FULL STORY HERE)<\/strong><\/a><\/p>","date":"2020-03-16 23:03:23","pin":"0","status":"1"},{"title":"Wipro asks employees to work from home amid COVID-19 outbreak","content":"<p>Given the evolving situation, beginning Monday, March 16, we have advised our employees to work from home wherever feasible and if their role allows them to do so. Wipro offices will remain open. Our global environment, health and safety (EHS) and crisis management teams will continue to assess the situation, review these measures after a week and decide the future course of action, Wipro said in a statement. <a href=\"https:\/\/www.newindianexpress.com\/business\/2020\/mar\/16\/wipro-asks-employees-to-work-from-home-amid-covid-19-outbreak-2117499.html\" target=\"_blank\"><strong>(READ FULL REPORT HERE)<\/strong><\/a><\/p>","date":"2020-03-16 23:25:52","pin":"0","status":"1"},{"title":"","content":"","date":"2020-03-17 00:08:06","pin":"0","status":"0"},{"title":"WATCH | TNIE explains why a lockdown might be necessary amidst the coronavirus outbreak","content":"<blockquote class=\"twitter-tweet\" data-conversation=\"none\">\n<p lang=\"en\" dir=\"ltr\">Is India set to be locked down? TNIE explains why such a measure is needed amidst a <a href=\"https:\/\/twitter.com\/hashtag\/CoronavirusOutbreak?src=hash&ref_src=twsrc%5Etfw\">#CoronavirusOutbreak<\/a>.<a href=\"https:\/\/twitter.com\/hashtag\/COVID19?src=hash&ref_src=twsrc%5Etfw\">#COVID19<\/a> <a href=\"https:\/\/twitter.com\/hashtag\/CoronavirusPandemic?src=hash&ref_src=twsrc%5Etfw\">#CoronavirusPandemic<\/a> <a href=\"https:\/\/twitter.com\/tisha_jaco?ref_src=twsrc%5Etfw\">@tisha_jaco<\/a> <a href=\"https:\/\/twitter.com\/PrabhuChawla?ref_src=twsrc%5Etfw\">@PrabhuChawla<\/a> <a href=\"https:\/\/twitter.com\/gsvasu_TNIE?ref_src=twsrc%5Etfw\">@gsvasu_TNIE<\/a> <a href=\"https:\/\/twitter.com\/MoHFW_INDIA?ref_src=twsrc%5Etfw\">@MoHFW_INDIA<\/a> <a href=\"https:\/\/t.co\/V0CZq8LCNy\">pic.twitter.com\/V0CZq8LCNy<\/a><\/p>\n— The New Indian Express (@NewIndianXpress) <a href=\"https:\/\/twitter.com\/NewIndianXpress\/status\/1239617819588710404?ref_src=twsrc%5Etfw\">March 16, 2020<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2020-03-17 00:11:09","pin":"0","status":"1"},{"title":"","content":"<blockquote class=\"twitter-tweet\">\n<p lang=\"en\" dir=\"ltr\">Rajesh Tope, Maharashtra Minister of Public Health and Family Welfare (in file pic): Those who have undergone 100% home quarantine, should be marked with instruction on their left hand with indelible ink, so that that this person can be identified in the community. <a href=\"https:\/\/twitter.com\/hashtag\/coronavirus?src=hash&ref_src=twsrc%5Etfw\">#coronavirus<\/a> <a href=\"https:\/\/t.co\/UTyL20mfW3\">pic.twitter.com\/UTyL20mfW3<\/a><\/p>\n— ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1239607923308822529?ref_src=twsrc%5Etfw\">March 16, 2020<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2020-03-17 00:26:16","pin":"0","status":"1"},{"title":"","content":"<p><span style=\"font-size: large;\"><strong>Section-144 <\/strong>of CrPC imposed in <strong>Nagpur<\/strong> till March 31 to avoid gathering of people in a place, in the wake of #coronavirus outbreak.<\/span><\/p>","date":"2020-03-17 00:28:01","pin":"0","status":"1"},{"title":"Bengal civic polls deferred over coronavirus ","content":"The elections to the West Bengal civic bodies, including the Kolkata Municipal Corporation (KMC), have been postponed for the time being amid the novel coronavirus pandemic.","date":"2020-03-17 00:30:44","pin":"0","status":"1"},{"title":"Seeking divine intervention: Srisailam temple authorities perform holy rituals desiring healthy India","content":"<blockquote class=\"twitter-tweet\" data-conversation=\"none\">\n<p lang=\"en\" dir=\"ltr\">In the view of <a href=\"https:\/\/twitter.com\/hashtag\/Coronavirus?src=hash&ref_src=twsrc%5Etfw\">#Coronavirus<\/a>, Srisailam temple authorities performed holy rituals desiring healthy India. It will continue for next 40 days, temple authorities said.<br \/>\nExpress photos. <a href=\"https:\/\/t.co\/3Zz7Y9jIlJ\">pic.twitter.com\/3Zz7Y9jIlJ<\/a><\/p>\n— The New Indian Express (@NewIndianXpress) <a href=\"https:\/\/twitter.com\/NewIndianXpress\/status\/1239561958375837698?ref_src=twsrc%5Etfw\">March 16, 2020<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2020-03-17 00:40:25","pin":"0","status":"1"},{"title":"","content":"<blockquote class=\"twitter-tweet\">\n<p lang=\"en\" dir=\"ltr\">Department of Health & Family Welfare, Himachal Pradesh: Entry of public at large in places of religious worship shall be stopped till further orders. Rituals as per established practice will be performed & if possible webcasting of the same may be done by management. <a href=\"https:\/\/twitter.com\/hashtag\/COVID19?src=hash&ref_src=twsrc%5Etfw\">#COVID19<\/a> <a href=\"https:\/\/t.co\/EX8oA1LQ0x\">pic.twitter.com\/EX8oA1LQ0x<\/a><\/p>\n— ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1239624235078668289?ref_src=twsrc%5Etfw\">March 16, 2020<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2020-03-17 01:25:59","pin":"0","status":"1"},{"title":"","content":"<p><span style=\"font-size: large;\">All <strong>shops<\/strong> and market places (excluding daily essentials and medicines shops) to be closed in <strong>Pune<\/strong> for<strong> 3 days<\/strong> (17,18 and 19 March) in the wake of Coronavirus.<\/span><\/p>","date":"2020-03-17 01:28:31","pin":"0","status":"1"},{"title":"EU borders, Schengen zone to be closed for 30 days: French President","content":"<p>The borders of the European Union (EU) and the Schengen area will be closed for a period of 30 days starting from March 17 due to the spread of the coronavirus, French President Emmanuel Macron said on Monday (local time).<\/p>\n<p>\"From tomorrow afternoon, the borders of the EU and the Schengen zone will be closed for 30 days,\" Macron said in a second televised address to the nation in the last four days.<\/p>","date":"2020-03-17 05:27:33","pin":"0","status":"1"},{"title":"2 more coronavirus cases confirmed in Karnataka","content":"<p>Two more cases of coronavirus have been confirmed in the state, Karnataka government said.  With this, a total of eight coronavirus positive cases have been reported in the state so far.<\/p>","date":"2020-03-17 07:04:57","pin":"0","status":"1"},{"title":"Pakistan: Tally of COVID-19 positive cases balloons to 186","content":"<p>A sharp rise of 131 cases in 24 hours was reported in Pakistan on Monday night increasing the cases to 186: Pakistani Media<img src=\"https:\/\/images.newindianexpress.com\/images\/liveimages\/Coronavirus.jpg\" width=\"100%\" alt=\"\" \/><\/p>","date":"2020-03-17 07:23:26","pin":"0","status":"1"},{"title":"Battling coronavirus in Italy","content":"<blockquote class=\"twitter-tweet\">\n<p lang=\"en\" dir=\"ltr\">India in Itlay: The medical team from India successfully completed its mission in Rome, it has collected samples for further testing and we await the reports so that our students can safely return home. <a href=\"https:\/\/t.co\/PRRZtasctu\">pic.twitter.com\/PRRZtasctu<\/a><\/p>\n— ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1239602918468141069?ref_src=twsrc%5Etfw\">March 16, 2020<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2020-03-17 07:24:58","pin":"0","status":"1"},{"title":"Two new cases of coronavirus confirmed in Karnataka, total count rises to 10","content":"<blockquote class=\"twitter-tweet\">\n<p lang=\"en\" dir=\"ltr\">Karnataka Health Department: 2 new confirmed cases of COVID-19; Total 10 positive cases in the State <a href=\"https:\/\/t.co\/PQbPmFp7ys\">pic.twitter.com\/PQbPmFp7ys<\/a><\/p>\n— ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1239738909304578048?ref_src=twsrc%5Etfw\">March 17, 2020<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2020-03-17 08:03:47","pin":"0","status":"1"},{"title":"Can cash spread coronavirus? Go digital, say experts","content":"<p>Forget avarice, your hard-earned money is sufficient to make you ill. If that is not enough, the money you handle has the potential of spreading diseases quicker than you can spend it. This was the gist of a study published in the Future Microbiology, which reported that public health risk associated with the simultaneous handling of food and currency may spread viral infections. <strong>(<a href=\"https:\/\/www.newindianexpress.com\/nation\/2020\/mar\/17\/can-cash-spread-coronavirus-go-digital-say-experts-2117533.html\" target=\"_blank\">READ MORE<\/a>)<\/strong><\/p>","date":"2020-03-17 08:30:15","pin":"0","status":"1"},{"title":"Monuments, museums including Taj Mahal closed for visitors over coronavirus fears","content":"<p>The iconic Taj Mahal will be closed for visitors from Tuesday as part of measures to try and combat the coronavirus pandemic, the tourism ministry said on Monday. Most schools and entertainment facilities, including cinemas, have already been closed across the country. <strong>(<a href=\"https:\/\/www.newindianexpress.com\/nation\/2020\/mar\/16\/monuments-museums-including-taj-mahal-closed-for-visitors-over-coronavirus-fears-2117501.html\" target=\"_blank\">READ MORE<\/a>)<\/strong><\/p>","date":"2020-03-17 08:31:50","pin":"0","status":"1"},{"title":"Karnataka Coronavirus Update","content":"<p><img src=\"https:\/\/images.newindianexpress.com\/images\/liveimages\/image\/coronaA.jpg\" width=\"240\" height=\"497\" alt=\"\" \/> <\/p>","date":"2020-03-17 08:35:19","pin":"0","status":"1"},{"title":"Here are the lists of places closed in Tamil Nadu until March 31 and further advisories","content":"<ul>\n\t<li>Tourist resorts must be closed and no advance bookings must be made before March 31.<\/li>\n\t<li>\n\t<p>All Anganwadi centres will be closed<\/p>\n\t<\/li>\n\t<li>\n\t<p>Theatres, malls, clubs, TASMAC bars, amusement parks, swimming pools, museums, zoos, and gymnasiums among other places will be closed.<\/p>\n\t<\/li>\n\t<li>\n\t<p>People must refrain from large gatherings in places of religious worship, markets, wedding halls, social gatherings, cultural events and beaches.<\/p>\n\t<\/li>\n\t<li>\n\t<p>All railway passengers must be strictly thermal screened during arrival to the State<\/p>\n\t<\/li>\n\t<li>\n\t<p>Passengers crossing Toll Plazas must strictly be thermal screened<\/p>\n\t<\/li>\n\t<li>\n\t<p>Tamil Nadu Legislative Assembly will be closed for visitors<\/p>\n\t<\/li>\n\t<li>\n\t<p>Coordinators must ensure delivery of dry ration worth 15 days of meal to all houses<\/p>\n\t<\/li>\n\t<li>\n\t<p>Parents must ensure their children don’t venture out during holidays<\/p>\n\t<\/li>\n\t<li>\n\t<p>People showing symptoms of cough, cold and sneezing must get immediate health check up<\/p>\n\t<\/li>\n\t<li>\n\t<p>For any emergency, contact 24\/7 helpline at 104, 044-29510400, 044-29510500, 9444340496 and 8754448477.<\/p>\n\t<\/li>\n<\/ul>","date":"2020-03-17 08:45:01","pin":"0","status":"1"},{"title":"Tale of dues and cancelled orders for textile units","content":"<p>The impact novel Coronavirus has had on the textile sector has been devastating, say industrialists. Explaining the impact of COVID-19, Tiruppur Exporters’ Association (TEA) President Raja M Shanmugham on Monday said that garment exporters are yet to receive Rs 1,200 crore from European countries due to the spread of the virus. <strong>(<a href=\"https:\/\/www.newindianexpress.com\/states\/tamil-nadu\/2020\/mar\/17\/coronavirus-tale-of-dues-and-cancelled-orders-for-textile-units-2117536.html\" target=\"_blank\">READ MORE<\/a>)<\/strong><\/p>","date":"2020-03-17 08:46:14","pin":"0","status":"1"},{"title":"Plightful wait of 783 stranded fishers in Iran continues","content":"<p>Ignored, helpless and starving, the 783 Indian fishermen, including 450 from Tamil Nadu, are sharing limited supplies in the hopes that they will be rescued from Iran soon. With the Indian embassy allegedly turning a blind eye, the fishermen can only request to be rescued from Kish and Chiruyeh Islands. Joseph Johnson, a fisherman who hails from Kanniyakumari district told Express from Chiruyeh Island that the Indian embassy in Tehran had directed the fishermen to contact Consulate of India in Bandar Abbas. <strong>(<a href=\"https:\/\/www.newindianexpress.com\/states\/tamil-nadu\/2020\/mar\/17\/plightful-wait-of-783-stranded-fishers-in-iran-continues-2117526.html\" target=\"_blank\">READ MORE<\/a>)<\/strong><\/p>","date":"2020-03-17 08:46:58","pin":"0","status":"1"},{"title":"More testing facilities to come up in Tamil Nadu","content":"<p>Chennai will have its second Coronavirus testing facility at Rajiv Gandhi Government General Hospital. Speaking to mediapersons on Monday after a review meeting, Health Minister C Vijayabaskar said the new facility will become operational in a couple of days. He added that two more testing centres — at Tiruvarur and Tirunelveli medical colleges — have become operational. <strong>(<a href=\"https:\/\/www.newindianexpress.com\/states\/tamil-nadu\/2020\/mar\/17\/more-testing-facilities-to-come-up-in-tamil-nadu-2117520.html\" target=\"_blank\">READ MORE<\/a>)<\/strong><\/p>","date":"2020-03-17 08:47:43","pin":"0","status":"1"},{"title":"65 lakh vulnerable in Kerala, says IMA","content":"<p>Assuming that around 65 lakh people in Kerala can contract coronavirus given the pandemic nature of the virus, the Indian Medical Association (IMA), Cochin Branch, has warned that Kerala would need at least 2.35 lakh ICU beds to fight the fast-spreading virus. In a letter sent to Chief Justice of Kerala High Court, IMA has requested his immediate intervention to stop public gatherings and enforce social distancing to prevent the virus outbreak. <strong>(<a href=\"https:\/\/www.newindianexpress.com\/states\/kerala\/2020\/mar\/17\/covid-19-65-lakh-vulnerable-in-kerala-says-ima-2117649.html\" target=\"_blank\">READ MORE<\/a>)<\/strong><\/p>","date":"2020-03-17 09:03:58","pin":"0","status":"1"},{"title":"Warriors in white combat to keep coronavirus at bay","content":"<p>Life has not been the same for Dr Roy Kurian (name changed) since COVID-19 struck Kerala. While the rest of the world beat a hasty retreat to the safety of their homes, this 40-year-old medic and others of his ilk have kitted up to bravely combat the virus. Having been chosen for the onerous task of treating patients who have tested positive for the virus, Dr Kurian exudes quiet pride and complete confidence as he goes about his daily work. <strong>(<a href=\"https:\/\/www.newindianexpress.com\/states\/kerala\/2020\/mar\/17\/warriors-in-white-combat-to-keep-coronavirus-at-bay-2117648.html\" target=\"_blank\">READ MORE<\/a>)<\/strong><\/p>","date":"2020-03-17 09:04:39","pin":"0","status":"1"},{"title":"Healthcare community under infection scare","content":"<p>The medical community in the state has come under the shadow of coronavirus infection. For the first time since COVID-19 threat, some medical personnel at Sree Chitra Tirunal Institute for Medical Sciences and Government Medical College Hospitals in Thiruvananthapuram and Ernakulam have been sent to isolation wards, triggering concern among health workers. <strong>(<a href=\"https:\/\/www.newindianexpress.com\/states\/kerala\/2020\/mar\/17\/healthcare-community-under-infection-scare-2117633.html\" target=\"_blank\">READ MORE<\/a>)<\/strong><\/p>","date":"2020-03-17 09:05:37","pin":"0","status":"1"},{"title":"Plan C: Isolation in vacant and unused facilities","content":"<p>Keeping in mind the huge number of Keralites based abroad, the state is chalking out an extensive Plan C which will see, in addition to the existing facilities, vacant buildings and unused facilities in all districts being converted into mass isolation wards to tackle the COVID-19 menace.<strong> (<a href=\"https:\/\/www.newindianexpress.com\/states\/kerala\/2020\/mar\/17\/plan-c-isolation-in-vacant-and-unused-facilities-2117604.html\" target=\"_blank\">READ MORE<\/a>)<\/strong><\/p>","date":"2020-03-17 09:06:21","pin":"0","status":"1"},{"title":"Foreigners face ostracism in Kerala","content":"<p>Two tourists, Selin from France and Moura from Italy, literally broke down as they met the police in Payyannur on Sunday. The young foreigners who arrived in Kerala to enjoy the lush greenery and fiery ritualistic dances of  God’s Own Country were shocked by the attitude of the people who shooed them away shouting ‘keep away corona.’<\/p>\n<p><img src=\"https:\/\/images.newindianexpress.com\/images\/liveimages\/image\/Foreignersa.jpg\" width=\"494\" height=\"160\" alt=\"\" \/><\/p>","date":"2020-03-17 09:12:56","pin":"0","status":"1"},{"title":"Denied hotel room in Wagamon, Italian spends night at Wagamon cemetery","content":"<p>With the district on high alert after the first positive case of coronavirus was confirmed in a UK tourist who stayed at a Munnar resort, an Italian national who arrived at Wagamon on Saturday was forced to sleep in the cemetery of a church located on the Wagamon-Pullikkanam route as he failed to get a room in any of the resorts or hotels. <strong>(<a href=\"https:\/\/www.newindianexpress.com\/states\/kerala\/2020\/mar\/17\/denied-hotel-room-italian-spends-night-at-wagamon-cemetery-2117636.html\" target=\"_blank\">READ MORE<\/a>)<\/strong><\/p>","date":"2020-03-17 09:14:53","pin":"0","status":"1"},{"title":"Residents lock up couple in apartment due to virus scare","content":"<p>In an incident that exposed the kind of panic people are going through in the present situation, an aged couple was locked up inside their apartment at Mundupalam in Thrissur on Monday as the residents there were afraid of the spread of coronavirus. <strong>(<a href=\"https:\/\/www.newindianexpress.com\/states\/kerala\/2020\/mar\/17\/residents-lock-up-couple-in-apartment-due-to-virus-scare-2117642.html\" target=\"_blank\">READ MORE<\/a>)<\/strong><\/p>","date":"2020-03-17 09:15:59","pin":"0","status":"1"},{"title":"Education department sends notice to 12 Hyderabad schools for remaining open","content":"<p>The Education Department served notices to 12 schools in the city for remaining open despite government orders to all educational institutions in the state to remain shut as part of preventive measures to contain spread of COVID-19. <strong>(<a href=\"https:\/\/www.newindianexpress.com\/states\/telangana\/2020\/mar\/17\/coronavirus-outbreak-education-department-sends-notice-to-12-hyderabad-schools-for-remaining-open-2117729.html\" target=\"_blank\">READ MORE<\/a>)<\/strong><\/p>","date":"2020-03-17 09:17:11","pin":"0","status":"1"},{"title":"All arrivals from COVID-hit nations to face quarantine in Telangana","content":"<p>In an attempt to prevent local transmission of Coronavirus in the State, the Telangana State Health department has decided to quarantine all passengers including Indians arriving at Rajiv Gandhi International Airport, from China, Iran, Italy, Republic of Korea, France, Germany and Spain either through direct flights or via hubs like Dubai, Abu Dhabi, or having a travel history to these seven countries, after March 15.<strong> (<a href=\"https:\/\/www.newindianexpress.com\/states\/telangana\/2020\/mar\/17\/all-arrivals-from-covid-hit-nations-to-face-quarantine-in-telangana-2117717.html\" target=\"_blank\">READ MORE<\/a>)<\/strong><\/p>","date":"2020-03-17 09:18:03","pin":"0","status":"1"},{"title":"","content":"<blockquote class=\"twitter-tweet\">\n<p lang=\"hi\" dir=\"ltr\">Punjab: Shiromani Gurdwara Parbandhak Committee (SGPC) provides hand sanitizers to devotees visiting Golden Temple (Sri Harimandir Sahib), in Amritsar, amid <a href=\"https:\/\/twitter.com\/hashtag\/COVID19?src=hash&ref_src=twsrc%5Etfw\">#COVID19<\/a> pandemic. (16.03.20) <a href=\"https:\/\/t.co\/YxmnTzftAP\">pic.twitter.com\/YxmnTzftAP<\/a><\/p>\n— ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1239648317140692992?ref_src=twsrc%5Etfw\">March 16, 2020<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2020-03-17 09:20:18","pin":"0","status":"1"},{"title":"Quarantine facilities have been set up in Hyderabad, Kolkata, Chennai and other cities","content":"<p>Quarantine facilities have been set up in Jaisalmer, Hyderabad, Kolkata, Gorakhpur, Chennai, Surat, Jhansi, Jodhpur and other places with the help of Navy & Air Force: Director General Medical Services (Army) Lieutenant General RS Grewal<\/p>","date":"2020-03-17 09:21:24","pin":"0","status":"1"},{"title":"All non-essential service providing offices to function at only 50% staff capacity: BMC","content":"<p>All non-essential service providing offices to function at only 50% staff capacity. Failure to obey the order shall be penalized under section 188 of the Indian Penal Code: Praveen Pardeshi, BMC Commissioner<\/p>","date":"2020-03-17 09:22:20","pin":"0","status":"1"},{"title":"2.46 lakh travelers screened at Mumbai Airport as of 16th March: BMC health department","content":"<p>2.46 lakh travelers have been screened at the Mumbai Airport as of 16th March. 14 people have been tested positive, out of which 6 are from Mumbai & 8 from outside: Daksha Shah, Deputy Director of BMC's health department<\/p>","date":"2020-03-17 09:23:23","pin":"0","status":"1"},{"title":"","content":"<blockquote class=\"twitter-tweet\">\n<p lang=\"en\" dir=\"ltr\">Madhya Pradesh: Bhasma aarti at Mahakaleshwar temple in Ujjain held today morning as the temple remains closed for devotees in the view of Coronavirus. <a href=\"https:\/\/t.co\/j8kaC8FVNu\">pic.twitter.com\/j8kaC8FVNu<\/a><\/p>\n— ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1239743913528709120?ref_src=twsrc%5Etfw\">March 17, 2020<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2020-03-17 09:25:49","pin":"0","status":"1"},{"title":"Ministry of Health and Family Welfare has issued guidelines on use of masks by public","content":"<p><img src=\"https:\/\/images.newindianexpress.com\/images\/liveimages\/image\/Coronavirus.jpg\" width=\"900\" height=\"656\" alt=\"\" \/> <\/p>","date":"2020-03-17 09:27:34","pin":"0","status":"1"},{"title":"Equity market in red, Sensex falls 400 points","content":"<p>The key Indian equity indices traded in the red on Tuesday morning, with the BSE Sensex losing over 400 points to trade below the 31,000 mark.The Nifty50 on the National Exchange was trading below 9,100. At 9.26 a.m., the Sensex was trading at 30,907.12, lower by 482.95, or 1.54 per cent from the previous close of 31,390.07 points.It had opened at 31,611.57 and has so far touched an intra-day high of 31,831.63 and a low of 30,745.19.<\/p>","date":"2020-03-17 09:49:12","pin":"0","status":"1"},{"title":"","content":"<blockquote class=\"twitter-tweet\">\n<p lang=\"en\" dir=\"ltr\">Indian Council of Medical Research, Ministry of Health and Family Welfare has laid guidelines for testing strategy in India. It also states that there is currently no community transmission of <a href=\"https:\/\/twitter.com\/hashtag\/COVID2019?src=hash&ref_src=twsrc%5Etfw\">#COVID2019<\/a>. <a href=\"https:\/\/t.co\/eAvJCnZwUd\">pic.twitter.com\/eAvJCnZwUd<\/a><\/p>\n— ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1239760550604595201?ref_src=twsrc%5Etfw\">March 17, 2020<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2020-03-17 10:27:17","pin":"0","status":"1"},{"title":"Odisha makes it mandatory for foreign travellers arriving in state to register themselves","content":"<p>With the first case of confirmed coronavirus case detected in Odisha, the Government on Monday made it mandatory for those coming to the State from abroad to register themselves. While an incentive of Rs 15,000 will be given for registration and home isolation, those not complying with the directive will be punished under the provisions of IPC and CrPC, according to a release from the Chief Minister’s Office (CMO). Registrations can be done by the passenger, relatives or friends. <strong>(<a href=\"https:\/\/www.newindianexpress.com\/states\/odisha\/2020\/mar\/17\/odisha-makes-it-mandatory-for-foreign-travellers-arriving-in-state-to-register-themselves-2117656.html\" target=\"_blank\">READ MORE<\/a>)<\/strong><\/p>","date":"2020-03-17 10:29:16","pin":"0","status":"1"},{"title":"Odisha's Jagannath temple goes on control mode to brace for coronavirus","content":"<p>The preventive measures to check the outbreak of novel coronavirus (COVID19) were enforced in Sri Jagannath Temple here on Monday. As decided in the Chhatisha Nijog meeting of the temple held on Sunday, Pujapanda servitors wore masks and performed rituals of Lord Jagannath and his siblings Balabhadra and Subhadra. <strong>(<a href=\"https:\/\/www.newindianexpress.com\/states\/odisha\/2020\/mar\/17\/odishas-jagannath-temple-goes-on-control-mode-to-brace-for-coronavirus--2117661.html\" target=\"_blank\">ALSO READ<\/a>)<\/strong><\/p>","date":"2020-03-17 10:31:05","pin":"0","status":"1"},{"title":"Wedding venue in Odisha's Sambalpur has dedicated COVID-19 kiosk","content":"<p>In the midst of corona chaos, a family in Sambalpur set up an exclusive kiosk at a wedding reception to sensitise guests about precautionary measures for coronavirus on Sunday. After the state government issued advisory to prevent possible outbreak of the disease on Friday, the Sambalpur administration geared up to take measures to sensitise people. <strong>(<a href=\"https:\/\/www.newindianexpress.com\/states\/odisha\/2020\/mar\/17\/coronavirus-effect-wedding-venue-in-odishas-sambalpur-has-dedicated-covid-19-kiosk-2117663.html\" target=\"_blank\">READ MORE<\/a>)<\/strong><\/p>","date":"2020-03-17 10:32:24","pin":"0","status":"1"},{"title":"Maharashtra to stamp people in home quarantine","content":"<p>In an unprecedented move, the Maharashtra government on Monday decided to 'stamp' all those people who have been sent to 100 per cent 'home quarantine' in view of the coronavirus pandemic. Accordingly, the left hand of all persons shunted to 100 per cent home quarantine will be stamped to identify them easily if they mingle with the general public. <strong>(<a href=\"https:\/\/www.newindianexpress.com\/nation\/2020\/mar\/17\/maharashtra-to-stamp-people-in-home-quarantine-2117763.html\" target=\"_blank\">READ MORE<\/a>)<\/strong><\/p>","date":"2020-03-17 10:55:24","pin":"0","status":"1"},{"title":"India reports third coronavirus death as as 63-year-old Mumbai man dies at Kasturba Hospital","content":"<p>A 63-year-old man, who was tested positive for coronavirus, died in Mumbai's Kasthurbha Gandhi hospital on Tuesday morning taking the number of deaths due to COVID-19 in India to three. This was the first coronavirus death reported in Maharashtra. <strong>(<a href=\"https:\/\/www.newindianexpress.com\/cities\/mumbai\/2020\/mar\/17\/india-reports-third-coronavirus-death-as-64-year-old-man-dies-in-mumbai-first-death-in-maharashtra-2117771.html\" target=\"_blank\">READ MORE<\/a>)<\/strong><\/p>","date":"2020-03-17 11:10:52","pin":"0","status":"1"},{"title":"Kalaburagi doctor who treated Coronavirus-infected man tests positive","content":"<p style=\"text-align: justify;\">A doctor who had treated a Coronovirus-infected man who died in Kalaburagi last week has tested positive for COVID-19, officials said here on Tuesday. The 63-year-old doctor has been placed under quarantine at his home along with his family members and is being shifted to an isolation ward, Kalaburagi Deputy Commissioner Sharat B said.<strong> (<a href=\"https:\/\/www.newindianexpress.com\/states\/karnataka\/2020\/mar\/17\/kalaburagi-doctor-who-treated-coronavirus-infected-man-tests-positive-2117786.html\" target=\"_blank\">READ MORE<\/a>)<\/strong><\/p>","date":"2020-03-17 12:13:53","pin":"0","status":"1"},{"title":"Two persons test positive in UP","content":"<p>Two persons test positive for Coronavirus; one in Sector 78 and another in Sector 100 with travel history to France. Both are admitted in designated isolation hospital: Gautam Budh Nagar CMO Anurag Bhargav<\/p>","date":"2020-03-17 12:16:36","pin":"0","status":"1"},{"title":"India prohibits travel of passengers","content":"<p>Government of India prohibits travel of passengers from Afghanistan, Philippines, Malaysia to India till 31st March, with immediate effect.<\/p>","date":"2020-03-17 12:17:02","pin":"0","status":"1"},{"title":"","content":"<blockquote class=\"twitter-tweet\">\n<p lang=\"en\" dir=\"ltr\">Henk Bekedam, WHO Representative to India on <a href=\"https:\/\/twitter.com\/hashtag\/Coronavirus?src=hash&ref_src=twsrc%5Etfw\">#Coronavirus<\/a>: The commitment from Indian govt, the Prime Minister's Office has been enormous, very impressive. It is one of the reasons why India is still doing quite well. I am very impressed that everyone has been mobilised. <a href=\"https:\/\/t.co\/RtNSMTsiag\">pic.twitter.com\/RtNSMTsiag<\/a><\/p>\n— ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1239779904134066177?ref_src=twsrc%5Etfw\">March 17, 2020<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2020-03-17 12:33:21","pin":"0","status":"1"},{"title":"For the next two weeks no visitor allowed to meet prisoners across Tamil Nadu","content":"<p>As a precautionary measure against the spread of Coronavirus, for the next two weeks no visitor or family members will be allowed to meet prisoners in the prisons across Tamil Nadu. Monitoring rooms have been set up inside the prisons to screen all new prisoners to the jail.<\/p>","date":"2020-03-17 12:34:22","pin":"0","status":"1"},{"title":"Mumbai Police conducted a raid on a shop last night","content":"<p>Officials of the Food and Drug Administration along with Mumbai police conducted a raid on a shop last night and arrested one person for advertising one of its products as an effective measure to cure coronavirus.<\/p>","date":"2020-03-17 12:35:07","pin":"0","status":"1"},{"title":"PM Modi asks MPs to visit their constituencies to make people aware about coronavirus","content":"<p>PM Narendra Modi in BJP Parliamentary party meeting today said that the Parliament will run till 3rd April. He asked the MPs to visit their constituencies to make people aware about Coronavirus.<\/p>","date":"2020-03-17 12:35:48","pin":"0","status":"1"},{"title":"","content":"<blockquote class=\"twitter-tweet\">\n<p lang=\"en\" dir=\"ltr\">Ashish Kumar, Dehradun District Magistrate: Uttarakhand Congress vice-president Suryakant Dhasmana will remain in quarantine for 14 days at his house. The step has been taken after he met a suspected <a href=\"https:\/\/twitter.com\/hashtag\/Coronavirus?src=hash&ref_src=twsrc%5Etfw\">#Coronavirus<\/a> patient in the isolation ward of Doon Hospital on Monday. <a href=\"https:\/\/t.co\/z3ihQ2VQcq\">pic.twitter.com\/z3ihQ2VQcq<\/a><\/p>\n— ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1239787764452700160?ref_src=twsrc%5Etfw\">March 17, 2020<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2020-03-17 12:36:37","pin":"0","status":"1"},{"title":"CJI Bobde took a stock of the situation inside the premise, in view of coronavirus","content":"<p>CJI SA Bobde and three other judges visited the Supreme Court corridors and inspected the area and take a stock of the situation inside the premise, in view of coronavirus. He also interacted with the Solicitor General Tushar Mehta and Mukul Rohatgi.<\/p>","date":"2020-03-17 12:38:03","pin":"0","status":"1"},{"title":"V Muraleedharan in self quarantine","content":"<p>Union Minister V Muraleedharan is in self quarantine after he attended a meeting in a medical institute in Trivandrum on March 14. A doctor there who returned from Spain, tested positive for COVID 19 on March 15.<\/p>","date":"2020-03-17 12:38:35","pin":"0","status":"1"},{"title":"Maharashtra Health Minister holds urgent meeting","content":"<p>Maharashtra Health Minister Rajesh Tope holds an urgent meeting on coronavirus. He is meeting leaders from the corporate and health sector.<\/p>","date":"2020-03-17 12:39:24","pin":"0","status":"1"},{"title":"","content":"<p>Initial talks are on for involving private labs to conduct COVID-19 tests : Indian Council of Medical Research officials<\/p>","date":"2020-03-17 12:39:50","pin":"0","status":"1"},{"title":"SAI decided that academic training in National Centre of Excellence shall be suspended till further order","content":"<p>Due to Covid-19, Sports Authority of India has decided that academic training in National Centre of Excellence & STCs shall be suspended till further order: Office of MoS Youth Affairs & Sports, Kiren Rijiju<\/p>","date":"2020-03-17 12:42:11","pin":"0","status":"1"},{"title":"India should be preparing itself not just for coronavirus but for economic devastation: Rahul Gandhi","content":"<blockquote class=\"twitter-tweet\">\n<p lang=\"en\" dir=\"ltr\"><a href=\"https:\/\/twitter.com\/hashtag\/WATCH?src=hash&ref_src=twsrc%5Etfw\">#WATCH<\/a> Congress MP Rahul Gandhi: It is like a tsunami is coming. India should be preparing itself not just for <a href=\"https:\/\/twitter.com\/hashtag\/Coronavirus?src=hash&ref_src=twsrc%5Etfw\">#Coronavirus<\/a> but for the economic devastation that is coming. I am saying it again & again. Our people are going to go through unimaginable pain in the next 6 months. <a href=\"https:\/\/t.co\/Pk6cMDVhNr\">pic.twitter.com\/Pk6cMDVhNr<\/a><\/p>\n— ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1239802397381312512?ref_src=twsrc%5Etfw\">March 17, 2020<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2020-03-17 12:44:35","pin":"0","status":"1"},{"title":"All shops in Pune have been shut down","content":"<blockquote class=\"twitter-tweet\">\n<p lang=\"en\" dir=\"ltr\">Maharashtra: All shops in Pune have been shut down for three days on the call of Federation Of Association Of Pune due to <a href=\"https:\/\/twitter.com\/hashtag\/Coronavirus?src=hash&ref_src=twsrc%5Etfw\">#Coronavirus<\/a>. Total 39 positive cases have been reported in the state. <a href=\"https:\/\/t.co\/89AWtQB2of\">pic.twitter.com\/89AWtQB2of<\/a><\/p>\n— ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1239805059514265600?ref_src=twsrc%5Etfw\">March 17, 2020<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2020-03-17 12:46:13","pin":"0","status":"1"},{"title":"Three positive cases in Ladakh","content":"<p>Three more people test positive for COVID-19 in Union Territory of Ladakh. 2 cases from Leh, 1 from Kargil district; Total positive cases in Ladakh is now 6: Ladakh Commissioner Secretary Rigzin Sampheal<\/p>","date":"2020-03-17 13:13:03","pin":"0","status":"1"},{"title":" I thank all the doctors and paramedics of the country, on behalf of all of you: Health Minister Dr Harsh Vardhan","content":"<p>The doctors, paramedical staff, pilots, airlines' staff and especially those Indians who braved this critical situation & brought back Indians from other parts of the world, despite social distancing being the best way to safeguard oneself, doctors across the country have been working honestly while taking all risks - I think there are not enough words to appreciate them. I thank all the doctors and paramedics of the country, on behalf of all of you: Health Minister Dr Harsh Vardhan, in Rajya Sabha<\/p>","date":"2020-03-17 13:14:37","pin":"0","status":"1"},{"title":"Three in Kasaragod shifted to isolation wards","content":"<p>Three persons in Kasaragod who travelled with COVID-infected person shifted to isolation wards; father quarantined at home.<\/p>","date":"2020-03-17 13:15:38","pin":"0","status":"1"},{"title":" We're trying best to deliver the best possible treatment: Health Minister Dr Harsh Vardhan","content":"<p>We've heard about some research being done on Chloroquine in US right now. Approvals are given after detailed scientific scrutiny, not by Ministry but by scientists working at ICMR. We're trying best to deliver the best possible treatment to the patients: Health Minister Dr Harsh Vardhan<\/p>","date":"2020-03-17 13:17:42","pin":"0","status":"1"},{"title":"Qutub Minar has been closed till 31st March","content":"<blockquote class=\"twitter-tweet\">\n<p lang=\"en\" dir=\"ltr\">Delhi: Qutub Minar has been closed till 31st March due to <a href=\"https:\/\/twitter.com\/hashtag\/Coronavirus?src=hash&ref_src=twsrc%5Etfw\">#Coronavirus<\/a>. There are total 8 positive cases in the national capital. <a href=\"https:\/\/t.co\/gnk5wtDD3Y\">pic.twitter.com\/gnk5wtDD3Y<\/a><\/p>\n— ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1239811620638875648?ref_src=twsrc%5Etfw\">March 17, 2020<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2020-03-17 13:19:56","pin":"0","status":"1"},{"title":"FORDA writes to the Union Health Minister Dr Harsh Vardhan","content":"<p>Federation of Resident Doctors Association (FORDA) writes to the Union Health Minister Dr Harsh Vardhan to provide health insurance cover for doctors and for adequate provisions of masks and other personal protective equipment in the view of COVID-19 pandemic.<\/p>","date":"2020-03-17 13:20:46","pin":"0","status":"1"},{"title":"","content":"<p>Death of 63-year-old male patient admitted at Kasturba Hospital is confirmed. He had high blood pressure, pneumonia & inflammation of heart muscles and increased heart rate leading to death. He tested positive for COVID19: Municipal Corporation Greater Mumbai<\/p>","date":"2020-03-17 13:22:54","pin":"0","status":"1"},{"title":"People from the corporate sector have ensured all cooperation: Rajesh Tope","content":"<p>People from the corporate sector had come to this important meeting and they have ensured all cooperation. They are ready for our decision of 'Work from home': Rajesh Tope, Minister of Public Health and Family Welfare Maharashtra<\/p>","date":"2020-03-17 13:24:20","pin":"0","status":"1"},{"title":"Volvo Car India asks all employees to work from home","content":"<p>Volvo Car India on Tuesday announced work from home as a safety measure for its employees with immediate effect, considering the number of Coronavirus cases have risen to over 100 in the past few days across the country.<strong> (<a href=\"https:\/\/www.newindianexpress.com\/business\/2020\/mar\/17\/volvo-car-india-asks-all-employees-to-work-from-home-2117792.html\" target=\"_blank\">READ MORE<\/a>)<\/strong><\/p>","date":"2020-03-17 13:27:55","pin":"0","status":"1"},{"title":"63-year-old patient had hid some details from us: Maharashtra Health Minister","content":"<p>Minister of Public Health & Family Welfare, Maharashtra on the death of 63-year-old male patient in Mumbai today: He was admitted at Kasturba Hospital on 5th March & he had hid some details from us, including that he had come from Dubai. But we grew suspicious on 13th March. We sent his samples for test which turned out to be positive. He died at 7 AM today.<\/p>","date":"2020-03-17 13:29:26","pin":"0","status":"1"},{"title":"Statistics of foreigners arriving in India are not maintained community-wise","content":"<p>Statistics of foreigners arriving in India are not maintained community-wise. However 25,782 persons belonging to minority communities in Bangladesh, Afghanistan & Pakistan granted Long Term Visa from 1 Jan 2015 to Dec 2019: MoS Home Nityanand Rai in Parliament<\/p>","date":"2020-03-17 13:30:44","pin":"0","status":"1"},{"title":"","content":"<blockquote class=\"twitter-tweet\" data-conversation=\"none\">\n<p lang=\"en\" dir=\"ltr\">As a 64-year-old patient died of <a href=\"https:\/\/twitter.com\/hashtag\/CoronavirusOutbreak?src=hash&ref_src=twsrc%5Etfw\">#CoronavirusOutbreak<\/a> in Mumbai's Kasturba hospital, death toll due to <a href=\"https:\/\/twitter.com\/hashtag\/Corona?src=hash&ref_src=twsrc%5Etfw\">#Corona<\/a> in India touched three, while total positive cases in the country crossed 125.<br \/>\nRead more 👇<a href=\"https:\/\/t.co\/OR0LrDcgmf\">https:\/\/t.co\/OR0LrDcgmf<\/a><\/p>\n— The New Indian Express (@NewIndianXpress) <a href=\"https:\/\/twitter.com\/NewIndianXpress\/status\/1239788792459886594?ref_src=twsrc%5Etfw\">March 17, 2020<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2020-03-17 13:32:13","pin":"0","status":"1"},{"title":"WATCH | Blood samples are being tested at viral research and diagnostic lab in Tirunelveli","content":"<blockquote class=\"twitter-tweet\" data-conversation=\"none\">\n<p lang=\"en\" dir=\"ltr\">Blood samples are being tested at viral research and diagnostic lab in Tirunelveli.<br \/>\nExpress video by V Karthikalagu. <a href=\"https:\/\/twitter.com\/hashtag\/Coronavirus?src=hash&ref_src=twsrc%5Etfw\">#Coronavirus<\/a> <a href=\"https:\/\/twitter.com\/hashtag\/CoronavirusOutbreak?src=hash&ref_src=twsrc%5Etfw\">#CoronavirusOutbreak<\/a> <a href=\"https:\/\/twitter.com\/xpresstn?ref_src=twsrc%5Etfw\">@xpresstn<\/a> <a href=\"https:\/\/t.co\/ZSmng7vLum\">pic.twitter.com\/ZSmng7vLum<\/a><\/p>\n— The New Indian Express (@NewIndianXpress) <a href=\"https:\/\/twitter.com\/NewIndianXpress\/status\/1239798123439869957?ref_src=twsrc%5Etfw\">March 17, 2020<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2020-03-17 13:33:35","pin":"0","status":"1"},{"title":"Red Fort closed temporarily ","content":"<p>Red Fort has been temporarily closed due to coronavirus. Total 8 positive cases have been reported in the capital.<\/p>","date":"2020-03-17 13:35:50","pin":"0","status":"1"},{"title":"","content":"<p><img src=\"https:\/\/images.newindianexpress.com\/images\/liveimages\/image\/MK%20Stalin_EPS.jpeg\" width=\"1280\" height=\"853\" alt=\"\" \/><\/p>","date":"2020-03-17 13:44:53","pin":"0","status":"0"},{"title":"WATCH | Chennai's iconic Sathyam Cinemas shuts down","content":"<blockquote class=\"twitter-tweet\" data-conversation=\"none\">\n<p lang=\"en\" dir=\"ltr\">Chennai's iconic <a href=\"https:\/\/twitter.com\/hashtag\/SathyamCinemas?src=hash&ref_src=twsrc%5Etfw\">#SathyamCinemas<\/a> shuts down following Tamil Nadu government's order.<a href=\"https:\/\/twitter.com\/hashtag\/Coronavirus?src=hash&ref_src=twsrc%5Etfw\">#Coronavirus<\/a> <a href=\"https:\/\/twitter.com\/hashtag\/CoronavirusOutbreak?src=hash&ref_src=twsrc%5Etfw\">#CoronavirusOutbreak<\/a> <br \/>\nExpress video by Ashwin Prasath.<a href=\"https:\/\/twitter.com\/xpresstn?ref_src=twsrc%5Etfw\">@xpresstn<\/a><a href=\"https:\/\/twitter.com\/hashtag\/Coronavirusindia?src=hash&ref_src=twsrc%5Etfw\">#Coronavirusindia<\/a> LIVE READ: <a href=\"https:\/\/t.co\/dAZEtrKBmo\">https:\/\/t.co\/dAZEtrKBmo<\/a> <a href=\"https:\/\/t.co\/jcmo1n2c09\">pic.twitter.com\/jcmo1n2c09<\/a><\/p>\n— The New Indian Express (@NewIndianXpress) <a href=\"https:\/\/twitter.com\/NewIndianXpress\/status\/1239826544282890240?ref_src=twsrc%5Etfw\">March 17, 2020<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2020-03-17 13:45:56","pin":"0","status":"1"},{"title":"DMK president MK Stalin disinfecting his hands while entering assembly session on Tuesday, following Noval Corona Virus threat, in Chennai. (Photo | P Jawahar, EPS)","content":"<p><img src=\"https:\/\/images.newindianexpress.com\/images\/liveimages\/image\/MK%20Stalin_EPS(1).jpeg\" width=\"600\" height=\"400\" alt=\"\" \/> <\/p>","date":"2020-03-17 13:48:25","pin":"0","status":"1"},{"title":"Rajghat closed down in Delhi","content":"<p>In Delhi, Rajghat has been closed till 31st March due to Coronavirus. Total 8 positive cases have been reported in the capital.  <\/p>","date":"2020-03-17 14:30:30","pin":"0","status":"1"},{"title":"Delhi police gears up to tackle coronavirus","content":"<p>Staff and visitors at DCP Central Office, Central District are being given masks and hand sanitisers. Their temperature is being checked with the help of thermometer gun as a precautionary measure against Coronavirus. Speaking to ANI, DCP Central Sanjay Bhatia said, \"Temperature of all staff and visitors is being checked with temperature gun, they are also being given hand sanitiser and masks. All field officers, beat staff, patrolling staff are being asked to use mask, and they indeed are using them.\" <\/p>","date":"2020-03-17 14:31:49","pin":"0","status":"1"},{"title":"Indian Army organises awareness camps on coronavirus in J&K","content":"<blockquote class=\"twitter-tweet\">\n<p lang=\"en\" dir=\"ltr\">Indian Army organises awareness lectures at village Keri, Darhal, Kulali Galuthi & Bisali in Rajouri & Poonch districts on <a href=\"https:\/\/twitter.com\/hashtag\/COVID19?src=hash&ref_src=twsrc%5Etfw\">#COVID19<\/a>. Measures to prevent infection spread through a demonstration given for easy understanding of populace by Medical Officer. <a href=\"https:\/\/t.co\/m7Mo9P0Ngq\">pic.twitter.com\/m7Mo9P0Ngq<\/a><\/p>\n— ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1239829788296011776?ref_src=twsrc%5Etfw\">March 17, 2020<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2020-03-17 14:33:08","pin":"0","status":"1"},{"title":"Karnataka health minister visits Mangaluru hospital","content":"<p>Karnataka Health Minister B Sriramulu visited the Wenlock District Hospital in Mangaluru to check the preparedness for coronavirus.  <\/p>","date":"2020-03-17 14:35:14","pin":"0","status":"1"},{"title":"More temples in Maharashtra close down","content":"<p>While Shani Shingnapur temple of Ahmednagar district closed till further notice, devotees gathered in huge numbers at Shirdi Saibaba Temple to participate in the last 'aarti' as the temple will shut from 3pm today, in the wake of coronavirus outbreak.  <\/p>","date":"2020-03-17 14:37:35","pin":"0","status":"1"},{"title":"Uttarakhand admin shuts zoos and sanctuaries","content":"<p>Tiger reserves, sanctuaries, national parks and zoos in Uttarakhand to remain closed till 31st March 2020, in the wake of coronavirus outbreak. <\/p>","date":"2020-03-17 14:42:00","pin":"0","status":"1"},{"title":"Compulsory quarantine extended to pax arriving from UAE, Qatar, Oman and Kuwait","content":"<p>Expanding compulsory quarantine for a minimum period of 14 days for passengers coming from\/transiting through UAE, Qatar, Oman & Kuwait. This will come into effect from 1200 GMT on 18th March at the port of first departure. This will be in force till 31st March: Health Ministry <\/p>","date":"2020-03-17 14:43:37","pin":"0","status":"1"},{"title":"Uttarakhand declares coronavirus as an epidemic","content":"<p>Uttarakhand govt has declared Coronavirus as an epidemic. Medical stores advised not to sell medicines to person suffering from cold and cough without medical prescription. Masks and hand sanitizers should be sold at MRP only. <\/p>","date":"2020-03-17 14:44:55","pin":"0","status":"1"},{"title":"Kasargod coronavirus patient route map","content":"<p><img src=\"https:\/\/images.newindianexpress.com\/images\/liveimages\/corona map_kasargod patient.jpg\" width=\"100%\" alt=\"\" \/> <\/p>","date":"2020-03-17 14:51:32","pin":"0","status":"1"},{"title":"Maharashtra government mulling suspension of public transport services","content":"<p>Maharashtra government may suspend public transport services like local train, metro and buses to prevent the virus from spreading, hinted health minister Rajesh Tope after Tuesday's cabinet meeting. <\/p>","date":"2020-03-17 14:54:59","pin":"0","status":"1"},{"title":"Virus impacts Seetha Rama Kalyanam at Bhadrachalam Temple","content":"<p>The grand Sri Seetha Rama Kalyanam, the celestial wedding of Lord Rama and Sita, will be performed sans the devotees on April 2 at Bhadrachalam temple in Telangana, announced transport Minister Puvvada Ajay Kumar in Khammam on Tuesday.<\/p>\n<p>The Minister said that all precautionary measures to combat Coronavirus were in place at Bhadrachalam temple, further adding that the celestial wedding would be conducted in the temple premises this year.<\/p>\n<p>Despite there being a discussion on how to conduct the celestial wedding at the recent State Cabinet meeting discussed, no decision was arrived at The annual Ugadi festival, reading the almanac, at Pragathi Bhavan, the official residence of the Chief Minister, will also be scaled down and held on March 25. <\/p>","date":"2020-03-17 15:12:46","pin":"0","status":"1"},{"title":"Ford asks 10,000 employees in India to work from home","content":"<p>US auto major Ford has asked 10,000 employees in India, except those in business-critical roles, to work from home, a step which has also been taken up by Swedish luxury carmaker Volvo. A Ford India spokesperson said, in recent days, the company has concluded that the issue of coronavirus has taken on a different dimension.<\/p>\n<p><a href=\"https:\/\/www.newindianexpress.com\/business\/2020\/mar\/17\/coronavirus-scare-ford-asks-10000-employees-in-india-to-work-from-home-2117796.html\" target=\"_blank\"><strong>READ FULL STORY HERE<\/strong><\/a><\/p>","date":"2020-03-17 15:15:02","pin":"0","status":"1"},{"title":"Coronavirus precautions stepped up in Kalaburagi","content":"<p>Kalaburagi City Corporation in Karnataka has ordered that street vendors, film theaters, bakeries and restaurants in the district to remain closed for next one week as a precautionary measure against coronavirus.<\/p>\n<p>It must be recalled that India's first coronavirus death was recorded in Kalaburagi on March 10, 2020.<\/p>\n<p><iframe width=\"100%\" height=\"450\" src=\"https:\/\/www.youtube.com\/embed\/5dfsXhps-UU\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\"><\/iframe><\/p>","date":"2020-03-17 15:23:42","pin":"0","status":"1"},{"title":"KSRTC sanitises govt buses","content":"<p>Karnataka State Road Transport Corporation's premium buses being sanitised, by the state govt, after their arrival to the bus depot and before their departure for the next journey, as a precautionary measure against coronavirus outbreak. <\/p>","date":"2020-03-17 15:29:38","pin":"0","status":"1"},{"title":"Coronavirus India updates","content":"<ul>\n    <li>Staff and visitors at the Ministry of Home Affairs are being given hand sanitisers to clean their hands before entering the Ministry, as a precautionary measure.<\/li>\n    <li>The Jammu and Kashmir High Court has issued a circular restricting functioning in both of its Jammu and Srinagar wings to urgent matters only, till March 31.<\/li>\n    <li>UP CM has directed educational institutions, including schools, to remain closed till Apr 2, says Minister Shrikant Sharma<\/li>\n    <li><p style=\"text-align: justify;\"><a href=\"https:\/\/www.newindianexpress.com\/nation\/2020\/mar\/17\/coronavirus-cic-limits-hearings-to-urgent-matters-only-through-audio-and-video-conference-2117821.html\" target=\"_blank\"><strong>CIC issues order<\/strong><\/a><\/p> restricting hearings to urgent matters only through audio and video conference till March 31. Personal appearance of parties or their representatives dispensed.  <\/li>\n<\/ul>","date":"2020-03-17 15:32:44","pin":"0","status":"1"},{"title":"Anganwadi workers in Tamil Nadu reach out to children directly","content":"<blockquote class=\"twitter-tweet\" data-conversation=\"none\">\n<p lang=\"en\" dir=\"ltr\">As <a href=\"https:\/\/twitter.com\/hashtag\/TamilNadu?src=hash&ref_src=twsrc%5Etfw\">#TamilNadu<\/a> government shuts down <a href=\"https:\/\/twitter.com\/hashtag\/anganwadi?src=hash&ref_src=twsrc%5Etfw\">#anganwadi<\/a> centres in the state amid <a href=\"https:\/\/twitter.com\/hashtag\/CoronavirusOutbreak?src=hash&ref_src=twsrc%5Etfw\">#CoronavirusOutbreak<\/a>, workers reach out directly to children to provide them with raw food materials. They also advised parents to feed them properly during the holidays. <br \/>\nExpress photos by U Rakesh Kumar <a href=\"https:\/\/t.co\/Gf5n0uJ9dE\">pic.twitter.com\/Gf5n0uJ9dE<\/a><\/p>\n— The New Indian Express (@NewIndianXpress) <a href=\"https:\/\/twitter.com\/NewIndianXpress\/status\/1239852279231995906?ref_src=twsrc%5Etfw\">March 17, 2020<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2020-03-17 15:34:44","pin":"0","status":"1"},{"title":"Here's why Amazon will hire 1 lakh people across US amidst coronavirus outbreak","content":"<p> Amazon said Monday that it needs to hire 1,00,000 people across the US to keep up with surging orders as the coronavirus spreads and keeps more people at home, shopping online. The online retailer said it will also temporarily raise pay by $2 an hour through the end of April for hourly employees.<\/p>\n<p><a href=\"https:\/\/www.newindianexpress.com\/business\/2020\/mar\/17\/amazon-to-hire-1-lakh-people-across-us-amidst-coronavirus-outbreak-heres-why-2117819.html\" target=\"_blank\"><strong>READ FULL STORY HERE<\/strong><\/a><\/p>","date":"2020-03-17 15:38:36","pin":"0","status":"1"},{"title":"Pondicherry reports its first COVID-19 positive case","content":"<blockquote class=\"twitter-tweet\" data-conversation=\"none\">\n<p lang=\"en\" dir=\"ltr\"><a href=\"https:\/\/twitter.com\/hashtag\/BREAKING?src=hash&ref_src=twsrc%5Etfw\">#BREAKING<\/a> | A 68-year-old woman who came from Abu Dhabi has tested positive for <a href=\"https:\/\/twitter.com\/hashtag\/Coronavirus?src=hash&ref_src=twsrc%5Etfw\">#Coronavirus<\/a> in Puducherry's Mahe region, reports <a href=\"https:\/\/twitter.com\/Debjani_TNIE?ref_src=twsrc%5Etfw\">@Debjani_TNIE<\/a>.<a href=\"https:\/\/twitter.com\/xpresstn?ref_src=twsrc%5Etfw\">@xpresstn<\/a> <a href=\"https:\/\/twitter.com\/hashtag\/covidindia?src=hash&ref_src=twsrc%5Etfw\">#covidindia<\/a><\/p>\n— The New Indian Express (@NewIndianXpress) <a href=\"https:\/\/twitter.com\/NewIndianXpress\/status\/1239858424671694848?ref_src=twsrc%5Etfw\">March 17, 2020<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>\n\n<p style=\"text-align: justify;\"><a href=\"https:\/\/www.newindianexpress.com\/states\/tamil-nadu\/2020\/mar\/17\/68-year-old-woman-from-mahe-region-of-puducherry-tests-positive-for-covid-19-2117836.html\" target=\"_blank\"><strong>READ FULL REPORT HERE<\/strong><\/a><\/p>","date":"2020-03-17 15:48:53","pin":"0","status":"1"},{"title":"Bengal man arrested for selling cow urine, dung as COVID-19 drug","content":"<p>A milk trader was arrested on Tuesday for selling cow dung and urine in a makeshift roadside shop in Hooghly district's Dankuni, about 20 km from the West Bengal capital. Mabud Ali was arrested by the Hooghly district police for \"cheating and hurting religious sentiments\".<\/p>\n<p><a href=\"https:\/\/www.newindianexpress.com\/nation\/2020\/mar\/17\/bengal-man-arrested-for-selling-cow-urine-dung-as-covid-19-drug-2117829.html\" target=\"_blank\"><strong>READ FULL REPORT HERE <\/strong><\/a><\/p>","date":"2020-03-17 16:00:05","pin":"0","status":"1"},{"title":"Pune restaurants and bars to remain shut till March 20","content":"<p> Pune Restaurant and Hoteliers Association has decided that all restaurants and bars will be voluntarily closed for next three days till 20 March to avoid spread of Coronavirus.<\/p>","date":"2020-03-17 16:19:23","pin":"0","status":"1"},{"title":"Qutub Minar, Red Fort other ASI monuments shut till March 31","content":"<p>With the number of positive COVID-19 cases climbing in India, public monuments including Qutub Minar and Red Fort in the national capital are being shut till the end of this month as a precautionary measure.<\/p>\n<p><a href=\"https:\/\/www.newindianexpress.com\/cities\/delhi\/2020\/mar\/17\/covid-19-qutub-minar-red-fort-other-asi-monuments-shut-till-march-31-2117832.html\" target=\"_blank\"><strong>READ FULL STORY HERE<\/strong><\/a><\/p>","date":"2020-03-17 16:21:06","pin":"0","status":"1"},{"title":"Health Ministry recommends anti-HIV drug combination on case-to-case basis","content":"<p>The Union Health Ministry has recommended the use of anti-HIV drug combinations Lopinavir and Ritonavir on a case-to-case basis depending upon the severity of the condition of a patient having coronavirus infection.<\/p>\n<p><a href=\"https:\/\/www.newindianexpress.com\/nation\/2020\/mar\/17\/coronavirus-health-ministry-recommends-anti-hiv-drug-combination-on-case-to-case-basis-2117838.html\" target=\"_blank\"><strong>READ FULL STORY HERE <\/strong><\/a><\/p>","date":"2020-03-17 16:22:23","pin":"0","status":"1"},{"title":"Medical council notice to Mumbai doc who claimed coronavirus won't survive in Indian summer","content":"<p>Cracking the whip on misinformation being spread about novel coronavirus infection, the Maharashtra Medical Council (MMC) has issued a notice to a Mumbai-based doctor who had termed the virus as a \"Chinese fad\" which will not survive in the Indian summer. The MMC has sought an explanation from Dr Anil Patil from Dadar in central Mumbai whether he has any study to substantiate his claims.<\/p>\n<p><a href=\"https:\/\/www.newindianexpress.com\/nation\/2020\/mar\/17\/medical-council-notice-to-mumbai-doctor-who-claimed-coronavirus-wont-survive-in-indian-summer-2117825.html\" target=\"_blank\"><strong>READ FULL REPORT HERE<\/strong><\/a><\/p>","date":"2020-03-17 16:27:39","pin":"0","status":"1"},{"title":"Dalai Lama Temple in Dharamshala closed for public due to coronavirus","content":"<p>The main Tibetan temple in Dharamshala (Dalai Lama temple) has been closed for public in view of the coronavirus pandemic. Tsuglhakhang temple, which is situated in Dharamshala's Mecleodganj area, is popular among tourists and Buddhists across the world. <\/p>","date":"2020-03-17 16:27:54","pin":"0","status":"1"},{"title":"WATCH | 43 doctors of Kerala hospital quarantined","content":"<p><iframe width=\"100%\" height=\"450\" src=\"https:\/\/www.youtube.com\/embed\/1-H17wOVjLQ\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\"><\/iframe><\/p>","date":"2020-03-17 16:30:38","pin":"0","status":"1"},{"title":"","content":"<blockquote class=\"twitter-tweet\">\n<p lang=\"en\" dir=\"ltr\">IT'S OFFICIAL: COVID-19 - Ernakulam collector orders taking over hostels of educational institutions, hotels, other hostels, vacant rooms of private hospitals under the Disaster Management Act. <a href=\"https:\/\/twitter.com\/NewIndianXpress?ref_src=twsrc%5Etfw\">@NewIndianXpress<\/a> <a href=\"https:\/\/twitter.com\/xpresskerala?ref_src=twsrc%5Etfw\">@xpresskerala<\/a><\/p>\n— Rajesh Abraham (@pendown) <a href=\"https:\/\/twitter.com\/pendown\/status\/1239866942762012672?ref_src=twsrc%5Etfw\">March 17, 2020<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2020-03-17 16:34:28","pin":"0","status":"1"},{"title":" Cricket Association of Bengal office to remain closed till 21st March","content":"<p>The office of the Cricket Association of Bengal will remain closed from 17th March to 21st March as a precautionary measure against Coronavirus. Managers\/functional heads can take a decision to get employees to report to office as per work exigency\/priorities. <\/p>","date":"2020-03-17 16:35:41","pin":"0","status":"1"},{"title":"Iskon Radha Krishna Temple to remain shut ","content":"<blockquote class=\"twitter-tweet\">\n<p lang=\"en\" dir=\"ltr\"><a href=\"https:\/\/twitter.com\/hashtag\/Karnataka?src=hash&ref_src=twsrc%5Etfw\">#Karnataka<\/a><a href=\"https:\/\/twitter.com\/hashtag\/CoronavirusOutbreak?src=hash&ref_src=twsrc%5Etfw\">#CoronavirusOutbreak<\/a><br \/>\n<br \/>\nISKCON Radha Krishna temple remains closed to public with effect from the early morning of 18th March 2020, till further notice.<a href=\"https:\/\/twitter.com\/NewIndianXpress?ref_src=twsrc%5Etfw\">@NewIndianXpress<\/a> <a href=\"https:\/\/twitter.com\/santwana99?ref_src=twsrc%5Etfw\">@santwana99<\/a><\/p>\n— TNIE Karnataka (@XpressBengaluru) <a href=\"https:\/\/twitter.com\/XpressBengaluru\/status\/1239868408847413248?ref_src=twsrc%5Etfw\">March 17, 2020<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2020-03-17 16:37:26","pin":"0","status":"1"},{"title":"COVID-19 international updates","content":"<p><strong><a href=\"https:\/\/www.newindianexpress.com\/world\/2020\/mar\/17\/malaysia-closes-borders-most-businesses-in-lockdown-amid-covid-19-2117835.html\" target=\"_blank\">Malaysia<\/a><\/strong><a href=\"https:\/\/www.newindianexpress.com\/world\/2020\/mar\/17\/malaysia-closes-borders-most-businesses-in-lockdown-amid-covid-19-2117835.html\" target=\"_blank\"><strong> announces a drastic two-week lockdown<\/strong><\/a> in the country to slow the spread of the new coronavirus following a sharp spike in the number of cases.<\/p>\n<p style=\"text-align: justify;\"><strong><a href=\"https:\/\/www.newindianexpress.com\/world\/2020\/mar\/17\/egypt-quarantines-300-families-in-village-after-coronavirus-deaths-2117844.html\" target=\"_blank\">Egypt has placed over 300 families under quarantine<\/a><\/strong> in a Delta village to stem the spread of the new coronavirus after two deaths were recorded this month originating from the area.<\/p>\n<p style=\"text-align: justify;\"><strong><a href=\"https:\/\/www.newindianexpress.com\/world\/2020\/mar\/17\/first-coronavirus-death-reported-in-pakistan-cases-surge-to-193-2117839.html\" target=\"_blank\">Pakistan reported its first casualty due to the novel coronavirus<\/a><\/strong> on Tuesday, as the number of positive cases of the COVID-19 infections rose to 193 in the country.<\/p>\n<p style=\"text-align: justify;\"><strong><a href=\"https:\/\/www.newindianexpress.com\/world\/2020\/mar\/17\/germany-to-fly-citizens-stranded-by-coronavirus-home-warns-against-all-travel-2117817.html\" target=\"_blank\">Germany will begin repatriating citizens stranded abroad as borders shut<\/a><\/strong> and airlines scrap flights because of the coronavirus pandemic<\/p>","date":"2020-03-17 16:39:45","pin":"0","status":"0"},{"title":"","content":"<blockquote class=\"twitter-tweet\" data-conversation=\"none\">\n<p lang=\"en\" dir=\"ltr\">Here's what goes into the menu at Ernakulam medical college for <a href=\"https:\/\/twitter.com\/hashtag\/COVID19?src=hash&ref_src=twsrc%5Etfw\">#COVID19<\/a> patients:<br \/>\nDosa, boiled egg, tea, oranges for Indian patients and toasted bread, omelette without onion, soup and fruit juice for foreigners.<a href=\"https:\/\/twitter.com\/hashtag\/Coronavirus?src=hash&ref_src=twsrc%5Etfw\">#Coronavirus<\/a> <a href=\"https:\/\/twitter.com\/hashtag\/covidindia?src=hash&ref_src=twsrc%5Etfw\">#covidindia<\/a> <a href=\"https:\/\/t.co\/diaeGAd7nV\">pic.twitter.com\/diaeGAd7nV<\/a><\/p>\n— The New Indian Express (@NewIndianXpress) <a href=\"https:\/\/twitter.com\/NewIndianXpress\/status\/1239871364909031424?ref_src=twsrc%5Etfw\">March 17, 2020<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2020-03-17 16:40:37","pin":"0","status":"1"},{"title":"COVID-19 international updates","content":"<ul>\n    <li>\n    <p><strong><a href=\"https:\/\/www.newindianexpress.com\/world\/2020\/mar\/17\/malaysia-closes-borders-most-businesses-in-lockdown-amid-covid-19-2117835.html\" target=\"_blank\">Malaysia<\/a><\/strong><a href=\"https:\/\/www.newindianexpress.com\/world\/2020\/mar\/17\/malaysia-closes-borders-most-businesses-in-lockdown-amid-covid-19-2117835.html\" target=\"_blank\"><strong> announces a drastic two-week lockdown<\/strong><\/a> in the country to slow the spread of the new coronavirus following a sharp spike in the number of cases.<\/p>\n    <\/li>\n    <li style=\"text-align: justify;\">\n    <p><strong><a href=\"https:\/\/www.newindianexpress.com\/world\/2020\/mar\/17\/egypt-quarantines-300-families-in-village-after-coronavirus-deaths-2117844.html\" target=\"_blank\">Egypt has placed over 300 families under quarantine<\/a><\/strong> in a Delta village to stem the spread of the new coronavirus after two deaths were recorded this month originating from the area.<\/p>\n    <\/li>\n    <li style=\"text-align: justify;\">\n    <p><strong><a href=\"https:\/\/www.newindianexpress.com\/world\/2020\/mar\/17\/first-coronavirus-death-reported-in-pakistan-cases-surge-to-193-2117839.html\" target=\"_blank\">Pakistan reported its first casualty due to the novel coronavirus<\/a><\/strong> on Tuesday, as the number of positive cases of the COVID-19 infections rose to 193 in the country.<\/p>\n    <\/li>\n    <li style=\"text-align: justify;\">\n    <p><strong><a href=\"https:\/\/www.newindianexpress.com\/world\/2020\/mar\/17\/germany-to-fly-citizens-stranded-by-coronavirus-home-warns-against-all-travel-2117817.html\" target=\"_blank\">Germany will begin repatriating citizens stranded abroad as borders shut<\/a><\/strong> and airlines scrap flights because of the coronavirus pandemic<\/p>\n    <\/li>\n<\/ul>","date":"2020-03-17 17:27:16","pin":"0","status":"1"},{"title":"British doctor beats coronavirus with paracetamol, chicken soup, lemonade","content":"<p> A veteran British general practitioner, who had tested positive for the novel coronavirus, said that she beat the deadly disease by \"dosing\" herself with paracetamol, chicken soup and lemonade, the media reported on Tuesday.<\/p>\n<p>Clare Gerada, 60, former head of the London-based Royal College of General Practitioners, was bedridden for days after returning from a New York conference with the virus, reports The Sun newspaper.<\/p>\n<p><a href=\"https:\/\/www.newindianexpress.com\/world\/2020\/mar\/17\/british-doctor-beats-coronavirus-with-paracetamol-chicken-soup-lemonade-2117861.html\" target=\"_blank\"><strong>READ FULL REPORT HERE<\/strong><\/a><\/p>","date":"2020-03-17 17:29:51","pin":"0","status":"1"},{"title":"","content":"<blockquote class=\"twitter-tweet\">\n<p lang=\"en\" dir=\"ltr\">As number of <a href=\"https:\/\/twitter.com\/hashtag\/coronavirusindia?src=hash&ref_src=twsrc%5Etfw\">#coronavirusindia<\/a> cases reaches 133, <a href=\"https:\/\/twitter.com\/ICMRDELHI?ref_src=twsrc%5Etfw\">@ICMRDELHI<\/a> DG Dr Balram Bhargava says \"premature of <a href=\"https:\/\/twitter.com\/WHO?ref_src=twsrc%5Etfw\">@WHO<\/a> DG <a href=\"https:\/\/twitter.com\/DrTedros?ref_src=twsrc%5Etfw\">@DrTedros<\/a> to say \" test, test test\" because India is not in community transmission stage yet <a href=\"https:\/\/twitter.com\/NewIndianXpress?ref_src=twsrc%5Etfw\">@NewIndianXpress<\/a><\/p>\n— Sumi Dutta (@SumiSukanya) <a href=\"https:\/\/twitter.com\/SumiSukanya\/status\/1239884387803475968?ref_src=twsrc%5Etfw\">March 17, 2020<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2020-03-17 17:42:49","pin":"0","status":"1"},{"title":"Total number of COVID-19 cases rises to 40 in Maharashtra.  ","content":"<p>Deepak Mhaisekar, Divisional Commissioner of Pune informs ANI that one person has been tested positive for COVID-19 in Pimpri-Chinchwad today; he has travel history to USA. With this, total number of COVID-19 cases rises to 40 in Maharashtra.  <\/p>","date":"2020-03-17 17:43:09","pin":"0","status":"1"},{"title":"Elective surgeries postponed to tackle COVID spread","content":"<p> The Telangana government has directed to postpone all elective surgeries from March 18 till March 25, in teaching and speciality hospitals under the control of the Director of Medical Education, to prevent spread of Coronavirus through medical and health workers who are at high-risk of contracting the virus.<\/p>\n<p>The GO stated, \"In view of the preparedness for COVID-19, the following decision was taken in the review meeting chaired by Chief Secretary and Special Chief Secretary, Health, Medical & Family Welfare, Govermment of Telangana on 16-03-2020.\"<\/p>\n<p>However, all regular Out Patients Services, Emergency Surgeries and Emergency Services will continue as usual, as reported by TNIE correspondent in Hyderabad. <\/p>","date":"2020-03-17 17:49:16","pin":"0","status":"1"},{"title":"KVs in Delhi to announce annual exam results through email, WhatsApp","content":"<p>Kendriya Vidyalayas in the national capital will be announcing annual examination results through email and WhatsApp this year in view of the coronavirus outbreak, officials said on Tuesday.<\/p>\n<p><a href=\"https:\/\/www.newindianexpress.com\/cities\/delhi\/2020\/mar\/17\/kendriya-vidyalayas-in-delhi-to-announce-annual-exam-results-through-email-whatsapp-2117887.html\" target=\"_blank\"><strong>READ FULL REPORT HERE<\/strong><\/a><\/p>","date":"2020-03-17 18:44:07","pin":"0","status":"1"},{"title":"Private NABL-accredited labs will soon be operationalised for coronavirus tests: ICMR","content":"<p>There are 72 functional Indian Council of Medical Research laboratories conducting tests for coronavirus and private NABL-accredited labs will soon be operationalised across the country, ICMR Director General Balram Bhargava on Tuesday said.<\/p>\n<p>He also appealed to all private laboratories to offer COVID-19 diagnosis free of cost.<\/p>\n<p><a href=\"https:\/\/www.newindianexpress.com\/nation\/2020\/mar\/17\/private-nabl-accredited-labs-will-soon-be-operationalised-for-coronavirus-tests-icmr-2117886.html\" target=\"_blank\"><strong>READ FULL STORY HERE <\/strong><\/a><\/p>","date":"2020-03-17 18:54:59","pin":"0","status":"1"},{"title":"Russian Deputy PM's visit to India in March cancelled due to coronavirus outbreak","content":"<p>Russian Deputy Prime Minister Yury Trutnev's visit to India scheduled for later this month has been cancelled in view of the coronavirus outbreak, Russian diplomatic sources said.<\/p>\n<p>The Russian deputy prime minister was expected to visit New Delhi with a large delegation around the end of this month to take forward discussions on India's participation in developing the resource-rich Far East and Arctic regions.<\/p>\n<p><a href=\"https:\/\/www.newindianexpress.com\/nation\/2020\/mar\/17\/russian-deputy-pms-visit-to-india-in-march-cancelled-due-to-coronavirus-outbreak-sources-2117881.html\" target=\"_blank\"><strong>READ FULL REPORT HERE<\/strong><\/a><\/p>","date":"2020-03-17 18:56:38","pin":"0","status":"1"},{"title":"WATCH | Why is Bollywood so oblivious to coronavirus outbreak?","content":"<p><iframe width=\"100%\" height=\"450\" src=\"https:\/\/www.youtube.com\/embed\/sk5pFzQGQNY\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\"><\/iframe><\/p>","date":"2020-03-17 19:02:33","pin":"0","status":"1"},{"title":"23 long-distance trains including Rajdhani, Duronto cancelled","content":"<p>In a significant decision to help contain the spread of coronavirus, the Central Railway on Tuesday announced cancellations of 23 long-distance trains including the Mumbai-Delhi Rajdhani Express and most trains on the Pune sector, for varying periods, an official said.<\/p>\n<p><a href=\"https:\/\/www.newindianexpress.com\/nation\/2020\/mar\/17\/covid-19-pandemic-23-long-distance-trains-including-rajdhani-duronto-cancelled-2117877.html\" target=\"_blank\"><strong>READ FULL REPORT HERE<\/strong><\/a><\/p>","date":"2020-03-17 19:03:55","pin":"0","status":"1"},{"title":"GoAir suspends international services, offers leave without pay for employees","content":"<p>Budget carrier GoAir on Tuesday announced suspending international operations and offering leave without pay programme for its staff on a rotational basis, amid a sharp decline in air travel due to the coronavirus pandemic. In a statement, the airline said the sharp decline in air travel that it was experiencing was \"unprecedented\".<\/p>\n<p><a href=\"https:\/\/www.newindianexpress.com\/nation\/2020\/mar\/17\/coronavirus-goair-suspends-international-services-offers-leave-without-pay-for-employees-2117872.html\" target=\"_blank\"><strong>READ FULL REPORT HERE<\/strong><\/a><\/p>","date":"2020-03-17 19:05:29","pin":"0","status":"1"},{"title":"To regulate crowds, railway zones hike price of platform tickets from Rs 10 to Rs 50","content":"<p>In a bid to discourage gathering of large crowds in view of the coronavirus, six divisions of the Western railway zone -- Mumbai, Vadodra, Ahmedabad, Ratlam, Rajkot, Bhavnagar -- that covers around 250 railway stations have hiked the platform ticket charges from Rs 10 to Rs 50.<\/p>\n<p><a href=\"https:\/\/www.newindianexpress.com\/nation\/2020\/mar\/17\/covid-19-to-regulate-crowds-railway-zones-hike-price-of-platform-tickets-from-rs-10-to-rs-50-2117875.html\" target=\"_blank\"><strong>READ FULL REPORT HERE<\/strong><\/a><\/p>","date":"2020-03-17 19:11:50","pin":"0","status":"1"},{"title":"Yogi govt to transfer fixed amount to labourers' accounts to sustain during COVID-19","content":"<p> Amidst the rising case of coronavirus infection in Uttar Pradesh, the state government on Tuesday has decided to transfer a fixed amount directly into the account of daily wagers through RTGS to help the proletarian sustain during the tough times.<\/p>\n<p>The decision to this effect was taken at the cabinet meeting presided by CM Yogi Adtiyanath as the total number of COVID-19 cases in the state has now risen to 14. <\/p>\n<p><a href=\"https:\/\/www.newindianexpress.com\/nation\/2020\/mar\/17\/yogi-govt-to-transfer-fixed-amount-to-labourers-accounts-to-sustain-during-covid-19-2117895.html\" target=\"_blank\"><strong>READ FULL REPORT HERE<\/strong><\/a><\/p>","date":"2020-03-17 19:21:01","pin":"0","status":"1"},{"title":"DGCA asks airlines to disinfect planes every 24 hrs, place hand sanitizers in lavatories","content":"<p>Aviation regulator DGCA on Tuesday asked airlines to disinfect and deep-clean each plane at least once in 24 hours and place hand sanitizers in lavatories and galleys of each aircraft in view of coronavirus pandemic, reported PTI.<\/p>\n<p>Moreover, the regulator said in its circular that all planes should have one or more universal precaution kit.<\/p>\n<p>\"Such kit should be used to protect crew members who are assisting potentially infectious cases of suspected Covid-19 and in cleaning up and correctly discarding any potentially infectious contents,\" the DGCA added. <\/p>","date":"2020-03-17 19:30:46","pin":"0","status":"1"},{"title":"One more tested positive in Karnataka, total cases in state rise to 11","content":"<blockquote class=\"twitter-tweet\">\n<p lang=\"en\" dir=\"ltr\">One more tested positive for <a href=\"https:\/\/twitter.com\/hashtag\/COVID19?src=hash&ref_src=twsrc%5Etfw\">#COVID19<\/a> in Karnataka taking the tally to 11 including one casualty. 67-yr-old resident of Bengaluru had returned from Dubai via Goa on March 9. She had been under home quarantine since<a href=\"https:\/\/twitter.com\/NewIndianXpress?ref_src=twsrc%5Etfw\">@NewIndianXpress<\/a> <a href=\"https:\/\/twitter.com\/XpressBengaluru?ref_src=twsrc%5Etfw\">@XpressBengaluru<\/a> <a href=\"https:\/\/twitter.com\/santwana99?ref_src=twsrc%5Etfw\">@santwana99<\/a><\/p>\n— Anusha Ravi Sood (@anusharavi10) <a href=\"https:\/\/twitter.com\/anusharavi10\/status\/1239913716847529984?ref_src=twsrc%5Etfw\">March 17, 2020<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2020-03-17 19:32:01","pin":"0","status":"1"},{"title":"No impact on Indian economy due to COVID-19, says Mos Finance Anurag Thakur","content":"<p>While the world economy has taken some beating after the outbreak of coronavirus or COVID-19, Minister of State for Finance Anurag Singh Thakur on Tuesday pointed out that the latest data \"do not suggest any adverse impact on the economy\" after the outbreak of COVID-19.<\/p>\n<p><a href=\"https:\/\/www.newindianexpress.com\/business\/2020\/mar\/17\/no-impact-on-indian-economy-due-to-covid-19-says-mos-finance-anurag-thakur-2117864.html\" target=\"_blank\"><strong>READ FULL REPORT HERE <\/strong><\/a><\/p>","date":"2020-03-17 19:53:08","pin":"0","status":"1"},{"title":"Uncertainty looms over elections to Bodo council","content":"<p>There is an uncertainty on the April 4 elections to autonomous Bodoland Territorial Council (BTC) in view of the outbreak of coronavirus.<\/p>\n<p>As of now, there is no official word on whether the polls will be postponed. The state’s election commission said if any decision were to be taken on the deferment of the polls, it would be taken by the authority of the Sixth Schedule of the Constitution.<\/p>\n<p><a href=\"https:\/\/www.newindianexpress.com\/nation\/2020\/mar\/17\/covid-19-pandemic-uncertainty-looms-over-elections-to-bodo-council-2117900.html\" target=\"_blank\"><strong>READ FULL REPORT HERE<\/strong><\/a><\/p>","date":"2020-03-17 19:58:03","pin":"0","status":"1"},{"title":"MEA says cannot confirm if 250 Indians tested positive for COVID-19 in Iran","content":"<p> MEA says news of 250 Indians testing positive in Iran is unconfirmed.<\/p>\n\"The Indians who are in Iran are being very well looked after by our mission. The ambassador is giving a lot of attention to them. Every care is being taken, in coordination and there is cooperation from the government of Iran. But I cannot at the moment confirm that over 250 Indians in Iran have tested positive for coronavirus,\" MEA Additional Secretary Dammu Ravi said.","date":"2020-03-17 19:58:37","pin":"0","status":"1"},{"title":"Total coronavirus patients in Maharashtra: 41","content":"<p>Pimpri Chinchwad- 10<br \/>\nPune- 7<br \/>\nMumbai- 7<br \/>\nNagpur- 4<br \/>\nYawatmal- 3<br \/>\nNavi Mumbai- 3<br \/>\nKalyan- 3<br \/>\nRaigad- 1<br \/>\nThane- 1<br \/>\nAhmednagar- 1<br \/>\nAurangabad- 1 <\/p>\n<p style=\"text-align: justify;\"><a href=\"https:\/\/www.newindianexpress.com\/nation\/2020\/mar\/17\/covid-19-positive-cases-surge-in-maharashtra-govt-says-no-plan-to-shut-down-public-transport-2117905.html\" target=\"_blank\"><strong>READ FULL REPORT HERE<\/strong><\/a><\/p>\n","date":"2020-03-17 20:00:52","pin":"0","status":"1"},{"title":"10 trains cancelled due to low occupancy","content":"<blockquote class=\"twitter-tweet\">\n<p lang=\"en\" dir=\"ltr\">Western Railway: 35 trips of 10 trains have been cancelled due to low occupancy in view of COVID19. <a href=\"https:\/\/twitter.com\/hashtag\/Coronavirus?src=hash&ref_src=twsrc%5Etfw\">#Coronavirus<\/a> <a href=\"https:\/\/t.co\/xU49LA9iet\">pic.twitter.com\/xU49LA9iet<\/a><\/p>\n— ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1239910948694978562?ref_src=twsrc%5Etfw\">March 17, 2020<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2020-03-17 20:57:55","pin":"0","status":"1"},{"title":"Centre deputes Joint Secretary-rank officers to assist state government in COVID-19 management","content":"<blockquote class=\"twitter-tweet\">\n<p lang=\"en\" dir=\"ltr\">Spokesperson, Ministry of Home Affairs: Government of India deputes 30 officers of Joint Secretary and above level, to assist state Governments in effective management of <a href=\"https:\/\/twitter.com\/hashtag\/COVID19?src=hash&ref_src=twsrc%5Etfw\">#COVID19<\/a> <a href=\"https:\/\/t.co\/C5V1WsPw84\">pic.twitter.com\/C5V1WsPw84<\/a><\/p>\n— ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1239928587404247042?ref_src=twsrc%5Etfw\">March 17, 2020<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2020-03-17 21:00:01","pin":"0","status":"1"},{"title":"More trains cancelled","content":"<blockquote class=\"twitter-tweet\">\n<p lang=\"en\" dir=\"ltr\">South Central Railway: Due to poor patronization as a result of <a href=\"https:\/\/twitter.com\/hashtag\/COVID19?src=hash&ref_src=twsrc%5Etfw\">#COVID19<\/a>, following 17 trains have been cancelled. <a href=\"https:\/\/t.co\/XqmJyL0a4I\">pic.twitter.com\/XqmJyL0a4I<\/a><\/p>\n— ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1239930618332319745?ref_src=twsrc%5Etfw\">March 17, 2020<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2020-03-17 21:01:12","pin":"0","status":"1"},{"title":"CrPC Section 144 imposed in Dakshina Kannada district","content":"<p>Dakshina Kannada Deputy Commissioner Sindhu B Rupesh has clamped CrPC Section 144(3) in the whole of the district to restrict the gathering of people at worship places.<\/p>","date":"2020-03-17 21:19:29","pin":"0","status":"1"},{"title":"90 Dubai-Mangaluru flyers home-quarantined after co-passenger tests positive","content":"<p>The authorities and people of Mangaluru were left anxious after the news spread that the person who had travelled from Mangaluru Airport to Kasargod had tested positive. Soon, the Dakshina Kannada district authorities got in touch with their counterparts in Kasargod to find out his route map and people the patient had come across in the airport and other places before he reached Kasargod.<a href=\"https:\/\/www.newindianexpress.com\/states\/karnataka\/2020\/mar\/17\/coronavirus-90-dubai-mangaluru-flyers-home-quarantined-after-co-passenger-tests-positive-2117914.html\" target=\"_blank\"> <strong>(READ FULL REPORT HERE)<\/strong><\/a><\/p>","date":"2020-03-17 21:24:56","pin":"0","status":"1"},{"title":"West Bengal confirms its first positive coronavirus case","content":"<blockquote class=\"twitter-tweet\">\n<p lang=\"en\" dir=\"ltr\">First positive case of <a href=\"https:\/\/twitter.com\/hashtag\/COVID19?src=hash&ref_src=twsrc%5Etfw\">#COVID19<\/a> confirmed in West Bengal. The 18-year-old man has travel history to United Kingdom. He is kept in isolation. <a href=\"https:\/\/t.co\/qLW0GbvsWn\">pic.twitter.com\/qLW0GbvsWn<\/a><\/p>\n— ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1239953388248260608?ref_src=twsrc%5Etfw\">March 17, 2020<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script><p><a href=\"https:\/\/www.newindianexpress.com\/nation\/2020\/mar\/18\/first-confirmed-case-of-coronavirus-in-west-bengal-2118001.html\" target=\"_blank\"><strong>(READ FULL STORY HERE)<\/strong><\/a><\/p>","date":"2020-03-17 22:19:28","pin":"0","status":"1"},{"title":"Kashmir bans entry of all foreign tourists ","content":"<blockquote class=\"twitter-tweet\">\n<p lang=\"en\" dir=\"ltr\">Shahid Choudhary, District Magistrate\/Development Commissioner, Srinagar, Jammu and Kashmir: Entry of all foreign tourists in Kashmir has been banned as a precautionary measure. <a href=\"https:\/\/twitter.com\/hashtag\/CoronavirusPandemic?src=hash&ref_src=twsrc%5Etfw\">#CoronavirusPandemic<\/a> (file pic) <a href=\"https:\/\/t.co\/c2vRslD1I0\">pic.twitter.com\/c2vRslD1I0<\/a><\/p>\n— ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1239960079861870592?ref_src=twsrc%5Etfw\">March 17, 2020<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2020-03-17 22:42:54","pin":"0","status":"1"},{"title":"","content":"<p><span style=\"font-size: large;\">All tourist spots in <strong>Meghalaya<\/strong>, including parks and recreational areas, to remain <strong>closed<\/strong> till <strong>March 31<\/strong>.<\/span><\/p>","date":"2020-03-17 23:06:38","pin":"0","status":"1"},{"title":"Maintain 1 metre distance in queue: Kerala's liquor distribution outlet Bevco issues guidelines","content":"<blockquote class=\"twitter-tweet\">\n<p lang=\"en\" dir=\"ltr\">Bevco, Kerala's liquor distribution outlet, issues Covid-19 guidelines: Customers should maintain minimum one meter distance from each other in the queue. 3 extra security men to ensure this.<\/p>\n— Rajesh Abraham (@pendown) <a href=\"https:\/\/twitter.com\/pendown\/status\/1239956352094502912?ref_src=twsrc%5Etfw\">March 17, 2020<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2020-03-18 00:04:08","pin":"0","status":"1"},{"title":"24 under hospital isolation in TN","content":"<blockquote class=\"twitter-tweet\">\n<p lang=\"en\" dir=\"ltr\"><a href=\"https:\/\/twitter.com\/hashtag\/corona?src=hash&ref_src=twsrc%5Etfw\">#corona<\/a> 2,635 passengers are under home quarantine & 24 under hospital isolation in TN, according to media bulletin issued by d <a href=\"https:\/\/twitter.com\/hashtag\/TNHealth?src=hash&ref_src=twsrc%5Etfw\">#TNHealth<\/a> dept. <a href=\"https:\/\/twitter.com\/ranjim?ref_src=twsrc%5Etfw\">@ranjim<\/a> <a href=\"https:\/\/twitter.com\/NewIndianXpress?ref_src=twsrc%5Etfw\">@NewIndianXpress<\/a><\/p>\n— Sinduja (@Sinduj11) <a href=\"https:\/\/twitter.com\/Sinduj11\/status\/1239933604840390656?ref_src=twsrc%5Etfw\">March 17, 2020<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2020-03-18 00:30:18","pin":"0","status":"1"},{"title":"First Indian Army jawan tests positive for Covid-19 in Ladakh","content":"<p>An Indian Army jawan from Ladakh, whose father had travelled to Iran for pilgrimage, has become the first positive case of Covid-19 in the 1.3 million-strong force. Senior Army sources confirmed that the Indian Army Lance Naik from Ladakh Scouts tested positive for Covid-19 on Monday. (<a href=\"https:\/\/www.newindianexpress.com\/nation\/2020\/mar\/18\/34-year-old-soldier-tests-positive-for-coronavirus-in-leh-first-case-for-armed-forces-2118270.html\" target=\"_blank\"><strong>ALSO READ<\/strong><\/a>)<\/p>","date":"2020-03-18 00:36:47","pin":"0","status":"1"},{"title":"","content":"<blockquote class=\"twitter-tweet\">\n<p lang=\"en\" dir=\"ltr\">Ministry of Health & Family Welfare, Government of India issues guidelines for notifying <a href=\"https:\/\/twitter.com\/hashtag\/COVID19?src=hash&ref_src=twsrc%5Etfw\">#COVID19<\/a> affected persons by private institutions. <a href=\"https:\/\/t.co\/pMcozHWwJY\">pic.twitter.com\/pMcozHWwJY<\/a><\/p>\n— ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1239975282594811905?ref_src=twsrc%5Etfw\">March 17, 2020<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2020-03-18 00:43:49","pin":"0","status":"1"},{"title":"40 European students quarantined in Himachal","content":"<p>A group of 40 European students have been quarantined on the campus of the International Sahaja Public School in the wake of the coronavirus outbreak in the country, officials said on Tuesday.<\/p>","date":"2020-03-18 00:52:06","pin":"0","status":"1"},{"title":"Govt approves AirAsia flights for Delhi, Vizag to help Indians stranded at Kuala Lumpur airport","content":"<p>\"Appreciate the difficult situation of Indian students and other passengers waiting in transit at Kuala Lumpur airport.  We have now approved Air Asia flights for you to Delhi and Vizag,\" Jaishankar tweeted.  \"These are tough times and you should understand the precautions.  Please contact the airline,\" he said.<\/p>","date":"2020-03-18 01:13:03","pin":"0","status":"1"},{"title":"Iran produces drug to heal lung lesion of COVID-19 patients","content":"<p>Iranian researchers have discovered a drug combination to heal the lesions in the lungs of COVID-19 patients, IRNA news agency quoted an Iranian health official as saying.<\/p>\n<p>Mostafa Qanei, head of the scientific committee to combat COVID-19, said the \"complex\" is the combination of three medicines which could reduce the period of hospitalisation of the patients, Xinhua reported.<\/p>","date":"2020-03-18 05:16:26","pin":"0","status":"1"},{"title":"Volkswagen brand to suspend production in Europe from Thursday","content":"<p>Automobile major Volkswagen Passenger Cars brand will gradually suspend production at its European plants from Thursday for two weeks due to the outbreak of coronavirus.<\/p>\n<p>According to the auto major, the move will impact plants operated by Volkswagen Passenger Cars brand for two weeks.<\/p>","date":"2020-03-18 05:17:08","pin":"0","status":"1"},{"title":"US coronavirus death toll approaches 100: Johns Hopkins Center","content":"<p>Almost 100 people have so far died from the coronavirus in the United States, Johns Hopkins University's real-time tracking map revealed.<\/p>\n<p>The US death toll has reached 97 and there are a total of 5,894 cases recorded, according to the updated data on Tuesday.<\/p>","date":"2020-03-18 05:22:46","pin":"0","status":"1"},{"title":"Army postpones all training courses starting from March 23 as jawan tests positive for COVID-19 in Ladakh","content":"<p>As a precautionary measure to curb the spread of coronavirus, the Army has postponed all training courses for its personnel which were scheduled to begin from March 23 onwards, officials said on Tuesday.<\/p>","date":"2020-03-18 09:42:02","pin":"0","status":"1"},{"title":"Section 144 CrPC imposed in many parts of Odisha","content":"<p>Odisha: Section 144 of the Code of Criminal Procedure imposed in Gajapati, Jagatsinghpur, Kandhamal, Bhadrak, and Mayurbhanj districts in view of COVID-19.<\/p>","date":"2020-03-18 10:06:22","pin":"0","status":"1"},{"title":"","content":"<blockquote class=\"twitter-tweet\">\n<p lang=\"en\" dir=\"ltr\">Maharashtra: Central Railway has vinyl wrapped a 12 coach Mumbai local train with messages regarding <a href=\"https:\/\/twitter.com\/hashtag\/COVID19?src=hash&ref_src=twsrc%5Etfw\">#COVID19<\/a>, in order to raise awareness among commuters. <a href=\"https:\/\/t.co\/mZ7WFsngFv\">pic.twitter.com\/mZ7WFsngFv<\/a><\/p>\n— ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1240017206722756608?ref_src=twsrc%5Etfw\">March 17, 2020<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2020-03-18 10:07:13","pin":"0","status":"1"},{"title":"66 premises sealed for violating state government order: Mayor of Greater Hyderabad","content":"<p>66 premises, including coaching centers, schools, gyms, & bars sealed for violating state government order of closure till 31st March. Bonthu Rammohan, Mayor of Greater Hyderabad says, \"18 special teams have been constituted for daily inspections\".<\/p>","date":"2020-03-18 10:08:06","pin":"0","status":"1"},{"title":"Police requested us to halt operations: President of Pune Restaurants & Hoteliers Association","content":"<p>Hotels in Pune to remain closed till 20 March. G Shetty, President of Pune Restaurants & Hoteliers Association says, \"Police requested us to halt operations, it's also our moral duty. There are 850 hotels in the city, in which around 25,000 people work\".<\/p>","date":"2020-03-18 10:11:20","pin":"0","status":"1"},{"title":"","content":"<blockquote class=\"twitter-tweet\">\n<p lang=\"en\" dir=\"ltr\">External Affairs Minister (EAM), Dr. S. Jaishankar met immigration, health, security, and airport officials of Delhi Airport tonight. <a href=\"https:\/\/twitter.com\/hashtag\/COVID19?src=hash&ref_src=twsrc%5Etfw\">#COVID19<\/a> <a href=\"https:\/\/t.co\/R7P457QFzJ\">pic.twitter.com\/R7P457QFzJ<\/a><\/p>\n— ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1240031827227623424?ref_src=twsrc%5Etfw\">March 17, 2020<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2020-03-18 10:11:35","pin":"0","status":"1"},{"title":"In touch with shipping company and US authorities: TS Sandhu","content":"<p>In touch with shipping company & US authorities regarding welfare of Indian crew on Grand Princess, they're required to undergo mandatory quarantine. We're extending necessary assistance&will facilitate their return on completion of quarantine: TS Sandhu, India's Ambassador to US<\/p>","date":"2020-03-18 10:12:23","pin":"0","status":"1"},{"title":"One more person has tested positive for coronavirus in Pune: Naval Kishore Ram","content":"<p>One more person has tested positive for coronavirus in Pune. The person has travel history to France and Netherlands. Total number of positive cases reaches 18 in Pune and 42 in Maharashtra: Naval Kishore Ram, District Magistrate of Pune, Maharashtra<\/p>","date":"2020-03-18 10:14:22","pin":"0","status":"1"},{"title":"","content":"<blockquote class=\"twitter-tweet\">\n<p lang=\"en\" dir=\"ltr\">Delhi: Temperature of people are being checked with the help of thermometer gun at Parliament Gate as precautionary measure to contain the spread of <a href=\"https:\/\/twitter.com\/hashtag\/Coronavirus?src=hash&ref_src=twsrc%5Etfw\">#Coronavirus<\/a>. <a href=\"https:\/\/t.co\/RT4cmHdLCd\">pic.twitter.com\/RT4cmHdLCd<\/a><\/p>\n— ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1240115000628436999?ref_src=twsrc%5Etfw\">March 18, 2020<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2020-03-18 10:32:23","pin":"0","status":"1"},{"title":"MoS Finance Anurag Thakur, on if Ministry is keeping watch on coronavirus' impact on Indian economy","content":"<ul>\n\t<li>As is true for the world at large, India's near-term macroeconomic outlook also vulnerable to disruption of trade with China and 2nd-round effects arising from an expected slowdown in global growth<\/li>\n\t<li>\n\t<p>However, the latest available data on trade&indicators of domestic output don't suggest any adverse impact on the economy. Additionally, a positive impact on India's economy may arise from a decline in global oil prices triggered by the outbreak of COVID-19<\/p>\n\t<\/li>\n\t<li>\n\t<p>In order to address the possibility of trade-induced adverse impact on economy, the government's constantly engaging with Expert Promotion Councils&trade bodies, particularly in pharmaceutical, electronics and automobile sectors where supply chains are sourcing imports from China<\/p>\n\t<\/li>\n\t<li>\n\t<p>These agencies put in touch with Indian Missions abroad to secure and transport inventories available with existing suppliers. Indian Missions abroad have been asked to explore alternate sources of supply of raw material for supporting India's domestic production<\/p>\n\t<\/li>\n\t<li>\n\t<p>With regards to domestic availability of fertilisers, the impact of COVID19 seems to be negligible at juncture&situation of forthcoming fertiliser imports at various ports being observed closely<\/p>\n\t<\/li>\n<\/ul>","date":"2020-03-18 10:40:26","pin":"0","status":"1"},{"title":"","content":"<blockquote class=\"twitter-tweet\">\n<p lang=\"en\" dir=\"ltr\">Government of Andhra Pradesh constitutes the following Inter-Departmental Coordination Committee with the Secretaries of Line Departments for concerted measurements to containment and surveillance of <a href=\"https:\/\/twitter.com\/hashtag\/COVID19?src=hash&ref_src=twsrc%5Etfw\">#COVID19<\/a> <a href=\"https:\/\/t.co\/S60l0IGaAe\">pic.twitter.com\/S60l0IGaAe<\/a><\/p>\n— ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1240133018511126528?ref_src=twsrc%5Etfw\">March 18, 2020<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2020-03-18 10:44:30","pin":"0","status":"1"},{"title":"Sanitization measures at Ludhiana Railway Station","content":"<blockquote class=\"twitter-tweet\">\n<p lang=\"en\" dir=\"ltr\">Punjab: Sanitization measures being taken at Ludhiana Railway Station as precautionary step to contain the spread of COVID-19. <a href=\"https:\/\/t.co\/tFMS6DOswE\">pic.twitter.com\/tFMS6DOswE<\/a><\/p>\n— ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1240138051705344000?ref_src=twsrc%5Etfw\">March 18, 2020<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2020-03-18 10:45:13","pin":"0","status":"1"},{"title":"Senior citizens are advised to avoid visit: Srikalahasti temple authorities","content":"<p>Srikalahasti temple authorities in Chittoor have appealed to devotees to restrict their tours in view of coronavirus. Children below 12 years and senior citizens are advised to avoid visit. All paid services are cancelled. 'Laghu darsanam'(brief darsan) is allowed.<\/p>","date":"2020-03-18 10:46:28","pin":"0","status":"1"},{"title":"Rajasthan bans gathering of over 50 people in public places till March 31","content":"<p>The Rajasthan government on Tuesday banned all gatherings at public places exceeding 50 people till March 31 to fight the coronavirus outbreak, said an official statement. (<strong><a href=\"https:\/\/www.newindianexpress.com\/nation\/2020\/mar\/18\/covid-19-impact-rajasthan-bans-gathering-of-over-50-people-in-public-places-till-march-31-2118278.html\" target=\"_blank\">READ MORE<\/a><\/strong>)<\/p>","date":"2020-03-18 11:05:42","pin":"0","status":"1"},{"title":"IIT Bombay shuts down campus, closes all activities till March 31","content":"<p>In view of the novel coronavirus outbreak, IIT Bombay has announced a virtual shutdown of its campus at Powai here till March 31. In the Tuesday night decision, the IIT-B decided to ask students to vacate hostels by March 20 evening. (<strong><a href=\"https:\/\/www.newindianexpress.com\/cities\/mumbai\/2020\/mar\/18\/coronavirus-outbreak-iit-bombay-shuts-down-campus-closes-all-activities-till-march-31-2118280.html\" target=\"_blank\">READ MORE<\/a><\/strong>)<\/p>","date":"2020-03-18 11:06:48","pin":"0","status":"1"},{"title":"States raise COVID concerns with MHA","content":"<p>States bordering Nepal, Bhutan, Bangladesh and Myanmar on Tuesday raised various issues with the Union Home Ministry concerning the coronavirus outbreak, including shortage of screening apparatus and lack of medical professionals to assist them. <strong>(<a href=\"https:\/\/www.newindianexpress.com\/nation\/2020\/mar\/18\/states-raise-covid-concerns-with-mha-2118157.html\" target=\"_blank\">READ MORE<\/a>)<\/strong><\/p>","date":"2020-03-18 11:11:31","pin":"0","status":"1"},{"title":"","content":"<p><img src=\"https:\/\/images.newindianexpress.com\/images\/liveimages\/image\/Coronavirus_Graph.jpg\" width=\"600\" height=\"359\" alt=\"\" \/> <\/p>","date":"2020-03-18 11:13:54","pin":"0","status":"1"},{"title":"Cipla, CSIR, IICT to develop up a drug to fight the coronavirus?","content":"<p>IICT has taken up the task to develop active pharma ingredients (APIs) for the drug. When they are developed, it would be handed-over to Cipla, who would then manufacture the drugs. <strong>(<a href=\"https:\/\/www.newindianexpress.com\/states\/andhra-pradesh\/2020\/mar\/18\/cipla-csir-iict-to-develop-up-a-drug-to-fight-the-coronavirus-2118172.html\" target=\"_blank\">ALSO READ<\/a>)<\/strong><\/p>","date":"2020-03-18 11:15:58","pin":"0","status":"1"},{"title":"Andhra Pradesh government steps up efforts to ward off coronavirus threat","content":"<p>In the wake of COVID-19 threat, the State government has initiated several measures to prevent the spread of the pandemic. Chief Minister YS Jagan Mohan Reddy is monitoring the situation, and based on his directions, the Chief Secretary has been holding meetings with heads of various departments. <strong>(<a href=\"https:\/\/www.newindianexpress.com\/states\/andhra-pradesh\/2020\/mar\/18\/andhra-pradesh-government-steps-up-efforts-to-ward-off-coronavirus-threat-2118139.html\" target=\"_blank\">ALSO READ<\/a>)<\/strong><\/p>","date":"2020-03-18 11:17:00","pin":"0","status":"1"},{"title":"Corona fear sends Andhra Police into tizzy, relief after cop’s son tests negative","content":"<p>Panic gripped the Kurnool district police department as the constable, whose son is a research scholar in Germany, and had been put under observation at the Government General Hospital (GGH) with coronavirus symptoms, visited the district police headquarters. <strong>(<a href=\"https:\/\/www.newindianexpress.com\/states\/andhra-pradesh\/2020\/mar\/18\/corona-fear-sends-police-into-tizzy---relief-after-cops-son-tests-negative-2118163.html\" target=\"_blank\">ALSO READ<\/a>)<\/strong><\/p>","date":"2020-03-18 11:19:23","pin":"0","status":"1"},{"title":"Guntur getting ready to tackle coronavirus","content":"<p>As many as 386 people reportedly came to Guntur from foreign countries on or before February 10, according to officials. Further, grama\/ward volunteers were engaged in locating  more persons who came to their native in the district from abroad. <strong>(<a href=\"https:\/\/www.newindianexpress.com\/states\/andhra-pradesh\/2020\/mar\/18\/guntur-getting-ready-to-tackle-coronavirus-2118156.html\" target=\"_blank\">READ MORE<\/a>)<\/strong><\/p>","date":"2020-03-18 11:20:18","pin":"0","status":"1"},{"title":"Shortage of sensors, Chief Justice Abhay draws state’s attention","content":"<p>On a day that screening facilities were set up at major government offices and courts, Chief Justice Abhay Shreeniwas Oka asked the Advocate-General to draw the attention of the state government to the shortage of thermal sensors, surgical gloves, sanitizers and face masks in the market.<strong> (<a href=\"https:\/\/www.newindianexpress.com\/states\/karnataka\/2020\/mar\/18\/shortage-of-sensors-cj-draws-states-attention-2118219.html\" target=\"_blank\">ALSO READ<\/a>)<\/strong><\/p>","date":"2020-03-18 11:21:58","pin":"0","status":"1"},{"title":"Visas over, flight cancelled. Yet these Polish nationals stay afloat with local support","content":"<p>Parol Zbignle’s first visit to India 35 years ago had an awkward start. The Polish national almost passed out seeing the huge crowd in New Delhi who had assembled to witness the Republic Day parade. A resident of Lublin, which is a part of Eastern Poland, Parol had never witnessed such a big crowd and that shock lingered for sometime till he found refuge on the silent beaches of Kovalam, away from the hurry burry of Thiruvananthapuram. <strong>(<a href=\"https:\/\/www.newindianexpress.com\/states\/kerala\/2020\/mar\/18\/visas-over-flight-cancelled-yet-these-poles-stay-afloat-with-local-support-2118034.html\" target=\"_blank\">ALSO READ<\/a>)<\/strong><\/p>","date":"2020-03-18 11:24:06","pin":"0","status":"1"},{"title":"Kerala to take steps to repatriate stranded foreigners","content":"<p>Stung by the suffering of foreigners in the state in the backdrop of Coronavirus outbreak, Kerala has decided to take immediate steps to repatriate stranded foreign tourists. It is estimated around 5,600 foreign tourists are stuck in the state and they are facing a trust deficit with the local populace. <strong>(<a href=\"https:\/\/www.newindianexpress.com\/states\/kerala\/2020\/mar\/18\/covid-19-kerala-to-take-steps-to-repatriate-stranded-foreigners-2118032.html\" target=\"_blank\">READ MORE<\/a>)<\/strong><\/p>","date":"2020-03-18 11:33:40","pin":"0","status":"1"},{"title":"Colleges shut in states; Keralite students scramble for train tickets","content":"<p>Keralites studying in universities across the country are a worried lot after they have been asked to vacate the campuses in 48 hours as part of Covid-19 vigil by the central government. <strong>(<a href=\"https:\/\/www.newindianexpress.com\/states\/kerala\/2020\/mar\/18\/colleges-shut-in-states-keralite-students-scramble-for-train-tickets-2118040.html\" target=\"_blank\">READ MORE<\/a>)<\/strong><\/p>","date":"2020-03-18 11:34:34","pin":"0","status":"1"},{"title":"Old-age homes take preventive steps to shield vulnerable inmates","content":"<p>75-year-old C Thaygarajan is perhaps more aware of the latest updates on Covid-19 than an average man on the street. An inmate of the government-run Care Home for the elderly at Pulayanarkotta in the capital, the septuagenarian reads newspapers and watches the news on the TV regularly to keep himself abreast of Covid-19.<strong> (<a href=\"https:\/\/www.newindianexpress.com\/states\/kerala\/2020\/mar\/18\/old-age-homes-take-preventive-steps-to-shield-vulnerable-inmates-2118042.html\" target=\"_blank\">READ MORE<\/a>)<\/strong><\/p>","date":"2020-03-18 11:36:05","pin":"0","status":"1"},{"title":"Now, robots to take on deadly virus","content":"<p>In a first in the country, two robots in Kerala will take up the fight against the deadly coronavirus epidemic. If all goes well, the machines can soon be found analysing people’s body temperatures and advising those with high temperature to consult the Health department. The robots from the Saya Bot series, developed by Kochi-based startup firm Asimov Robotics, are currently deployed at the entrance of the integrated startup complex in Kalamassery. <strong>(<a href=\"https:\/\/www.newindianexpress.com\/states\/kerala\/2020\/mar\/18\/now-robots-to-take-on-deadly-virus-2118045.html\" target=\"_blank\">READ MORE<\/a>)<\/strong><\/p>","date":"2020-03-18 11:37:01","pin":"0","status":"1"},{"title":"Disease mapping to stem community transmission","content":"<p>The all-out battle against Covid-19 will be further strengthened as the state health department will make use of the e-service ration card management system for its prevention and control activities. The details that will be made available through the system will be used by the department for preparing disease mapping. <strong>(<a href=\"https:\/\/www.newindianexpress.com\/states\/kerala\/2020\/mar\/18\/disease-mapping-to-stem-community-transmission-2118038.html\" target=\"_blank\">READ MORE<\/a>)<\/strong><\/p>","date":"2020-03-18 11:37:57","pin":"0","status":"1"},{"title":"Experts to give fight new vigour in Kerala","content":"<p>Chief Minister Pinarayi Vijayan has said that an expert committee would be constituted to assist the state government in preventing the spread of Covid-19. The government is in talks with doctors and scientists to join the initiative, Pinarayi told reporters after chairing a high-level meeting here on Tuesday. <strong>(<a href=\"https:\/\/www.newindianexpress.com\/states\/kerala\/2020\/mar\/18\/covid--19-experts-to-give-fight-new-vigour-in-kerala-2118037.html\" target=\"_blank\">READ MORE<\/a>)<\/strong><\/p>","date":"2020-03-18 11:38:57","pin":"0","status":"1"},{"title":"Aahar centre time extended to prevent congestion, minimise contact as COVID-19 cases continue to rise","content":"<p>As per the order issued by the Housing and Urban Development department, the Rs 5 meal at these centres will be served from 10 am to 4 pm. People have been asked to maintain 1.5 metre distance from one another while standing in the queue. <strong>(<a href=\"https:\/\/www.newindianexpress.com\/states\/odisha\/2020\/mar\/18\/aahar-centre-time-extended-to-prevent-congestion-minimise-contact-as-covid-19-cases-continue-to-rise-2118062.html\" target=\"_blank\">READ MORE<\/a>)<\/strong><\/p>","date":"2020-03-18 11:40:55","pin":"0","status":"1"},{"title":"More than one lakh tickets under East Coast Railway cancelled in six days","content":"<p>Praveen Kumar Singh and his family had planned a vacation to Mumbai after the examinations. A resident of the city, Singh has cancelled the group ticket after virus scare. Hundreds like Singh, who had planned their trips to Maharashtra cities like Pune, Mumbai and Nashik, and South India States where COVID-19 positive cases are on the rise,  have started cancelling their tickets leading to a major drop in the number of passengers in long-distance trains.<strong> (<a href=\"https:\/\/www.newindianexpress.com\/states\/odisha\/2020\/mar\/18\/covid-19-impact-more-than-one-lakh-tickets-under-east-coast-railway-cancelled-in-six-days--2118063.html\" target=\"_blank\">READ MORE<\/a>)<\/strong><\/p>","date":"2020-03-18 11:41:53","pin":"0","status":"1"},{"title":"Odisha Police stops breath analyser test in wake of COVID-19 outbreak","content":"<p>In what may come as music to those driving under intoxication, Odisha Police has decided to suspend breath analyser test temporarily to check coronavirus outbreak in Odisha. <strong>(<a href=\"https:\/\/www.newindianexpress.com\/states\/odisha\/2020\/mar\/18\/odisha-police-stops-breath-analyser-test-in-wake-of-covid-19-outbreak-2118055.html\" target=\"_blank\">READ MORE<\/a>)<\/strong><\/p>","date":"2020-03-18 11:42:50","pin":"0","status":"1"},{"title":"Odisha districts set up 24-hour control rooms in wake of coronavirus outbreak","content":"<p>The control room will remain operational till March 31. People suffering from fever, cough and difficulty in breathing can call the toll free number for any information on the virus. A vehicle has been provided to the control room to bring suspected cases to the hospital. Isolation wards have already been opened in the DHH. <strong>(<a href=\"https:\/\/www.newindianexpress.com\/states\/odisha\/2020\/mar\/18\/odisha-districts-set-up-24-hour-control-rooms-in-wake-of-coronavirus-outbreak-2118069.html\" target=\"_blank\">READ MORE<\/a>)<\/strong><\/p>","date":"2020-03-18 11:43:46","pin":"0","status":"1"},{"title":"Mad rush for blood tests in Koraput MCH, DHH","content":"<p>Coronavirus fear has fuelled a mad rush for blood tests in Koraput district. People suffering from common cold are rushing to district headquarters hospital and Saheed Laxman Nayak Medical College and Hospital and demanding blood tests. <strong>(<a href=\"https:\/\/www.newindianexpress.com\/states\/odisha\/2020\/mar\/18\/covid-19-impact-mad-rush-for-blood-tests-in-koraput-mch-dhh-2118079.html\" target=\"_blank\">READ MORE<\/a>)<\/strong><\/p>","date":"2020-03-18 11:44:50","pin":"0","status":"1"},{"title":"Telangana records fifth coronavirus case, Centre claims six","content":"<p>While the Telangana state government states that it has recorded the fifth positive case of Coronavirus, the Union Ministry has claimed that there are six positive cases in Telangana, including two foreign nationals. <strong>(<a href=\"https:\/\/www.newindianexpress.com\/states\/telangana\/2020\/mar\/18\/ts-records-5th-virus-case-centre-says-6-2118081.html\" target=\"_blank\">READ MORE<\/a>)<\/strong><\/p>","date":"2020-03-18 12:00:26","pin":"0","status":"1"},{"title":"In home quarantine for coronavirus? You are being watched","content":"<p>The civic body will monitor the movements of the 1,000 people under home quarantine who had arrived in the city from China, Iran, Italy, Korea, France, Germany, Spain and other countries. This comes in the wake of reports of people escaping quarantine in Kerala, Maharashtra, Karnataka, and other states. <strong>(<a href=\"https:\/\/www.newindianexpress.com\/states\/telangana\/2020\/mar\/18\/in-home-quarantine-for-coronavirus-you-are-being-watched-2118103.html\" target=\"_blank\">READ MORE<\/a>)<\/strong><\/p>","date":"2020-03-18 12:02:02","pin":"0","status":"1"},{"title":"Coronavirus outbreak aside, liquor sales increase in Telangana","content":"<p>Even as vegetable and poultry sales are plummeting due to the COVID-19 scare, liquor sale, despite the price hike, has remained constant in Telangana during the last 16 days. There has, in fact, been a marginal increase in liquor sales. <strong>(<a href=\"https:\/\/www.newindianexpress.com\/states\/telangana\/2020\/mar\/18\/coronavirus-outbreak-aside-liquor-sales-increase-in-telangana-2118101.html\" target=\"_blank\">READ MORE<\/a>)<\/strong><\/p>","date":"2020-03-18 12:02:56","pin":"0","status":"1"},{"title":"Amid coronavirus outbreak, Telangana policemen reveal they have no masks, sanitisers","content":"<p>The Telangana police department is at the forefront of spreading awareness on COVID-19 through social media campaigns, sending out advisories on precautions and effects of spreading fake news. However, when it comes to protecting their own field staff, who are constantly interacting with the public, the police department has been lackadaisical. <strong>(<a href=\"https:\/\/www.newindianexpress.com\/states\/telangana\/2020\/mar\/18\/amid-coronavirus-outbreak-telangana-policemen-reveal-they-have-no-masks-sanitisers-2118100.html\" target=\"_blank\">READ MORE<\/a>)<\/strong><\/p>","date":"2020-03-18 12:03:49","pin":"0","status":"1"},{"title":"In-house 'solution' to fight the alien","content":"<p>Tackling the scarcity of hand sanitisers, the Government Rajaji Hospital prepares an in-house hand sanitiser, taking help of the College of Pharmacy located at Madurai Medical College. <strong>(<a href=\"https:\/\/www.newindianexpress.com\/states\/tamil-nadu\/2020\/mar\/18\/in-house-solution-to-fight-the-alien-2118269.html\" target=\"_blank\">READ MORE<\/a>)<\/strong><\/p>","date":"2020-03-18 12:05:08","pin":"0","status":"1"},{"title":"Three arrested in Tamil Nadu for fake news on virus","content":"<p>Police on Tuesday arrested three men from Gudiyattam for spreading fake news about the novel coronavirus through WhatsApp. The Gudiyattam town police arrested M Vijayan (19) of Nellorepet, M Sugumar (19) of Gandhi nagar, T Sivakumar (22) of Sethukarai, following a complaint lodged by a doctor from the Government Hospital in Gudiyattam.<strong> (<a href=\"https:\/\/www.newindianexpress.com\/states\/tamil-nadu\/2020\/mar\/18\/3-arrested-for-fake-news-on-virus-2118268.html\" target=\"_blank\">READ MORE<\/a>)<\/strong><\/p>","date":"2020-03-18 12:06:37","pin":"0","status":"1"},{"title":"Amitabh Bachchan gets 'Home Quarantined' stamp on hand, spreads awareness on COVID-19","content":"<p>Amid rising concern over coronavirus situation, Amitabh Bachchan took to Twitter to share a picture of his hand with a 'Home Quarantined' stamp on it. Late Tuesday night, the actor tweeted a picture of his hand with a 'Home Quarantined' stamp on it. <strong>(<a href=\"https:\/\/www.newindianexpress.com\/entertainment\/hindi\/2020\/mar\/18\/amitabh-bachchan-gets-home-quarantined-stamp-on-hand-spreads-awareness-on-covid-19-2118283.html\" target=\"_blank\">READ MORE<\/a>)<\/strong><\/p>","date":"2020-03-18 12:10:03","pin":"0","status":"1"},{"title":"Uttar Pradesh man booked for black marketing, selling sub-standard masks","content":"<p>The FIR was registered against Vivek Kumar on Tuesday after a district administration team found him selling sub-standard masks and also black marketing them, in Babrala locality of Gunnaur area, Superintendent of Police Yamuna Prasad said. <strong>(<a href=\"https:\/\/www.newindianexpress.com\/nation\/2020\/mar\/18\/coronavirus-scare-uttar-pradesh-man-booked-for-black-marketing-selling-sub-standard-masks-2118285.html\" target=\"_blank\">READ MORE<\/a>)<\/strong><\/p>","date":"2020-03-18 12:11:27","pin":"0","status":"1"},{"title":"Karnataka CM BS Yediyurappa calls for emergency cabinet meet as cases in state rise to 11","content":"<p>Karnataka Chief Minister BS Yediyurappa on Wednesday called an emergency cabinet meeting to discuss the coronavirus outbreak and indicated the lockdown in the state will continue. <strong>(<a href=\"https:\/\/www.newindianexpress.com\/states\/karnataka\/2020\/mar\/18\/covid-19-karnataka-cm-bs-yediyurappa-calls-for-emergency-cabinet-meet-as-cases-in-state-rise-to-11-2118290.html\" target=\"_blank\">READ MORE<\/a>)<\/strong><\/p>","date":"2020-03-18 12:13:01","pin":"0","status":"1"},{"title":"Next one month the party won't participate in any agitation, demonstration: BJP president JP Nadda","content":"<p>PM Narendra Modi, yesterday in the Parliamentary party meeting, had desired that because of corona we should avoid any type of agitation, dharna, demonstration. Keeping that in view, BJP has decided that for next one month party won't participate in any agitation, demonstration. If it has to give any memorandum, 4-5 party office bearers will give the memorandum to the concerned officers or the political leader but avoid any type of conglomeration of people. All state units have been told about it, and a circular has been issued on this issue: BJP president JP Nadda<\/p>","date":"2020-03-18 12:15:56","pin":"0","status":"1"},{"title":"","content":"<blockquote class=\"twitter-tweet\">\n<p lang=\"en\" dir=\"ltr\">Punjab: Sanitization measures being taken at Ludhiana Railway Station as precautionary step to contain the spread of COVID-19. <a href=\"https:\/\/t.co\/tFMS6DOswE\">pic.twitter.com\/tFMS6DOswE<\/a><\/p>\n— ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1240138051705344000?ref_src=twsrc%5Etfw\">March 18, 2020<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2020-03-18 12:16:12","pin":"0","status":"1"},{"title":"Bank staff wear masks as a precautionary measure against coronavirus in Bengaluru","content":"<p><iframe src=\"https:\/\/www.facebook.com\/plugins\/post.php?href=https%3A%2F%2Fwww.facebook.com%2Fthenewindianxpress%2Fposts%2F10157436813849794&width=500\" width=\"500\" height=\"689\" style=\"border:none;overflow:hidden\" scrolling=\"no\" frameborder=\"0\" allow=\"encrypted-media\"><\/iframe><\/p>","date":"2020-03-18 12:21:43","pin":"0","status":"1"},{"title":"WATCH | BJP has issued a circular among its state units, says JP Nadda","content":"<blockquote class=\"twitter-tweet\">\n<p lang=\"en\" dir=\"ltr\"><a href=\"https:\/\/twitter.com\/hashtag\/WATCH?src=hash&ref_src=twsrc%5Etfw\">#WATCH<\/a> BJP Pres: BJP has issued a circular among its state units, over <a href=\"https:\/\/twitter.com\/hashtag\/Coronavirus?src=hash&ref_src=twsrc%5Etfw\">#Coronavirus<\/a>, to spread awareness in small groups&tell people of the dos & donts. When PM held discussions with SAARC leaders,he had mentioned that we should be alert, maintain hygiene but steer clear of panic <a href=\"https:\/\/t.co\/wGMQXpYTce\">pic.twitter.com\/wGMQXpYTce<\/a><\/p>\n— ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1240151152714551300?ref_src=twsrc%5Etfw\">March 18, 2020<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2020-03-18 12:26:36","pin":"0","status":"1"},{"title":"Junior doctor in Lucknow has tested positive for coronavirus","content":"<p>A junior doctor in Lucknow has tested positive for coronavirus. The doctor was treating coronavirus patients. The doctor is stable and there is nothing to worry about: Incharge of the KGMU isolation ward Dr Sudhir Singh<\/p>","date":"2020-03-18 12:28:05","pin":"0","status":"1"},{"title":"","content":"<p>Delhi High Court says that it will consider the petition seeking court's direction to issue a direction for practice, stipulating that video conferencing be allowed for advocates and also allow courts to function in the wake of coronavirus outbreak.<\/p>","date":"2020-03-18 12:28:52","pin":"0","status":"1"},{"title":"Indian Army has quarantined all the soldiers: Sources","content":"<p>Indian Army has quarantined all the soldiers and colleagues of the Ladakh Scouts jawan who has tested positive for #COVID-19 in Ladakh. The jawan was attached to the Ladakh Scouts Regimental Centre in Leh: Army sources<\/p>","date":"2020-03-18 12:29:39","pin":"0","status":"1"},{"title":"A senior advocate should only come with one advocate: Justice MR Shah","content":"Justice MR Shah of Supreme Court to senior advocate Aryman Sundaram, 'You all come with 5-6 advocates. This is a request to the Bar also, a senior advocate should only come with one advocate. This is ultimately for our sake.'","date":"2020-03-18 12:30:28","pin":"0","status":"1"},{"title":"","content":"<blockquote class=\"twitter-tweet\">\n<p lang=\"en\" dir=\"ltr\">Senior Congress leader <a href=\"https:\/\/twitter.com\/hashtag\/PChidambaram?src=hash&ref_src=twsrc%5Etfw\">#PChidambaram<\/a> wears a face mask as a preventive measure against the <a href=\"https:\/\/twitter.com\/hashtag\/COVID19?src=hash&ref_src=twsrc%5Etfw\">#COVID19<\/a> at Parliament.<a href=\"https:\/\/twitter.com\/hashtag\/Coronavirus?src=hash&ref_src=twsrc%5Etfw\">#Coronavirus<\/a><br \/>\nExpress photos by <a href=\"https:\/\/twitter.com\/Shekharyadav02?ref_src=twsrc%5Etfw\">@Shekharyadav02<\/a>. <a href=\"https:\/\/t.co\/eRxep1QPl6\">pic.twitter.com\/eRxep1QPl6<\/a><\/p>\n— The New Indian Express (@NewIndianXpress) <a href=\"https:\/\/twitter.com\/NewIndianXpress\/status\/1240170711089479680?ref_src=twsrc%5Etfw\">March 18, 2020<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2020-03-18 12:31:33","pin":"0","status":"1"},{"title":"","content":"<blockquote class=\"twitter-tweet\">\n<p lang=\"en\" dir=\"ltr\">Ministry of Chemicals & Fertilisers: All manufacturers\/importers are directed to furnish info for surgical & protective masks, gloves and sanitisers in the attached Form I, Form II & Form III to National Pharmaceutical Pricing Authority at an early date, not later then 17th March <a href=\"https:\/\/t.co\/uAuFOyEV6a\">pic.twitter.com\/uAuFOyEV6a<\/a><\/p>\n— ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1240154629461155840?ref_src=twsrc%5Etfw\">March 18, 2020<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2020-03-18 12:32:22","pin":"0","status":"1"},{"title":"","content":"<blockquote class=\"twitter-tweet\" data-conversation=\"none\">\n<p lang=\"en\" dir=\"ltr\"><a href=\"https:\/\/twitter.com\/hashtag\/TNIE?src=hash&ref_src=twsrc%5Etfw\">#TNIE<\/a> copy given along with breakfast for people in the isolation ward at Government Medical College Kalamassery <a href=\"https:\/\/twitter.com\/hashtag\/covidindia?src=hash&ref_src=twsrc%5Etfw\">#covidindia<\/a> <a href=\"https:\/\/twitter.com\/hashtag\/Kerala?src=hash&ref_src=twsrc%5Etfw\">#Kerala<\/a> <a href=\"https:\/\/twitter.com\/hashtag\/COVID2019?src=hash&ref_src=twsrc%5Etfw\">#COVID2019<\/a> <a href=\"https:\/\/twitter.com\/xpresskerala?ref_src=twsrc%5Etfw\">@xpresskerala<\/a> <a href=\"https:\/\/t.co\/YV4qz1SBqv\">pic.twitter.com\/YV4qz1SBqv<\/a><\/p>\n— The New Indian Express (@NewIndianXpress) <a href=\"https:\/\/twitter.com\/NewIndianXpress\/status\/1240148457534480385?ref_src=twsrc%5Etfw\">March 18, 2020<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2020-03-18 12:33:44","pin":"0","status":"1"},{"title":"Coronavirus can survive on some surfaces for days or in air for several hours","content":"<p>The novel coronavirus can survive on some surfaces for days or in the air for several hours, according to a US-government funded study published Tuesday. Scientists found that the virus that causes the COVID-19 disease had similar levels of viability outside the body to its predecessor that caused SARS. <strong>(<a href=\"https:\/\/www.newindianexpress.com\/nation\/2020\/mar\/18\/coronavirus-can-survive-on-some-surfaces-for-days-or-in-air-for-several-hours-2118286.html\" target=\"_blank\">ALSO READ<\/a>)<\/strong><\/p>","date":"2020-03-18 13:01:00","pin":"0","status":"1"},{"title":"No positive case in Goa,  health minister retracts earlier statement","content":"<p>Goa Health Minister Vishwajit Rane on Wednesday said a Norway national in the state has tested positive for novel coronavirus but shortly afterwards retracted the remarks. Rane said the earlier information was based on a 'hoax call' to the concerned nodal officer. <strong>(<a href=\"https:\/\/www.newindianexpress.com\/nation\/2020\/mar\/18\/covid-19-no-positive-case-in-goa--health-minister-retracts-earlier-statement-2118298.html\" target=\"_blank\">READ MORE<\/a>)<\/strong><\/p>","date":"2020-03-18 13:03:14","pin":"0","status":"1"},{"title":"","content":"<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\">A security official checks the temperature of Vice president <a href=\"https:\/\/twitter.com\/MVenkaiahNaidu?ref_src=twsrc%5Etfw\">@MVenkaiahNaidu<\/a> as a precaution against the <a href=\"https:\/\/twitter.com\/hashtag\/coronavirus?src=hash&ref_src=twsrc%5Etfw\">#coronavirus<\/a> at the <a href=\"https:\/\/twitter.com\/hashtag\/ParliamentHouse?src=hash&ref_src=twsrc%5Etfw\">#ParliamentHouse<\/a> in New Delhi on Wednesday. <a href=\"https:\/\/twitter.com\/NewIndianXpress?ref_src=twsrc%5Etfw\">@NewIndianXpress<\/a> <a href=\"https:\/\/twitter.com\/hashtag\/coronavirusindia?src=hash&ref_src=twsrc%5Etfw\">#coronavirusindia<\/a> <a href=\"https:\/\/twitter.com\/hashtag\/budgetsession2020?src=hash&ref_src=twsrc%5Etfw\">#budgetsession2020<\/a> <a href=\"https:\/\/t.co\/hXBuYvrvcE\">pic.twitter.com\/hXBuYvrvcE<\/a><\/p>\n— Shekhar Yadav (@Shekharyadav02) <a href=\"https:\/\/twitter.com\/Shekharyadav02\/status\/1240143273076940803?ref_src=twsrc%5Etfw\">March 18, 2020<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2020-03-18 13:04:25","pin":"0","status":"1"},{"title":"Two more coronavirus cases in Ladakh, tally rises to eight","content":"<p>Two more people on Wednesday were tested positive for coronavirus in Ladakh, taking the cases of the deadly virus in the Union Territory to eight. Both the COVID-19 positive patients are the relatives of people who were previously tested positive for the disease. <strong>(<a href=\"https:\/\/www.newindianexpress.com\/nation\/2020\/mar\/18\/two-more-coronavirus-cases-in-ladakh-tally-rises-to-eight-2118300.html\" target=\"_blank\">READ MORE<\/a>)<\/strong><\/p>","date":"2020-03-18 13:07:28","pin":"0","status":"1"},{"title":"All health department employees in Kerala instructed to join back immediately","content":"<p>Health Minister KK Shailaja has instructed all health department employees including doctors on leave to join back immediately in the wake of COVID-19 scare. \"In view of the special situation in the state, all those who do not have a clear reason should immediately return to work. The state as a whole is waging a vigorous defense against COVID 19. All health workers should work together at this time,\" she said.The primary health centers (PHCs) have also been instructed to operate until 6 pm. More doctors will be hired on a temporary basis.<\/p>","date":"2020-03-18 13:32:38","pin":"0","status":"1"},{"title":"","content":"<blockquote class=\"twitter-tweet\">\n<p lang=\"en\" dir=\"ltr\">⚡️The total number of <a href=\"https:\/\/twitter.com\/hashtag\/Coronavirus?src=hash&ref_src=twsrc%5Etfw\">#Coronavirus<\/a> cases rises over 140 as more people test positive in Maharashtra, Ladakh and Goa. Here's all you need to know! <a href=\"https:\/\/twitter.com\/hashtag\/covidindia?src=hash&ref_src=twsrc%5Etfw\">#covidindia<\/a> <a href=\"https:\/\/twitter.com\/hashtag\/coronavirusindia?src=hash&ref_src=twsrc%5Etfw\">#coronavirusindia<\/a> <a href=\"https:\/\/twitter.com\/hashtag\/COVID19?src=hash&ref_src=twsrc%5Etfw\">#COVID19<\/a> <br \/>\nRead LIVE updates here: <a href=\"https:\/\/t.co\/fnXvOgu2cT\">https:\/\/t.co\/fnXvOgu2cT<\/a> <a href=\"https:\/\/t.co\/OR0LrDcgmf\">https:\/\/t.co\/OR0LrDcgmf<\/a><\/p>\n— The New Indian Express (@NewIndianXpress) <a href=\"https:\/\/twitter.com\/NewIndianXpress\/status\/1240188730717044736?ref_src=twsrc%5Etfw\">March 18, 2020<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2020-03-18 13:42:24","pin":"0","status":"0"},{"title":"","content":"<p>Indian Army has postponed all Services Selection Board batches commencing from 20th March onwards till further orders in view of COVID-19 outbreak.<\/p>","date":"2020-03-18 14:26:21","pin":"0","status":"1"},{"title":"Shri Mata Vaishno Devi Yatra closed from today","content":"<p>Shri Mata Vaishno Devi Yatra has been closed from today. Operations of all inter state buses, both incoming and outgoing from J&K, are banned from today: Department of Information and Public Relations, Government of Jammu & Kashmir<\/p>","date":"2020-03-18 14:27:40","pin":"0","status":"1"},{"title":"A person, with a travel history to Indonesia, has tested positive for coronavirus","content":"<p>A person, with a travel history to Indonesia, has tested positive for coronavirus. This is the fourth positive case of Coronavirus in Gautam Buddh Nagar: Chief Medical Officer, Gautam Buddh Nagar<\/p>","date":"2020-03-18 14:28:28","pin":"0","status":"1"},{"title":"","content":"<p>Two more COVID-19 cases have been registered in Bengaluru today, taking the total infected cases to 13. 56-year-old male, resident of Bengaluru returned from USA on 6th March. Another, 25-year-old female, who has returned from Spain.<\/p>","date":"2020-03-18 14:29:28","pin":"0","status":"1"},{"title":"","content":"<blockquote class=\"twitter-tweet\">\n<p lang=\"en\" dir=\"ltr\">Gujarat: Sanitization of Gujarat State Road Transport Corporation buses is being undertaken as a precautionary measure to contain the spread of <a href=\"https:\/\/twitter.com\/hashtag\/Coronavirus?src=hash&ref_src=twsrc%5Etfw\">#Coronavirus<\/a>. <a href=\"https:\/\/t.co\/YJQfjcwtsF\">pic.twitter.com\/YJQfjcwtsF<\/a><\/p>\n— ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1240195185209794561?ref_src=twsrc%5Etfw\">March 18, 2020<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2020-03-18 14:30:00","pin":"0","status":"1"},{"title":"","content":"<blockquote class=\"twitter-tweet\">\n<p lang=\"en\" dir=\"ltr\">Gujarat: Sanitization of Gujarat State Road Transport Corporation buses is being undertaken as a precautionary measure to contain the spread of <a href=\"https:\/\/twitter.com\/hashtag\/Coronavirus?src=hash&ref_src=twsrc%5Etfw\">#Coronavirus<\/a>. <a href=\"https:\/\/t.co\/YJQfjcwtsF\">pic.twitter.com\/YJQfjcwtsF<\/a><\/p>\n— ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1240195185209794561?ref_src=twsrc%5Etfw\">March 18, 2020<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2020-03-18 14:30:02","pin":"0","status":"1"},{"title":"Bengaluru ISKCON temples closed","content":"ISKCON Temples (International Society for Krishna Consciousness) at Rajajinagar and Kanakpura Road in Bengaluru are closed for public from today, till further notice.","date":"2020-03-18 14:31:01","pin":"0","status":"1"},{"title":"255 Indians in Iran infected with coronavirus, confirms MEA in Lok Sabha","content":"<blockquote class=\"twitter-tweet\">\n<p lang=\"en\" dir=\"ltr\">Ministry of External Affairs in a written reply to a question in Lok Sabha: 276 Indians are infected with <a href=\"https:\/\/twitter.com\/hashtag\/coronavirus?src=hash&ref_src=twsrc%5Etfw\">#coronavirus<\/a> abroad including 255 in Iran, 12 in UAE, 5 in Italy, and 1 each in Hong Kong, Kuwait, Rwanda, and Sri Lanka. <a href=\"https:\/\/t.co\/Hk1GjJoXyT\">pic.twitter.com\/Hk1GjJoXyT<\/a><\/p>\n— ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1240205652355502080?ref_src=twsrc%5Etfw\">March 18, 2020<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2020-03-18 15:02:41","pin":"0","status":"1"},{"title":" When hand hygiene practice in rural Chhattisgarh caught WHO attention","content":"<p>Amid the coronavirus pandemic, a campaign by Mitanin (rural health workers) in the rural areas across Ambikapur district in north Chhattisgarh, where women were educated on washing hands has gained global praise. <\/p>\n<p>The World Health Organisation (WHO) director-general Tedros Adhanom Ghebreyesus, much impressed with the steps taken on ‘SafeHands’ by the village community promoting hygiene practice in rural Ambikapur, had tweeted about it.<\/p>\n<p><strong><a href=\"https:\/\/www.newindianexpress.com\/good-news\/2020\/mar\/18\/coronavirus-when-hand-hygiene-practice-in-rural-chhattisgarh-caught-who-attention-2118321.html\" target=\"_blank\">READ FULL REPORT HERE<\/a> <\/strong><\/p>","date":"2020-03-18 15:12:59","pin":"0","status":"1"},{"title":"Lack of access to clean water for India’s poor spawns virus concerns","content":"<p>For India’s homeless and urban poor who live in thousands of slums across major cities and towns, maintaining good hygiene can be nearly impossible.<\/p>\n<p><a href=\"https:\/\/www.newindianexpress.com\/world\/2020\/mar\/18\/forget-sanitizer-what-about-clean-water-lack-of-access-for-indias-poor-spawns-virus-concerns-2118332.html\" target=\"_blank\"><strong>READ FULL REPORT HERE<\/strong><\/a><\/p>","date":"2020-03-18 15:17:14","pin":"0","status":"1"},{"title":"","content":"<blockquote class=\"twitter-tweet\">\n<p lang=\"en\" dir=\"ltr\"><a href=\"https:\/\/twitter.com\/hashtag\/Chennai?src=hash&ref_src=twsrc%5Etfw\">#Chennai<\/a> Corporation strongly reiterates that only big places like malls, theatres would be closed and not small scale shops selling fruits, vegetable, meat and fish. No common man’s life will be affected, civic body has said. <a href=\"https:\/\/twitter.com\/xpresstn?ref_src=twsrc%5Etfw\">@xpresstn<\/a> <a href=\"https:\/\/twitter.com\/NewIndianXpress?ref_src=twsrc%5Etfw\">@NewIndianXpress<\/a> <a href=\"https:\/\/twitter.com\/hashtag\/covidindia?src=hash&ref_src=twsrc%5Etfw\">#covidindia<\/a> <a href=\"https:\/\/twitter.com\/hashtag\/COVID19?src=hash&ref_src=twsrc%5Etfw\">#COVID19<\/a><\/p>\n— Omjasvin M D (@omjasvinMD) <a href=\"https:\/\/twitter.com\/omjasvinMD\/status\/1240174479575220225?ref_src=twsrc%5Etfw\">March 18, 2020<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2020-03-18 15:20:04","pin":"0","status":"1"},{"title":"Plea in Bihar court against Harsh Vardhan for failing to prevent 'black marketing' of masks, sanitizers","content":"<p> A petition was filed on Wednesday before a court here accusing Union Health Minister Harsh Vardhan of failing to put a check on \"black marketing\" of face masks and hand sanitizers, the demand for which has spiked in the wake of the coronavirus outbreak. Social activist Tamanna Hashmi filed the petition before the court of Chief Judicial Magistrate Mukesh Kumar where it has been posted for hearing on March 30.<\/p>\n<p><a href=\"https:\/\/www.newindianexpress.com\/nation\/2020\/mar\/18\/plea-in-bihar-court-against-harsh-vardhan-for-failing-to-prevent-black-marketing-of-masks-sanitiz-2118335.html\" target=\"_blank\"><strong>READ FULL REPORT HERE<\/strong><\/a><\/p>","date":"2020-03-18 15:25:05","pin":"0","status":"1"},{"title":" South African cricketers told to self-isolate on return from aborted India tour","content":"<p>The South African cricket team has been asked to self-quarantine for the next 14 days after returning midway from an ODI tour of India due to the COVID-19 pandemic. Cricket South Africa's chief medical officer, Dr Shuaib Manjra, was quoted as saying that the players have been told to isolate themselves and will be tested for the deadly virus in case any symptoms show up.<\/p>\n<p><strong><a href=\"https:\/\/www.newindianexpress.com\/sport\/cricket\/2020\/mar\/18\/south-african-cricketers-told-to-self-isolate-on-return-from-aborted-india-tour-2118331.html\" target=\"_blank\">READ FULL REPORT HERE<\/a> <\/strong><\/p>","date":"2020-03-18 15:27:22","pin":"0","status":"1"},{"title":"Vaishno Devi yatra closed in J&K","content":"<blockquote class=\"twitter-tweet\">\n<p lang=\"en\" dir=\"ltr\"><a href=\"https:\/\/twitter.com\/hashtag\/COVID19?src=hash&ref_src=twsrc%5Etfw\">#COVID19<\/a> <a href=\"https:\/\/twitter.com\/hashtag\/JammuAndKashmir?src=hash&ref_src=twsrc%5Etfw\">#JammuAndKashmir<\/a> <br \/>\nShri Mata Vaishno Devi Yatra has been closed from today.<br \/>\nOperations of All Inter State Buses - Incoming and Outgoing from J&K, banned from today.<a href=\"https:\/\/twitter.com\/ANI?ref_src=twsrc%5Etfw\">@ANI<\/a> <a href=\"https:\/\/twitter.com\/PIB_India?ref_src=twsrc%5Etfw\">@PIB_India<\/a> <a href=\"https:\/\/twitter.com\/DDNewslive?ref_src=twsrc%5Etfw\">@DDNewslive<\/a> <a href=\"https:\/\/twitter.com\/airnewsalerts?ref_src=twsrc%5Etfw\">@airnewsalerts<\/a> <a href=\"https:\/\/twitter.com\/kansalrohit69?ref_src=twsrc%5Etfw\">@kansalrohit69<\/a><\/p>\n— DIPR-J&K (@diprjk) <a href=\"https:\/\/twitter.com\/diprjk\/status\/1240186384297521153?ref_src=twsrc%5Etfw\">March 18, 2020<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2020-03-18 15:28:25","pin":"0","status":"1"},{"title":"CBSE issues guidelines for ongoing board examinations","content":"<p>CBSE issues guidelines for the rest of the board examinations, says each center superintendent should ensure that candidates are seated at a distance of one meter from each other and masks are provided to candidates who cough\/sneeze.  <\/p>","date":"2020-03-18 15:44:04","pin":"0","status":"1"},{"title":"Telangana reports fresh case, total number of cases in state rise to 6","content":"<blockquote class=\"twitter-tweet\">\n<p lang=\"en\" dir=\"ltr\"><a href=\"https:\/\/twitter.com\/hashtag\/Telangana?src=hash&ref_src=twsrc%5Etfw\">#Telangana<\/a> has recorded it's sixth positive case of <a href=\"https:\/\/twitter.com\/hashtag\/Coronavirus?src=hash&ref_src=twsrc%5Etfw\">#Coronavirus<\/a> in the state. Person has travel history from UK. <a href=\"https:\/\/twitter.com\/hashtag\/coronavirusindia?src=hash&ref_src=twsrc%5Etfw\">#coronavirusindia<\/a> <a href=\"https:\/\/twitter.com\/hashtag\/covidindia?src=hash&ref_src=twsrc%5Etfw\">#covidindia<\/a> <a href=\"https:\/\/twitter.com\/hashtag\/Hyderabad?src=hash&ref_src=twsrc%5Etfw\">#Hyderabad<\/a><\/p>\n— Oishani Mojumder (@Oishani_TNIE) <a href=\"https:\/\/twitter.com\/Oishani_TNIE\/status\/1240218761447292928?ref_src=twsrc%5Etfw\">March 18, 2020<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2020-03-18 16:03:53","pin":"0","status":"1"},{"title":"Hundreds in Bihar perform herbal havan to 'ward off' coronavirus","content":"<p>Dozens of women assembled on Wednesday morning in Patna's Kankar bagh with the Hindu priests and started putting organic disinfectants in the alter of fire called \"Havan\". This was initiated by the women associated with the Middle Income Welfare Association in Kankarbagh.<\/p>\n<p><strong><a href=\"https:\/\/www.newindianexpress.com\/nation\/2020\/mar\/18\/hundreds-in-bihar-perform-herbal-havan-to-ward-off-coronavirus-2118339.html\" target=\"_blank\">READ FULL REPORT HERE<\/a><\/strong> <\/p>","date":"2020-03-18 16:06:29","pin":"0","status":"1"},{"title":"Medical student, octogenarian with travel history quarantined in Vellore","content":"<p>Two persons, including a medical student, with symptoms of cold, fever and sore throat in Vellore city, have been admitted at the isolation ward in Government Vellore Medical College Hospital (GVMCH), sources said.<\/p>\n<p>The medical student, pursuing the third year at the Govt Vellore Medical College, has been staying at the college hostel, the sources stated, adding that she was admitted at the isolation ward in the GVMCH on Wednesday following cold, fever and sore throat.<\/p>\n<p><strong><a href=\"https:\/\/www.newindianexpress.com\/states\/tamil-nadu\/2020\/mar\/18\/covid-19-pandemic-medical-student-octogenarian-with-travel-history-quarantined-in-vellore-2118336.html\" target=\"_blank\">READ FULL REPORT HERE<\/a> <\/strong><\/p>","date":"2020-03-18 16:07:47","pin":"0","status":"1"},{"title":"Roche Diagnostics India first private firm to get COVID-19 test approval","content":"<p>Swiss firm Roche Diagnostics India received the license for conducting coronavirus tests after approval from drug regulator DCGI, making it the first private firm to get such permission after the government decided to allow accredited private labs to test for COVID-19. <\/p>\n<p><a href=\"https:\/\/www.newindianexpress.com\/nation\/2020\/mar\/18\/roche-diagnostics-india-first-private-firm-to-get-covid-19-test-approval-2118350.html\" target=\"_blank\"><strong>READ FULL REPORT HERE<\/strong><\/a><\/p>","date":"2020-03-18 16:09:47","pin":"0","status":"1"},{"title":"NCPCR seeks report on Shaheen Bagh protest","content":"<p>The National Commission for Protection of Child Rights on Wednesday wrote to the District Magistrate of South East Delhi to submit a report regarding the assembly of people in Shaheen Bagh protest site amidst the coronavirus outbreak.<\/p>\n<p><a href=\"https:\/\/www.newindianexpress.com\/cities\/delhi\/2020\/mar\/18\/dissent-in-times-of-covid-19-ncpcr-seeks-report-on-shaheen-bagh-protest-2118351.html\" target=\"_blank\"><strong>READ FULL REPORT HERE<\/strong><\/a><\/p>","date":"2020-03-18 16:16:03","pin":"0","status":"1"},{"title":"Odisha CM register sister's details in govt portal for persons coming from abroad","content":"<blockquote class=\"twitter-tweet\">\n<p lang=\"en\" dir=\"ltr\">I have registered my sister’s details in the Government portal for persons coming from abroad. I appeal all of you to also register details about your family members and friends coming from abroad. This will help protect <a href=\"https:\/\/twitter.com\/hashtag\/Odisha?src=hash&ref_src=twsrc%5Etfw\">#Odisha<\/a> from <a href=\"https:\/\/twitter.com\/hashtag\/CoronaVirus?src=hash&ref_src=twsrc%5Etfw\">#CoronaVirus<\/a><a href=\"https:\/\/twitter.com\/hashtag\/Register4Covid19SafeOdisha?src=hash&ref_src=twsrc%5Etfw\">#Register4Covid19SafeOdisha<\/a><\/p>\n— Naveen Patnaik (@Naveen_Odisha) <a href=\"https:\/\/twitter.com\/Naveen_Odisha\/status\/1240201719285452801?ref_src=twsrc%5Etfw\">March 18, 2020<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2020-03-18 16:21:31","pin":"0","status":"1"},{"title":"Seven major daily markets in Bhubaneswar to be closed after 6 pm","content":"<p>Bhubaneswar Municipal Corporation (BMC) on Wednesday announced the closure of seven major daily markets in the city after 6 pm to prevent unnecessary gathering. The order will come into effect from Thursday. As per BMC’s order the daily markets of Unit I, Unit II, Saheed Nagar, Old Town, Damana along with Ruchika market and Indradhanu market will now function for 12 hours, from 6am to 6pm, every day till March-end.<\/p>\n<p><strong><a href=\"https:\/\/www.newindianexpress.com\/cities\/bhubaneswar\/2020\/mar\/18\/covid-19-pandemic-7-major-daily-markets-in-bhubaneswar-to-be-closed-after-6-pm-2118347.html\" target=\"_blank\">READ FULL REPORT HERE<\/a><\/strong> <\/p>","date":"2020-03-18 16:25:39","pin":"0","status":"1"},{"title":"UK asks nationals in India with coronavirus symptoms to self-isolate for seven days","content":"<blockquote class=\"twitter-tweet\">\n<p lang=\"en\" dir=\"ltr\">UPDATE: We now advise against all non-essential travel overseas. <br \/>\n<br \/>\nActing 🇬🇧 High Commissioner to 🇮🇳<a href=\"https:\/\/twitter.com\/JanThompsonFCO?ref_src=twsrc%5Etfw\">@JanThompsonFCO<\/a> talks about the implications of <a href=\"https:\/\/twitter.com\/hashtag\/Coronavirus?src=hash&ref_src=twsrc%5Etfw\">#Coronavirus<\/a> for British Nationals currently in, or planning to travel to India. <br \/>\n<br \/>\nFollow <a href=\"https:\/\/twitter.com\/FCOtravel?ref_src=twsrc%5Etfw\">@FCOtravel<\/a> <br \/>\n<br \/>\n👉<a href=\"https:\/\/t.co\/F4EhI9YcSx\">https:\/\/t.co\/F4EhI9YcSx<\/a> <a href=\"https:\/\/t.co\/ET0SFdx9db\">pic.twitter.com\/ET0SFdx9db<\/a><\/p>\n— UK in India🇬🇧🇮🇳 (@UKinIndia) <a href=\"https:\/\/twitter.com\/UKinIndia\/status\/1239898137214345221?ref_src=twsrc%5Etfw\">March 17, 2020<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>\n<p><strong><a href=\"https:\/\/www.newindianexpress.com\/world\/2020\/mar\/18\/uk-asks-nationals-in-india-with-coronavirus-symptoms-to-self-isolate-for-seven-days-2118357.html\" target=\"_blank\">READ FULL REPORT HERE<\/a><\/strong><\/p>","date":"2020-03-18 16:27:36","pin":"0","status":"1"},{"title":" Suresh Prabhu goes into self-quarantine as precautionary measure after coming from Saudi","content":"<p>Former Union minister and BJP MP Suresh Prabhu has self quarantined himself at his residence for the next 14 days, as a precautionary measure following his return from Saudi Arabia to attend a meeting on March 10.<\/p>\n<p><strong><a href=\"https:\/\/www.newindianexpress.com\/nation\/2020\/mar\/18\/covid-19-suresh-prabhu-goes-into-self-quarantine-as-precautionary-measure-after-coming-from-saudi-2118361.html\" target=\"_blank\">READ FULL REPORT HERE<\/a><\/strong> <\/p>","date":"2020-03-18 16:29:42","pin":"0","status":"1"},{"title":"BJP activist arrested in Kolkata for hosting cow urine consumption event to fight COVID-19","content":"<p> According to police officials, 40-year-old Narayan Chatterjee, a local party worker of Jorasakho area in North Kolkata, had on Monday organised a cow-worship programme at a cowshed and distributed cow urine.<\/p>\n<p><a href=\"https:\/\/www.newindianexpress.com\/cities\/kolkata\/2020\/mar\/18\/bjp-activist-arrested-in-kolkata-for-hosting-cow-urine-consumption-event-to-fight-covid-19-2118364.html\" target=\"_blank\"><strong>READ FULL REPORT HERE<\/strong><\/a><\/p>","date":"2020-03-18 16:35:41","pin":"0","status":"1"},{"title":"Indian cricketers spread awareness","content":"<p>The cricketing world has come to a standstill due to the coronavirus outbreak which means that the members of the Indian cricket team have got a break from their unrelenting schedule. The second and third match of the ODI series against South Africa were called off due to the outbreak of the viral pandemic and away from the cricket field, the players have been posting messages and updates on social media.<\/p>\n<p><a href=\"https:\/\/www.newindianexpress.com\/sport\/cricket\/2020\/mar\/18\/covid-19-india-cricketers-spread-awareness-to-battle-tough-times-2118363.html\" target=\"_blank\"><strong>READ FULL REPORT HERE<\/strong><\/a><\/p>","date":"2020-03-18 16:38:12","pin":"0","status":"1"},{"title":"'Quick aggressive action'","content":"<blockquote class=\"twitter-tweet\">\n<p lang=\"en\" dir=\"ltr\">Quick aggressive action is the answer to tackling the <a href=\"https:\/\/twitter.com\/hashtag\/Coronavirus?src=hash&ref_src=twsrc%5Etfw\">#Coronavirus<\/a> . India is going to pay an extremely heavy price for our governments inability to act decisively.<\/p>\n— Rahul Gandhi (@RahulGandhi) <a href=\"https:\/\/twitter.com\/RahulGandhi\/status\/1240219741333020677?ref_src=twsrc%5Etfw\">March 18, 2020<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2020-03-18 16:39:48","pin":"0","status":"1"},{"title":"Provide information on masks, hand sanitisers, NPPA asks manufacturers","content":"<p>The National Pharmaceutical Pricing Authority (NPPA) has asked manufacturers and importers of surgical and protective masks, gloves and hand sanitisers to furnish information regarding these items by the end of the day, failing which it will have to take coercive action.<\/p>\n<p><strong><a href=\"https:\/\/www.newindianexpress.com\/business\/2020\/mar\/18\/coronavirus-provide-information-on-masks-hand-sanitisers-nppa-asks-manufacturers-2118325.html\" target=\"_blank\">READ FULL REPORT HERE<\/a><\/strong> <\/p>","date":"2020-03-18 16:45:18","pin":"0","status":"1"},{"title":"Karnataka reports fresh case","content":"<blockquote class=\"twitter-tweet\">\n<p lang=\"en\" dir=\"ltr\"><a href=\"https:\/\/twitter.com\/hashtag\/COVID19?src=hash&ref_src=twsrc%5Etfw\">#COVID19<\/a> <a href=\"https:\/\/twitter.com\/hashtag\/coronaupdateswithTNIE?src=hash&ref_src=twsrc%5Etfw\">#coronaupdateswithTNIE<\/a> <a href=\"https:\/\/twitter.com\/hashtag\/karnataka?src=hash&ref_src=twsrc%5Etfw\">#karnataka<\/a> reports another positive case. Takes total to 14: medical Edn Minister <a href=\"https:\/\/twitter.com\/mla_sudhakar?ref_src=twsrc%5Etfw\">@mla_sudhakar<\/a>. <a href=\"https:\/\/twitter.com\/XpressBengaluru?ref_src=twsrc%5Etfw\">@XpressBengaluru<\/a> <a href=\"https:\/\/twitter.com\/santwana99?ref_src=twsrc%5Etfw\">@santwana99<\/a> <a href=\"https:\/\/twitter.com\/DHFWKA?ref_src=twsrc%5Etfw\">@DHFWKA<\/a> <a href=\"https:\/\/twitter.com\/NewIndianXpress?ref_src=twsrc%5Etfw\">@NewIndianXpress<\/a><\/p>\n— Chetana Belagere (@chetanabelagere) <a href=\"https:\/\/twitter.com\/chetanabelagere\/status\/1240233078619959297?ref_src=twsrc%5Etfw\">March 18, 2020<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2020-03-18 16:45:41","pin":"0","status":"1"},{"title":" Bengal officials to stay at home after coming in contact with officer whose son tested positive","content":"<p>A few senior West Bengal government officials, including Home Secretary Alapan Bandyopadhyay, were asked to stay at home after they came in contact with an officer whose son tested positive for coronavirus, sources said on Wednesday.<\/p>\n<p>The officials came in contact on Monday with the woman officer of the home department whose son tested positive for coronavirus after returning from the UK.<\/p>\n<p><strong><a href=\"https:\/\/www.newindianexpress.com\/cities\/kolkata\/2020\/mar\/18\/covid-19-bengal-officials-to-stay-at-home-after-coming-in-contact-with-officer-whose-son-tested-pos-2118375.html\" target=\"_blank\">READ FULL REPORT<\/a><\/strong><\/p>","date":"2020-03-18 17:09:57","pin":"0","status":"1"},{"title":"Action sought against 'Healer' Baskar for terming COVID-19 'Illuminati conspiracy'","content":"<p>In an audio clip, Baskar claimed the coronavirus outbreak is reportedly a depopulation measure across the globe as per directions given by ‘Illuminati’. Commenting on the state government’s order to close down educational institutions malls and theatres, Baskar claimed the people isolated would be eliminated later on.<\/p>\n<p><strong><a href=\"https:\/\/www.newindianexpress.com\/states\/tamil-nadu\/2020\/mar\/18\/tn-health-dept-seeks-action-against-healer-baskar-for-terming-covid-19-illuminati-conspiracy-2118372.html\" target=\"_blank\">READ FULL REPORT HERE<\/a><\/strong> <\/p>","date":"2020-03-18 17:10:52","pin":"0","status":"1"},{"title":"'Break the Chain' campaign at Ernakulam junction rail station","content":"<blockquote class=\"twitter-tweet\" data-conversation=\"none\">\n<p lang=\"en\" dir=\"ltr\">Passengers using the handwashing kiosk set up as part of <a href=\"https:\/\/twitter.com\/hashtag\/Kerala?src=hash&ref_src=twsrc%5Etfw\">#Kerala<\/a> government's 'Break The Chain' campaign at Ernakulam Junction Railway Station.<br \/>\nExpress photo by <a href=\"https:\/\/twitter.com\/sanesh_TNIE?ref_src=twsrc%5Etfw\">@sanesh_TNIE<\/a><a href=\"https:\/\/twitter.com\/hashtag\/BreakTheChain?src=hash&ref_src=twsrc%5Etfw\">#BreakTheChain<\/a> <a href=\"https:\/\/twitter.com\/hashtag\/coronavirusindia?src=hash&ref_src=twsrc%5Etfw\">#coronavirusindia<\/a> <a href=\"https:\/\/twitter.com\/hashtag\/CoronavirusOutbreak?src=hash&ref_src=twsrc%5Etfw\">#CoronavirusOutbreak<\/a> <a href=\"https:\/\/t.co\/n4wbLjTQFk\">pic.twitter.com\/n4wbLjTQFk<\/a><\/p>\n— The New Indian Express (@NewIndianXpress) <a href=\"https:\/\/twitter.com\/NewIndianXpress\/status\/1240241524895408128?ref_src=twsrc%5Etfw\">March 18, 2020<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2020-03-18 17:12:02","pin":"0","status":"1"},{"title":"Planet asking human race to be more responsible: Ashwin appeals for social distancing to tackle COVID-19","content":"<blockquote class=\"twitter-tweet\">\n<p lang=\"en\" dir=\"ltr\">The planet is challenging the human race, asking us if we can be responsible towards the society, it’s asking us if we can be honest and confine ourselves for another persons sake.  some very difficult questions to answer. Stay safe and answer the questions <a href=\"https:\/\/twitter.com\/hashtag\/coronavirusindia?src=hash&ref_src=twsrc%5Etfw\">#coronavirusindia<\/a><\/p>\n— Ashwin Ravichandran (@ashwinravi99) <a href=\"https:\/\/twitter.com\/ashwinravi99\/status\/1240215473595117570?ref_src=twsrc%5Etfw\">March 18, 2020<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>\n<p><strong><a href=\"https:\/\/www.newindianexpress.com\/sport\/cricket\/2020\/mar\/18\/planet-asking-human-race-to-be-more-responsible-ashwin-appeals-for-social-distancing-to-tackle-covi-2118371.html\" target=\"_blank\">READ FULL REPORT HERE<\/a><\/strong><\/p>","date":"2020-03-18 17:21:29","pin":"0","status":"1"},{"title":"Close all Delhi government offices for seven days, employees tell Kejriwal","content":"<p>A Delhi government employee association on Wednesday met Chief Minister Arvind Kejriwal and demanded the closure of all government offices for a week in the wake of the coronavirus outbreak. Umesh Batra, general secretary of the Delhi government Welfare Association, said around 2.5 lakh people are employed with the Delhi government and most of them are engaged in public dealings.<\/p>\n<p><a href=\"https:\/\/www.newindianexpress.com\/cities\/delhi\/2020\/mar\/18\/coronavirus-close-all-delhi-government-offices-for-seven-days-employees-to-kejriwal-2118389.html\" target=\"_blank\"><strong>READ FULL REPORT HERE <\/strong><\/a><\/p>","date":"2020-03-18 18:03:02","pin":"0","status":"1"},{"title":"Indian carriers may ground 150 planes; stare at quarterly loss on coronavirus impact","content":"<p> All Indian airlines will report significant losses in the first quarter of this year and may initially ground around 150 planes as the shock from the coronavirus pandemic will be \"far deeper and much longer\", according to a report.<\/p>\n<p>Aviation advisory firm CAPA India on Wednesday said even before COVID-19 (coronavirus) appeared on the scene, most Indian carriers already had very strained balance sheets and almost no liquidity.<\/p>\n<p><a href=\"https:\/\/www.newindianexpress.com\/business\/2020\/mar\/18\/indian-carriers-may-ground-150-planes-stare-at-quarterly-loss-on-coronavirus-impact-report-2118387.html\" target=\"_blank\"><strong>READ FULL REPORT HERE<\/strong><\/a><\/p>","date":"2020-03-18 18:03:39","pin":"0","status":"1"},{"title":"Chennai reports 2nd positive case for Covid-19","content":"<blockquote class=\"twitter-tweet\">\n<p lang=\"en\" dir=\"ltr\"><a href=\"https:\/\/twitter.com\/hashtag\/Coronaupdate?src=hash&ref_src=twsrc%5Etfw\">#Coronaupdate<\/a>: <a href=\"https:\/\/twitter.com\/hashtag\/RGGH?src=hash&ref_src=twsrc%5Etfw\">#RGGH<\/a>, Chennai reports the 2nd positive case for <a href=\"https:\/\/twitter.com\/hashtag\/Covid19?src=hash&ref_src=twsrc%5Etfw\">#Covid19<\/a>. The Pt hails from Delhi, is in isolation & stable is under the observation of the expert team treating <a href=\"https:\/\/twitter.com\/hashtag\/Covid19?src=hash&ref_src=twsrc%5Etfw\">#Covid19<\/a>. <a href=\"https:\/\/twitter.com\/hashtag\/TNHealth?src=hash&ref_src=twsrc%5Etfw\">#TNHealth<\/a> <a href=\"https:\/\/twitter.com\/MoHFW_INDIA?ref_src=twsrc%5Etfw\">@MoHFW_INDIA<\/a> <a href=\"https:\/\/twitter.com\/hashtag\/Vijayabaskar?src=hash&ref_src=twsrc%5Etfw\">#Vijayabaskar<\/a><\/p>\n— Dr C Vijayabaskar (@Vijayabaskarofl) <a href=\"https:\/\/twitter.com\/Vijayabaskarofl\/status\/1240250048639668224?ref_src=twsrc%5Etfw\">March 18, 2020<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2020-03-18 18:04:10","pin":"0","status":"1"},{"title":"Woman tests positive for COVD-19 in Delhi's Dilshad Garden, total case in capital at 9","content":"<p> The number of Coronavirus (COVID-19) cases reached nine in the national capital after a resident of L Block, Dilshad Garden tested positive on Wednesday. \"A woman (38) who has returned from Saudi Arabia has been tested positive. Her two daughters (25) (26) who have shown symptoms have been put in isolation at the Dr Ram Manohar Lohia hospital while the patient has also been shifted to the same hospital. Her son has been asked to self-quarantine at his home as he is asymptomatic for now,\" Pankaj Bhatnagar, SDM Seemapuri said.<\/p>\n<p><a href=\"https:\/\/www.newindianexpress.com\/cities\/delhi\/2020\/mar\/18\/woman-tests-positive-for-covd-19-in-delhis-dilshad-garden-total-case-in-capital-at-9-2118395.html\" target=\"_blank\"><strong>READ FULL REPORT HERE<\/strong><\/a><\/p>","date":"2020-03-18 18:34:37","pin":"0","status":"1"},{"title":"Delhi doctor using anti-HIV drug combo for high-risk COVID-19 patients","content":"<p>As the number of coronavirus patients in India is surging, those developing serious complications are being given a combination of anti-HIV and anti-malaria medicines along with Tamiflu — an antiviral drug used in the treatment, However, most patients are being treated with antipyretics.<\/p>\n<p><strong><a href=\"http:\/\/Delhi doctor using anti-HIV drug combo for high-risk COVID-19 patients\" target=\"_blank\">READ FULL REPORT HERE<\/a><\/strong> <\/p>","date":"2020-03-18 18:38:20","pin":"0","status":"1"},{"title":"WATCH | How this doctor cured COVID-19 using anti-HIV drugs","content":"<p><iframe width=\"100%\" height=\"450\" src=\"https:\/\/www.youtube.com\/embed\/Qqk9odDGeec\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\"><\/iframe><\/p>","date":"2020-03-18 18:41:12","pin":"0","status":"1"},{"title":"Third batch of evacuees reach Army wellness facility at Jaisalmer","content":"<p>Close to 195 Indians from Iran were brought to Jaisalmer by a special plane on Wednesday evening. The passengers were screened at the Airport and shifted to the Army Wellness Facility at Jaisalmer Military Station. With the arrival of this batch of evacuees, the total number of quarantined people housed at the Army Wellness Facility in Jaisalmer Military Station has increased to 484. Army authorities have confirmed that all the quarantined persons are stable. <\/p>\n<p style=\"text-align:center\"><img alt=\"\" height=\"\" src=\"https:\/\/images.newindianexpress.com\/uploads\/user\/ckeditor_images\/article\/2020\/3\/18\/indian_evacuees-.jpeg\" width=\"100%\" \/><\/p>\n","date":"2020-03-18 19:24:23","pin":"0","status":"1"},{"title":"Devotees banned from taking part in Varanasi's famous Ganga Arti","content":"<p>While all the major religious congregations being cancelled due to the rising number of coronavirus cases in the country, the Varanasi district administration has also decided to ban the entry of devotees in famous Ganga Arti. The Aarti has also been downgraded where instead of seven, only one person would perform it.<\/p>\n<p><strong><a href=\"https:\/\/www.newindianexpress.com\/nation\/2020\/mar\/18\/devotees-banned-from-taking-part-in-varanasis-famous-ganga-arti-2118426.html\" target=\"_blank\">READ FULL REPORT HERE<\/a> <\/strong><\/p>","date":"2020-03-18 19:47:53","pin":"0","status":"1"},{"title":"Passengers stranded as 16 trains from, via Chennai cancelled due to COVID-19","content":"<p>Sixteen trains have been cancelled due to the fear of coronavirus pandemic, according to a release from the Southern Railways. <\/p>\n<p><a href=\"https:\/\/www.newindianexpress.com\/cities\/chennai\/2020\/mar\/18\/passengers-stranded-as-16-trains-from-via-chennai-cancelled-due-to-covid-19-2118415.html\" target=\"_blank\"><strong>CLICK HERE TO READ DETAILS OF CANCELLED AND RESCHEDULED TRAINS<\/strong><\/a><\/p>","date":"2020-03-18 19:50:11","pin":"0","status":"1"},{"title":"","content":"<blockquote class=\"twitter-tweet\">\n<p lang=\"en\" dir=\"ltr\">No fresh Covid-19 case reported in Kerala on Wednesday. 25 k people are under surveillance in the state as on Wednesday. <a href=\"https:\/\/twitter.com\/NewIndianXpress?ref_src=twsrc%5Etfw\">@NewIndianXpress<\/a> <a href=\"https:\/\/twitter.com\/xpresskerala?ref_src=twsrc%5Etfw\">@xpresskerala<\/a><\/p>\n— Dhinesh Kallungal (@Dinesh_TNIE) <a href=\"https:\/\/twitter.com\/Dinesh_TNIE\/status\/1240272057243320322?ref_src=twsrc%5Etfw\">March 18, 2020<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2020-03-18 19:52:30","pin":"0","status":"1"},{"title":"Don't behave irresponsibly if you have coronavirus-like symptoms: West Bengal CM Mamata","content":"<p>Banerjee also instructed police to take stern action against those who spread fake news on the coronavirus outbreak.  \"We don't support if somebody tries to hide his\/her symptoms and doesn't take precautionary measures.  If people show any symptom of Covid-19 (coronavirus disease), they should immediately go for tests and medical examination,\" the chief minister said.<\/p>","date":"2020-03-18 20:06:04","pin":"0","status":"1"},{"title":"Now robots to take on deadly virus in Kerala","content":"<iframe width=\"100%\" height=\"315\" src=\"https:\/\/www.youtube.com\/embed\/hT0crHebh-g\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen><\/iframe>","date":"2020-03-18 20:15:33","pin":"0","status":"1"},{"title":"Kerala cop removed from service for running away from coronavirus isolation ward","content":"<p>The cop, who hails from Amburi in Thiruvananthapuram, was kept in the isolation ward after it came to the Health Department's notice that he had been to Ranni very recently. Ranni was badly affected as a slew of COVID-19 cases were reported from there.<a href=\"https:\/\/www.newindianexpress.com\/cities\/thiruvananthapuram\/2020\/mar\/18\/kerala-cop-removed-from-service-for-running-away-from-coronavirus-isolation-ward-2118437.html\" target=\"_blank\"><strong> (READ FULL STORY HERE)<\/strong><\/a><\/p>","date":"2020-03-18 20:20:22","pin":"0","status":"1"},{"title":"One more tests positive in Pune","content":"<blockquote class=\"twitter-tweet\">\n<p lang=\"en\" dir=\"ltr\">Maharashtra: One more person has tested positive for <a href=\"https:\/\/twitter.com\/hashtag\/Coronavirus?src=hash&ref_src=twsrc%5Etfw\">#Coronavirus<\/a> in Pimpri-Chinchwad; the person has a travel history to Philippines. Total number of positive cases reaches 19 in Pune and 44 in Maharashtra.<\/p>\n— ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1240287855051599872?ref_src=twsrc%5Etfw\">March 18, 2020<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2020-03-18 20:50:06","pin":"0","status":"1"},{"title":"50-year-old tests positive in Maharashtra, total case in India reaches 159","content":"<blockquote class=\"twitter-tweet\">\n<p lang=\"en\" dir=\"ltr\">Public Health Department, Maharashtra: A 50-year-old person has tested positive for <a href=\"https:\/\/twitter.com\/hashtag\/Coronavirus?src=hash&ref_src=twsrc%5Etfw\">#Coronavirus<\/a> in Ratnagiri today; the person has a travel history to Dubai. Total number of positive cases reaches 45 in Maharashtra.<\/p>\n— ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1240304049422888960?ref_src=twsrc%5Etfw\">March 18, 2020<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2020-03-18 21:34:03","pin":"0","status":"1"},{"title":"Section 144 imposed in Rajasthan","content":"<p>Section 144 (prohibiting assembly of more than 4 people in an area) has been imposed across the state, to avoid gathering of people in view of Coronavirus Pandemic.<\/p>","date":"2020-03-18 22:12:41","pin":"0","status":"1"},{"title":"Maharashtra govt suggests operating 50% passenger capacity of public transport system","content":"<blockquote class=\"twitter-tweet\">\n<p lang=\"en\" dir=\"ltr\">Maharashtra Government: It has been decided that offices will continue on a day-to-day basis, accounting for 50% of the workforce. Besides, it has been suggested to try to operate 50% passenger capacity of the public transport system including rail, buses & metro. <a href=\"https:\/\/t.co\/WIaezJeCOG\">pic.twitter.com\/WIaezJeCOG<\/a><\/p>\n— ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1240300985676783620?ref_src=twsrc%5Etfw\">March 18, 2020<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2020-03-18 22:16:17","pin":"0","status":"1"},{"title":"Passengers coming through UAE, Kuwait to be quarantined upon arrival: Health ministry","content":"<ul>\n    <li>Passengers coming\/transiting through UAE, Qatar, Oman & Kuwait after March 18 (port of departure) to be quarantined upon arrival for 14 days.<\/li>\n    <li>Those who have visited China, South Korea, Iran, Italy, Spain, France & Germany on\/after Feb 15 to be quarantined.<\/li>\n    <li>Indians coming from South Korea are required to produce negative #COVID19 certificate to come to the country.<\/li>\n<\/ul>","date":"2020-03-18 22:23:04","pin":"0","status":"1"},{"title":"","content":"<p><span style=\"font-size: large;\"><strong>3 people<\/strong> have tested positive for <strong>Coronavirus<\/strong> in <strong>Rajasthan<\/strong>'s Jhunjhunu today.<\/span><\/p>","date":"2020-03-18 22:25:33","pin":"0","status":"1"},{"title":"CBSE, JEE mains exams postponed","content":"<ul>\n    <li>Ongoing CBSE class 10th &12 exams to be rescheduled after March 31<\/li>\n    <li>All ongoing examinations including University exams to be rescheduled after March 31<\/li>\n    <li>JEE mains examination to be rescheduled & new date will be announced on March 31 after re-assessment of the situation since the examination may require travel by examinees to different towns & the dates may clash with rescheduled CBSE, other board exams<\/li>\n<\/ul>","date":"2020-03-18 22:48:22","pin":"0","status":"1"},{"title":"Suspected COVID-19 patient commits suicide in Delhi","content":"<blockquote class=\"twitter-tweet\">\n<p lang=\"en\" dir=\"ltr\">Devender Arya, Deputy Commissioner of Police (South West): A suspected <a href=\"https:\/\/twitter.com\/hashtag\/COVID19?src=hash&ref_src=twsrc%5Etfw\">#COVID19<\/a> patient committed suicide by jumping from the Safdarjung Hospital. The deceased has been identified as Tanveer Singh, he was admitted to hospital today at 9 pm after returning from Sydney, Australia. <a href=\"https:\/\/t.co\/KYy3MvkYVv\">https:\/\/t.co\/KYy3MvkYVv<\/a> <a href=\"https:\/\/t.co\/TnQDiitboC\">pic.twitter.com\/TnQDiitboC<\/a><\/p>\n— ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1240328147435835395?ref_src=twsrc%5Etfw\">March 18, 2020<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2020-03-18 22:56:34","pin":"0","status":"1"},{"title":"PM Modi to address nation on COVID-19 at 8 pm on Thursday","content":"<p>Prime Minister Narendra Modi will address the nation on Thursday 8 p.m. and will talk about issues relating to the pandemic diseases and the efforts to combat it, the Prime Minister's Office (PMO) announced on Wednesday. <a href=\"https:\/\/www.newindianexpress.com\/nation\/2020\/mar\/18\/pm-modi-to-address-nation-on-covid-19-at-8-pm-on-thursday-2118495.html\" target=\"_blank\"><strong>( READ FULL STORY HERE)<\/strong><\/a><\/p>\n<p><strong><img src=\"https:\/\/images.newindianexpress.com\/images\/liveimages\/PM modi.jpg\" width=\"100%\" height=\"\" alt=\"\" \/><\/strong><\/p>","date":"2020-03-18 23:22:17","pin":"0","status":"1"},{"title":"7 Indonesian nationals test positive in Telangana, total cases rise to 169","content":"<p><img src=\"https:\/\/images.newindianexpress.com\/images\/liveimages\/WhatsApp Image 2020-03-18 at 23_49_03.jpeg\" width=\"100%\" height=\"\" alt=\"\" \/> <\/p>","date":"2020-03-19 00:00:36","pin":"0","status":"1"},{"title":"","content":"<p><a href=\"https:\/\/www.newindianexpress.com\/live\/2020\/mar\/19\/covid-19-live--7-foreigners-test-positive-in-telangana-as-total-cases-in-india-rises-to-169-pm-to-2118519.html\" target=\"_blank\"><span style=\"font-size: large;\"><strong>FOLLOW NEWER UPDATES HERE<\/strong><\/span><\/a><\/p>","date":"2020-03-19 01:29:08","pin":"0","status":"1"}]}