{"details":[{"title":"Major updates in the last 24 hours","content":"<ul>\n    <li>Sec 144 imposed in Haryana, Goa, Puducherry<\/li>\n    <li>Kerala directs government employees to work part-time for 2 weeks<\/li>\n    <li>Coronavirus positive cases in Maharashtra jumps to 63<\/li>\n    <li>Chennai beaches closed<\/li>\n    <li>Tamil Nadu postpones Class X board exams<\/li>\n    <li>Bengal postpones class XII exams, restaurants, bars shut till March 31<\/li>\n    <li>Maharashtra to have special control room, lockdown in Akola<\/li>\n    <li>Bengaluru metro train sevices to be regulated from March 23<\/li>\n    <li>PM appeals to people not to leave currrent place of stay to control spread of virus<\/li>\n    <li>Rajasthan CM Ashok Gehlot orders lockdown in state from March 22-March 31<\/li>\n    <li>First positive case in Assam, sample sent to ICMR research centre for reconfirmation<\/li>\n<\/ul>","date":"2020-03-22 00:36:52","pin":"0","status":"1"},{"title":"No passenger trains to ply today","content":"<ul>\n    <li>1,300 trains to be cancelled on Sunday<\/li>\n    <li>Mumbai Metro to suspend services<\/li>\n    <li>Walmart to keep all India stores closed<\/li>\n    <li>Twelve airports in North-East to continue functioning during 'Janta Curfew': AAI<\/li>\n    <li>No passenger train to begin journey from midnight to 10 pm on Sunday<\/li>\n<\/ul>","date":"2020-03-22 00:42:46","pin":"0","status":"1"},{"title":"Italy reports new daily record of almost 800 coronavirus deaths","content":"<p>Italy on Saturday reported 793 new coronavirus deaths, a one-day record that saw its toll shoot up to 4,825 - 38.3 per cent of the world's total. The number of COVID-19 infections rose by 6,557 to 53,578, another record. <a href=\"https:\/\/www.newindianexpress.com\/world\/2020\/mar\/22\/italy-reports-new-daily-record-of-almost-800-coronavirus-deaths-2119961.html\" target=\"_blank\"><strong>(READ FULL REPORT HERE)<\/strong><\/a><\/p>","date":"2020-03-22 00:44:16","pin":"0","status":"1"},{"title":"Bengaluru Police, BBMP to conduct home quarantine checks during Janta curfew","content":"<blockquote class=\"twitter-tweet\">\n<p lang=\"en\" dir=\"ltr\">On 22nd March,500 teams of Bangalore Police&Bruhat Bengaluru Mahanagara Palike will go the houses of about 30,000 who returned from foreign countries,to check if they are obeying home quarantine.Hand stamping will be done¬ices will be served:Govt of Karnataka,Health Department<\/p>\n— ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1241431746081480704?ref_src=twsrc%5Etfw\">March 21, 2020<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2020-03-22 00:46:01","pin":"0","status":"1"},{"title":"Centre lays down norms for COVID-19 testing in private labs, fixes a price cap of Rs 4500 per test","content":"<p>The government on Saturday notified norms under which private diagnostic labs accredited by the National Accreditation Board for testing and calibration laboratories will be allowed to carry out tests for coronavirus fixing an upper cap of Rs 4,500 per test.<a href=\"https:\/\/www.newindianexpress.com\/nation\/2020\/mar\/22\/centre-lays-down-norms-for-covid-19-testing-in-private-labs-fixes-a-price-cap-of-rs-4500-per-test-2119971.html\" target=\"_blank\"> <strong>(READ FULL STORY HERE)<\/strong><\/a><\/p>","date":"2020-03-22 00:48:43","pin":"0","status":"1"},{"title":"Two men test positive in UP ","content":"<ul>\n    <li>A 31-year-old resident of Greater Noida has tested positive for CoronaVirus. He had returned from Dubai.<\/li>\n    <li>A 30-year-old man from Varanasi has been tested positive for Coronavirus at BHU testing lab. He had arrived in Delhi from Dubai on March 17 and went to Varanasi on March 18 in train.<\/li>\n<\/ul>","date":"2020-03-22 00:53:28","pin":"0","status":"1"},{"title":"PM urges pharma industry to manufacture COVID -19 testing kits on a war footing","content":"<p>Prime Minister Narendra Modi on Saturday urged the pharmaceutical industry to manufacture COVID-19 testing kits on \"a war footing\".<\/p>\n<p>In an interaction with leaders of the pharmaceutical industry, Modi said that the Centre has already approved schemes worth Rs 14,000 crore for production of critical drugs and medical equipment.<\/p>","date":"2020-03-22 05:29:39","pin":"0","status":"1"},{"title":"Moradabad jail suspends meeting between inmate and family till March 31","content":"<ul>\n    <li>The Moradabad jail authorities have also been distributing ayurvedic and allopathic medicines among the prisoners to protect them from the novel coronavirus, an official said.  Jail Superintendent Umesh Singh said, \"We are facing challenge to protect the all prisoners in the over-crowded jail from coronavirus.  So, we have stopped all public meetings till March 31.  \"<\/li>\n    <li>\"To protect the prisoners, we had already reduced the number of visitors and days last week.  But we completely stopped the entry of visitors and appearance of undertrials in the different courts till March 31,\" he said.<\/li>\n    <li>\"To increase the immunity (of prisoners), we are distributing many ayurvedic and allopathic medicines among them,\" he added.  No positive case of coronavirus has been reported in the jail.<\/li>\n<\/ul>","date":"2020-03-22 08:51:20","pin":"0","status":"1"},{"title":"No trains in Delhi today due to 'Janta Curfew'","content":"<blockquote class=\"twitter-tweet\">\n<p lang=\"en\" dir=\"ltr\">Delhi: Indian Railways has cancelled all passenger trains till 10pm today during <a href=\"https:\/\/twitter.com\/hashtag\/JantaCurfew?src=hash&ref_src=twsrc%5Etfw\">#JantaCurfew<\/a> in the view of Coronavirus <a href=\"https:\/\/t.co\/s1i3lBBbSw\">pic.twitter.com\/s1i3lBBbSw<\/a><\/p>\n— ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1241562447665864706?ref_src=twsrc%5Etfw\">March 22, 2020<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2020-03-22 08:52:44","pin":"0","status":"1"},{"title":"Major temples in Mathura closed due to coronavirus","content":"<ul>\n    <li>\"On the orders of civil judge, junior division, Mathura, the noted Bankey Behari Temple has been closed till March 31 for public,\" Munish Sharma, the temple manager, said.  He, however, said that the obeisance to the principal deity would continue as usual within the temple.  The 22-kilometer Parikrama of Govardhan has been banned.  The Mukharbind Temple Jatipura has been closed till March 31, SDM Rahul Yadav said.<\/li>\n    <li>Daan Ghati Temple and Mukut Mukharbind Temple Goverdhan have also been closed till Monday.  The situation would be reviewed on Monday, Rama Kant Goshwami, the receiver of Mukut Mukharbind Temple, said.  According to Sevayat Mathura Prasad Kaushik, Daan Ghati temple has been closed till Monday.  All the temples based at Sri Krishna Janmasthan and the Old Keshav Deo temple would remain closed till March 24.<\/li>\n    <li>The Kirti Kishori Temple, Barsana, has also been closed till March 31.  Further decision would be taken on March 30 by the management of the temple, Nitin Gupta, the Secretary of the temple, said.<\/li>\n    <li>The Ladli Temple, Barsana, would also remain closed till Monday, when a final decision on extending the closure would be taken, Krishna Murari Goshwami, the receiver of the temple, said.  Raja Thakur Temple, Gokul, would also remain closed till March 31, Bhikoo Ji Mahraj, the priest of the temple, said.<\/li>\n<\/ul>","date":"2020-03-22 08:53:31","pin":"0","status":"1"},{"title":"Jharkhand railway stations wear deserted look","content":"<blockquote class=\"twitter-tweet\">\n<p lang=\"en\" dir=\"ltr\">Jharkhand: Deserted Ranchi Railway Station, as all passenger & intercity trains have been cancelled till 10 pm today, in view of <a href=\"https:\/\/twitter.com\/hashtag\/JantaCurfew?src=hash&ref_src=twsrc%5Etfw\">#JantaCurfew<\/a> announced by Prime Minister Narendra Modi. <a href=\"https:\/\/twitter.com\/hashtag\/COVID19?src=hash&ref_src=twsrc%5Etfw\">#COVID19<\/a> <a href=\"https:\/\/t.co\/bwICJNdZ2h\">pic.twitter.com\/bwICJNdZ2h<\/a><\/p>\n— ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1241562214990921728?ref_src=twsrc%5Etfw\">March 22, 2020<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2020-03-22 08:55:04","pin":"0","status":"1"},{"title":"Two districts in Kashmir valley cancel gazetted holidays of government employees","content":"<ul>\n    <li>District authorities in Srinagar and Ganderbal on Saturday ordered cancellation of all gazetted holidays of government employees in view of the coronavirus pandemic.  In separate orders by the respective district magistrates of the two districts, all government officers and officials who might be on leave were asked to report to duty as and when required or asked.<\/li>\n    <li>\"Officers\/officials of essential services\/emergency services and those associated with measures being taken for control of coronavirus shall not avail any gazetted holidays\/ restricted holidays\/Sunday or any leave,\" the orders read.<\/li>\n    <li>The orders also directed private persons and organisations requisitioned for providing services for the COVID-19 related activities to comply with such orders without fail.  The order states that non-compliance with instructions under the order or creating obstructions in the implementation of such measures will attract strict action as warranted.<\/li>\n<\/ul>","date":"2020-03-22 09:03:24","pin":"0","status":"1"},{"title":"","content":"<p><img src=\"https:\/\/images.newindianexpress.com\/images\/liveimages\/Chennai Janata Curfew-collage.jpg\" width=\"3264\" height=\"1632\" alt=\"\" \/> <\/p>","date":"2020-03-22 09:04:51","pin":"0","status":"0"},{"title":"Here are some snaps of the Janta Curfew in Chennai, clicked by the TNIE readers","content":"<p><img src=\"https:\/\/images.newindianexpress.com\/images\/liveimages\/Chennai Janata Curfew-collage(1).jpg\" width=\"500\" height=\"250\" alt=\"\" \/> <\/p>","date":"2020-03-22 09:06:48","pin":"0","status":"1"},{"title":"Punjab government orders lockdown in some districts","content":"<ul>\n    <li>The Punjab government Saturday night ordered lockdown till March 25 in several districts including Nawanshahr, Hoshiarpur, Kapurthala and Jalandhar in view of the rising coronavirus cases in the state, officials said.  In the highest single-day increase in the number of confirmed coronavirus cases in Punjab, 11 people tested positive on Saturday, taking the total number to 14 in the state, official said.<\/li>\n    <li>\"Establishments in districts of Nawanshahr and Hoshiarpur have been closed while the partial lockdown has been ordered in Jalandhar with effect from 7 am on March 22 (Sunday) up to midnight of March 25,\" a government statement said here.  Likewise, it has also been advised to close down establishments in Kapurthala district from Monday as a precautionary measure, it said.  Among the fresh cases, six were from Nawanshahr, three from Mohali and one each from Hoshiarpur and Amritsar districts.  In Jalandhar, Deputy Commissioner Varinder Kumar Sharma and Commissioner of Police Gurpreet Singh Bhullar said that all commercial establishments, except those dealing in essentials, would be closed during the lockdown.  The DC said that no one would be allowed to loiter around and severe action would be taken against the violators.<\/li>\n    <li>The officers further said that movement of vehicles in, outside and within the city would be restricted to emergency vehicles only.<\/li>\n    <li>\"Only one person from a family would be allowed to move out for availing of essential services,\" said the Jalandhar Deputy Commissioner.  Factories engaged in the production of essential items including flour mills, cattle feed, food processing, medical pharma, etc will not be closed by enforcing staggering of workers and other preventive safeguards, said the government statement.<\/li>\n    <li>Other DCs should interact with industry associations to work out modalities for proactive closure and they should also appeal to them to compensate labourers and not deduct the wages, even of casual employees, it said.<\/li>\n    <li>Chief Secretary Karan Avtar Singh emphasised on the need of home quarantine to be strictly enforced.<\/li>\n    <li>Sticker outside the homes of those quarantined should be pasted for the information to the neighbours, the statement said.  The state government also issued a list of the essential commodities as per the provisions in the Essential Commodities Act 1955.<\/li>\n<\/ul>","date":"2020-03-22 09:10:00","pin":"0","status":"1"},{"title":"Total shutdown in Kerala","content":"<ul>\n    <li>Its total shutdown in Kerala as the state responded to the ‘Janata Curfew’ to break the chain of transmission of coronavirus which has now infected as many as 52 people in the state.<\/li>\n    <li>Roads, bus stands, railway stations and other public places are deserted, Metro stations closed in Kochi and almost all public places shut down as the Curfew began at 7 am on Sunday.<\/li>\n    <li>Although a few long-haul trains are passing through the state, the railways have stopped distributing tickets to the passengers and prevented entry of people to the platforms.  The voluntary curfew will last till 9 pm.<\/li>\n<\/ul>","date":"2020-03-22 09:11:19","pin":"0","status":"1"},{"title":"Maharashtra government announces effective shut-down of Mumbai local trains","content":"<ul>\n    <li>only the government personnel engaged in provision of essential services would be allowed to travel by local trains in Mumbai from the next week, a release by the Konkan divisional commissioner said on Saturday night.  The restriction, which will effectively shut down the train services, Mumbai's lifeline, will come into effect from midnight of Sunday, March 22, the release said.<\/li>\n    <li>Apart from the government officials involved in provision of essential services (who will have to produce their id-cards), only those who need urgent medical aid would be allowed to travel, said the release by divisional commissioner Shivaji Daund.  Those who are traveling by local train to reach railway terminus for boarding a long-distance train will also be allowed on inspection of their journey tickets.<\/li>\n    <li>Earlier, Maharashtra health minister Rajesh Tope had said that the government would be compelled to shut down the local train services and other modes of public transport if crowds did not thin.  Maharashtra has recorded 64 cases of coronavirus so far, including 19 in Mumbai.<\/li>\n<\/ul>","date":"2020-03-22 09:14:18","pin":"0","status":"1"},{"title":"Latest scenes from Uttar Pradesh","content":"<blockquote class=\"twitter-tweet\">\n<p lang=\"en\" dir=\"ltr\">The self-imposed <a href=\"https:\/\/twitter.com\/hashtag\/JantaCurfew?src=hash&ref_src=twsrc%5Etfw\">#JantaCurfew<\/a> to be observed till 9 pm today, amid rising cases of Coronavirus in the country; Visuals from Meerut. <a href=\"https:\/\/t.co\/CYVyTTyJmN\">pic.twitter.com\/CYVyTTyJmN<\/a><\/p>\n— ANI UP (@ANINewsUP) <a href=\"https:\/\/twitter.com\/ANINewsUP\/status\/1241558442864590850?ref_src=twsrc%5Etfw\">March 22, 2020<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2020-03-22 09:15:35","pin":"0","status":"1"},{"title":"Mizoram announces statewide shutdown till March 29","content":"<ul>\n    <li>The notification was issued following a decision of the state-level task force on mitigation of coronavirus and subsequent approval by the cabinet late in the evening, officials said.  As per the notification issued by the General Administration Department, restrictions will be in place in all districts from March 22 till March 29.<\/li>\n    <li>All stores, barring pharmacies and those selling essential commodities, will remain shut during the period, the notification said.  All commercial and private vehicles, including two- wheeler taxis, will not be allowed to ply during the period, it said.<\/li>\n    <li>Ambulances, fire and emergency services, vehicles used for law and order duties and those of accredited journalists will be allowed, it said, adding that those on medical duty to contain coronavirus and transporting essential commodities will be exempted.<\/li>\n    <li>It further instructed people to stay indoors, except those on medical duty and dealing with essential commodities and services.<\/li>\n<\/ul>","date":"2020-03-22 09:17:57","pin":"0","status":"1"},{"title":"Patna resident distributes hand sanitiser to cops","content":"<blockquote class=\"twitter-tweet\">\n<p lang=\"en\" dir=\"ltr\">Bihar: Rakesh Chaudhary,a local in Patna, observes <a href=\"https:\/\/twitter.com\/hashtag\/JantaCurfew?src=hash&ref_src=twsrc%5Etfw\">#JantaCurfew<\/a> by distributing hand sanitiser to police& traffic police personnel in Patna, amid rising cases of Coronavirus in the country. He says, \"The entire country is fighting against Coronavirus. This is my way to fight it\". <a href=\"https:\/\/t.co\/Xphyh0Wj7S\">pic.twitter.com\/Xphyh0Wj7S<\/a><\/p>\n— ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1241571756231385089?ref_src=twsrc%5Etfw\">March 22, 2020<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2020-03-22 09:18:52","pin":"0","status":"1"},{"title":"Deserted roads in Delhi as people observe 14-hour Janata Curfew","content":"Barring shops selling essential commodities and pharmacies, all other establishments remained closed as the self-imposed curfew began at 7 am. (READ FULL STORY HERE)","date":"2020-03-22 09:31:34","pin":"0","status":"0"},{"title":"Deserted roads in Delhi as people observe 14-hour Janata Curfew","content":"<p>Barring shops selling essential commodities and pharmacies, all other establishments remained closed as the self-imposed curfew began at 7 am.<a href=\"https:\/\/www.newindianexpress.com\/cities\/delhi\/2020\/mar\/22\/deserted-roads-in-delhi-as-people-observe-14-hour-janata-curfew-2120115.html\" target=\"_blank\"><strong> (READ FULL STORY HERE)<\/strong><\/a><\/p>","date":"2020-03-22 09:32:29","pin":"0","status":"1"},{"title":"Unique initiave by Delhi Police to request people to observe curfew","content":"<blockquote class=\"twitter-tweet\">\n<p lang=\"en\" dir=\"ltr\">Delhi: Policemen offer flowers to the locals out on roads, requesting them to stay at home and observe the countrywide <a href=\"https:\/\/twitter.com\/hashtag\/JanataCurfew?src=hash&ref_src=twsrc%5Etfw\">#JanataCurfew<\/a> today. <a href=\"https:\/\/twitter.com\/hashtag\/COVID19?src=hash&ref_src=twsrc%5Etfw\">#COVID19<\/a> <a href=\"https:\/\/t.co\/QnSNnrHBeA\">pic.twitter.com\/QnSNnrHBeA<\/a><\/p>\n— ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1241571178130493440?ref_src=twsrc%5Etfw\">March 22, 2020<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2020-03-22 09:35:09","pin":"0","status":"1"},{"title":"Gujarat in self-imposed lockdown","content":"<ul>\n    <li>Streets were empty and shops and business establishments remained shut in the state.  Roads, railway stations and airports in the state's four major cities - Ahmedabad, Surat, Vadodara and Rajkot - wore a deserted look on Sunday morning.  People stayed indoors and hardly anybody was seen emerging from residential societies in Ahmedabad.<\/li>\n    <li>All major roads in Ahmedabad, like the SG Highway and SP Ring Road, were empty, as was the Kalupur fruit market which is usually crowded in the mornings.<\/li>\n    <li>Public transport services, including buses of the Gujarat State Road Transport Corporation (GSRTC), private buses, local civic-run buses and services of the Bus Rapid Transit System (in Ahmedabad, Surat and Rajkot) remain closed.  Services of the Ahmedabad Metro were also suspended.<\/li>\n<\/ul>","date":"2020-03-22 09:40:12","pin":"0","status":"1"},{"title":"Latest scene from Shillong","content":"<blockquote class=\"twitter-tweet\">\n<p lang=\"en\" dir=\"ltr\">Meghalaya's Shillong observes <a href=\"https:\/\/twitter.com\/hashtag\/JantaCurfew?src=hash&ref_src=twsrc%5Etfw\">#JantaCurfew<\/a> in order to control the spread of <a href=\"https:\/\/twitter.com\/hashtag\/COVID19?src=hash&ref_src=twsrc%5Etfw\">#COVID19<\/a>. <a href=\"https:\/\/t.co\/6YjRc4ybZS\">pic.twitter.com\/6YjRc4ybZS<\/a><\/p>\n— ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1241577494999777281?ref_src=twsrc%5Etfw\">March 22, 2020<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2020-03-22 09:41:01","pin":"0","status":"1"},{"title":"People stay indoors in Kolkata as 'Janata curfew' begins","content":"<p>The usually bustling Esplanade, Dalhousie, airport and railway stations wore a deserted look as people stayed indoors to support the prime minister's call.  Mostly those engaged in essential services were seen on the roads travelling to work.  The Eastern and South Eastern Railway have cancelled all mail\/express trains originating from the two zones between 4 am and 10 pm on Sunday in view of 'Janata Curfew', but will run skeletal local train services on the day, officials had said on Saturday.<\/p>","date":"2020-03-22 09:41:56","pin":"0","status":"1"},{"title":"People stay indoors, shops closed in Madhya Pradesh","content":"<p>People in Madhya Pradesh remained indoors and streets wore a deserted look on Sunday in view of the 'Janta Curfew' call given by Prime Minister Narendra Modi to make the fight against coronavirus a success.  Roadside shops and eateries also remained closed in the state.  Four districts - Jabalpur, Rewa, Seoni and Narsinghpur - have already been placed under lockdown since Saturday.<\/p>","date":"2020-03-22 09:42:46","pin":"0","status":"1"},{"title":"Mumbaikars stay indoors as 'Janata curfew' commences","content":"<ul>\n    <li>The usually bustling western and eastern express highways and other arterial roads looked empty as people stayed in their homes to support the curfew.  Same was the situation at the suburban train stations which normally see thousands of commuters jostling to get inside the overcrowded trains.<\/li>\n    <li>State government authorities had on Saturday informed people that only those engaged in essential services would be allowed to travel in local trains, that too after checking their identity papers.  Public transport is being curtailed in the city on Sunday.  Local trains on the Central line will see 60 per cent services as against the normal 70 per cent on Sundays.<\/li>\n    <li>The Western Railway has cancelled four services, two from Virar to Dahanu Road, and two from Dahanu Road to Dadar and Churchgate.  The Central Railway has cancelled 60 long distance trains across Mumbai division, while the Western Railway has cancelled 40 mail express and 26 passenger trains from Mumbai.<\/li>\n    <li>It has also cancelled 477 suburban locals on Sunday.  The Mumbai Metro and Mumbai Monorail will remain suspended for the day, while BEST buses will run according to their holiday schedule, officials said.<\/li>\n<\/ul>","date":"2020-03-22 09:45:08","pin":"0","status":"1"},{"title":"Join 'Janata curfew' to make fight against coronavirus a success: PM to people","content":"<p>Modi had proposed a 'Janata curfew' on Sunday between 7 am and 9 pm as part of social distancing to check the spread of the deadly virus.  \"In a few minutes from now, the #JantaCurfew commences.  Let us all be a part of this curfew, which will add tremendous strength to the fight against COVID-19 menace,\" the prime minister wrote on Twitter.  He said the steps to be taken now will help in the times to come.  \"Stay indoors and stay healthy,\" he said.<\/p>","date":"2020-03-22 09:45:52","pin":"0","status":"1"},{"title":"Tamil Nadu Muslim League distributes sanitizers, free masks","content":"<blockquote class=\"twitter-tweet\">\n<p lang=\"en\" dir=\"ltr\">Chennai: A member of Tamil Nadu Muslim League distributes hand sanitizers & face masks to elderly people at an old age home. <a href=\"https:\/\/twitter.com\/hashtag\/CoronaVirusPandemic?src=hash&ref_src=twsrc%5Etfw\">#CoronaVirusPandemic<\/a> <a href=\"https:\/\/t.co\/KkyoqEOxxJ\">pic.twitter.com\/KkyoqEOxxJ<\/a><\/p>\n— ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1241571375761879043?ref_src=twsrc%5Etfw\">March 22, 2020<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2020-03-22 09:48:48","pin":"0","status":"1"},{"title":"Foreign returnee sent to hospital by Bengaluru police","content":"One returnee from abroad who had arrived at Bengaluru Airport this morning with no symptoms, but who was supposed to self-quarantine himself was seen roaming around the Majestic area. He was looking for hotels to stay in. When he found them closed, he came near Upparpet police station. Police sources said it took them an hour to reach 104 and get an ambulance to send him to a hospital.","date":"2020-03-22 09:54:39","pin":"0","status":"0"},{"title":"Goa beaches, streets empty as people support 'Janata curfew'","content":"<ul>\n    <li>Except for the essential services, everything else including bus services, commercial establishments, restaurants, markets and places of worship were shut and people remained inside their homes.<\/li>\n    <li>The Goa Church cancelled its Sunday masses all over the coastal state to avoid crowding.  Prominent temples, including the Mangueshi temple, the Mahalsa Narayani temple at Mardol and the Kamakshi temple in North Goa district were shut.<\/li>\n<\/ul>","date":"2020-03-22 09:56:35","pin":"0","status":"1"},{"title":"Empty streets in Imphal","content":"<blockquote class=\"twitter-tweet\">\n<p lang=\"en\" dir=\"ltr\">Manipur: Empty streets in Imphal as people observe <a href=\"https:\/\/twitter.com\/hashtag\/JantaCurfew?src=hash&ref_src=twsrc%5Etfw\">#JantaCurfew<\/a> <a href=\"https:\/\/t.co\/8wX1h6hgDc\">pic.twitter.com\/8wX1h6hgDc<\/a><\/p>\n— ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1241581332439826437?ref_src=twsrc%5Etfw\">March 22, 2020<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2020-03-22 09:57:55","pin":"0","status":"1"},{"title":"263 Indian students from Rome land at Delhi airport","content":"<blockquote class=\"twitter-tweet\">\n<p lang=\"en\" dir=\"ltr\">The special Air India flight carrying 263 Indian students that took off from Rome landed at Delhi airport at 9.15 AM today. All 263 evacuees to be taken to ITBP Chhawla Quarantine Facility in Delhi, after thermal screening and immigration at the airport. <a href=\"https:\/\/twitter.com\/hashtag\/Coronavirus?src=hash&ref_src=twsrc%5Etfw\">#Coronavirus<\/a> <a href=\"https:\/\/t.co\/KdgHOwXFlH\">pic.twitter.com\/KdgHOwXFlH<\/a><\/p>\n— ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1241585830293987328?ref_src=twsrc%5Etfw\">March 22, 2020<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2020-03-22 10:30:46","pin":"0","status":"1"},{"title":"South wears deserted look as curfew kicks in","content":"<blockquote class=\"twitter-tweet\" data-conversation=\"none\">\n<p lang=\"en\" dir=\"ltr\"><a href=\"https:\/\/twitter.com\/hashtag\/JanataCurfew?src=hash&ref_src=twsrc%5Etfw\">#JanataCurfew<\/a> comes into full force: Snapshots of South India's busy roads wearing a deserted look on <a href=\"https:\/\/twitter.com\/hashtag\/JanataCurfewMarch22?src=hash&ref_src=twsrc%5Etfw\">#JanataCurfewMarch22<\/a>. <br \/>\nFollow LIVE updates on <a href=\"https:\/\/twitter.com\/hashtag\/COVID19outbreak?src=hash&ref_src=twsrc%5Etfw\">#COVID19outbreak<\/a> here: <a href=\"https:\/\/t.co\/QsWCvNMtWN\">https:\/\/t.co\/QsWCvNMtWN<\/a> <a href=\"https:\/\/t.co\/bzCzbfA74M\">pic.twitter.com\/bzCzbfA74M<\/a><\/p>\n— The New Indian Express (@NewIndianXpress) <a href=\"https:\/\/twitter.com\/NewIndianXpress\/status\/1241583774090948610?ref_src=twsrc%5Etfw\">March 22, 2020<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2020-03-22 10:33:34","pin":"0","status":"1"},{"title":"Deserted roads in Hyderabad as people observe 'Janata Curfew'","content":"<p>Citizens remained indoors at several places in the city and across the state from Sunday morning after, Telangana Chief Minister K Chandrasekhar Rao on Saturday called for a 24-hour voluntary curfew from 6 am on March 22 to combat the spread of the coronavirus.  Roads wore a deserted look at many places even as shops and eateries also remained closed in the state.  State-run Telangana State Road Transport Corporation (TSRTC) buses were not operating even as the Hyderabad Metro Rail remained closed, but five trains have been kept on stand-by to attend to any emergency.<\/p>","date":"2020-03-22 10:36:00","pin":"0","status":"1"},{"title":"Home-quaranine sealed man found roaming in Bengaluru's Majestic area","content":"<ul>\n    <li>A 32-year-old man hailing from Chennai was seen roaming around Majestic area to search for a lodge, early on Sunday morning. The man returned from Dubai on Saturday night and the airport authorities had put the seal of home quarantine on his hand, indicating that he had to stay isolated at home.<\/li>\n    <li>The man was noticed by news channel reporters and Upparpet police were alerted. He then came to the police station and was sent to KC Genaral hospital with an ambulance.<\/li>\n    <li>The police said that \"We enquired with him and came to know that he was asked to stay in a room for 14 days and thus he was searching for a room using a mobile app. He wanted to go to his native Chennai and since there was no bus, train or flight he came to book a room in Majestic\".<\/li>\n<\/ul>","date":"2020-03-22 10:38:34","pin":"0","status":"1"},{"title":"Number of confirmed cases reach 324 in India","content":"Number of Coronavirus cases in India rises to 324: Ministry of Health and Family Welfare.","date":"2020-03-22 10:40:43","pin":"0","status":"1"},{"title":"SSLC Exams postponed in Karnataka","content":"<blockquote class=\"twitter-tweet\">\n<p lang=\"en\" dir=\"ltr\">Karnataka Education Minister <a href=\"https:\/\/twitter.com\/nimmasuresh?ref_src=twsrc%5Etfw\">@nimmasuresh<\/a> announces that the SSLC examination for students in the state will be postponed as per instructions from the CM in the wake of <a href=\"https:\/\/twitter.com\/hashtag\/COVID19outbreak?src=hash&ref_src=twsrc%5Etfw\">#COVID19outbreak<\/a>.<a href=\"https:\/\/twitter.com\/XpressBengaluru?ref_src=twsrc%5Etfw\">@XpressBengaluru<\/a> <a href=\"https:\/\/t.co\/swJaNwIySQ\">pic.twitter.com\/swJaNwIySQ<\/a><\/p>\n— The New Indian Express (@NewIndianXpress) <a href=\"https:\/\/twitter.com\/NewIndianXpress\/status\/1241579878949900288?ref_src=twsrc%5Etfw\">March 22, 2020<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2020-03-22 10:44:05","pin":"0","status":"1"},{"title":"J&K Man flees hospital when asked to test for coronavirus","content":"<p>A man with travel history to Saudi Arabia fled from a hospital in Srinagar on Saturday after doctors advised him to undergo few tests, including for coronavirus, but was immediately traced and sent to quarantine, officials said.  The man, a resident of Padshahi Bagh area of the city, was advised by the district authorities to visit the hospital as a precautionary measure.  He ran away after doctors at the CD hospital here asked him to undergo a chest X-Ray and other tests, including one for coronavirus.  They said the hospital authorities took up the matter with the district administration and the man was immediately traced and sent to quarantine.<\/p>","date":"2020-03-22 10:45:26","pin":"0","status":"1"},{"title":"Karnataka's Udupi wears deserted look","content":"<blockquote class=\"twitter-tweet\">\n<p lang=\"en\" dir=\"ltr\">Follow <a href=\"https:\/\/twitter.com\/XpressBengaluru?ref_src=twsrc%5Etfw\">@XpressBengaluru<\/a> to get <a href=\"https:\/\/twitter.com\/hashtag\/TNIEupdatesOnCovid19?src=hash&ref_src=twsrc%5Etfw\">#TNIEupdatesOnCovid19<\/a><br \/>\n<br \/>\nUdupi wears deserted look<br \/>\n<br \/>\nVideo <a href=\"https:\/\/twitter.com\/prakash_TNIE?ref_src=twsrc%5Etfw\">@prakash_TNIE<\/a> <a href=\"https:\/\/twitter.com\/NewIndianXpress?ref_src=twsrc%5Etfw\">@NewIndianXpress<\/a> <a href=\"https:\/\/twitter.com\/santwana99?ref_src=twsrc%5Etfw\">@santwana99<\/a> <a href=\"https:\/\/t.co\/BtzWPjdCtE\">pic.twitter.com\/BtzWPjdCtE<\/a><\/p>\n— TNIE Karnataka (@XpressBengaluru) <a href=\"https:\/\/twitter.com\/XpressBengaluru\/status\/1241583698681696257?ref_src=twsrc%5Etfw\">March 22, 2020<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2020-03-22 10:46:08","pin":"0","status":"1"},{"title":"Pune man with 'home quarantine' stamp detrained, sent to hospital","content":"<ul>\n    <li>A 28-year-old man with the 'home quarantine' stamp on his hand was deboarded from a Bangalore-bound train at Daund station in Pune district on Saturday, a railway official said.  The man had arrived in Mumbai from Qatar in the early hours of Saturday, the official said.  At the Mumbai airport, he was asked to be in home isolation for 14 days, and stamped on his left hand with a seal saying \"home quarantined\".<\/li>\n    <li>\"We received a call about such a passenger being onboard the train around 12.  30 pm.  He was examined by doctors.  His condition was fine, with no symptoms of coronavirus like cough, cold, body pain and headache,\" said Samuel Clifton, the station superintendent, Daund.<\/li>\n    <li>The man was on his way to his hometown Gulbarga in Karnataka, Clifton said.  \"He was sent to Naidu Hospital in Pune.  The coach in which he was traveling was fully sanitized and locked,\" the superintendent said.<\/li>\n<\/ul>","date":"2020-03-22 10:49:28","pin":"0","status":"1"},{"title":"Latest scenes from Dehradun","content":"<blockquote class=\"twitter-tweet\">\n<p lang=\"en\" dir=\"ltr\">Dehradun in Uttarakhand wears a deserted look as people observe self-imposed <a href=\"https:\/\/twitter.com\/hashtag\/JantaCurfew?src=hash&ref_src=twsrc%5Etfw\">#JantaCurfew<\/a>, amid rising Coronavirus cases in the country. <a href=\"https:\/\/t.co\/F2gZYIEeqi\">pic.twitter.com\/F2gZYIEeqi<\/a><\/p>\n— ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1241593592755314688?ref_src=twsrc%5Etfw\">March 22, 2020<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2020-03-22 10:50:11","pin":"0","status":"1"},{"title":"170 visitors from Nepal denied entry into India","content":"<p>West Bengal Tourism Minister Goutam Deb said a total of 170 people were not allowed to enter India from Nepal on Saturday after thermal screening.  Though the India-Nepal border in Panitanki area in Darjeeling district is open, visitors to both the countries are being screened in wake of the novel coronavirus outbreak, he said at a press conference here.  Deb said visitors to Nepal from India are also being screened.  He urged people returning from abroad to get their health examined and go in home quarantine, failing which strict action will be taken against them.<\/p>","date":"2020-03-22 10:56:34","pin":"0","status":"1"},{"title":"International passenger traffic at Mumbai airport declines sharply by up to 70 pc in March","content":"<p>The AAI-GVK group-run Mumbai's Chhatrapati Shivaji Maharaj International Airport handles 950-980 arrivals and departures per day with around 200-250 of them international.  The coronavirus pandamic has wreaked a havoc across the world, impacting airline industry severely along with other segments of the economy.  It has forced the airlines world over to shut flights and passenger to cancel their trips.<\/p>","date":"2020-03-22 10:59:35","pin":"0","status":"1"},{"title":"India registers fifth coronavirus death","content":"The 63-year-old man died at HN Reliance hospital. He was was admitted on March 19. He had a chronic history of diabeties, high blood pressure and ischemic heart disease. He also developed Acute Respiratory Distress Syndrome, leading to his death. As of now, there are total 74 cases in the state as of now. New 10 cases came positive on Sunday. Out of which, six are in Mumbai and four at Pune, five travel history, four contacts of earlier cases.","date":"2020-03-22 11:02:40","pin":"0","status":"1"},{"title":"Trains suspeended at the Kalka-Shimla Heritage line","content":"<blockquote class=\"twitter-tweet\">\n<p lang=\"en\" dir=\"ltr\">Himachal Pradesh: Trains have been suspended by the Northern Railway on Kalka-Shimla Heritage line, in view of <a href=\"https:\/\/twitter.com\/hashtag\/JantaCurfew?src=hash&ref_src=twsrc%5Etfw\">#JantaCurfew<\/a> <a href=\"https:\/\/t.co\/K8dC2P7428\">pic.twitter.com\/K8dC2P7428<\/a><\/p>\n— ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1241597172866363392?ref_src=twsrc%5Etfw\">March 22, 2020<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2020-03-22 11:14:17","pin":"0","status":"1"},{"title":"'Janata Curfew' brings Puducherry to a standstill","content":"<ul>\n    <li>The local bus terminals, railway stations and municipal markets wore a deserted look.  The entire stretch of beach road which is normally teeming with people, tourists and others was out of bounds for the people as the government had closed the road till end of this month.  Vegetable markets and other outlets suspended their business.<\/li>\n    <li>The territorial government had already declared closure of all retail outlets selling liquor, arrack and toddy in Puducherry and outlying regions of Karaikal, Mahe and Yanam which are traditionally wet pockets.<\/li>\n    <li>All temples, Aurobindo Ashram, Bharathi park and tourist centric boat houses were closed and there was restriction on visitors in several other places of worship.<\/li>\n<\/ul>","date":"2020-03-22 11:34:00","pin":"0","status":"1"},{"title":"Mumbai's Juhu Beach wears deserted look ","content":"<blockquote class=\"twitter-tweet\">\n<p lang=\"en\" dir=\"ltr\">Maharashtra: Juhu Beach in Mumbai wears a deserted look as people observe self-imposed <a href=\"https:\/\/twitter.com\/hashtag\/JantaCurfew?src=hash&ref_src=twsrc%5Etfw\">#JantaCurfew<\/a>, amid rising Coronavirus cases in the country. <a href=\"https:\/\/t.co\/OaUAcQHSgb\">pic.twitter.com\/OaUAcQHSgb<\/a><\/p>\n— ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1241601998165663748?ref_src=twsrc%5Etfw\">March 22, 2020<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2020-03-22 11:35:21","pin":"0","status":"1"},{"title":"Latest updates from Chennai","content":"<ul>\n    <li>The Chennai City Corporation, from Saturday night, have undertaken one of their biggest simultaneous rescue operations for homeless individuals in the city with the help of volunteers from NGOs. Around 2000 rescued individuals are given accommodation , food, snacks and facilities to take a bath until the curfew comes to an end.<\/li>\n    <li>Corporation officials noted that a large number of people that approached them where those stranded due to the cancellation of buses and trains and those asked to vacate by lodges.   Many interior streets and narrow lanes of the city, especially in north chennai, pose a deserted look.<\/li>\n    <li>As even small provisions stories are closed, people are not stepping out for anything.    Meanwhile, activists alleged that cops had started told to shut down all the markets in Chromepet and nearby areas yesterday evening itself, even though the curfew was only today.  This has resulted in many residential localities running short of essential items including diary.<\/li>\n    <li>“There was no curfew yesterday but police patrol vehicles in sounding speakers told everyone to shut the market yesterday evening itself, when hundreds of people were buying things,” alleged civic activist David Manohar.<\/li>\n<\/ul>","date":"2020-03-22 11:39:36","pin":"0","status":"1"},{"title":"Wedlock distribute sanitizer before getting blessings from guest in a very less gathering marriage in Tiruchy","content":"<p><img src=\"https:\/\/images.newindianexpress.com\/images\/liveimages\/Chennai Janata Curfew-collage (1).jpg\" width=\"500\" height=\"250\" alt=\"\" \/> <\/p>","date":"2020-03-22 11:46:27","pin":"0","status":"1"},{"title":"Congress leader, wife test negative","content":"Congress leader Jitin Prasada and his wife Neha Prasada have tested negative for Coronavirus. Jitin had put himself under self-quarantine earlier, as he was present in the party attended by singer Kanika Kapoor who has tested positive for COVID-19.","date":"2020-03-22 11:48:56","pin":"0","status":"1"},{"title":"Curfew-like restrictions in Kashmir","content":"<ul>\n    <li>Only government and essential services employees with valid identity cards and emergency cases were allowed to move \"Strict curfew-like restrictions on the movement and assembly of people were imposed across all districts of the Kashmir valley on Sunday morning,\" officials said.<\/li>\n    <li>They said the deployment of security forces was strengthened and more barricades, including concertina wire, were put up at several places across the valley, including in the city here, to enforce the restrictions.  Inspector General of Police (IGP), Kashmir, Vijay Kumar had said on Saturday that extra security forces will be deployed across the valley to ensure that strict restrictions are imposed.<\/li>\n    <li>\"It may be Janata curfew by name, but the history of Kashmir is such that whatever the situation is, the restrictions cannot be imposed without the police or security forces enforcing them,\" he told reporters at a press conference.<\/li>\n    <li>At several places across the valley on Saturday night, the police used vehicles fitted with public address systems to announce the restrictions on Sunday and appealed the people to stay indoors.<\/li>\n    <li>The police also appealed the people on Twitter to observe the curfew.  On Sunday morning also, police vehicles were used to announce strict restrictions, the officials said.  Markets across the valley were shut and public transport was off the roads, they said.  Train services also remained suspended, they added.<\/li>\n<\/ul>","date":"2020-03-22 11:50:06","pin":"0","status":"1"},{"title":"347 positve cases so far, Bihar registers India's sixth death","content":"<ul>\n    <li>341 tested positive for Coronavirus in India, said Indian Council of Medical Research.  \"A 38-year-old man has passed away in Bihar due to kidney failure; he has been tested positive for COVID-19.<\/li>\n    <li>He was from Munger. He died at AIIMS in Patna on Saturday; had returned from Kolkata two days back,\" said Dr. Prabhat Kumar Singh, AIIMS Patna, Bihar.<\/li>\n    <li>Tamil Nadu also registered one more case, taking the confirmed cases in state to seven<\/li>\n<\/ul>","date":"2020-03-22 12:10:20","pin":"0","status":"1"},{"title":"WATCH | Goa wears deserted look during 'Janta Curfew'","content":"<blockquote class=\"twitter-tweet\">\n<p lang=\"en\" dir=\"ltr\"><a href=\"https:\/\/twitter.com\/hashtag\/WATCH?src=hash&ref_src=twsrc%5Etfw\">#WATCH<\/a> Beaches, streets, markets in Goa's Panaji wear a deserted look as the public observes <a href=\"https:\/\/twitter.com\/hashtag\/JantaCurfew?src=hash&ref_src=twsrc%5Etfw\">#JantaCurfew<\/a> <a href=\"https:\/\/t.co\/AZUeEQlgkc\">pic.twitter.com\/AZUeEQlgkc<\/a><\/p>\n— ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1241614896657313792?ref_src=twsrc%5Etfw\">March 22, 2020<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2020-03-22 12:13:49","pin":"0","status":"1"},{"title":"Trinamool asks its MPs to withdraw from Parliament","content":"<p>Trinamool asks its MPs to withdraw from Parliament and return to their constituencies in view of coronavirus.   \"Around 44 per cent of MPs in Rajya Sabha, 22 per cent in Lok Sabha above 65 years; conflicting message from government dangerous\", TMC to presiding officers of both Houses on coronavirus<\/p>","date":"2020-03-22 12:24:30","pin":"0","status":"1"},{"title":"Cases registered against gym owners for flouting Delhi government order","content":"<ul>\n    <li>Two gym onwers -- Kanhaiya Lal and Vishal, both residents of Madipur, Punjabi Bagh have been arrested and action against rest of the owners is being taken.  Four FIRs have been registered against the owners for operating gyms in West Delhi areas of Punjabi Bagh, Moti Nagar and Kirti Nagar despite government orders, police said.<\/li>\n    <li>The FIRs have been registered with a view to deter the violation of orders promulgated by the government for the purpose of prevention and control of epidemic disease Coronavirus in Delhi, said Deputy Commissioner of Police (West) Deepak Purohit.<\/li>\n    <li>According to a Delhi government order issued in the wake of coronavirus, operation of gyms and spas were suspended till March 31.<\/li>\n<\/ul>","date":"2020-03-22 12:28:43","pin":"0","status":"1"},{"title":"More on the seventh case in Tamil Nadu","content":"<p>Health Minister C Vijayabaskar confirmed the case on Sunday on Twitter. The tweet said,\"A traveller from Spain tests COVID-19 positive. Patient is undergoing treatment in Isolation\".  The State had confirmed three cases yesterday. With one more new case the confirmed cases increased to Seven including one recovered from COVID-19 in Tamil Nadu.<\/p>","date":"2020-03-22 12:29:40","pin":"0","status":"1"},{"title":"WATCH | Foreign returned in Bengaluru was seen roaming around the Majestic area","content":"<blockquote class=\"twitter-tweet\">\n<p lang=\"en\" dir=\"ltr\">One returnee from abroad who had arrived at Bengaluru was supposed to self-quarantine himself but was seen roaming around the Majestic area. He came near the came near Upparpet police station as he found all the hotels were closed. <a href=\"https:\/\/twitter.com\/XpressBengaluru?ref_src=twsrc%5Etfw\">@XpressBengaluru<\/a> <a href=\"https:\/\/t.co\/unAgDp2TdP\">pic.twitter.com\/unAgDp2TdP<\/a><\/p>\n— The New Indian Express (@NewIndianXpress) <a href=\"https:\/\/twitter.com\/NewIndianXpress\/status\/1241609319998619648?ref_src=twsrc%5Etfw\">March 22, 2020<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2020-03-22 12:32:51","pin":"0","status":"1"},{"title":"Another Chandigarh resident tests positive","content":"<ul>\n    <li>A young male, a resident of Chandigarh, was the secondary contact of the city's first coronavirus patient and was positive for coronavirus, said an official statement of UT Chandigarh Administration.  \"Uptill now, the total number of positive cases in Chandigarh is six,\" the statement said, adding the condition of all patients was stable.<\/li>\n    <li>A 23-year-old woman, who returned from London, was the city's first positive case for coronavirus.<\/li>\n    <li>Later, her mother, brother and cook had also tested positive for the deadly infection.  Besides, a 26-year-old woman, who also had travel history to London, was Chandigarh's fifth person who had tested positive for coronavirus.<\/li>\n    <li>At present, as many as 203 persons in Chandigarh have been home quarantined, the statement said.<\/li>\n<\/ul>","date":"2020-03-22 12:37:00","pin":"0","status":"1"},{"title":"No Passenger trains till March 31","content":"Only goods trains will run from March 22 midnight till March 31 midnight: Railways","date":"2020-03-22 13:12:27","pin":"0","status":"1"},{"title":"Train cancelled, markets shut as people in Arunachal Pradesh join 'Janata Curfew'","content":"<ul>\n    <li>State capital Itanagar wore a deserted look as all the usually-busy arterial roads remained empty with people choosing to stay indoors.  A few police and media vehicles were seen in the city, besides those of the essential services.  Markets and standalone stores in the city and the districts remained shut, barring a few pharmacies, in response to the 14-hour voluntary curfew that began at 7 am.<\/li>\n    <li>The Capital Police, except those on essential duties, have joined the curfew, superintendent of police Tumme Amo said.  The North East Frontier Railway has also cancelled the Naharlagun-Guwahati Donyi Polo Intercity Express for the day, officials said.<\/li>\n<\/ul>","date":"2020-03-22 13:13:53","pin":"0","status":"1"},{"title":"Holidays in J&K from March 23-25","content":"<blockquote class=\"twitter-tweet\">\n<p lang=\"en\" dir=\"ltr\">Ongoing COVID19 pandemic; Govt declares holiday in all offices on March 23. March 24 and March 25 are holidays. Essential services to continue undisturbed: Rohit Kansal, Principal Secretary, Planning, Jammu & Kashmir (file pic) <a href=\"https:\/\/t.co\/PWKls2Mk6v\">pic.twitter.com\/PWKls2Mk6v<\/a><\/p>\n— ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1241619858896216064?ref_src=twsrc%5Etfw\">March 22, 2020<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2020-03-22 13:15:23","pin":"0","status":"1"},{"title":"Greater Noida man, who returned from Dubai, tests positive for coronavirus","content":"<ul>\n    <li>The man stays in Sector Alpha 1, which has been locked down by the district administration for 48 hours to sanitise the area and all residents have been asked to stay indoors, the officials said.<\/li>\n    <li>\"The man had returned from Dubai.  He was tested on March 18 and the results came on Saturday evening, which turned out to be positive.  He has been admitted at the Government Institute of Medical Sciences (GIMS),\" Chief Medical Officer Anurag Bhargava said.<\/li>\n<\/ul>","date":"2020-03-22 13:15:56","pin":"0","status":"1"},{"title":"Air India sends its crew of Rome flight to home quarantine","content":"Air India crew who evacuated Indians citizens from Rome, Italy on Sunday have been advised home quarantine as per the established norms of the company: Official","date":"2020-03-22 13:38:20","pin":"0","status":"1"},{"title":"Delhi Airport issues statement on the current situation in its premises","content":"\"We are anticipating higher passenger arrivals between 12 noon and 4 pm from various destinations at Delhi Airport. This may result in a longer wait time. We would like to request friends & relatives of arriving passengers to plan accordingly,\" the statement said.","date":"2020-03-22 13:39:35","pin":"0","status":"1"},{"title":"Netflix, Amazon and other OTT platforms asked to lower video streaming quality","content":"<p> In two separate letters sent to the Department of Telecom (DoT) and OTT (over-the-top) streaming platforms, the Cellular Operators Association of India (COAI) said that the increasing number of people working from home and the rise in digital services usage \"is already putting pressure on the network infrastructure\".<\/p>\n<p><a href=\"https:\/\/www.newindianexpress.com\/business\/2020\/mar\/22\/covid-19-netflix-amazon-and-other-ott-platforms-asked-to-lower-video-streaming-quality-2120136.html\" target=\"_blank\"><strong>READ FULL STORY HERE<\/strong><\/a><\/p>","date":"2020-03-22 13:39:39","pin":"0","status":"1"},{"title":"Train services suspended in Mumbai","content":"<blockquote class=\"twitter-tweet\">\n<p lang=\"en\" dir=\"ltr\"><a href=\"https:\/\/twitter.com\/hashtag\/WATCH?src=hash&ref_src=twsrc%5Etfw\">#WATCH<\/a> Train services suspended, roads free from traffic as citizens of Mumbai observe <a href=\"https:\/\/twitter.com\/hashtag\/JantaCurfew?src=hash&ref_src=twsrc%5Etfw\">#JantaCurfew<\/a> announced by Prime Minister Narendra Modi <a href=\"https:\/\/t.co\/fkYYb381W6\">pic.twitter.com\/fkYYb381W6<\/a><\/p>\n— ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1241637053273640960?ref_src=twsrc%5Etfw\">March 22, 2020<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2020-03-22 13:40:12","pin":"0","status":"1"},{"title":"Chemical bomb hurled at Shaheen Bagh protest site as India observes Janata Curfew","content":"<p>The protesters who refused to call off the protest even after huge criticism, in the wake of Coronavirus, were also observing Janata Curfew. “Around 10 AM, some miscreants threw a chemical bomb at the protest site from behind the barricades. It was not petrol but some kind of chemical that led to fire. However, no one was injured,” senior volunteer at Shaheen Bagh, Syed Taseer Ahmed told this newspaper. <\/p>\n<p><strong><a href=\"https:\/\/www.newindianexpress.com\/cities\/delhi\/2020\/mar\/22\/chemical-bomb-hurled-at-shaheen-bagh-protest-site-as-india-observes-janata-curfew-for-covid-19-2120143.html\" target=\"_blank\">READ FULL REPORT HERE<\/a> <\/strong><\/p>","date":"2020-03-22 14:02:03","pin":"0","status":"1"},{"title":"TN govt extends Janata curfew to 5 AM on Monday","content":"<p>Tamil Nadu Government has extended Sunday’s curfew to 5 am on Monday morning. However, there will be no restrictions for essential services, it said. The curfew, originally set to be from 7 am to 9 PM on Sunday, was called by Prime Minister Narendra Modi in the wake of the Corona pandemic which is in stage 2 of transmission in India.  <\/p>","date":"2020-03-22 14:04:23","pin":"0","status":"1"},{"title":"Mahindra group chairman offers resorts as care facilities","content":"<p><img src=\"https:\/\/images.newindianexpress.com\/images\/liveimages\/Anand Mahindra- Twitter.JPG\" width=\"100%\" style=\"display: none !important;\" alt=\"\" \/> <img src=\"https:\/\/images.newindianexpress.com\/images\/liveimages\/Anand Mahindra- Twitter(1).jpg\" width=\"100%\" alt=\"\" \/><\/p>","date":"2020-03-22 14:22:37","pin":"0","status":"1"},{"title":"75 districts advised to go into lockdown","content":"<p>Centre advises state govts to declare lockdown in 75 districts where Covid-19 reported: Officials <\/p>\n\n<iframe width=\"100%\" height=\"450\" src=\"https:\/\/www.youtube.com\/embed\/g54qccYJj1I\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen><\/iframe>","date":"2020-03-22 14:36:01","pin":"0","status":"1"},{"title":"","content":"<blockquote class=\"twitter-tweet\" data-conversation=\"none\">\n<p lang=\"en\" dir=\"ltr\"><a href=\"https:\/\/twitter.com\/hashtag\/India?src=hash&ref_src=twsrc%5Etfw\">#India<\/a> wears a deserted look, as cities participate in the Janata Curfew urged by PM <a href=\"https:\/\/twitter.com\/narendramodi?ref_src=twsrc%5Etfw\">@narendramodi<\/a>.<br \/>\n<br \/>\nPHOTO|ENS<a href=\"https:\/\/twitter.com\/hashtag\/JantaCurfew?src=hash&ref_src=twsrc%5Etfw\">#JantaCurfew<\/a> <a href=\"https:\/\/twitter.com\/hashtag\/Covid_19india?src=hash&ref_src=twsrc%5Etfw\">#Covid_19india<\/a> <br \/>\n<br \/>\nFollow LIVE updates here: <a href=\"https:\/\/t.co\/bdoSIRBOzx\">https:\/\/t.co\/bdoSIRBOzx<\/a> <a href=\"https:\/\/t.co\/QBGGoE8GeG\">pic.twitter.com\/QBGGoE8GeG<\/a><\/p>\n— The New Indian Express (@NewIndianXpress) <a href=\"https:\/\/twitter.com\/NewIndianXpress\/status\/1241619874394157057?ref_src=twsrc%5Etfw\">March 22, 2020<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2020-03-22 14:43:29","pin":"0","status":"1"},{"title":"Spike in positive cases ","content":"<p>Number of COVID-19 cases climb to 370 in India: Health Ministry <\/p>","date":"2020-03-22 14:57:36","pin":"0","status":"0"},{"title":"Soon 3000 inmates could be released from Punjab prisons due to COVID-19 pandemic","content":"<p>In the wake of the coronavirus pandemic, around 3,000 criminals lodged in different jails of Punjab for petty offences such as fights, snatching, thefts might get parole to make prisons de-congested. Sources said that the Punjab prisons department is contemplating to lift the ban on regular parole to criminals who are behind bars for petty offences. \"The department has identified around 3,000 of such inmates who can be given parole but it is for the courts to decide. No hardcore criminal will be given parole,\" said Additional DGP (Prisons), Punjab, Parveen Kumar Sinha.<\/p>\n<p><strong><a href=\"https:\/\/www.newindianexpress.com\/nation\/2020\/mar\/18\/soon-3000-inmates-could-be-released-from-punjab-prisons-due-to-covid-19-pandemic-2118410.html\" target=\"_blank\">READ FULL REPORT HERE<\/a> <\/strong><\/p>","date":"2020-03-22 15:08:05","pin":"0","status":"1"},{"title":"Wash hands after handling currency notes: Indian Banks Association","content":"<p>: In the wake of the coronavirus outbreak, banking lobby Indian Banks' Association (IBA) has made an appeal to people to wash their hands after touching or counting currency. IBA has also asked customers to use online and mobile banking channels for making their transactions and avoid visiting bank branches as it could pose a risk to banks' front desk staff.<\/p>\n<p><a href=\"https:\/\/www.newindianexpress.com\/business\/2020\/mar\/22\/coronavirus-outbreak-wash-hands-after-handling-currency-notes-indian-banks-association-2120150.html\" target=\"_blank\"><strong>READ FULL REPORT HERE<\/strong><\/a><\/p>","date":"2020-03-22 15:17:30","pin":"0","status":"1"},{"title":"Noida Metro suspended till March 31","content":"<p>Noida-Greater Noida metro, city bus services suspended till March 31 with immediate effect due to coronavirus outbreak: NMRC <\/p>","date":"2020-03-22 15:21:18","pin":"0","status":"1"},{"title":"Metro Services to remain completely closed till 31ST March 2020","content":"<p>Kochi Metro's services will remain suspended till March 31st to combat Corona disease. Kochi Metro Rail Limited has taken the decision pursuant to the directives of both the state and central governments, informed KMRL MD Alkesh Kumar Sharma. The move is aimed at controlling the spread of corona virus by ensuring social distancing and encouraging people to stay at home for the time being. <\/p>","date":"2020-03-22 15:33:40","pin":"0","status":"1"},{"title":"Public transport in Karnataka to be suspended till March 31","content":"<p>In Karnataka, Public transportation system will be suspended across state from march 23. All AC buses suspended till March 31.<\/p>\n<p>Starting 9 PM tonight when Janata curfew ends, section 144 will be imposed. Till March 31, only essential services will be allowed in Bengaluru urban and rural, Mangaluru, Mysuru, Kalburgi, Dharwad, Chikkaballapur, Belgaum and Kodagu- 9 districts. All other commercial activities will be shut down. <\/p>","date":"2020-03-22 15:40:09","pin":"0","status":"1"},{"title":"Delhi metro services to be closed till March 31 due to coronavirus: DMRC","content":"<p>As part of the nationwide lockdown to prevent the spread of coronavirus, <strong><a href=\"https:\/\/www.newindianexpress.com\/cities\/delhi\/2020\/mar\/22\/delhi-metro-services-to-be-closed-till-march-31-due-to-coronavirus-dmrc-2120160.html\" target=\"_blank\">Delhi Metro services will remain closed completely<\/a><\/strong> till March 31.<\/p>\n<p>Earlier, Delhi Metro Rail Corporation (DMRC) had announced to curtail services for certain hours on Monday.<\/p>\n<p>\"The move is aimed at controlling the spread of coronavirus by ensuring social distancing and encouraging people to stay at home for the time being,\" said a statement issued by Anuj Dayal, Executive Director, Corporate Communications of DMRC.<br \/>\n <\/p>","date":"2020-03-22 15:41:01","pin":"0","status":"1"},{"title":"Maharashtra updates","content":"<ul>\n    <li>The percentage of employees working in govt offices has been brought down to five per cent from 25 per cent. Only the people discharging essential duties will be allowed to use public transport till March 31<\/li>\n    <li>Maharashtra CM has requested everyone to continue Janata Curfew till tomorrow morning. Number of cases has increased considerably.<\/li>\n    <li>Section 144 in Maharashtra. No flights outside of India will be allowed to land in Mumbai: <\/li>\n    <li>All originating long distance Mail\/Express\/Intercity trains, including premium trains&originating passenger trains to remain cancelled till 24:00 hrs of 31 March. Trains which commenced journey prior to 04:00 hrs of 22 March will run up to their destination. <\/li>\n<\/ul>","date":"2020-03-22 15:45:28","pin":"0","status":"1"},{"title":"Gujarat registers first COVID-19 death","content":"<blockquote class=\"twitter-tweet\">\n<p lang=\"en\" dir=\"ltr\">One <a href=\"https:\/\/twitter.com\/hashtag\/COVID19?src=hash&ref_src=twsrc%5Etfw\">#COVID19<\/a> positive patient, male 69 yrs, died today in Surat hospital. He was having co-morbid conditions. One female, 65 years, died in Vadodara hospital but her test report for COVID is awaited. She was also having comorbid conditions: Health & Family Welfare Dept, Gujarat <a href=\"https:\/\/t.co\/ewXKn1TUbK\">pic.twitter.com\/ewXKn1TUbK<\/a><\/p>\n— ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1241670393108152323?ref_src=twsrc%5Etfw\">March 22, 2020<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2020-03-22 16:01:02","pin":"0","status":"1"},{"title":"75 districts of coronavirus-hit states to go into lockdown","content":"<blockquote class=\"twitter-tweet\" data-conversation=\"none\">\n<p lang=\"en\" dir=\"ltr\"><a href=\"https:\/\/twitter.com\/hashtag\/Covid_19india?src=hash&ref_src=twsrc%5Etfw\">#Covid_19india<\/a> | After a high-level meeting with Chief Secretaries of States by Cabinet Secretary and Principal Secretary to PM, Centre and state govts have decided to completely lock down 75 districts where coronavirus cases have been reported.<br \/>\nRead more: <a href=\"https:\/\/t.co\/VY3krCmwWB\">https:\/\/t.co\/VY3krCmwWB<\/a> <a href=\"https:\/\/t.co\/pLlwY1zjGe\">pic.twitter.com\/pLlwY1zjGe<\/a><\/p>\n— The New Indian Express (@NewIndianXpress) <a href=\"https:\/\/twitter.com\/NewIndianXpress\/status\/1241674464774873088?ref_src=twsrc%5Etfw\">March 22, 2020<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2020-03-22 16:09:38","pin":"0","status":"1"},{"title":"Outsiders to be isolated; virus not present in air","content":"<p>To break the chain of transmission, the easiest method is to isolate the people coming from outside. The virus is not present in the air, it can be transmitted through droplets released: ICMR <\/p>","date":"2020-03-22 16:12:38","pin":"0","status":"1"},{"title":"5 PM for 5 minutes: PM Modi","content":"<blockquote class=\"twitter-tweet\">\n<p lang=\"en\" dir=\"ltr\">Do remember,<br \/>\n<br \/>\n5 PM this evening for 5 minutes...<br \/>\n<br \/>\nBe on your terraces, balconies or windows to express gratitude to all those who are working 24\/7 so that our nation becomes free from COVID-19. <a href=\"https:\/\/twitter.com\/hashtag\/JantaCurfew?src=hash&ref_src=twsrc%5Etfw\">#JantaCurfew<\/a> <a href=\"https:\/\/t.co\/Cwds0v4cJ8\">pic.twitter.com\/Cwds0v4cJ8<\/a><\/p>\n— Narendra Modi (@narendramodi) <a href=\"https:\/\/twitter.com\/narendramodi\/status\/1241673542506180610?ref_src=twsrc%5Etfw\">March 22, 2020<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2020-03-22 16:14:48","pin":"0","status":"1"},{"title":"80% will recover: ICMR","content":"<p>It is essential to understand the ailment. 80% of the people will experience cold-like fever & they will recover. 20% may experience cough, cold, fever & some of them may be needed to be admitted to hospital. The 5% who get admitted to the hospital are given supportive treatment and in some cases, new medicines are being given: ICMR <\/p>","date":"2020-03-22 16:21:55","pin":"0","status":"1"},{"title":"Seven districts in Kerala to be locked down till March 31","content":"<p>The decision was announced by the Center on Sunday after Cabinet Secretary reviewed Covid-19 status with Chief Secretaries of states.<\/p>\n<p>Thiruvananthapuram, Ernakulam, Kottayam, Pathanamthitta,  Malappuram, Kasaragod and Kannur are the districts which will be going for a shutdown from Monday. <\/p>\n<p><strong><a href=\"https:\/\/www.newindianexpress.com\/states\/kerala\/2020\/mar\/22\/seven-districts-in-kerala-to-be-locked-down-till-march-31-2120168.html\" target=\"_blank\">READ FULL REPORT HERE<\/a> <\/strong><\/p>","date":"2020-03-22 16:23:24","pin":"0","status":"1"},{"title":"Section 144 in New Delhi from 9 PM on March 22 ","content":"<p>In wake of the  Coronavirus outbreak, Section 144 of CrPC to be imposed in Delhi with effect from 9 pm on March 22 to 12 midnight of March 31. <\/p>","date":"2020-03-22 16:25:48","pin":"0","status":"1"},{"title":"","content":"<blockquote class=\"twitter-tweet\">\n<p lang=\"en\" dir=\"ltr\">These are the group of doctors at Ripon Builndings who are behind the Chennai Corporation‘a 24\/7 helpline number 044 - 2538 4520, answering your calls. <a href=\"https:\/\/twitter.com\/xpresstn?ref_src=twsrc%5Etfw\">@xpresstn<\/a> <a href=\"https:\/\/twitter.com\/NewIndianXpress?ref_src=twsrc%5Etfw\">@NewIndianXpress<\/a> <a href=\"https:\/\/twitter.com\/hashtag\/CoronaUpdatesInIndia?src=hash&ref_src=twsrc%5Etfw\">#CoronaUpdatesInIndia<\/a> <a href=\"https:\/\/twitter.com\/hashtag\/Covid19?src=hash&ref_src=twsrc%5Etfw\">#Covid19<\/a> <a href=\"https:\/\/t.co\/mFldNEGsLT\">pic.twitter.com\/mFldNEGsLT<\/a><\/p>\n— Omjasvin M D (@omjasvinMD) <a href=\"https:\/\/twitter.com\/omjasvinMD\/status\/1241670627280347136?ref_src=twsrc%5Etfw\">March 22, 2020<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2020-03-22 16:26:20","pin":"0","status":"1"},{"title":"Prabhas in self-quarantine after returning from film's shoot abroad","content":"<p>South superstar Prabhas has announced that he is in self-quarantine in the wake of the coronavirus pandemic. In a short statement posted on Twitter, the \"Baahubali\" actor said he recently returned from Georgia after completing a film's shoot and therefore decided to keep himself insolation.<\/p>\n<p><a href=\"https:\/\/www.newindianexpress.com\/entertainment\/telugu\/2020\/mar\/22\/prabhas-in-self-quarantine-after-returning-from-films-shoot-abroad-2120152.html\" target=\"_blank\"><strong>READ FULL REPORT HERE<\/strong><\/a><\/p>","date":"2020-03-22 16:29:01","pin":"0","status":"1"},{"title":"Salman Khan asks fans to take coronavirus threat seriously, says lockdown is not public holiday","content":"<blockquote class=\"twitter-tweet\">\n<p lang=\"und\" dir=\"ltr\"><a href=\"https:\/\/twitter.com\/hashtag\/IndiaFightsCorona?src=hash&ref_src=twsrc%5Etfw\">#IndiaFightsCorona<\/a> <a href=\"https:\/\/twitter.com\/CMOMaharashtra?ref_src=twsrc%5Etfw\">@CMOMaharashtra<\/a> <a href=\"https:\/\/twitter.com\/mybmc?ref_src=twsrc%5Etfw\">@mybmc<\/a> <a href=\"https:\/\/twitter.com\/AUThackeray?ref_src=twsrc%5Etfw\">@AUThackeray<\/a> <a href=\"https:\/\/twitter.com\/Iamrahulkanal?ref_src=twsrc%5Etfw\">@Iamrahulkanal<\/a> <a href=\"https:\/\/t.co\/l9qPAPs88U\">pic.twitter.com\/l9qPAPs88U<\/a><\/p>\n— Salman Khan (@BeingSalmanKhan) <a href=\"https:\/\/twitter.com\/BeingSalmanKhan\/status\/1241462024481067008?ref_src=twsrc%5Etfw\">March 21, 2020<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>\n\n<p style=\"text-align: justify;\"><a href=\"https:\/\/www.newindianexpress.com\/entertainment\/hindi\/2020\/mar\/22\/salman-khan-asks-fans-to-take-coronavirus-threat-seriously-says-lockdown-is-not-public-holiday-2120156.html\" target=\"_blank\"><strong>READ FULL REPORT<\/strong><\/a><\/p>","date":"2020-03-22 16:30:00","pin":"0","status":"1"},{"title":"10,000 tests per day: ICMR","content":"<p>We have conducted 15,000-17,000 tests so far. We have the capacity to conduct 10,000 tests per day, it means we can conduct 50,000-70,000 per week. 60 private labs have registered so far to conduct COVID-19 tests: ICMR<\/p>","date":"2020-03-22 16:35:28","pin":"0","status":"1"},{"title":"Jharkhand chief secy writes to State Police","content":"<p>Jharkhand Chief Secretary writes to Deputy Police Commissioners and Superintendents of Police of the state asking them to ensure that the situation observed during Janata Curfew is observed after 9 PM too. <\/p>","date":"2020-03-22 16:43:03","pin":"0","status":"1"},{"title":"Non-essential Industries to be shut till March 25 in Vadodra","content":"<p>All industries except involved in essential services will remain closed from tomorrow to March 25 in Vadodara in Gujarat in view of Coronavirus Pandemic. Workers of the affected industries will be given paid leaves: Vadodara District Collector Shalini Agrawal <\/p>","date":"2020-03-22 16:44:52","pin":"0","status":"1"},{"title":"Chandigarh administration notifies a lockdown ","content":"<p>The Chandigarh administration notifies a lockdown in the territorial jurisdiction of the entire Union Territory with effect from 00:00 hours on March 23 to 2400 hours on March 31. All essential commodities and services and their manufacturing, supply chains, required transporter and other logistics to ensure their availability: Health Department  <\/p>","date":"2020-03-22 16:46:22","pin":"0","status":"1"},{"title":"","content":"<blockquote class=\"twitter-tweet\" data-conversation=\"none\">\n<p lang=\"en\" dir=\"ltr\">As the entire nation looked deserted on <a href=\"https:\/\/twitter.com\/hashtag\/JanataCurfew?src=hash&ref_src=twsrc%5Etfw\">#JanataCurfew<\/a>, police personnel in Srinagar beat up a youth who argued with them. <a href=\"https:\/\/twitter.com\/hashtag\/CoronavirusPandemic?src=hash&ref_src=twsrc%5Etfw\">#CoronavirusPandemic<\/a> <a href=\"https:\/\/t.co\/vqUhJoDpMt\">pic.twitter.com\/vqUhJoDpMt<\/a><\/p>\n— The New Indian Express (@NewIndianXpress) <a href=\"https:\/\/twitter.com\/NewIndianXpress\/status\/1241669255881297920?ref_src=twsrc%5Etfw\">March 22, 2020<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2020-03-22 16:49:03","pin":"0","status":"1"},{"title":"One person tested positive in Jodhpur, Rajasthan","content":"<p> One person from Jodhpur has been tested positive for Coronavirus today. Total 26 positive cases have been reported in the state till now: Rohit Singh, Additional Chief Secretary of Rajasthan Health Department<\/p>","date":"2020-03-22 16:53:17","pin":"0","status":"1"},{"title":"WATCH | Delhi roads wear a deserted look, thanks to Janata Curfew","content":"<p><iframe width=\"100%\" height=\"450\" src=\"https:\/\/www.youtube.com\/embed\/IE9RD9Ga5fw\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\"><\/iframe><\/p>","date":"2020-03-22 17:07:47","pin":"0","status":"1"},{"title":"Global updates for COVID-19","content":"<ul>\n    <li>\n    <p>A <strong><a href=\"https:\/\/www.newindianexpress.com\/world\/2020\/mar\/22\/buckingham-palace-royal-aide-tests-covid-19-positive-report-2120161.html\" target=\"_blank\">Buckingham Palace<\/a><\/strong> royal aide has tested positive for the novel coronavirus while Queen Elizabeth II was still at the London residence<\/p>\n    <\/li>\n    <li>\n    <p><strong><a href=\"https:\/\/www.newindianexpress.com\/world\/2020\/mar\/22\/covid-19-eight-indian-sailors-stranded-on-ship-off-uae-appeal-for-help-2120155.html\" target=\"_blank\">Eight Indian sailors<\/a><\/strong> stranded without full wages for nine months aboard a ship off the UAE have appealed for help as three of them have fallen sick<\/p>\n    <\/li>\n    <li>\n    <p><strong><a href=\"https:\/\/www.newindianexpress.com\/world\/2020\/mar\/22\/singapore-to-restrict-short-term-visitors-as-imported-coronavirus-cases-increase-2120167.html\" target=\"_blank\">Singapore will restrict short-term visitors<\/a><\/strong> from entering country due to the heightened risk of the spread of the novel coronavirus as the city-state reported 47 new infections, including 39 imported cases.<\/p>\n    <\/li>\n    <li>\n    <p>France is calling up <strong><a href=\"https:\/\/www.newindianexpress.com\/world\/2020\/mar\/22\/france-to-use-helicopters-drones-to-enforce-coronavirus-restrictions-2120166.html\" target=\"_blank\">helicopters and drones<\/a><\/strong> to boost the government's attempts to keep people in their homes<\/p>\n    <\/li>\n    <li>\n    <p><strong><a href=\"https:\/\/www.newindianexpress.com\/world\/2020\/mar\/22\/iran-says-virus-deaths-up-by-129-bringing-total-to-1685-2120164.html\" target=\"_blank\">Iran<\/a><\/strong> says the new coronavirus has killed another 129 people, raising the death toll to 1,685 amid 21,638 confirmed cases.<\/p>\n    <\/li>\n    <li>\n    <p>Nearly 340 people have been arrested in <strong><a href=\"https:\/\/www.newindianexpress.com\/world\/2020\/mar\/22\/about-340-people-arrested-in-sri-lanka-for-defying-nationwide-curfew-2120144.html\" target=\"_blank\">Sri Lanka for defying a nationwide curfew<\/a><\/strong> imposed by the government to contain the fast-spreading coronavirus pandemic <\/p>\n    <\/li>\n<\/ul>","date":"2020-03-22 17:22:14","pin":"0","status":"1"},{"title":"","content":"<blockquote class=\"twitter-tweet\">\n<p lang=\"en\" dir=\"ltr\">Follow <a href=\"https:\/\/twitter.com\/XpressBengaluru?ref_src=twsrc%5Etfw\">@XpressBengaluru<\/a> to get <a href=\"https:\/\/twitter.com\/hashtag\/TNIEupdatesOnCovid19?src=hash&ref_src=twsrc%5Etfw\">#TNIEupdatesOnCovid19<\/a><br \/>\n<br \/>\nA big applause from an apartment in JP Nagar<br \/>\nVideo by <a href=\"https:\/\/twitter.com\/shrirambn?ref_src=twsrc%5Etfw\">@shrirambn<\/a> <a href=\"https:\/\/twitter.com\/NewIndianXpress?ref_src=twsrc%5Etfw\">@NewIndianXpress<\/a> <a href=\"https:\/\/twitter.com\/santwana99?ref_src=twsrc%5Etfw\">@santwana99<\/a> <a href=\"https:\/\/t.co\/VyeqLZsMXU\">pic.twitter.com\/VyeqLZsMXU<\/a><\/p>\n— TNIE Karnataka (@XpressBengaluru) <a href=\"https:\/\/twitter.com\/XpressBengaluru\/status\/1241694494312919041?ref_src=twsrc%5Etfw\">March 22, 2020<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2020-03-22 17:57:02","pin":"0","status":"1"},{"title":"Delhi to go under complete lockdown from 6 AM on March 23","content":"<p>Delhi government has decided to impose lockdown in Delhi from 6 AM tomorrow (23rd March) to 12 midnight of 31st March 2020: Arvind Kejriwal  <\/p>","date":"2020-03-22 18:49:43","pin":"0","status":"1"},{"title":"Delhi govt has decided to impose lockdown frmo 6 AM on March 23","content":"Though the government order states that all domestic\/international flights arriving to Delhi during the lockdown period will be suspended, the DGCA, which is the deciding authority, has clarified that the flights will continue to operate. <p style=\"text-align: justify;\"><a href=\"https:\/\/www.newindianexpress.com\/cities\/delhi\/2020\/mar\/22\/domestic-flights-will-continue-to-operate-as-usual-from-delhi-airport-dgca-2120194.html\" target=\"_blank\"><strong>READ HERE<\/strong><\/a><\/p>\n\n<p><img src=\"https:\/\/images.newindianexpress.com\/images\/liveimages\/Delhi govt order.jpg\" width=\"100%\" alt=\"\" \/> <\/p>","date":"2020-03-22 18:55:20","pin":"0","status":"1"},{"title":" Lockdown will continue till 12 midnight on March 31","content":"<p> Delhi will be locked down in view of the growing coronavirus threat, from 6 am on March 23, Chief Minister Arvind Kejriwal announced at a joint press conference with Lt Governor Anil Baijal on Sunday.<\/p>\n<p><a href=\"https:\/\/www.newindianexpress.com\/cities\/delhi\/2020\/mar\/22\/delhi-to-be-locked-down-from-march-23-arvind-kejriwal-2120183.html\" target=\"_blank\"><strong>READ FULL REPORT HERE<\/strong><\/a><\/p>","date":"2020-03-22 18:57:39","pin":"0","status":"1"},{"title":"Kerala reports 15 fresh cases, total number of cases rise to 67 ","content":"<blockquote class=\"twitter-tweet\">\n<p lang=\"en\" dir=\"ltr\">15 more Covid19 cases in Kerala, taking the total to 67. 2 each from Ernakulam, Malappuram and Kozhikode. 4 from Kannur. <a href=\"https:\/\/twitter.com\/NewIndianXpress?ref_src=twsrc%5Etfw\">@NewIndianXpress<\/a> <a href=\"https:\/\/twitter.com\/xpresskerala?ref_src=twsrc%5Etfw\">@xpresskerala<\/a><\/p>\n— Rajesh Abraham (@pendown) <a href=\"https:\/\/twitter.com\/pendown\/status\/1241714661398999040?ref_src=twsrc%5Etfw\">March 22, 2020<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>\n<p style=\"text-align: justify;\"><a href=\"https:\/\/www.newindianexpress.com\/states\/kerala\/2020\/mar\/22\/covid-19-15-more-confirmed-cases-in-kerala-decision-on-lockdown-monday-2120188.html\" target=\"_blank\"><strong>READ FULL REPORT HERE<\/strong><\/a><\/p>","date":"2020-03-22 19:18:28","pin":"0","status":"1"},{"title":"","content":"<p><iframe width=\"100%\" height=\"450\" src=\"https:\/\/www.youtube.com\/embed\/eJFaHKMkFI4\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\"><\/iframe><\/p>","date":"2020-03-22 19:30:16","pin":"0","status":"1"},{"title":"First French hospital doctor dies of coronavirus, death toll crosses 500","content":"<p>France on Sunday reported its first death of a hospital doctor from coronavirus. Health Minister Olivier Veran said that as far as he knew the man -- who died on Saturday -- was the \"first hospital doctor to be hit\". The accident and emergency practitioner worked at a hospital in Compiegne, north of Paris, AFP was able to confirm. Veran refused to give any more information about the victim, saying details were being withheld for medical reasons and to respect the wishes of the doctor's family.<\/p>\n<p><a href=\"https:\/\/www.newindianexpress.com\/world\/2020\/mar\/22\/first-french-hospital-doctor-dies-of-coronavirus-death-toll-crosses-500-2120187.html\" target=\"_blank\"><strong>READ FULL REPORT HERE<\/strong><\/a><\/p>","date":"2020-03-22 19:33:14","pin":"0","status":"1"},{"title":"","content":"<blockquote class=\"twitter-tweet\">\n<p lang=\"en\" dir=\"ltr\">CM <a href=\"https:\/\/twitter.com\/ysjagan?ref_src=twsrc%5Etfw\">@ysjagan<\/a> says: This initiative to cost the exchequer about Rs 1500 crore. The financial assistance will be delivered at the doorsteps of the poor by village\/ward volunteers. <a href=\"https:\/\/twitter.com\/hashtag\/AndhraPradesh?src=hash&ref_src=twsrc%5Etfw\">#AndhraPradesh<\/a> <a href=\"https:\/\/twitter.com\/hashtag\/Covid19?src=hash&ref_src=twsrc%5Etfw\">#Covid19<\/a> <a href=\"https:\/\/t.co\/L5dp3N80el\">https:\/\/t.co\/L5dp3N80el<\/a><\/p>\n— Jayanth P (@Jayanth_TNIE) <a href=\"https:\/\/twitter.com\/Jayanth_TNIE\/status\/1241727834470494218?ref_src=twsrc%5Etfw\">March 22, 2020<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2020-03-22 19:43:35","pin":"0","status":"1"},{"title":"WATCH | Naveen Patnaik, OPS join in saluting the corona warriors ","content":"<p><iframe width=\"100%\" height=\"450\" src=\"https:\/\/www.youtube.com\/embed\/t82HRCZLRrY\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\"><\/iframe><\/p>","date":"2020-03-22 20:05:57","pin":"0","status":"1"},{"title":"Karnataka reports five fresh cases","content":"<p><img src=\"https:\/\/images.newindianexpress.com\/images\/liveimages\/WhatsApp Image 2020-03-22 at 20_46_51.jpeg\" width=\"949\" height=\"1280\" alt=\"\" \/> <\/p>","date":"2020-03-22 20:56:29","pin":"0","status":"1"},{"title":"States asked to designate exclusive COVID-19 hospitals","content":"<p>The Centre on Sunday asked states to designate separate hospitals for treating corona virus patients and the first such dedicated facility for COVID 19 patients could be 800 bedded National Cancer Institute in Jhajjar, Haryana under AIIMS, Delhi.<\/p>","date":"2020-03-22 20:59:15","pin":"0","status":"1"},{"title":"Nagaland declares indefinite lockdown","content":"<p>\"All shops and business establishments barring pharmacies, petrol pumps and grocery stores shall remain closed till further orders. All commercial passenger vehicles such as buses, taxis, auto-rickshaws or two-wheeler taxis shall remain off roads,\" Chief Secretary Temjen Toy said.<br \/>\n<strong><a href=\"https:\/\/www.newindianexpress.com\/nation\/2020\/mar\/22\/covid-19-nagaland-declares-indefinite-lockdown-from-sunday-midnight-2120201.html\" target=\"_blank\">READ FULL REPORT HERE<\/a><\/strong><\/p>","date":"2020-03-22 21:07:51","pin":"0","status":"1"},{"title":"Maruti, Honda, Mahindra suspend manufacturing operations ","content":"<p>The country's largest carmaker MSI halted production at its Gurgaon and Manesar plants with immediate effect, while Honda Cars India Ltd decided to suspend manufacturing at its two plants in the country till March 31. Mahindra & Mahindra (M&M) announced to suspend production at its manufacturing plants in Maharashtra. <br \/>\n<strong><a href=\"https:\/\/www.newindianexpress.com\/business\/2020\/mar\/22\/coronavirus-impact-maruti-honda-mahindra-suspend-manufacturing-operations-2120203.html\" target=\"_blank\">READ FULL REPORT HERE<\/a><\/strong><\/p>","date":"2020-03-22 21:17:39","pin":"0","status":"1"},{"title":"Punjab put under lockdown till March 31","content":"<p>In an official notification, Chief Secretary Karan Avtar Singh ordered shutdown of all establishments to break the transmission chain of the highly contagious coronavirus.<br \/>\n<strong><a href=\"https:\/\/www.newindianexpress.com\/nation\/2020\/mar\/22\/punjab-chandigarh-and-seven-districts-in-haryana-under-lock-down-from-tomorrow-2120198.html\" target=\"_blank\">READ FULL REPORT HERE<\/a><\/strong><\/p>","date":"2020-03-22 21:26:50","pin":"0","status":"1"},{"title":"Three more test positive in Kolkata","content":"<p>The three are parents of a UK-returned youth, the second positive case of the deadly infection in the state, and a maid working at their residence in Ballygunge area. <br \/>\n<strong><a href=\"https:\/\/www.newindianexpress.com\/cities\/kolkata\/2020\/mar\/22\/three-test-positive-in-kolkata-total-covid-19-cases-in-bengal-rise-to-seven-2120212.html\" target=\"_blank\">READ FULL REPORT HERE<\/a><\/strong><\/p>","date":"2020-03-22 21:55:54","pin":"0","status":"1"},{"title":"WATCH | Health Ministry's media briefing","content":"<blockquote class=\"twitter-tweet\">\n<p lang=\"en\" dir=\"ltr\"><a href=\"https:\/\/twitter.com\/hashtag\/WATCH?src=hash&ref_src=twsrc%5Etfw\">#WATCH<\/a> Live: Union Health Ministry briefs the media on <a href=\"https:\/\/twitter.com\/hashtag\/CoronavirusPandemic?src=hash&ref_src=twsrc%5Etfw\">#CoronavirusPandemic<\/a>, on 22nd March. <a href=\"https:\/\/t.co\/lkPAudsFHi\">https:\/\/t.co\/lkPAudsFHi<\/a><\/p>\n— ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1241674807696998401?ref_src=twsrc%5Etfw\">March 22, 2020<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2020-03-22 21:58:48","pin":"1","status":"1"},{"title":"Sec 144 imposed in Chhattisgarh ","content":"<blockquote class=\"twitter-tweet\">\n<p lang=\"en\" dir=\"ltr\">Chhattisgarh CM Bhupesh Baghel: Besides essential services all other activities will remain suspended in the state. Section 144 of CrPC will be imposed in the state till March 31. <a href=\"https:\/\/t.co\/Ggh1yZ9K9V\">pic.twitter.com\/Ggh1yZ9K9V<\/a><\/p>\n— ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1241753205647630336?ref_src=twsrc%5Etfw\">March 22, 2020<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2020-03-22 22:09:02","pin":"0","status":"1"},{"title":"Odisha suspends inter-state bus services ","content":"<p>The state government's chief spokesperson on COVID-19, Subroto Bagchi said all inter-state bus services will remain suspended after 11 am on March 23. <br \/>\n<strong><a href=\"https:\/\/www.newindianexpress.com\/states\/odisha\/2020\/mar\/22\/covid-19-odisha-suspends-inter-state-bus-services-2120217.html\" target=\"_blank\">READ FULL REPORT HERE<\/a><\/strong><\/p>","date":"2020-03-22 22:18:20","pin":"0","status":"1"},{"title":"Two more test positive in Tamil Nadu","content":"<blockquote class=\"twitter-tweet\">\n<p lang=\"en\" dir=\"ltr\"><a href=\"https:\/\/twitter.com\/hashtag\/coronaupdate?src=hash&ref_src=twsrc%5Etfw\">#coronaupdate<\/a>: 2 new positive cases of <a href=\"https:\/\/twitter.com\/hashtag\/Covid19?src=hash&ref_src=twsrc%5Etfw\">#Covid19<\/a>. 64 Y F, traveled from California, under isolation at Stanley Med College. 43 Y M, returned from Dubai, under isolation at Tirunelveli Med College. Both the pts are stable. <a href=\"https:\/\/twitter.com\/MoHFW_INDIA?ref_src=twsrc%5Etfw\">@MoHFW_INDIA<\/a> <a href=\"https:\/\/twitter.com\/hashtag\/Vijayabaskar?src=hash&ref_src=twsrc%5Etfw\">#Vijayabaskar<\/a><\/p>\n— Dr C Vijayabaskar (@Vijayabaskarofl) <a href=\"https:\/\/twitter.com\/Vijayabaskarofl\/status\/1241766156324573184?ref_src=twsrc%5Etfw\">March 22, 2020<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2020-03-22 22:19:35","pin":"0","status":"1"},{"title":"Andhra Pradesh reports sixth COVID-19","content":"<p>The 49-year old woman was in close contact with the 65-year-old man, who returned from Mecca in Saudi Arabia and tested positive on Sunday evening.<br \/>\n<strong><a href=\"https:\/\/www.newindianexpress.com\/states\/andhra-pradesh\/2020\/mar\/22\/andhra-pradesh-reports-sixth-covid-19-case-as-visakhapatnam-woman-tests-positive-2120226.html\" target=\"_blank\">READ FULL REPORT HERE<\/a><\/strong><\/p>","date":"2020-03-22 23:00:00","pin":"0","status":"1"},{"title":"Rajasthan to set-up quarantine facilities","content":"<blockquote class=\"twitter-tweet\">\n<p lang=\"en\" dir=\"ltr\">Rajasthan Health Department writes to senior officials of all districts to immediately identify buildings for setting up quarantine facilities for over 1 lakh people as part the govt's preparedness to tackle any emergency situation arising out of <a href=\"https:\/\/twitter.com\/hashtag\/Coronavirus?src=hash&ref_src=twsrc%5Etfw\">#Coronavirus<\/a> in the state.<\/p>\n— ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1241771171277758464?ref_src=twsrc%5Etfw\">March 22, 2020<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2020-03-22 23:07:58","pin":"0","status":"1"},{"title":"Jharkhand goes under lockdown till March 31","content":"<p>During the lockdown, the movement of all public transport is prohibited and all shops, commercial institutions, offices, factories, godowns, weekly markets will remain closed.<\/p>","date":"2020-03-22 23:11:59","pin":"0","status":"1"},{"title":"WATCH | Kerala records 15 new cases, total count crosses 60","content":"<p><iframe width=\"100%\" height=\"450\" src=\"https:\/\/www.youtube.com\/embed\/bHZE0QAPzzw\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\"><\/iframe><\/p>","date":"2020-03-22 23:16:30","pin":"0","status":"1"},{"title":"HDFC Bank changes working hours","content":"<p>The private bank will function from 10 am to 2 pm till March 31, except on Saturday.<\/p>","date":"2020-03-22 23:24:07","pin":"0","status":"1"},{"title":"Five  held in Telangana for flouting home quarantine","content":"<p>The Telangana Railway Police on Sunday booked cases against five passengers, including two women, for allegedly violating the government's orders by using public transport despite being advised home quarantine on their return here from abroad.<\/p>","date":"2020-03-22 23:35:26","pin":"0","status":"1"},{"title":"Uttarakhand announces lockdown till March 31 ","content":"<p>After the nationwide Janta Curfew that was observed today against COVID-19 outbreak, we have decided to continue the curfew till March 31. We will make sure the availability of essential services such as food, medicines for all, \" CM Trivendra Singh Rawat said.  <strong><a href=\"https:\/\/www.newindianexpress.com\/nation\/2020\/mar\/22\/uttarakhand-announces-lockdown-till-march-31-2120240.html\" target=\"_blank\">READ FULL REPORT HERE<\/a><\/strong><\/p>","date":"2020-03-22 23:43:58","pin":"0","status":"1"},{"title":"Section 144 imposed in Dakshina Kannada ","content":"<blockquote class=\"twitter-tweet\">\n<p lang=\"en\" dir=\"ltr\">Section 144 has been imposed in Dakshina Kannada till 31st March, in the wake of <a href=\"https:\/\/twitter.com\/hashtag\/CoronavirusPandemic?src=hash&ref_src=twsrc%5Etfw\">#CoronavirusPandemic<\/a>: Sindhu B. Rupesh, Deputy Commissioner, Dakshina Kannada <a href=\"https:\/\/twitter.com\/hashtag\/Bengaluru?src=hash&ref_src=twsrc%5Etfw\">#Bengaluru<\/a><\/p>\n— ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1241767146390081536?ref_src=twsrc%5Etfw\">March 22, 2020<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2020-03-22 23:45:04","pin":"0","status":"1"},{"title":"J&K restricts public assembly to not more than three people","content":"<blockquote class=\"twitter-tweet\">\n<p lang=\"en\" dir=\"ltr\">All assemblies at public places to be restricted to 3 persons or less: Rohit Kansal, Principal Secretary, Planning, Jammu & Kashmir <a href=\"https:\/\/t.co\/s4KCR76QUY\">https:\/\/t.co\/s4KCR76QUY<\/a><\/p>\n— ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1241783775769448448?ref_src=twsrc%5Etfw\">March 22, 2020<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2020-03-22 23:47:35","pin":"0","status":"1"},{"title":"Air Asia pilot ejects through cockpit window to escape virus","content":"<p>As there were suspected coronavirus-infected passengers aboard AirAsia India's Pune-Delhi flight last Friday, the pilot-in-command after landing chose to come out of the plane through cockpit's secondary exit, which is a sliding window.<br \/>\n<strong><a href=\"https:\/\/www.newindianexpress.com\/cities\/delhi\/2020\/mar\/22\/watch--with-suspected-covid-19-passengers-onboard-airasia-pilot-slides-down-via-cockpit-window-2120250.html\" target=\"_blank\">READ FULL REPORT HERE<\/a><\/strong><\/p>","date":"2020-03-22 23:56:20","pin":"0","status":"1"},{"title":"Ernakulam Medical College declared exclusive COVID-19 treatment centre​","content":"<p>The hospital superintendent has been directed to shift all patients being treated at the facility to other hospitals.<br \/>\n<strong><a href=\"https:\/\/www.newindianexpress.com\/cities\/kochi\/2020\/mar\/23\/ernakulam-medical-college-hospital-declared-exclusive-covid-19-treatment-centre%E2%80%8B-2120254.html\" target=\"_blank\">READ FULL REPORT HERE<\/a><\/strong><\/p>","date":"2020-03-23 00:29:25","pin":"0","status":"1"},{"title":"Guwahati airport to stamp all incoming passengers","content":"<p>The stamp will bear the time period for mandatory home quarantine period of the individual.<\/p>","date":"2020-03-23 00:30:07","pin":"0","status":"1"},{"title":"Coronavirus-contracted celebrities, VIPs","content":"<p><strong><a href=\"https:\/\/www.newindianexpress.com\/galleries\/world\/2020\/mar\/13\/kanika-kapoor-to-paulo-dybala-celebrities-vips-who-have-contracted-coronavirus--tom-hanks-idris-102799.html\" target=\"_blank\">CLICK HERE TO FIND FULL LIST<br \/>\n<\/a><img src=\"https:\/\/images.newindianexpress.com\/images\/liveimages\/BeFunky-collage_(1).jpg\" width=\"600\" height=\"300\" alt=\"\" \/><br \/>\n<br type=\"_moz\" \/>\n<\/strong><\/p>","date":"2020-03-23 00:45:27","pin":"0","status":"1"},{"title":"As Delhi goes on lockdown, passengers of last international flight exit IGI airport","content":"<blockquote class=\"twitter-tweet\">\n<p lang=\"en\" dir=\"ltr\">Delhi Airport statement: Passengers of the last international arriving flight have exited the Airport. Operations at T3 international arrivals will remain suspended till 0531 hours of 29th March, 2020. <a href=\"https:\/\/twitter.com\/hashtag\/COVID19?src=hash&amp;ref_src=twsrc%5Etfw\">#COVID19<\/a> <a href=\"https:\/\/t.co\/WcobFnw79q\">pic.twitter.com\/WcobFnw79q<\/a><\/p>\n&mdash; ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1241817505376563200?ref_src=twsrc%5Etfw\">March 22, 2020<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2020-03-23 01:39:34","pin":"0","status":1}]}