{"details":[{"title":"Major updates in the last 24 hours","content":"<ul>\n    <li>India reports highest cases in 1 day with over 60 testing positive on Friday<\/li>\n    <li>No passenger trains on Janta curfew day, suburban train services to be reduced to bare minimum<\/li>\n    <li>IRCTC says on-board catering services in mail or express trains to be closed until further advice<\/li>\n    <li>Kerala positve cases shoot up to 40<\/li>\n    <li>Singer Kanika Kapoor becomes first Bollywood celebrity to test positive for coronavirus, booked for negligence<\/li>\n    <li>Rajasthan ex-CM Vasundhara Raje, son Dushyant Singh, who attended event with Kanika Kapoor, self quarantine <\/li>\n    <li>All workplaces in Mumbai, Pune, Pimpri-Chinchwad, Nagpur shut till March 31<\/li>\n    <li>Italian tourist, who recovered from coronavirus, dies of cardiac arrest in Jaipur hospital<\/li>\n<\/ul>","date":"2020-03-21 02:12:36","pin":"0","status":"1"},{"title":"Uber, Ola suspend pool ride service in India","content":"<p>Cab-hailing companies Uber and Ola said on Friday they have suspended pool ride services across India in the wake of growing new coronavirus fears.<\/p>\n<p>The companies witnessed a huge drop in its pool service as people were afraid to share the rides with strangers while new coronavirus cases surged in the country.<a href=\"https:\/\/www.newindianexpress.com\/nation\/2020\/mar\/20\/uber-ola-suspend-pool-ride-service-in-india-2119448.html\" target=\"_blank\"><strong>(READ FULL REPORT HERE)<\/strong><\/a><strong>\n <\/strong><\/p>","date":"2020-03-21 02:14:03","pin":"0","status":"1"},{"title":"President to undergo corona test on Saturday","content":"<p>President Ram Nath Kovind will undergo coronavirus test on Saturday, according to Rashtrapati Bhavan sources. The President's decision comes in the wake of BJP MP Dushyant Singh's participation in an event where Kanika Kapoor, who is affected by COVID-19, was present on Sunday and the MP's subsequent meeting with the President.<\/p>","date":"2020-03-21 02:14:44","pin":"0","status":"1"},{"title":"","content":"<p><span style=\"font-size: medium;\"><strong>Bollywood singer Kanika Kapoor who tested positive for coronavirus booked for negligence: Lucknow police chief<\/strong><\/span><\/p>\n<p><a href=\"https:\/\/www.newindianexpress.com\/nation\/2020\/mar\/21\/bollywood-singer-kanika-kapoor-who-tested-positive-for-coronavirus-booked-for-negligence--2119457.html\" target=\"_blank\"><strong>( READ FULL STORY HERE)<\/strong><\/a><\/p>","date":"2020-03-21 02:15:58","pin":"0","status":"1"},{"title":"Italy's coronavirus toll crosses 4,000 after record 627 deaths on one day","content":"<p>Italy reported a record 627 new coronavirus deaths on Friday and saw its world-topping toll surpass 4,000, despite government efforts to stem the pandemic's spread. The Mediterranean country's daily rate of fatalities is now higher than that officially reported by China at the peak of its outbreak around Wuhan's Hubei province. <a href=\"https:\/\/www.newindianexpress.com\/world\/2020\/mar\/21\/italys-coronavirus-toll-crosses-4000-after-record-627-deaths-on-one-day-2119482.html\" target=\"_blank\"><strong>(READ FULL REPORT HERE)<\/strong><\/a><\/p>","date":"2020-03-21 02:18:01","pin":"0","status":"1"},{"title":"WHO warns world youth on virus: 'you are not invincible'","content":"<p>The head of the World Health Organisation on Friday warned young people they were \"not invincible\" against the coronavirus pandemic, and said their self-restraint could save the lives of older people.<\/p>","date":"2020-03-21 02:18:48","pin":"0","status":"1"},{"title":"IndiGo announces schedule reductionsto support Janata Curfew","content":"<p>IndiGo, India's largest airline, has reduced its domestic schedule to match market demand over the next few weeks.<\/p>\n<p>On Sunday, in line with the ''Janata Curfew'' announced by the Prime Minister on March 19, the airline would be operating approximately 60 per cent of its normal domestic schedule, in order to accommodate those with urgent travel requirements on that day.<\/p>","date":"2020-03-21 03:05:26","pin":"0","status":"1"},{"title":"Coronavirus: Entry of pilgrims to Sabarimala Temple to be restricted","content":"<p>In the wake of COVID-19 threat, the Kerala government has directed the Travancore Devaswom Board and the Pathanamthitta district administration to restrict the entry of pilgrims to the 10 day-long annual Sabarimala Temple festival that will begin on March 29.<\/p>\n<p>The rituals will be observed at the Sabarimala festival that begins with Kodiyettam (hoisting flag) on March 29. Pilgrims will also not be allowed to attend the 'Ararat ceremony' on April 8 at Pampa.<\/p>","date":"2020-03-21 05:12:23","pin":"0","status":"1"},{"title":"Govt fixes prices of sanitizers, face masks: Paswan","content":"<p>After declaring face masks and hand sanitisers under essential commodities, the government has now fixed the prices of these items, Union Minister Ram Vilas Paswan has said in a tweet.<\/p>\n<p>He said that since the outbreak of coronavirus (COVID-19), the Indian market has seen a huge surge in the prices of various face masks and hand sanitizers. Therefore, the government has fixed the prices of two-ply and three-ply surgical masks and hand sanitizers.<\/p>","date":"2020-03-21 05:14:52","pin":"0","status":"1"},{"title":"Civil Aviation Ministry officials go into self quarantine","content":"<p>Senior officials belonging to the Ministry of Civil Aviation, who recently met with the Member of Parliament Dushyant Singh have gone into self quarantine from Friday evening.<\/p>\n<p>According to the ministry, officers who attended the 'Parliamentary Standing Committee' meeting on March 18 and came in close proximity with the MP have gone into self quarantine as a precautionary measure against the spread of coronavirus.<\/p>","date":"2020-03-21 05:16:14","pin":"0","status":"1"},{"title":" Haryana government invokes Sec 144","content":"<p>The Haryana government has issued an order to all District Magistrates and Police Commissioners in the state to invoke section 144 of the CrPc as precautionary measure against coronavirus. <\/p>\n<p>Not more than 5 people will be allowed to assemble in public places.<\/p>","date":"2020-03-21 08:04:00","pin":"0","status":"1"},{"title":"Pneumonia patients will to be tested for coronavirus ","content":"<p>Union Ministry of Health has said that pneumonia patients will also be tested for coronavirus regardless of travel or contact history.<\/p>\n<p><img src=\"https:\/\/images.newindianexpress.com\/images\/liveimages\/WhatsApp Image 2020-03-20 at 20_15_53.jpeg\" width=\"600\" height=\"397\" alt=\"\" \/><\/p>\n<p><em>Image used for representational purpose. (Express Photo | V. Karthik Alagu)<\/em><\/p>","date":"2020-03-21 08:29:19","pin":"0","status":"1"},{"title":"Punjab man tests positive for COVID-19 pushing total number of cases in state to 4","content":"<blockquote class=\"twitter-tweet\">\n<p lang=\"en\" dir=\"ltr\">Punjab: One Mohali resident with travel history to the UK has tested positive for Coronavirus; Total number of positive cases in the state rises to 4<\/p>\n— ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1241197895702827014?ref_src=twsrc%5Etfw\">March 21, 2020<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2020-03-21 08:49:10","pin":"0","status":"1"},{"title":"Environment Ministry suspends meetings of its green panel till March 31","content":"The Environment Ministry has put all meetings of its expert appraisal committees (EAC), responsible for issuing green clearances, on hold till March 31 amid a spurt in new coronavirus cases across the country, a top environment ministry official said.","date":"2020-03-21 09:07:13","pin":"0","status":"1"},{"title":"Cloud over President House, Parliament after Bollywood singer Kanika Kapoor’s Holi party","content":"<p>Parliament and even Rashtrapati Bhavan have come under the pandemic scare after it came to light on Friday that BJP MP Dushyant Singh had attended a <strong><a href=\"https:\/\/www.newindianexpress.com\/nation\/2020\/mar\/21\/bollywood-singer-kanika-kapoor-who-tested-positive-for-coronavirus-booked-for-negligence--2119457.html\" target=\"_blank\">party in Lucknow<\/a><\/strong> recently where  Bollywood singer Kanika Kapoor, who has tested positive for coronavirus, was present.<\/p>\n<p>Several Rajya Sabha and Lok Sabha members who had been in contact with Dushyant in Parliament last week went into self- quarantine following the revelation, as did the MP along with his mother, former Rajasthan chief minister Vasundhara Raje, who also attended the party. <strong>(<a href=\"https:\/\/www.newindianexpress.com\/nation\/2020\/mar\/21\/cloud-over-president-house-parliament-after-bollywood-singer-kanika-kapoors-holi-party-2119638.html\" target=\"_blank\">READ MORE<\/a>)<\/strong><\/p>","date":"2020-03-21 09:10:32","pin":"0","status":"1"},{"title":"Kerala directs government employees to work part-time for 2 weeks","content":"<p><img src=\"https:\/\/images.newindianexpress.com\/images\/liveimages\/Pinarayi_Vijayan_EPS__pic.jpg\" width=\"600\" height=\"300\" alt=\"\" \/><\/p>\n<p> <em>Kerala CM Pinarayi Vijayan (Photo | Albin Mathew, EPS)<\/em><\/p>","date":"2020-03-21 09:16:11","pin":"0","status":"1"},{"title":"","content":"<blockquote class=\"twitter-tweet\">\n<p lang=\"en\" dir=\"ltr\">Maharashtra: Roads in Nagpur wear deserted look as the state government announced closure of all non-essential services and appealed to people to not gather at public places as measures to combat <a href=\"https:\/\/twitter.com\/hashtag\/CoronavirusPandemic?src=hash&ref_src=twsrc%5Etfw\">#CoronavirusPandemic<\/a>. <a href=\"https:\/\/t.co\/P5GclbpW2N\">pic.twitter.com\/P5GclbpW2N<\/a><\/p>\n— ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1241202711443288064?ref_src=twsrc%5Etfw\">March 21, 2020<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2020-03-21 09:17:58","pin":"0","status":"1"},{"title":"Janata curfew on Sunday","content":"<p><img src=\"https:\/\/images.newindianexpress.com\/images\/liveimages\/Capture(5).jpg\" width=\"316\" height=\"524\" alt=\"\" \/> <\/p>","date":"2020-03-21 09:21:34","pin":"0","status":"1"},{"title":"No new local coronavirus cases for third day in row in China","content":"<p>China reported no domestically transmitted coronavirus cases for the third consecutive day even as seven more fatalities have been confirmed, taking the death toll in the country to 3255.<\/p>\n<p>No new domestically transmitted cases of COVID-19 were reported on the Chinese mainland for the third day in a row on Friday, China's National Health Commission (NHC) said on Saturday.<\/p>","date":"2020-03-21 09:22:40","pin":"0","status":"1"},{"title":"Bengal reports third positive case of novel coronavirus","content":"<p>A woman with a recent travel history to Scotland has tested positive for the novel coronavirus, making it the third confirmed case in West Bengal, a state health department official said on Saturday.<\/p>\n<p>The woman, in her early 20s, returned from Scotland on March 16 and was subsequently admitted to the Beliaghata ID Hospital in the city with symptoms of COVID-19, the official said. <strong>(<a href=\"https:\/\/www.newindianexpress.com\/nation\/2020\/mar\/21\/bengal-reports-third-positive-case-of-novel-coronavirus-2119725.html\" target=\"_blank\">READ MORE<\/a>)<\/strong><\/p>","date":"2020-03-21 09:45:58","pin":"0","status":"1"},{"title":"Over 800 under home quarantine in Aurangabad","content":"<p>Over 800 persons have been kept under home quarantine in Maharashtra's Aurangabad district, amid the coronavirus outbreak, a senior official said on Saturday.<\/p>\n<p>A major chunk of these are students of a local college, where one of the lecturers tested positive for Covid-19 last week, she said.<\/p>","date":"2020-03-21 09:49:35","pin":"0","status":"1"},{"title":"1,300 trains to be cancelled on Sunday ","content":"<p>In view of the Janata Curfew call given by Prime Minister Narendra Modi on Sunday, the Indian Railways has cancelled all long-distance mail and express trains originating between 4 am and 10 pm on the day. According to a statement by the Railway Board, the services of around 1,300 trains will be hit. “However, the trains already on the run at 7 am on Sunday would be allowed to arrive at their destinations,” the statement read. <strong>(<a href=\"https:\/\/www.newindianexpress.com\/nation\/2020\/mar\/21\/janata-curfew-brakes-on-journey-as-no-passenger-train-to-run-on-march-22-2119635.html\" target=\"_blank\">READ MORE<\/a>) <\/strong><\/p>\n<p><strong><img src=\"https:\/\/images.newindianexpress.com\/images\/liveimages\/306fa8c8-5bfc-41e5-b7b2-05ff347355f5.jpg\" width=\"600\" height=\"400\" alt=\"\" \/><\/strong><\/p>\n<p><em>For representational purpose. (Photo | R.Satish Babu)<\/em><\/p>","date":"2020-03-21 09:57:18","pin":"0","status":"1"},{"title":" Indian nationals in US advised to stay safe and isolated","content":"<p>As India's week-long ban on international commercial flights comes into effect on March 22, the Indian Embassy in the US has advised its nationals to stay safe and isolated to prevent the spread of the novel coronavirus.  A total of 230 people have died in the US due to the fast-spreading coronavirus pandemic by Friday evening.  The number of confirmed cases has jumped to over 18,000.<\/p>","date":"2020-03-21 10:09:44","pin":"0","status":"1"},{"title":"Punjab reports 3 new cases ","content":"Three more people in Punjab have tested positive for coronavirus, taking the total in\nthe state to seven, while more positive case has come from Haryana.\n\nIn the new cases is 72-year old  lady elder sister of  69-year-old woman living in Phase 3-A who tested positive yesterday. While both the sisters are now in Fortis Hospital as on their request they were shifted from civil hospital. Another young girl 25-year old of Phase V who had come\nin contact with 23-year-old girl who had been tested positive in Chandigarh has tested positive.","date":"2020-03-21 11:01:49","pin":"0","status":"1"},{"title":"1 new case in Noida ","content":"<p>One more person has tested positive for the novel coronavirus in Noida, taking the number of COVID-19 cases to five, district officials said on Saturday.<\/p>\n<p><img src=\"https:\/\/images.newindianexpress.com\/images\/liveimages\/vijtemple1.jpg\" width=\"600\" height=\"300\" alt=\"\" \/><\/p>\n<p><em><span style=\"font-family: \"Times New Roman\"; font-size: medium;\">For representational purpose. (Photo |<\/span> <span style=\"font-family: \"Times New Roman\"; font-size: medium;\">Prasant Madugula)<\/span><\/em><\/p>","date":"2020-03-21 11:27:10","pin":"0","status":"1"},{"title":"Air India to send aircraft to bring back Indians stranded in Rome","content":"<p>National carrier Air India will send a 787 Dreamliner aircraft to Rome on Saturday afternoon to evacuate Indians stranded there amid the coronavirus crisis.  The Centre issued a statement on Thursday that no international flights would be allowed to land in India from March 22 onward for a period of one week. <\/p>","date":"2020-03-21 11:31:18","pin":"0","status":"1"},{"title":"Singapore reports first coronavirus death","content":"<p>Singapore on Saturday reported its first coronavirus deaths, including a 75-year-old Singaporean woman, the health ministry said, as the country announced a slew of measures to prevent the spread of the deadly disease that has infected 385 people in the island nation.  Singapore on Friday confirmed 40 new COVID-19 cases, including 30 imported infections, taking the total number to 385 in the country.<\/p>\n<p><img src=\"https:\/\/images.newindianexpress.com\/images\/liveimages\/AAIRPORT12(1).jpg\" width=\"600\" height=\"300\" alt=\"\" \/><\/p>\n<p><em>For representational purpose. (Photo | Ashwin prasath)<\/em><\/p>","date":"2020-03-21 11:40:30","pin":"0","status":"1"},{"title":"Karnataka reports 1 new case taking the total to 16","content":"<p>A new novel coronavirus case has been reported in Karnataka on Saturday, taking the total number of infections to 16 in the State. A 32-year old person from Gauribidanur in Chikkaballapura district, who has returned from Mecca has been confirmed for COVID-19 infection, Health Minister B Sriramulu tweeted.<\/p>","date":"2020-03-21 11:43:19","pin":"0","status":"1"},{"title":"Coronavirus positive cases in Maharashtra jumps to 63","content":"<p>The total number of coronavirus positive patients in Maharashtra has risen to 63 with 11 more positive cases reported in the last 24 hours, officials said. Of the 11 new cases, 10 are in Mumbai and one in Pune, they said on Saturday.<\/p>","date":"2020-03-21 11:52:16","pin":"0","status":"1"},{"title":"SBI opens emergency credit line for borrowers","content":"<p>Amid businesses getting affected due to the novel coronavirus pandemic, the country's largest lender State Bank of India has opened an emergency credit line to meet any liquidity mismatch for its borrowers.  The additional liquidity facility \"Covid-19 Emergency Credit Line, will provide funds up to Rs 200 crore and will be available till June 30, 2020, SBI said in a circular issued on Friday. The loan will be offered at an interest rate of 7.25 per cent with a tenure of 12 months.\" <strong>(<a href=\"https:\/\/www.newindianexpress.com\/business\/2020\/mar\/21\/coronavirus-scare-sbi-opens-emergency-credit-line-for-borrowers-2119745.html\" target=\"_blank\">READ MORE<\/a>)<\/strong><\/p>","date":"2020-03-21 12:26:41","pin":"0","status":"1"},{"title":"WHO Health Alert on WhatsApp to debunk COVID-19 myths","content":"<p>The World Health Organisation on Saturday launched a Health Alert on WhatsApp where over 1.5 billion users can ask questions and they will be provided with reliable information about new coronavirus 24\/7. All you have to do is, text the word 'Hi' to +41 79 893 1892. <strong>(<a href=\"https:\/\/www.who.int\/news-room\/feature-stories\/detail\/who-health-alert-brings-covid-19-facts-to-billions-via-whatsapp\" target=\"_blank\">READ MORE<\/a>)<\/strong><\/p>\n<blockquote class=\"twitter-tweet\">\n<p lang=\"en\" dir=\"ltr\">I am proud to announce that today we launched a new <a href=\"https:\/\/twitter.com\/WHO?ref_src=twsrc%5Etfw\">@WHO<\/a> Health Alert messaging service via <a href=\"https:\/\/twitter.com\/WhatsApp?ref_src=twsrc%5Etfw\">@WhatsApp<\/a>. This service will provide the latest news & information on <a href=\"https:\/\/twitter.com\/hashtag\/COVID19?src=hash&ref_src=twsrc%5Etfw\">#COVID19<\/a>, including details on symptoms and how to protect yourself. To subscribe, click here <a href=\"https:\/\/t.co\/mUvOWlGfqC\">https:\/\/t.co\/mUvOWlGfqC<\/a><\/p>\n— Tedros Adhanom Ghebreyesus (@DrTedros) <a href=\"https:\/\/twitter.com\/DrTedros\/status\/1241111124994637825?ref_src=twsrc%5Etfw\">March 20, 2020<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2020-03-21 12:39:21","pin":"0","status":"1"},{"title":"CBSE launches toll-free helpline for students, parents on coronavirus safeguards","content":"<p>The Central Board of Secondary Education has launched a toll-free helpline on coronavirus safeguards for students, officials said on Saturday. The facility is available on helpline number 1800 11 8004 from 8 am to 8 pm, initially up to March 31.<\/p>\n<p><img src=\"https:\/\/images.newindianexpress.com\/images\/liveimages\/cbscexams02113213.jpg\" width=\"600\" height=\"300\" alt=\"\" \/><\/p>\n<p><em>For representational purpose. (Photo | Nagaraja Gadekal)<\/em><\/p>","date":"2020-03-21 12:47:29","pin":"0","status":"1"},{"title":" Sex workers stop working in Maharashtra's Bhiwandi","content":"<p>Even as Mumbai prepares for a complete lockdown in light of the Covid-19 pandemic, daily wagers, including sex workers, seem to be worst affected in the crisis.  Over 300 sex workers in Bhiwandi town of Maharashtra's Thane district decided to stop working for a couple of days as a precautionary measure against the deadly virus.<\/p>","date":"2020-03-21 12:54:18","pin":"0","status":"1"},{"title":"Couple booked for hiding foreign travel history","content":"<p>A case was registered against a couple in Maharashtra's Jalgaon district after they allegedly failed to inform the authorities about their trip to Thailand, police said on Saturday.<\/p>","date":"2020-03-21 13:01:25","pin":"0","status":"1"},{"title":"Despite zero positive cases, Goa imposes Section 144 to curb rumours","content":"<p>The Goa government on Saturday imposed section 144 CrPC in both districts of the state to prohibit movement of more than four persons together, as a precautionary measure in view of the COVID-19 pandemic.<strong> (<a href=\"https:\/\/www.newindianexpress.com\/nation\/2020\/mar\/21\/covid-19-despite-zero-positive-cases-goa-imposes-section-144-to-curb-circulation-of-rumours-2119748.html\" target=\"_blank\">READ MORE<\/a>)<\/strong><\/p>","date":"2020-03-21 13:05:56","pin":"0","status":"1"},{"title":"Rs 1,000 each for 15 lakh daily wagers, 20 lakh construction workers: Yogi","content":"<p>Uttar Pradesh Chief Minister Yogi Adityanath on Saturday said that an amount of Rs 1,000 each will be given to 15 lakh daily wage labourers and 20.37 lakh construction workers across the state via direct benefit transfer.<\/p>\n<p><img src=\"https:\/\/images.newindianexpress.com\/images\/liveimages\/Captured.jpg\" width=\"600\" height=\"300\" alt=\"\" \/><\/p>\n<p><em>Uttar Pradesh Chief Minister Yogi Adityanath. (Photo | PTI)<\/em><\/p>","date":"2020-03-21 13:15:09","pin":"0","status":"1"},{"title":"Couple deboarded from Rajdhani after home quarantine seal found on husband's hand","content":"<p>A couple was deboarded from a Delhi-bound Rajdhani train on Saturday after co-passengers observed a home quarantine seal on the husband's hand.  Officials said the Delhi-based couple boarded the Bangalore City-New Delhi Rajdhani at Secunderabad Saturday morning.<\/p>","date":"2020-03-21 13:34:07","pin":"0","status":"1"},{"title":"ICMR revises testing strategy to fight spread of new coronavirus","content":"<p>The Indian Council of Medical Research revised its strategy to fight the spread of the new coronavirus on Saturday, saying all hospitalised patients with severe acute respiratory illness, shortness of breath and having fever and cough will now be tested for COVID-19 infection. <strong>(<a href=\"https:\/\/www.newindianexpress.com\/nation\/2020\/mar\/21\/icmr-revises-testing-strategy-to-fight-spread-of-new-coronavirus-2119755.html\" target=\"_blank\">READ MORE<\/a>)<\/strong><\/p>","date":"2020-03-21 13:37:09","pin":"0","status":"1"},{"title":"Rajasthan reports 6 new cases","content":"<p>Six new coronavirus cases have surfaced in Rajasthan, taking the total in the state to 23 so far, officials said on Saturday. Among the six, five are staff members of a private hospital, where a doctor tested positive for COVID-19, Additional Chief Secretary (Health) Rohit Kumar Singh said.<\/p>\n<p><img src=\"https:\/\/images.newindianexpress.com\/images\/liveimages\/6ae000c8-c98c-4e42-8e61-c84080e321dd(1).jpg\" width=\"600\" height=\"300\" alt=\"\" \/><\/p>\n<p><em>For representational purpose. (Photo | RVK Rao)<\/em> <\/p>","date":"2020-03-21 13:42:25","pin":"0","status":"1"},{"title":"Janata Curfew: Hyderabad Metro to remain shut whole day ","content":"<p>Hyderabad Metro Rail services will be shut down on March 22, abiding by the Prime Minister Narendra Modi's advice of Janata Curfew. Additionally, all the L&T Next Galleria Malls will also be shut down for the entire day, as an attempt to socially distance people.<\/p>","date":"2020-03-21 14:34:20","pin":"0","status":"1"},{"title":"Markets shut in Srinagar","content":"<p>\"In wake of the coronavirus outbreak, it is hereby ordered that the government employees shall attend their offices on alternate weeks except those who are associated with the coronavirus control efforts and essential services,\" reads the order by the Jammu and Kashmir administration.<\/p>","date":"2020-03-21 14:42:44","pin":"0","status":"1"},{"title":"Railway relaxes refund rules","content":"<p>If a train is cancelled by Railways for journey period March 21-April 15, refund across the counter can be taken on submission of the ticket up to 45 days from the date of the journey instead of the present three hours.<strong> (<a href=\"https:\/\/www.newindianexpress.com\/nation\/2020\/mar\/21\/coronavirus-railways-puts-brakes-on-709-trains-relaxes-refund-rules-between-march-21-april-15-2119778.html\" target=\"_blank\">READ HERE<\/a>)<\/strong><\/p>","date":"2020-03-21 14:44:35","pin":"0","status":"1"},{"title":"Quarantine-marked couple spotted in Bengaluru-Delhi Rajdhani Express","content":"<blockquote class=\"twitter-tweet\">\n<p lang=\"en\" dir=\"ltr\">A newly married couple with quarantine marking who boarded Bengaluru-Delhi Rajdhani Express from Secunderabad @ 7.35 am 2day was spotted by an alert co-psgr when washing hands. Duo deboarded @ Kazipet stn at 9.28 am. Train sanitised <a href=\"https:\/\/twitter.com\/NewIndianXpress?ref_src=twsrc%5Etfw\">@NewIndianXpress<\/a> <a href=\"https:\/\/twitter.com\/XpressBengaluru?ref_src=twsrc%5Etfw\">@XpressBengaluru<\/a><a href=\"https:\/\/twitter.com\/KARailway?ref_src=twsrc%5Etfw\">@KARailway<\/a><\/p>\n— Lalitha (@Lolita_TNIE) <a href=\"https:\/\/twitter.com\/Lolita_TNIE\/status\/1241291067330158594?ref_src=twsrc%5Etfw\">March 21, 2020<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2020-03-21 14:49:20","pin":"0","status":"1"},{"title":"Two more positive cases in Karnataka ","content":"<blockquote class=\"twitter-tweet\">\n<p lang=\"en\" dir=\"ltr\">Three new cases of <a href=\"https:\/\/twitter.com\/hashtag\/Covid19?src=hash&ref_src=twsrc%5Etfw\">#Covid19<\/a> detected in Karnataka till 10 AM on Saturday. State's tally jumps to 18. <br \/>\nDetails of two of the three new cases awaited. <a href=\"https:\/\/twitter.com\/NewIndianXpress?ref_src=twsrc%5Etfw\">@NewIndianXpress<\/a> <a href=\"https:\/\/twitter.com\/XpressBengaluru?ref_src=twsrc%5Etfw\">@XpressBengaluru<\/a> <a href=\"https:\/\/twitter.com\/santwana99?ref_src=twsrc%5Etfw\">@santwana99<\/a> <a href=\"https:\/\/t.co\/pXS3pMMjHr\">pic.twitter.com\/pXS3pMMjHr<\/a><\/p>\n— Anusha Ravi Sood (@anusharavi10) <a href=\"https:\/\/twitter.com\/anusharavi10\/status\/1241281121012174849?ref_src=twsrc%5Etfw\">March 21, 2020<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2020-03-21 14:58:06","pin":"0","status":"1"},{"title":"Karnataka-Kerala border shut","content":"<p>Karnataka-Kerala border shut at Talapady near Mangaluru as a precautiinary measure in view of coronavirus positive cases reported in Kasargod.<\/p>","date":"2020-03-21 14:59:45","pin":"0","status":"1"},{"title":"Gujarat reports six new cases","content":"<p>The number of infected persons in the state has now gone up to 13, Deputy Chief Minister Nitin Patel said. These patients are being treated in hospitals at Ahmedabad, Vadodara, Surat and Rajkot, Patel said. <strong>(<a href=\"https:\/\/www.newindianexpress.com\/nation\/2020\/mar\/21\/six-new-coronavirus-positive-cases-in-gujarat-count-now-13-2119786.html\" target=\"_blank\">READ HERE<\/a>)<\/strong><\/p>","date":"2020-03-21 15:02:04","pin":"0","status":"1"},{"title":"Chennai beaches closed ","content":"<blockquote class=\"twitter-tweet\">\n<p lang=\"en\" dir=\"ltr\">Corona threat: Marina and Besant Nagar beaches, Palavakkam, Thiruvanmiyur beaches will be closed from 3 pm today onwards till further instructions <a href=\"https:\/\/twitter.com\/xpresstn?ref_src=twsrc%5Etfw\">@xpresstn<\/a> <a href=\"https:\/\/twitter.com\/NewIndianXpress?ref_src=twsrc%5Etfw\">@NewIndianXpress<\/a><\/p>\n— T Muruganandham (@muruga_TNIE) <a href=\"https:\/\/twitter.com\/muruga_TNIE\/status\/1241277632999612418?ref_src=twsrc%5Etfw\">March 21, 2020<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2020-03-21 15:13:52","pin":"0","status":"1"},{"title":"No Bengaluru Metro on Sunday","content":"<p>In a sudden move aimed at containing the pandemic, the Bangalore Metro Rail Corporation Limited also announced that it has decided to restrict passengers in trains and stations. <strong>(<a href=\"https:\/\/www.newindianexpress.com\/cities\/bengaluru\/2020\/mar\/21\/covid-19-no-bengaluru-metro-on-sunday-kids-and-elderly-to-be-barred-2119785.html\" target=\"_blank\">READ HERE<\/a>)<\/strong><\/p>","date":"2020-03-21 15:16:53","pin":"0","status":"1"},{"title":"Cities gear-up for Janata Curfew","content":"<p><img src=\"https:\/\/images.newindianexpress.com\/images\/liveimages\/WhatsApp Image 2020-03-21 at 14_41_44(1).jpeg\" width=\"600\" height=\"548\" alt=\"\" \/><\/p>\n<p><em>The massive queue at DMart store in Hyderabad on Saturday - a day before Janata Curfew (Photo | RVK Rao, EPS)<\/em><\/p>","date":"2020-03-21 15:20:47","pin":"0","status":"1"},{"title":"10 booked in Kerala for opening shops against warning","content":"<p>Kasaragod district, which has reported eight positive cases of COVID-19, was on Saturday put under total lock-down, while cases were registered against 10 traders who opened their shops despite a warning.<strong> (<a href=\"https:\/\/www.newindianexpress.com\/states\/kerala\/2020\/mar\/21\/coronavirus-lockdown-in-keralas-kasaragod-cases-against-10-for-opening-shops-despite-warning-2119796.html\" target=\"_blank\">READ HERE<\/a>)<\/strong><\/p>","date":"2020-03-21 15:24:55","pin":"0","status":"1"},{"title":"Potato prices soar in West Bengal","content":"<p>Potato prices in parts of West Bengal jump at least 20 per cent due to panic-buying, according to market sources.<\/p>","date":"2020-03-21 15:37:01","pin":"0","status":"1"},{"title":"Tamil Nadu postpones Class X board exams","content":"<p>CM Edappadi K Palaniswami said the exams scheduled to be held from March 27 to April 13 will be held after the Tamil New Year's Day on April 15. <strong>(<a href=\"http:\/\/ttps:\/\/www.newindianexpress.com\/states\/tamil-nadu\/2020\/mar\/21\/tenth-standard-board-exams-postponed-due-to-corona--tamil-nadu-cm-edappadi-palaniswami-2119795.html\" target=\"_blank\">READ HERE<\/a>)<\/strong><\/p>","date":"2020-03-21 15:41:41","pin":"0","status":"1"},{"title":"Major restrictions for devotees in Kerala temples","content":"<p>Temples under the Travancore Devaswom Board will be now opened only from 6 am to 10 am and 5.30 pm to 7.30 pm. Poojas should be restructured accordingly. Offerings, already booked, should be postponed to other convenient dates. <strong>(<a href=\"https:\/\/www.newindianexpress.com\/states\/kerala\/2020\/mar\/21\/covid-19-major-restrictions-for-devotees-at-temples-under-travancore-devaswom-board-2119806.html\" target=\"_blank\">READ HERE<\/a>)<\/strong><\/p>","date":"2020-03-21 15:44:21","pin":"0","status":"1"},{"title":"Patient in Maharashtra's Aurangabad recovers","content":"<p>The woman, with travel history to Russia and Kazakhstan, had tested positive for the virus on March 13, district health officer Dr Sundar Kulkarni said. Her latest swab reports after treatment have come out negative. <strong>(<a href=\"https:\/\/www.newindianexpress.com\/nation\/2020\/mar\/21\/covid-19-patient-in-maharashtras-aurangabad-recovers-tests-negative-2119810.html\" target=\"_blank\">READ HERE<\/a>)<\/strong><\/p>","date":"2020-03-21 16:01:07","pin":"0","status":"1"},{"title":"Telangana to enforce Janata curfew","content":"<p>CM K Chandrasekhar Rao announced  that the curfew will be enforced for 24 hours, starting from 6 am on Sunday.<\/p>","date":"2020-03-21 16:08:42","pin":"0","status":"1"},{"title":"Assam cancels Bihu cultural programmes","content":"<p>Cultural programmes will not figure in the month-long celebration of Rongali Bihu in Guwahati this year. Given the COVID-19 pandemic, the Bihu committees in Guwahati has taken the decision.<\/p>","date":"2020-03-21 16:08:54","pin":"0","status":"1"},{"title":"Intense scrutiny in Andhra Pradesh","content":"<p><img src=\"https:\/\/images.newindianexpress.com\/images\/liveimages\/WhatsApp Image 2020-03-21 at 15_22_05.jpeg\" width=\"600\" height=\"371\" alt=\"\" \/><\/p>\n<p>Thermal screening at Tirupati railway station (Photo | Madhav K, EPS)<\/p>","date":"2020-03-21 16:15:10","pin":"0","status":"1"},{"title":"Permit movement of telecom staff: DoT tells states","content":"<p>All critical telecom infrastructure should be permitted to be manned by the staff of telecom service providers\/telecom infrastructure providers, it said in a letter to the chief secretaries of all states. <strong>(<a href=\"https:\/\/www.newindianexpress.com\/business\/2020\/mar\/21\/coronavirus-outbreak-dot-asks-states-to-permit-movement-of-telecom-staff-2119823.html\" target=\"_blank\">READ HERE<\/a>)<\/strong><\/p>","date":"2020-03-21 16:25:35","pin":"0","status":"1"},{"title":"Janata Curfew: Mumbai Metro to suspend services ","content":"<p>The announcement comes a day after Mumbai Metropolitan Region Development Authority (MMRDA) announced the suspension of monorail services on March 22. <strong>(<a href=\"https:\/\/www.newindianexpress.com\/cities\/mumbai\/2020\/mar\/21\/coronavirus-mumbai-metro-to-suspend-services-on-sunday-in-view-of-janta-curfew-2119827.html\" target=\"_blank\">READ HERE<\/a>)<\/strong><\/p>","date":"2020-03-21 16:32:19","pin":"0","status":"1"},{"title":"Google launches educational coronavirus website","content":"<p>Google on Saturday launched an educational coronavirus website that contains safety tips and authoritative information about the pandemic. The move comes a week after President Donald Trump held a press conference wherein he claimed Google would be building a screening website for the coronavirus that would direct people to testing sites.<\/p>","date":"2020-03-21 16:43:19","pin":"0","status":"1"},{"title":"Amsterdam-Delhi flight with around 100 Indians turns back mid-air","content":"<p>Because of the pandemic, India has imposed a bar on flights from Europe and from Sunday a one-week complete ban on all incoming international commercial flights comes into force. <strong>(<a href=\"https:\/\/www.newindianexpress.com\/world\/2020\/mar\/21\/amsterdam-delhi-flight-with-around-100-indians-turns-back-mid-air-after-india-denies-permission-to-land-2119832.html\" target=\"_blank\">READ MORE<\/a>)<\/strong><\/p>","date":"2020-03-21 16:51:42","pin":"0","status":"1"},{"title":"Odisha govt puts 40 per cent of state under lockdown","content":"<p>CM Naveen Patnaik on Saturday announced a lockdown in 40 per cent of Odisha including five districts, seven major towns and the capital city Bhubaneswar as the fight to contain COVID-19 enters a decisive stage. The lockdown will be effective from 7 am on Sunday to 9 pm on March 29. <strong>(<a href=\"https:\/\/www.newindianexpress.com\/states\/odisha\/2020\/mar\/21\/covid-19-odisha-cm-puts-40-per-cent-of-state-under-lockdown-including-bhubaneswar-2119843.html\" target=\"_blank\">READ HERE<\/a>)<\/strong><\/p>","date":"2020-03-21 17:09:45","pin":"0","status":"1"},{"title":"J&K Waqf Board suspends regular prayers at mosques","content":"<p>The decision to suspend the prayers was taken as a preventive measure to contain the spread of the coronavirus in the Kashmir valley and in view of the imposition of restrictions under Sec 144.<\/p>","date":"2020-03-21 17:11:31","pin":"0","status":"1"},{"title":"Bengal postpones class XII exams, restaurants, bars shut till March 31","content":"<p>The directive also applies to massage parlours and hookah bars, the official said, adding that strict action would be taken in case of any violation. <strong>(<a href=\"https:\/\/www.newindianexpress.com\/cities\/kolkata\/2020\/mar\/21\/coronavirus-bengal-shuts-down-restaurants-pubs-bars-till-march-31-postpones-class-12-exams-2119838.html\" target=\"_blank\">READ HERE<\/a>)<\/strong><\/p>","date":"2020-03-21 17:17:47","pin":"0","status":"1"},{"title":"Three more positive cases in Tamil Nadu","content":"<blockquote class=\"twitter-tweet\">\n<p lang=\"en\" dir=\"ltr\"><a href=\"https:\/\/twitter.com\/hashtag\/coronaupdate?src=hash&ref_src=twsrc%5Etfw\">#coronaupdate<\/a>: 3 positive cases confirmed, 2 Thai nationals & 1 from New Zealand.Patients are undergoing treatment in isolation. <a href=\"https:\/\/twitter.com\/MoHFW_INDIA?ref_src=twsrc%5Etfw\">@MoHFW_INDIA<\/a> <a href=\"https:\/\/twitter.com\/hashtag\/Vijayabaskar?src=hash&ref_src=twsrc%5Etfw\">#Vijayabaskar<\/a><\/p>\n— Dr C Vijayabaskar (@Vijayabaskarofl) <a href=\"https:\/\/twitter.com\/Vijayabaskarofl\/status\/1241325941005012994?ref_src=twsrc%5Etfw\">March 21, 2020<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2020-03-21 17:18:10","pin":"0","status":"1"},{"title":"Health Minister rules out community transmission in TN","content":"<blockquote class=\"twitter-tweet\">\n<p lang=\"en\" dir=\"ltr\"><a href=\"https:\/\/twitter.com\/hashtag\/Corona?src=hash&ref_src=twsrc%5Etfw\">#Corona<\/a>:All 6 +ve cases are imported cases from diff regions with travel histories & not community transmitted. New cases were already quarantined & in our radar.Screening is more intensified at all ports of arrival incl Railway,dom.arrivals & interstate borders. <a href=\"https:\/\/twitter.com\/hashtag\/Vijayabaskar?src=hash&ref_src=twsrc%5Etfw\">#Vijayabaskar<\/a><\/p>\n— Dr C Vijayabaskar (@Vijayabaskarofl) <a href=\"https:\/\/twitter.com\/Vijayabaskarofl\/status\/1241326267166642178?ref_src=twsrc%5Etfw\">March 21, 2020<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2020-03-21 17:29:36","pin":"0","status":"1"},{"title":"Bihar shuts down bus services, restaurants, banquet halls till March 31","content":"Bihar shuts down bus services, restaurants, banquet halls till March 31 to prevent spread of novel coronavirus.","date":"2020-03-21 17:53:26","pin":"0","status":"1"},{"title":"No gatherings of more than five people, will lockdown Delhi if needed: Kejriwal ","content":"<p>\"We are extremely concerned about daily wagers, labourers who have been hit hard over the coronavirus crisis; don't want anyone to go hungry,\" he said, adding that lunch and dinner would be provided for homeless in night shelters. <strong>(<a href=\"https:\/\/www.newindianexpress.com\/cities\/delhi\/2020\/mar\/21\/no-gatherings-of-more-than-five-people-will-do-delhi-lockdown-if-needed-kejriwal-on-coronavirus-2119839.html\" target=\"_blank\">READ HERE<\/a>)<\/strong><\/p>","date":"2020-03-21 18:17:39","pin":"0","status":"1"},{"title":"Maharashtra to have special control room, lockdown in Akola","content":"<p>Senior IAS officers Rajeev Jalota and Bhushan Gagrani would lead the team operating from the control room, which will also include IAS officer Prajakta Lavangare and IPS officer Manoj Patil.<\/p>","date":"2020-03-21 18:18:48","pin":"0","status":"1"},{"title":"Man who travelled to Mecca tests positive in Karnataka","content":"<p>Chikballapur Deputy Commissioner R Latha said the man along with his mother went to Mecca and Medina and returned on March 17 to Gouribidanur. Following uneasiness and fever, he went to the Rajiv Gandhi Institute of Chest Diseases and gave blood samples and was later admitted to a private hospital in Bengaluru. <strong>(<a href=\"https:\/\/www.newindianexpress.com\/states\/karnataka\/2020\/mar\/21\/man-who-travelled-to-mecca-and-medina-tests-positive-for-covid-19-in-karnataka-2119856.html\" target=\"_blank\">READ HERE<\/a>)<\/strong><\/p>","date":"2020-03-21 18:36:48","pin":"0","status":"1"},{"title":"Indian Oil initiates rare protocol to keep fuel supplies running","content":"<p>\"We are in a business where we need to ensure not just consumers get uninterrupted supplies of petrol, diesel and cooking gas (LPG), but also airlines get jet fuel on demand and supply lines for nation's defence forces are unhindered,\" IOC Chairman Sanjiv Singh said. <strong>(<a href=\"https:\/\/www.newindianexpress.com\/business\/2020\/mar\/21\/covid-19-indian-oil-initiates-rare-protocol-to-keep-fuel-supplies-running-amid-shutdown-2119852.html\" target=\"_blank\">READ HERE<\/a>)<\/strong><\/p>","date":"2020-03-21 18:52:26","pin":"0","status":"1"},{"title":"HRD ministry tells educational institutions to allow students still in hostels to stay put","content":"<p>\"Students who are still in hostels, particularly foreign students, should be allowed to continue in their hostels and advised to take all necessary safe precaution,\" HRD Secretary Amit Khare said in a letter to the institutions.<\/p>\n<p><em><img src=\"https:\/\/images.newindianexpress.com\/images\/liveimages\/WhatsApp Image 2020-03-21 at 18_50_36(1).jpeg\" width=\"600\" height=\"398\" alt=\"\" \/>\n(Photo | G Satyanarayana, EPS)<\/em><\/p>\n<p> <\/p>","date":"2020-03-21 18:57:10","pin":"0","status":"1"},{"title":"Strict action  if instructions not followed: Pinarayi Viajayan","content":"<blockquote class=\"twitter-tweet\">\n<p lang=\"en\" dir=\"ltr\">Kerala CM: Violating government guidelines mass gatherings&religious festivals were held. Govt is requesting again to avoid mass gatherings. But if the direction is not followed we will not hesitate to take strict action including imposing Section 144. <a href=\"https:\/\/t.co\/rSedzUXFjL\">pic.twitter.com\/rSedzUXFjL<\/a><\/p>\n— ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1241354213608701952?ref_src=twsrc%5Etfw\">March 21, 2020<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2020-03-21 18:59:50","pin":"0","status":"1"},{"title":"East Coast Railway cancels 72 trains","content":"<p>Most of the trains cancelled were to run on Sunday. Some other trains, which were to run next week, have also been cancelled. <strong>(<a href=\"https:\/\/www.newindianexpress.com\/nation\/2020\/mar\/21\/covid-19-east-coast-railway-cancels-72-trains-on-saturday-to-prevent-outbreak-2119858.html\" target=\"_blank\">READ THE FULL LIST HERE<\/a>)<\/strong><\/p>","date":"2020-03-21 19:05:36","pin":"0","status":"1"},{"title":"Around the globe","content":"<ul>\n    <li>The global number of infected cases has crossed 2,75,000 while more than 11,500 have died from the disease.<\/li>\n    <li>Pakistan's national airline halted all international flights amid coronavirus crisis effective March 21, 8 pm and will resume on March 28.<\/li>\n    <li>China does damage control, sends masks and experts to governments that are struggling to fight the spread of the virus.<\/li>\n    <li>Indian embassies worldwide issued advisories to its distressed nationals who wish to travel back home before India's week-long ban. The government also started emergency helpline numbers for Indians and assured them of all possible help.<\/li>\n    <li>A Study published in the New England Journal of Medicine said that people may acquire the novel coronavirus through the air and after touching contaminated objects- the virus is detectable for up to 3 hours in aerosols, up to 4 hours on copper, up to 24 hours on cardboard and up to 2 to 3 days on plastic and stainless steel.<\/li>\n    <li>WHO warned world youth on coronavirus, says 'you are not invincible'. While the elderly and those with pre-existing medical conditions are the hardest hit by the virus, youngsters were also vulnerable.<\/li>\n    <li>No domestically transmitted cases reported in China for 3rd consecutive day.<\/li>\n<\/ul>\n<p> <\/p>","date":"2020-03-21 19:14:30","pin":"0","status":"1"},{"title":"Section 144 in Puducherry","content":"<p>Already  Section 144 Cr P.C has been promulgated in  Karaikal, Mahe and Yanam regions of the Union territory. <strong>(<a href=\"https:\/\/www.newindianexpress.com\/states\/tamil-nadu\/2020\/mar\/21\/coronavirus-puducherry-clamps-section-144-to-ensure-social-distancing-2119862.html\" target=\"_blank\">READ HERE<\/a>)<\/strong><\/p>","date":"2020-03-21 19:21:17","pin":"0","status":"1"},{"title":"Fight coronavirus like Yuvraj-Kaif 2002 Natwest Series stand: PM Modi","content":"<p>Kaif and Yuvraj joined hands for a 121-run stand to drag Sourav Ganguly-led India out of a hole and guide them to a two-wicket victory against England at Lord's in July 2002. <strong>(<a href=\"https:\/\/www.newindianexpress.com\/sport\/cricket\/2020\/mar\/21\/fight-coronavirus-like-yuvraj-kaif-2002-natwest-series-stand-narendra-modi-to-nation-2119861.html\" target=\"_blank\">READ HERE<\/a>)\n<img src=\"https:\/\/images.newindianexpress.com\/images\/liveimages\/a456bf190c0f14f562256aa2e519e1f2.jpg\" width=\"600\" height=\"314\" alt=\"\" \/>\n<\/strong><\/p>","date":"2020-03-21 19:28:15","pin":"0","status":"1"},{"title":"Rajasthan count reaches 23 as five medical staff test positive","content":"<p>Five of the six new infections reported on Saturday emerged in Bhilwara which has now become a serious concern for the state government. <strong>(<a href=\"https:\/\/www.newindianexpress.com\/nation\/2020\/mar\/21\/covid-19-five-medical-staff-test-positive-in-bhilwara-cases-in-rajasthan-rise-to-23-2119866.html\" target=\"_blank\">READ HERE<\/a>)<\/strong><\/p>","date":"2020-03-21 19:31:56","pin":"0","status":"1"},{"title":"Coach maintenance staff equipped to deal with coach maintenance: Indian Railways","content":"<blockquote class=\"twitter-tweet\">\n<p lang=\"en\" dir=\"ltr\">Indian Railway: Coach maintenance staff have been equipped to deal with coach sanitization en-route and at terminals in the Bhopal Division, Madhya Pradesh. <a href=\"https:\/\/t.co\/fVk8xcrPZd\">pic.twitter.com\/fVk8xcrPZd<\/a><\/p>\n— ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1241357485560098817?ref_src=twsrc%5Etfw\">March 21, 2020<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2020-03-21 19:34:06","pin":"0","status":"1"},{"title":"Bengaluru metro train sevices to be regulated from March 23","content":"<blockquote class=\"twitter-tweet\">\n<p lang=\"en\" dir=\"ltr\">Bengaluru Metro Rail Corporation: Namma Metro Train Services will be regulated with effect from March 23, Monday, onwards till March 31, Tuesday, to facilitate social distancing as a measure for countering the spread of <a href=\"https:\/\/twitter.com\/hashtag\/COVID19?src=hash&ref_src=twsrc%5Etfw\">#COVID19<\/a> pandemic. <a href=\"https:\/\/t.co\/yinz1pPGzc\">pic.twitter.com\/yinz1pPGzc<\/a><\/p>\n— ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1241377052793671681?ref_src=twsrc%5Etfw\">March 21, 2020<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2020-03-21 20:49:49","pin":"0","status":"1"},{"title":"Telangana confirms two new cases","content":"<blockquote class=\"twitter-tweet\">\n<p lang=\"en\" dir=\"ltr\">Telangana CM K. Chandrashekar Rao: Two new <a href=\"https:\/\/twitter.com\/hashtag\/COVID19?src=hash&ref_src=twsrc%5Etfw\">#COVID19<\/a> positive cases have been reported in the state today taking the total figure to 21. Everyone should participate in the 'Janata Curfew' that has been called by PM Modi on March 22. (File pic) <a href=\"https:\/\/t.co\/W5fjrQi5ou\">pic.twitter.com\/W5fjrQi5ou<\/a><\/p>\n— ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1241365237770498048?ref_src=twsrc%5Etfw\">March 21, 2020<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2020-03-21 20:52:42","pin":"0","status":"1"},{"title":"PM appeals to people not to leave currrent place of stay to control spread of virus","content":"<p>I appeal to all that in whichever city you're in,stay there for few days. By doing so,we can control spread of #Coronavirus.We're playing with our health by crowding railways stations&bus-stands.Please think about yourself&your family;don't move out of your house,unnecessarily: PM Modi<\/p>\n<p><a href=\"https:\/\/www.newindianexpress.com\/nation\/2020\/mar\/21\/pm-modi-appeals-to-migrants-against-any-travel-amid-coronavirus-fears-2119895.html\" target=\"_blank\"><strong>(READ FULL STORY HERE)<\/strong><\/a><\/p><p><img src=\"https:\/\/images.newindianexpress.com\/images\/liveimages\/747497fce137273d65cb328c1d744062.jpg\" width=\"100%\" height=\"\" alt=\"\" \/><\/p>","date":"2020-03-21 20:57:40","pin":"0","status":"1"},{"title":"Man with no foreign-travel history tests positive in Bengal, state's 4th confirmed case ","content":"<p>A 57-yr-old man tested positive for Coronavirus in Dumdum today.He was admitted on 16 March with fever & dry cough;symptoms intensified with acute respiratory distress syndrome & was put on ventilator. He's in Isolation ICU.<\/p><p><a href=\"http:\/\/www.newindianexpress.com\/nation\/2020\/mar\/21\/covid-19-man-with-no-foreign-travel-history-tests-positive-in-bengal-2119894.html\" target=\"_blank\"><strong>(READ FULL STORY HERE)<\/strong><\/a><\/p>","date":"2020-03-21 21:32:48","pin":"0","status":"1"},{"title":"First positive case in Assam, sample sent to ICMR research centre for reconfirmation","content":"<p>A four-and-half-year-old girl in Assam tested positive for novel coronavirus during preliminary medical examinations. However, to reconfirm it, the authorities sent the sample to the Regional Medical Research Centre under the Indian Council of Medical Research at Lahowal in Dibrugarh for laboratory testing.<\/p><p><a href=\"https:\/\/www.newindianexpress.com\/nation\/2020\/mar\/21\/assam-toddler-tests-positive-for-coronavirus-sample-sent-to-another-lab-for-reconfirmation-2119907.html\" target=\"_blank\"><strong>(READ FULL STORY HERE)<\/strong><\/a><\/p>","date":"2020-03-21 22:46:30","pin":"0","status":"1"},{"title":"","content":"<p><span style=\"font-size: large;\"><strong>Rajasthan<\/strong> CM Ashok Gehlot orders<strong> lockdown in state<\/strong> from <strong>March 22-March 31<\/strong>: Official statement<\/span><\/p>\n<p><a href=\"https:\/\/www.newindianexpress.com\/nation\/2020\/mar\/21\/coronavirus-gehlot-orders-lockdown-in-rajasthan-till-march-31-exempts-essential-services-2119946.html\" target=\"_blank\"><strong>(READ FULL STORY HERE)<\/strong><\/a><\/p>","date":"2020-03-21 22:53:06","pin":"0","status":"1"},{"title":"Two new cases confirmed in Andhra Pradesh; India tally mounts to 306","content":"<blockquote class=\"twitter-tweet\">\n<p lang=\"en\" dir=\"ltr\">Two more test positive for <a href=\"https:\/\/twitter.com\/hashtag\/coronavirus?src=hash&ref_src=twsrc%5Etfw\">#coronavirus<\/a> in <a href=\"https:\/\/twitter.com\/hashtag\/AndhraPradesh?src=hash&ref_src=twsrc%5Etfw\">#AndhraPradesh<\/a> A 24-year-old who returned from <a href=\"https:\/\/twitter.com\/hashtag\/Paris?src=hash&ref_src=twsrc%5Etfw\">#Paris<\/a> to <a href=\"https:\/\/twitter.com\/hashtag\/Vijayawada?src=hash&ref_src=twsrc%5Etfw\">#Vijayawada<\/a> and 22-year-old who came from <a href=\"https:\/\/twitter.com\/hashtag\/London?src=hash&ref_src=twsrc%5Etfw\">#London<\/a> to <a href=\"https:\/\/twitter.com\/hashtag\/Rajahmundry?src=hash&ref_src=twsrc%5Etfw\">#Rajahmundry<\/a>. Total + cases in <a href=\"https:\/\/twitter.com\/hashtag\/AP?src=hash&ref_src=twsrc%5Etfw\">#AP<\/a> 5 <a href=\"https:\/\/twitter.com\/NewIndianXpress?ref_src=twsrc%5Etfw\">@NewIndianXpress<\/a> <a href=\"https:\/\/twitter.com\/hashtag\/CoronaVirusUpdates?src=hash&ref_src=twsrc%5Etfw\">#CoronaVirusUpdates<\/a> <a href=\"https:\/\/twitter.com\/hashtag\/CoronavirusPandemic?src=hash&ref_src=twsrc%5Etfw\">#CoronavirusPandemic<\/a> <a href=\"https:\/\/twitter.com\/hashtag\/AndhraFightsCorona?src=hash&ref_src=twsrc%5Etfw\">#AndhraFightsCorona<\/a> <a href=\"https:\/\/t.co\/Vxlq3kq3Wv\">pic.twitter.com\/Vxlq3kq3Wv<\/a><\/p>\n— TNIE Andhra Pradesh (@xpressandhra) <a href=\"https:\/\/twitter.com\/xpressandhra\/status\/1241415801778737153?ref_src=twsrc%5Etfw\">March 21, 2020<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2020-03-21 23:06:15","pin":"0","status":"1"},{"title":"","content":"<p><a href=\"https:\/\/www.newindianexpress.com\/live\/2020\/mar\/22\/covid-19-india-ready-to-observe-janta-curfew-today-as-confirmed-cases-touch-315-2119970.html\" target=\"_blank\"><span style=\"font-size: x-large;\"><strong>CLICK HERE FOR FURTHER UPDATES<\/strong><\/span><\/a><\/p>","date":"2020-03-22 01:21:05","pin":"0","status":"1"}]}