{"details":[{"title":"SC upholds  royal family's rights","content":"<blockquote class=\"twitter-tweet\">\n<p lang=\"en\" dir=\"ltr\">Supreme Court upholds the rights of Travancore royal family in the administration of Sree Padmanabhaswamy Temple at Thiruvananthapuram in Kerala <a href=\"https:\/\/t.co\/3Ih9V1czIl\">pic.twitter.com\/3Ih9V1czIl<\/a><\/p>\n— ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1282544607482413056?ref_src=twsrc%5Etfw\">July 13, 2020<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2020-07-13 10:59:27","pin":"0","status":"1"},{"title":"Quick background of the case","content":"<ul>\n    <li>The bench comprising Justice UU Lalit and Justice Indu Malhotra is considering the appeal petition filed by the Travancore royal family against the 2011 verdict of the Kerala High Court.<br \/>\n    <\/li>\n    <li>The High Court had ruled that the temple and its assets should be taken over by the state government. Inventorying of the vaults where a treasure worth one lakh crore is hidden was also ordered.<br \/>\n     <\/li>\n    <li>Though inventorying of three vaults was completed, the opening of the Vault B, said to be the most important among them in terms of the value of items, was not done following the opposition of the royal family. They claimed that the vault cannot be opened as it would affect the sanctity of the shrine.<br \/>\n    <\/li>\n    <li>In the course of the case the royal family had put forth a suggestion to form a committee to manage the temple with a retired high court justice as its chairman.<br \/>\n    <\/li>\n    <li>The family wanted the chairman to be nominated by the high court chief justice.   Besides the decision on ownership and management of the temple, the SC is also expected to make a call on whether to open the vault B.<\/li>\n<\/ul>","date":"2020-07-13 11:01:36","pin":"0","status":"1"},{"title":"Royal family reacts to the verdict","content":"<p>Travancore royal family expressed happiness over the verdict. The temple wealth belongs to the deity, said the family.<\/p>","date":"2020-07-13 11:02:30","pin":"0","status":"1"},{"title":"","content":"<blockquote class=\"twitter-tweet\">\n<p lang=\"en\" dir=\"ltr\">Padmanabhaswamy temple: SC says administrative committee will manage the temple affairs <a href=\"https:\/\/twitter.com\/NewIndianXpress?ref_src=twsrc%5Etfw\">@NewIndianXpress<\/a> <a href=\"https:\/\/twitter.com\/TheMornStandard?ref_src=twsrc%5Etfw\">@TheMornStandard<\/a><\/p>\n— kanusarda (@sardakanu_TNIE) <a href=\"https:\/\/twitter.com\/sardakanu_TNIE\/status\/1282542867483734016?ref_src=twsrc%5Etfw\">July 13, 2020<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2020-07-13 11:04:36","pin":"0","status":"1"},{"title":"","content":"<p>The death of the last ruler will not result in escheat of the rights in favour of the government.<\/p>","date":"2020-07-13 11:08:56","pin":"0","status":"1"},{"title":"Verdict as read out:","content":"<p>\"We allow the appeal of the royal family of Travancore. Death does not effect Shebaitship of the Travancore Family. The bench gives a nod for constituting a committee headed by the district judge of Trivandrum.\"<\/p>","date":"2020-07-13 11:14:10","pin":"0","status":"1"},{"title":"Shebaitship by royal family upheld","content":"<p>The apex court stated that administrative Committee will manage the temple affairs while  District judge of Thiruvanathpuram will be the chairperson of the committee.<\/p>","date":"2020-07-13 11:15:14","pin":"0","status":"1"},{"title":"All committee members to be Hindus","content":"<p>Supreme Court specifies that all members of the temple committee will be Hindus.<\/p>","date":"2020-07-13 11:16:37","pin":"0","status":"1"},{"title":"What is Shebaitship?","content":"<p>Broadly described, a shebait is the human ministrant and custodian of an idol, its earthly spokesman, its authorised representative entitled to deal with all its temporal affairs and to manage its property.<\/p>","date":"2020-07-13 11:24:19","pin":"0","status":"1"},{"title":"Committee to decide whether to open Vault B or not","content":"<p>The question on whether Vault B will be opened or not will be decided by the committee formed. J Lalit stated that this interim arrangement will become the final arrangement.<\/p>","date":"2020-07-13 11:27:55","pin":"0","status":"1"},{"title":"","content":"<p>The top court delivered the verdict on a batch of appeals, including the one filed by the legal representatives of the Travancore royal family, challenging the January 31, 2011 verdict of the high court in the matter.<\/p>","date":"2020-07-13 11:29:04","pin":"0","status":"1"},{"title":"State govt welcomes verdict","content":"<p>The state government respects the SUpreme Court verdict and hence won't challenge it, Devaswom Minister Kadakampally Surendran said.<\/p>","date":"2020-07-13 11:34:42","pin":"0","status":"1"},{"title":"Temple executive officer welcomes verdict","content":"<p>V Ratheesan, IAS said the court's  direction to continue with the present committee for the timebeing is a recognition.<\/p>","date":"2020-07-13 11:43:04","pin":"0","status":"1"},{"title":"Royal family express happiness ","content":"<blockquote class=\"twitter-tweet\">\n<p lang=\"en\" dir=\"ltr\">We wholeheartedly welcome Supreme Court verdict on Sree Padmanabhaswamy Temple. It re-establishes our family's connection with Lord Sree Padmanabha. The family is happy about it. We're looking forward to reading the full verdict:Adithya Varma,Travancore royal family member to ANI <a href=\"https:\/\/t.co\/suciUDeVvD\">https:\/\/t.co\/suciUDeVvD<\/a><\/p>\n— ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1282567891557052417?ref_src=twsrc%5Etfw\">July 13, 2020<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2020-07-13 12:45:23","pin":"0","status":"1"},{"title":"Chronology of events","content":"<ul>\n    <li>Jan 31, 2011: HC orders state government to take over the temple's control, restrains executive officer and Maharaja of the royal family against opening any of Kallaras (vault). <br \/>\n     <\/li>\n    <li>May 2: An appeal of Uthradam Thirunal Marthanda Varma, brother of the last ruler, comes up for hearing before the SC, which grants interim stay on the high court directives.  It also directs conducting a detailed inventory of the articles\/ valuables\/ ornaments in Kallaras (vaults) and appoints a team of observers. <br \/>\n     <\/li>\n    <li>Jul 8: SC orders that opening of kallara 'A' and 'B' is to be kept in abeyance till further orders.     <br \/>\n     <\/li>\n    <li>Jul 21: SC considers state's response, directs setting up of an Expert Committee to advise on inventory, conservation and security.  It says panel would examine and give an opinion whether it is necessary to open Kallara 'B'. <br \/>\n    <\/li>\n    <li>Sep 22: SC examines interim report of the Expert Committee, issues directions.  It says issue relating to opening of Kallara 'B' shall be considered after substantial progress is made in regard to documentation, categorization, security, preservation, conservation, maintenance and storage relating to the contents in the other Kallaras. <br \/>\n    <\/li>\n    <li>Aug 23, 2012: The Court appointed Senior Advocate Gopal Subramaniam as an amicus curiae.   <br \/>\n    <\/li>\n    <li>Dec 6, 2013: Uthradam Thirunal Marthanda Varma passed away, his legal heirs later substitute him in SC.<br \/>\n    <\/li>\n    <li>Apr 15, 2014: Amicus Curiae submits report.   <br \/>\n    <\/li>\n    <li>Apr 24: The Court appoints Administrative Committee headed by the District Judge, Thiruvananthapuram, to manage the temple. <br \/>\n     <\/li>\n    <li>Aug-Sep 2014: Gopal Subramaniam writes to SC opting out as amicus curiae.  Later, he withdraws his resignation and continues to assist the SC.   <br \/>\n    <\/li>\n    <li>Nov 2014: Royal family questions Amicus Curiae Gopal Subramaniam's report, files objections before SC.<br \/>\n    <\/li>\n    <li>Nov 27: SC accepts some of the recommendations made by the Amicus Curiae. <br \/>\n    <\/li>\n    <li>Jul 4, 2017: SC appoints Justice K S P Radhakrishnan as Chairman of the Selection Committee for the Sreekovil and other allied works.  SC says it would examine claims that one of the vaults of the temple contains extraordinary treasure with \"mystical\" energy, passes a slew of directions including on the security of the treasures, auditing of accounts and repair of the deity.<br \/>\n     <\/li>\n    <li>Jan-Apr 2019: The cases are posted before the bench comprising of Justices UU Lalit and Indu Malhotra for final hearing. <br \/>\n     <\/li>\n    <li>Apr 10: SC reserves verdict on pleas challenging January 31, 2011 judgement of the Kerala HC in the matter. <br \/>\n    <\/li>\n    <li>Jul 13, 2020: SC upholds right of Travancore royal family in administration of Temple.<\/li>\n<\/ul>","date":"2020-07-13 12:59:04","pin":"0","status":"1"},{"title":"Maharashtra: 6,497 new cases, 193 deaths and 4,182 recovery in last 24 hours","content":"<blockquote class=\"twitter-tweet\">\n<p lang=\"en\" dir=\"ltr\">In Maharashtra, total 2,60,924 <a href=\"https:\/\/twitter.com\/hashtag\/COVID__19?src=hash&ref_src=twsrc%5Etfw\">#COVID__19<\/a> positive patients, 10482 deaths and 1,44,507 recovery reported. Today, 6497 new cases, 193 deaths and 4182 recovery reported. <a href=\"https:\/\/twitter.com\/NewIndianXpress?ref_src=twsrc%5Etfw\">@NewIndianXpress<\/a> <a href=\"https:\/\/twitter.com\/Sunday_Standard?ref_src=twsrc%5Etfw\">@Sunday_Standard<\/a><\/p>\n— Sudhir Suryawanshi (@ss_suryawanshi) <a href=\"https:\/\/twitter.com\/ss_suryawanshi\/status\/1282683169456582657?ref_src=twsrc%5Etfw\">July 13, 2020<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2020-07-13 20:08:37","pin":"0","status":"0"},{"title":"Left gasping since COVID lockdown: The distressed Khes weavers of UP's ceramic city","content":"<p>The lesser-known Khes weavers in UP, who earn their livelihood solely by churning blankets out of yarns of cotton, have been rendered jobless since the great lockdown began in March.<br \/>\n<strong>(<a href=\"https:\/\/www.newindianexpress.com\/nation\/2020\/jul\/13\/left-gasping-since-the-covid-lockdown-the-distressed-khes-weavers-of-ups-ceramic-city-2169218.html\" target=\"_blank\">READ FULL REPORT HERE<\/a>)<\/strong><\/p>","date":"2020-07-13 20:09:45","pin":"0","status":"0"},{"title":"Karnataka: COVID-19 tally crosses 41,000 with 2,738 new cases in last 24 hours","content":"<blockquote class=\"twitter-tweet\">\n<p lang=\"en\" dir=\"ltr\">2,738 new <a href=\"https:\/\/twitter.com\/hashtag\/COVID19?src=hash&ref_src=twsrc%5Etfw\">#COVID19<\/a> cases & 73 deaths reported in Karnataka till Monday evening. 839 discharged. 545 people in ICUs. 1315 cases from Bengaluru urban alone<br \/>\n<br \/>\nState's tally- 41,581<br \/>\nActive cases - 24,572<br \/>\nDeaths- 757+4<br \/>\nDischarges- 16,248<a href=\"https:\/\/twitter.com\/NewIndianXpress?ref_src=twsrc%5Etfw\">@NewIndianXpress<\/a> <a href=\"https:\/\/twitter.com\/XpressBengaluru?ref_src=twsrc%5Etfw\">@XpressBengaluru<\/a> <a href=\"https:\/\/twitter.com\/santwana99?ref_src=twsrc%5Etfw\">@santwana99<\/a> <a href=\"https:\/\/t.co\/27mnk8PoZm\">pic.twitter.com\/27mnk8PoZm<\/a><\/p>\n— Anusha Ravi Sood (@anusharavi10) <a href=\"https:\/\/twitter.com\/anusharavi10\/status\/1282684727699234816?ref_src=twsrc%5Etfw\">July 13, 2020<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2020-07-13 20:10:58","pin":"0","status":"0"}]}