{"details":[{"title":"Melania Trump's chief of staff, White House deputy press secretary resign","content":"<ul>\n\t<li>Stephanie Grisham, the US first lady Melania Trump&#39;s chief of staff, and White House Deputy Press Secretary Sarah Matthews have resigned following violence at the US Capitol by supporters of President Donald Trump.<\/li>\n\t<li>Grisham, who previously served as the White House press secretary before making way for current White House Press Secretary Kayleigh McEnany in April, was the first to submit her resignation Wednesday.<\/li>\n\t<li>&quot;It has been an honour to serve the country in the White House,&quot; Grisham said in a statement posted on Twitter.<\/li>\n\t<li>&quot;I am very proud to have been a part of Mrs Trump&#39;s mission to help children everywhere and proud of the many accomplishments of this administration,&quot; Grisham said.<\/li>\n\t<li>She is the first senior White House staffer to resign. Matthews also tendered her resignation.<\/li>\n\t<li>&quot;As someone who worked in the halls of Congress, I was deeply disturbed by what I saw today,&quot;&nbsp;she said.<\/li>\n\t<li>&quot;I will be stepping down from my role, effective immediately. Our nation needs a peaceful transfer of power,&quot;&nbsp;Matthews said.<\/li>\n\t<li>According to ABC News, White House social secretary Rickie Niceta also submitted her resignation in reaction to the violent protest by Trump supporters.<\/li>\n<\/ul>\n","date":"2021-01-07 09:07:25","pin":"0","status":"1"},{"title":"US Senate rejects challenge to Biden's Arizona win","content":"<ul>\n\t<li>The Senate has overwhelmingly turned aside a challenge to US President-elect Joe Biden&#39;s victory in Arizona, guaranteeing the result will stand. The objection to the results in Arizona -- spearheaded by Rep. Paul Gosar and Sen. Ted Cruz -- was rejected 93-6 on Wednesday night.<\/li>\n\t<li>All votes in favour came from Republicans, but after violent protesters mobbed the Capitol earlier Wednesday a number of GOP senators who had planned to support the objection reversed course.<\/li>\n\t<li>The Republicans raised the objection based on false claims pushed by President Donald Trump and others of issues with the vote in Arizona, which were repeatedly dismissed in Arizona&#39;s courts and by the state&#39;s election officials.<\/li>\n<\/ul>\n","date":"2021-01-07 09:08:37","pin":"0","status":"1"},{"title":"Democratic process can't be subverted through unlawful protests, says PM Modi","content":"<p>Condemning the violent situation that unfolded at the US Capitol in Washington on Wednesday, Prime Minister Narendra Modi on Thursday said the democratic process cannot be allowed to be subverted through unlawful protests and called for an orderly and peaceful transfer of power. <strong><a href=\"https:\/\/www.newindianexpress.com\/nation\/2021\/jan\/07\/us-capitol-riots-democratic-process-cannot-be-subverted-through-unlawful-protests-says-pm-modi-2246723.html\" target=\"_blank\">(READ FULL STORY HERE)<\/a><\/strong><\/p>\n","date":"2021-01-07 09:10:46","pin":"0","status":"1"},{"title":"Disgraceful, deeply disturbed: World leaders on US Capitol violence","content":"<p>Key allies were appalled at what they described as an attack on American democracy, though some said they believed U.S. democratic institutions would withstand the turmoil. <strong><a href=\"https:\/\/www.newindianexpress.com\/world\/2021\/jan\/07\/disgraceful-deeply-disturbed-world-leaders-onus-capitol-violence-2246720.html\" target=\"_blank\">(READ FULL STORY HERE)<\/a><\/strong><\/p>\n","date":"2021-01-07 09:11:41","pin":"0","status":"1"},{"title":"Unfurling of Puerto Rican flag, firing on Congressmen: US Capitol's tryst with violence in its 220 years of existence","content":"<p>In 1814, just 14 years after the building opened, British forces in the War of 1812 tried to burn it down. The invaders looted the building first, and then set the southern and northern wings ablaze, incinerating the Library of Congress. <strong><a href=\"https:\/\/www.newindianexpress.com\/world\/2021\/jan\/07\/unfurling-of-puerto-rican-flag-firing-on-congressmen-us-capitols-tryst-with-violence-in-its-220-y-2246716.html\" target=\"_blank\">(READ FULL STORY HERE)<\/a><\/strong><\/p>\n","date":"2021-01-07 09:12:38","pin":"0","status":"1"},{"title":"Trump's rage ignites mob assault on democracy","content":"<p>The scene that unfolded, pushing through police barricades, breaking windows, then occupying seats of power, was one that Americans are accustomed to watching in distant lands with authoritarian regimes. <strong><a href=\"https:\/\/www.newindianexpress.com\/world\/2021\/jan\/07\/us-capitol-riots-trumps-rage-ignites-mob-assault-on-democracy-2246719.html\" target=\"_blank\">(READ FULL STORY HERE)<\/a><\/strong><\/p>\n","date":"2021-01-07 09:13:42","pin":"0","status":"1"},{"title":"US Capitol riot product of years of hateful rhetoric stoked by disinformation: Experts","content":"<p>Members of far-right groups, including the violent Proud Boys, joined the crowds that formed in Washington to cheer on President Donald Trump as he urged them to protest Congress&#39; counting of Electoral College votes confirming President-elect Joe Biden&#39;s win. <strong><a href=\"https:\/\/www.newindianexpress.com\/world\/2021\/jan\/07\/us-capitol-riot-product-of-years-of-hateful-rhetoricstoked-by-disinformation-experts-2246718.html\" target=\"_blank\">(READ FULL STORY HERE)<\/a><\/strong><\/p>\n","date":"2021-01-07 09:14:30","pin":"0","status":"1"},{"title":"30 arrested for curfew violation","content":"<p>Police have arrested 30 people for violating a curfew imposed in Washington, D.C., after rioters stormed the U.S. Capitol, says AP.<\/p>\n","date":"2021-01-07 09:15:09","pin":"0","status":"1"},{"title":"Emergency extended at Washington","content":"<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\">I have issued order extending the public emergency declared earlier today for a total of 15 days: Mayor of <a href=\"https:\/\/twitter.com\/hashtag\/WashingtonDC?src=hash&amp;ref_src=twsrc%5Etfw\">#WashingtonDC<\/a>, Muriel Bowser <a href=\"https:\/\/t.co\/cozs5wSGz4\">pic.twitter.com\/cozs5wSGz4<\/a><\/p>\n&mdash; ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1347029513029312513?ref_src=twsrc%5Etfw\">January 7, 2021<\/a><\/blockquote>\n<script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2021-01-07 09:34:24","pin":"0","status":"1"},{"title":"Obama hits out at Trump","content":"<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\">Here&rsquo;s my statement on today&rsquo;s violence at the Capitol. <a href=\"https:\/\/t.co\/jLCKo2D1Ya\">pic.twitter.com\/jLCKo2D1Ya<\/a><\/p>\n&mdash; Barack Obama (@BarackObama) <a href=\"https:\/\/twitter.com\/BarackObama\/status\/1346983894298595330?ref_src=twsrc%5Etfw\">January 7, 2021<\/a><\/blockquote>\n<script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2021-01-07 09:37:09","pin":"0","status":"1"},{"title":"Death toll goes up to four, reports AP","content":"<ul>\n\t<li>Four people died as supporters of President Donald Trump violently occupied the U.S. Capitol. Washington, D.C., Police Chief Robert Contee said the dead on Wednesday included a woman who was shot by the U.S. Capitol Police, as well as three others who died in &ldquo;medical emergencies.&rdquo;<\/li>\n\t<li>Police said both law enforcement and Trump supporters deployed chemical irritants during the hourslong occupation of the Capitol building before it was cleared Wednesday evening by law enforcement.<\/li>\n\t<li>The woman was shot earlier Wednesday as the mob tried to break through a barricaded door in the Capitol where police were armed on the other side.<\/li>\n\t<li>She was hospitalized with a gunshot wound and later died. D.C. police officials also say two pipe bombs were recovered, one outside the Democratic National Committee and one outside the Republican National Committee.<\/li>\n\t<li>Police found a cooler from a vehicle that had a long gun and Molotov cocktail on Capitol grounds.<\/li>\n<\/ul>\n","date":"2021-01-07 09:45:35","pin":"1","status":"1"},{"title":"Republican congresswoman justifies riots with Hitler quote, draws criticism","content":"<p>Mary Miller of Illinois, elected in November to replace Republican John Shimkus, spoke during an event by conservative group &quot;Moms for America,&quot; one of several demonstrations by Trump supporters. <strong><a href=\"https:\/\/www.newindianexpress.com\/world\/2021\/jan\/07\/capitol-violence-republican-congresswoman-justifies-riots-with-hitler-quote-draws-criticism-2246727.html\" target=\"_blank\">(READ FULL STORY HERE)<\/a><\/strong><\/p>\n","date":"2021-01-07 10:06:52","pin":"0","status":"1"},{"title":"Capitol riots: Biden urges restoring decency after 'assault' on democracy","content":"<p>Biden had planned to deliver a speech focused on how to revive the economy and provide financial relief for small-business owners reeling from the coronavirus pandemic, giving routine political remarks from a theater in his native Delaware. But shortly before he was to begin speaking, demonstrators broke into the Capitol building, reaching as far as the Senate floor. <strong><a href=\"https:\/\/www.newindianexpress.com\/world\/2021\/jan\/07\/capitol-riots-biden-urges-restoring-decency-after-assault-on-democracy-2246728.html\" target=\"_blank\">(READ FULL STORY HERE)<\/a><\/strong><\/p>\n","date":"2021-01-07 10:14:14","pin":"0","status":"1"},{"title":"IN PICS | When pro-Trump mob stormed the building to overturn election","content":"<p>A violent mob loyal to President Donald Trump stormed the US Capitol on Wednesday and forced lawmakers into hiding, in a stunning attempt to overturn America&rsquo;s presidential election, undercut the nation&rsquo;s democracy and keep Democrat Joe Biden from replacing Trump in the White House. <strong><a href=\"https:\/\/www.newindianexpress.com\/galleries\/world\/2021\/jan\/07\/us-capitol-violence-in-10-pictureswhen-pro-trump-mob-stormed-the-building-to-overturn-election-103056--1.html\" target=\"_blank\">(VIEW THE GALLERY HERE)<\/a><\/strong><\/p>\n","date":"2021-01-07 10:26:13","pin":"0","status":"1"},{"title":"Moment of 'great dishonour and shame' for US: Obama","content":"<p>The statement of the former popular president came hours after thousands of pro-Trump rioters on Wednesday stormed the US Capitol, interrupting a joint session of Congress where lawmakers were set to certify President-elect Joe Biden&#39;s win.<strong><a href=\"https:\/\/www.newindianexpress.com\/world\/2021\/jan\/07\/moment-of-great-dishonour-and-shame-for-us-obama-attacks-trump-over-capitol-violence-2246733.html\" target=\"_blank\"> (READ FULL STORY HERE)<\/a><\/strong><\/p>\n","date":"2021-01-07 10:32:27","pin":"0","status":"1"},{"title":"'Violence never wins', says Mike Pence as Senate returns, rejects challenge to Biden's Arizona win","content":"<p>&quot;We condemn the violence that took place here in the strongest possible terms. We grieve the loss of life in these hallowed halls, as well as the injuries suffered by those who defended our Capitol today. And we will always be grateful to the men and women who stayed at their posts to defend this historic place,&quot; Pence said in his remarks as he presided over the resumption of the Joint Session of the Congress, which was disrupted after the violence. <strong><a href=\"https:\/\/www.newindianexpress.com\/world\/2021\/jan\/07\/violence-never-wins-saysmike-pence-as-senate-returnsrejects-challenge-to-bidens-arizona-win-2246735.html\" target=\"_blank\">(READ FULL STORY HERE)<\/a><\/strong><\/p>\n","date":"2021-01-07 10:46:54","pin":"0","status":"1"},{"title":"Over 50 arrested so far","content":"<p>Police say 52 have been arrested, following the violence at the US Capitol, reports Reuters.<\/p>\n","date":"2021-01-07 10:49:21","pin":"0","status":"1"},{"title":"Capitol riots: US lawmakers seek immediate removal of Trump","content":"<p>According to Congresswoman Ayanna Pressley, the acts of &quot;domestic terrorism&quot; at the Capitol makes it clear that Trump is a &quot;grave threat to our democracy who must immediately be removed from office&quot;. <strong><a href=\"https:\/\/www.newindianexpress.com\/world\/2021\/jan\/07\/capitol-riots-us-lawmakers-seek-immediate-removal-of-trump-2246740.html\" target=\"_blank\">(READ FULL STORY HERE)<\/a><\/strong><\/p>\n","date":"2021-01-07 11:06:13","pin":"0","status":"1"},{"title":"Sombre Senate unites to reject election challenges as death toll reaches four","content":"<p>The riot in the Capitol prompted more than half of those who had signed on to the protest to instead vote &quot;no. Catering to Trump&#39;s supporters seemed less important than defending democracy.&quot;<strong><a href=\"https:\/\/www.newindianexpress.com\/world\/2021\/jan\/07\/capitol-violence-sombre-senate-unites-to-reject-election-challenges-as-death-toll-reaches-four-2246748.html\" target=\"_blank\"> (READ FULL STORY HERE)<\/a><\/strong><\/p>\n","date":"2021-01-07 11:30:13","pin":"0","status":"1"},{"title":"US House, Senate reject challenge to Biden's win in Arizona","content":"<ul>\n\t<li>Both the US House of Representatives and the Senate have rejected the challenge to President-elect Joe Biden&#39;s victory in Arizona.<\/li>\n\t<li>In a massive rebuke to the efforts of President Donald Trump and his supporting lawmakers, the Republican-controlled Senate on Wednesday voted 93-6 against the objection to the election results, while the House of Representatives rejected it by 303-121 votes.<\/li>\n\t<li>Following violence by pro-Trump supporters at the US capitol, several Republican Senators have decided not to raise objections to the election results.<\/li>\n\t<li>Both the House and the Senate voted on the objection after two hours of debate.<\/li>\n<\/ul>\n","date":"2021-01-07 11:31:36","pin":"1","status":"1"},{"title":"Smooth sailing for Biden in US Electoral College so far","content":"<ul>\n\t<li>The Senate has quickly killed Republican objections to Pennsylvania&rsquo;s electoral vote for President-elect Joe Biden. Senators voted 92-7 after midnight to derail the GOP attempt to overturn Pennsylvania&rsquo;s support for the Democrat.<\/li>\n\t<li>In a long day dominated by pro-Trump rioters&rsquo; deadly storming of the Capitol, it&#39;s the second state for which a group of Republicans tried and failed to reverse the will of voters. Some GOP lawmakers have backed President Donald Trump&rsquo;s bogus claims that the election was fraudulent.<\/li>\n\t<li>Senate Majority Leader Mitch McConnell says he believes no other states&rsquo; votes will be challenged.<\/li>\n\t<li>That means Congress&rsquo; formal certification of Biden&rsquo;s victory could finish quickly once the House votes on the Pennsylvania challenge.<\/li>\n\t<li>The Senate rejected the effort to cancel Pennsylvania&rsquo;s votes without any debate.<\/li>\n\t<li>Those objecting to Pennsylvania&rsquo;s votes included 80 House Republicans and Missouri GOP Sen. Josh Hawley, who is considered a potential 2024 presidential contender.<\/li>\n<\/ul>\n","date":"2021-01-07 11:43:15","pin":"0","status":"1"},{"title":"FBI jumps into action","content":"<p>FBI says it &quot;is seeking information that will assist in identifying individuals who are actively instigating violence in Washington DC,&quot; reports NBC News.<\/p>\n","date":"2021-01-07 11:50:38","pin":"0","status":"1"},{"title":"Trump is 'menace', must be removed and held accountable for Capitol attack: US media","content":"<p>In an editorial titled &#39;Trump is to blame for Capitol attack&#39;, The New York Times said, &quot;President Trump and his Republican enablers in Congress incited a violent attack Wednesday against the government they lead and the nation they profess to love. This cannot be allowed to stand.&quot; <strong><a href=\"https:\/\/www.newindianexpress.com\/world\/2021\/jan\/07\/trump-is-menace-must-be-removed-and-held-accountable-for-capitol-attack-us-media-2246759.html\" target=\"_blank\">(READ FULL STORY HERE)<\/a><\/strong><\/p>\n","date":"2021-01-07 12:15:09","pin":"0","status":"1"},{"title":"Lawmakers vow to investigate police after Capitol breach","content":"<p>The incident forced lawmakers to crouch under desks and don gas marks, while police futilely tried to barricade the building. A woman was shot and killed inside the Capitol, and Washington&#39;s mayor instituted an evening curfew in an attempt to contain the violence. <strong><a href=\"https:\/\/www.newindianexpress.com\/world\/2021\/jan\/07\/us-riots-lawmakers-vow-to-investigate-police-after-capitol-breach-2246763.html\" target=\"_blank\">(READ FULL STORY HERE)<\/a><\/strong><\/p>\n","date":"2021-01-07 12:37:54","pin":"0","status":"1"},{"title":"This is not Ukraine or Belarus: Media captures unprecedented storming of US Capitol","content":"<p>The scenes of bedlam and fear at the center of national government erupted quickly, but journalists wondered whether they should have been a surprise. <strong><a href=\"https:\/\/www.newindianexpress.com\/world\/2021\/jan\/07\/this-not-ukraine-or-belarus-media-captures-unprecedented-storming-of-uscapitol-2246769.html\" target=\"_blank\">(READ FULL STORY HERE)<\/a><\/strong><\/p>\n","date":"2021-01-07 12:54:54","pin":"0","status":"1"},{"title":"Tempers flare in House debates","content":"<ul>\n\t<li>A small group of House lawmakers came close to physically fighting early Thursday morning as the congressional count of electoral votes stretched into the wee hours and a Pennsylvania Democrat charged that Republicans had been telling &ldquo;lies&rdquo; about his state&rsquo;s votes.<\/li>\n\t<li>Rep. Morgan Griffiths, R-Va., objected after Rep. Conor Lamb, D-Pa., said a breach of the Capitol by an angry mob earlier in the day was &ldquo;inspired by lies, the same lies you are hearing in this room tonight.&rdquo;<\/li>\n\t<li>House Speaker Nancy Pelosi shot down the objection, but a few minutes later Republicans and Democrats streamed to the middle aisle, with around a dozen lawmakers getting close to each other and arguing. But the group quickly broke up when Pelosi called for order on the floor.<\/li>\n\t<li>President Donald Trump has falsely claimed there was widespread fraud in Pennsylvania and other states and Republicans have echoed those claims as they have challenged electoral votes.<\/li>\n<\/ul>\n","date":"2021-01-07 13:04:03","pin":"0","status":"1"},{"title":"US Congress certifies victory of Biden and Kamala","content":"<p>Joint session of US Congress certifies victory of President-elect Joe Biden and Vice President-elect Kamala Harris in Nov 3 election.<\/p>\n","date":"2021-01-07 14:16:11","pin":"1","status":"1"},{"title":"US House Speaker Pelosi's office damaged during Capitol riot","content":"<p>Pelosi&#39;s aides said the mob shattered a big mirror in the office of the 80-year-old top Democrat and took the nameplate from above the door of her office in the highly-secure building. One image captured a Trump supporter sitting with his feet up on the desk of Pelosi, a fierce critic of President Donald Trump, a Republican.<\/p>\n\n<p><a href=\"https:\/\/www.newindianexpress.com\/world\/2021\/jan\/07\/us-house-speaker-pelosis-office-damaged-during-capitol-riot-2246796.html\" target=\"_blank\"><strong>FULL REPORT HERE<\/strong><\/a><\/p>\n\n<p><\/p>\n","date":"2021-01-07 14:19:46","pin":"0","status":"1"},{"title":"US Congress rejects challenge to Biden's Pennsylvania win","content":"<p>US lawmakers on Thursday rejected a second Republican-led objection to certifying electoral votes for Joe Biden, hours after a riot by Donald Trump supporters forced a delay in the process, AFP reported.&nbsp;The Senate voted 92 to 7 against the effort to discount Pennsylvania&#39;s 20 electoral votes and the House followed suit, albeit with more than 130 Republicans supporting the decertification bid.&nbsp;With 38 states now certified, Congress moved to continue its late night process to affirm the electoral votes of all 50 states and formalize Biden&#39;s victory.<\/p>\n","date":"2021-01-07 14:24:43","pin":"0","status":"1"},{"title":"Trump pledges 'orderly' transfer of power to Biden on January 20","content":"<p>US President Donald Trump says there will be an &quot;orderly&quot; transfer of power to Joe Biden on <a href=\"https:\/\/www.newindianexpress.com\/world\/2021\/jan\/07\/trump-pledges-orderly-transfer-of-power-to-biden-on-january-20-2246810.html\" target=\"_blank\">January 20.<\/a><\/p>\n","date":"2021-01-07 14:57:19","pin":"0","status":"1"},{"title":"'Inexcusable act of carnage, chaos': Hollywood and Bollywood react sharply to US Capitol attack","content":"<p>Cinema and music personalities, including Chris Evans, Mark Ruffalo, Cardi B, Richa Chadha, and Vir Das, have condemned the attack on the Capitol Hill in the US by thousands of supporters of President Donald Trump who clashed with police, calling it an act of &quot;terror&quot; and assault on democracy.<\/p>\n\n<p><a href=\"https:\/\/www.newindianexpress.com\/entertainment\/english\/2021\/jan\/07\/inexcusable-act-of-carnage-chaos-hollywood-and-bollywood-react-sharply-to-us-capitol-attack-2246799.html\" target=\"_blank\"><strong>FULL REPORT HERE<\/strong><\/a><\/p>\n","date":"2021-01-07 15:07:50","pin":"0","status":"1"},{"title":"Hong Kongers call US violence a setback for democracy","content":"<p><a href=\"https:\/\/www.newindianexpress.com\/world\/2021\/jan\/07\/hong-kongers-call-us-violence-a-setback-for-democracy-2246830.html\" target=\"_blank\">Hong Kong residents<\/a> from across the political spectrum condemned mob violence at the U.S. Capitol, 18 months after protesters stormed their own legislature to demand greater democracy, not the overthrow of election results.<\/p>\n","date":"2021-01-07 15:59:19","pin":"0","status":"1"}]}