{"details":[{"title":"Pandemic-battered salaried class to get some cushion now","content":"<p>The salaried class battered by the pandemic is likely to get some relief this year, with major changes in tax slabs being ruled out and experts hinting at some relief in terms of increased limit of standard deduction. <strong><a href=\"http:\/\/cms.newindianexpress.com\/business\/2021\/feb\/01\/budget-2021-pandemic-battered-salaried-class-to-get-some-cushion-now-2257805.html\">(READ MORE)<\/a><\/strong><\/p>\n","date":"2021-02-01 10:27:29","pin":"0","status":"1"},{"title":"Sitharaman replaces Swadeshi 'bahi khata' with tablet as Union budget goes digital","content":"<p>With the Union Budget 2021 set to be delivered in paperless form for the first time, Finance Minister Nirmala Sitharaman replaced the Swadeshi &#39;bahi khata&#39; and switched to a tablet.<\/p>\n\n<p>The Finance Minister was seen carrying a tablet kept inside a red coloured cover with a golden coloured national emblem embossed on it.<\/p>\n\n<div style=\"text-align:center\">\n<figure class=\"image\" style=\"display:inline-block\"><img alt=\"\" height=\"333\" src=\"https:\/\/images.newindianexpress.com\/uploads\/user\/imagelibrary\/2021\/2\/1\/original\/Nirmala_Sitharaman-_EPS.jpeg\" width=\"500\" \/>\n<figcaption><em>Express Photo by Shekhar Yadav<\/em><\/figcaption>\n<\/figure>\n<\/div>\n","date":"2021-02-01 10:34:17","pin":"0","status":"1"},{"title":"Sensex, Nifty open higher ahead of Budget 2021 presentation","content":"<p>The BSE benchmark Sensex surged over 443 points and the NSE Nifty advanced 115 points in opening trade on Monday, ahead of the Union Budget 2021-22 presentation in Parliament.<\/p>\n\n<p>The 30-share Sensex was trading higher by 443.06 points or 0.96 per cent at 46,728.83; and the broader Nifty was up 114.85 points or 0.84 per cent at 13,749.45.<\/p>\n","date":"2021-02-01 10:36:47","pin":"0","status":"1"},{"title":"Union Cabinet meeting begins","content":"<p>Union Cabinet&#39;s meeting begins ahead of the presentation of Budget 2021-22 by Finance Minister Nirmala Sitharaman at the Parliament on Monday.<\/p>\n","date":"2021-02-01 10:37:21","pin":"0","status":"1"},{"title":"Watch out for increase in healthcare expenditure: P Chidambaram","content":"<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\">Watch out for increase in healthcare expenditure and increase in defence expenditure. These are two non-negotiables<br \/>\n<br \/>\nThen watch out for the 10 heads highlighted by the Congress party on 28th January<\/p>\n&mdash; P. Chidambaram (@PChidambaram_IN) <a href=\"https:\/\/twitter.com\/PChidambaram_IN\/status\/1356088832563634176?ref_src=twsrc%5Etfw\">February 1, 2021<\/a><\/blockquote>\n<script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2021-02-01 10:45:13","pin":"0","status":"1"},{"title":"OPINION | Budget 2021: Thinking desi, being desi and protecting rural spaces","content":"<p>There is always a clamour for sops to be able to penetrate rural India and percolate every urban product and service into the gut of our mother market. If Budget 2021 fulfils these ambitions of mine, or for that matter accepts it as an ethos of development as we want it to be, I will be the happiest of them all -&nbsp;Harish Bijoor&nbsp;<strong><a href=\"https:\/\/www.newindianexpress.com\/opinions\/2021\/feb\/01\/budget-2021-thinking-desi-being-desi-andprotecting-rural-spaces-2257781.html\" target=\"_blank\">(READ MORE)<\/a><\/strong><\/p>\n","date":"2021-02-01 10:52:49","pin":"0","status":"1"},{"title":"Cabinet approves Union Budget","content":"<p>Union Cabinet approves the Union Budget 2021-22 that will be presented by Finance Minister Nirmala Sitharaman in the Parliament.<\/p>\n","date":"2021-02-01 10:58:38","pin":"0","status":"1"},{"title":"","content":"<p><strong>Finance Minister Nirmala Sitharaman begins Budget presentation&nbsp;<\/strong><\/p>\n","date":"2021-02-01 11:04:04","pin":"0","status":"1"},{"title":"PM announced the Pradhan Mantri Gareeb Kalyan Yojna during lockdown: FM","content":"<p>During the lockdown last year, PM Modi announced the Pradhan Mantri Gareeb Kalyan Yojna worth Rs 2.76 lakh crore for the poor and the needy: FM<\/p>\n","date":"2021-02-01 11:07:30","pin":"0","status":"1"},{"title":"What we have endured with COVID-19 to 2020 is Sui generis: FM","content":"<p>&quot;Preparation of this Budget was undertaken under circumstances like never before.&nbsp;We couldn&#39;t have imagined the global slowdown during the last Budget.&quot;, said FM.&nbsp;<\/p>\n\n<p>&quot;We announced the &#39;Aatmanirbhar&#39; Package in May 2020 to sustain recovery. Atmanirbhar Bharat and Pradhan Mantri Yojana were like five mini Budgets in themselves. Total COVID-19 support measures amount to 13 per cent of GDP and total COVID-19 support measures by government and RBI amounts to Rs 27.1 lakh crore,&quot; she added.<\/p>\n","date":"2021-02-01 11:10:18","pin":"0","status":"1"},{"title":"FM Sitharaman quotes Rabindranath Tagore","content":"<p>&quot;Faith is the bird that feels the light and sings when the dawn is still dark&quot; FM Sitharaman quotes Rabindranath Tagore, adding that &quot;this moment in history is the dawn of a new era, where India is well-poised to be the land of promise and hope&quot;<\/p>\n","date":"2021-02-01 11:16:16","pin":"0","status":"1"},{"title":"Atmanirbhar Swasth Bharat Yojana: Government to spend Rs 64,180 crore over six years","content":"<p>Finance Minister Nirmala Sitharaman announced the PM Atmanirbhar Swasth Bharat Yojana which will spend Rs 64,180 crore on primary, secondary and tertiary healthcare over a period of six years.<\/p>\n\n<p>This will be in addition to the National Health Mission. 17,000 rural and 11,000 urban health and wellness centres to be set up Integrated public health labs to be set up in each district, 3,382 block public health units in 11 states.<\/p>\n","date":"2021-02-01 11:17:07","pin":"0","status":"1"},{"title":"Another long budget speech in the offing, will it set a new record?","content":"<p>The FM has begun&nbsp;her Budget 2022 speech with a self-congratulatory round of Covid-measures.&nbsp;Sitharaman has a tendency to&nbsp;repeat for impact.&nbsp;Will this be yet another long&nbsp;budget speech? Will she break her own record set last year speaking for over 1.5 hours -- the longest ever?<\/p>\n","date":"2021-02-01 11:18:28","pin":"0","status":"1"},{"title":"Government to spend Rs 1.41 lakh crore for Urban Clean India Mission","content":"<p>The Urban Swachh Bharat 2.0 Mission to be launched at outlay of Rs 1.41 lakh crore over 5 years, Sitharaman said. The Jal Jeevan Mission Urban to be launched at outlay of Rs 2.87 lakh crore.<\/p>\n","date":"2021-02-01 11:20:11","pin":"0","status":"1"},{"title":"Expert view: Focus on sanitation heartening; scrapping policy likely to have only limited impact","content":"<p>Expert views from <strong>Dr Anil K Sood<\/strong>, Professor and Co-Founder of The Institute for Advanced Studies in Complex Choices, Hyderabad:<\/p>\n\n<p>1. Good to see the focus on sanitation. We will need to look at annual allocation in the detailed document.&nbsp;<br \/>\n2. Scrapping policy is likely to make only a limited impact on the environment, as we don&#39;t really have a lot of vehicles that are older than 20 years, particularly in urban areas.<\/p>\n","date":"2021-02-01 11:24:04","pin":"0","status":"1"},{"title":"Government allocates Rs 35,000 crore for Covid-19 vaccines","content":"<p>The FY22 health and well-being spend has been pegged at 2.23 lakh crore, Finance Minister&nbsp;said. Of this Rs 35,000 crore has been earmarked for the Covid-19 vaccine, she added.<br \/>\n&nbsp;<\/p>\n","date":"2021-02-01 11:24:15","pin":"0","status":"1"},{"title":"FM proposes voluntary vehicle scrapping policy","content":"<p>A voluntary scrapping&nbsp;policy for vehicles to be launched, aimed at reducing vehicular pollution Vehicles to undergo fitness test after 20 years for personal vehicles, 15 years for commercial vehicles: FM<br \/>\n&nbsp;<\/p>\n","date":"2021-02-01 11:27:57","pin":"0","status":"1"},{"title":"Gone in thirty minutes: Rs 12 lakh crore","content":"<p>Sunitha Natti from our team does the math and finds that 30 minutes&nbsp;into Budget 2022, allocations have crossed Rs 12 lakh crore. looks like Ms Sitharaman is warming up to the task.<\/p>\n","date":"2021-02-01 11:31:11","pin":"0","status":"1"},{"title":"The total budget outlay for healthcare is an increase of 137 % from last year: FM","content":"<blockquote class=\"twitter-tweet\" data-conversation=\"none\">\n<p dir=\"ltr\" lang=\"en\"><a href=\"https:\/\/twitter.com\/hashtag\/COVID19?src=hash&amp;ref_src=twsrc%5Etfw\">#COVID19<\/a> impact | 137% increase in healthcare budget this year. <a href=\"https:\/\/twitter.com\/hashtag\/Budget2021?src=hash&amp;ref_src=twsrc%5Etfw\">#Budget2021<\/a> LIVE updates ????<a href=\"https:\/\/t.co\/BZM7miIRah\">https:\/\/t.co\/BZM7miIRah<\/a> <a href=\"https:\/\/t.co\/Z45fJKxRGw\">pic.twitter.com\/Z45fJKxRGw<\/a><\/p>\n&mdash; The New Indian Express (@NewIndianXpress) <a href=\"https:\/\/twitter.com\/NewIndianXpress\/status\/1356119995361722369?ref_src=twsrc%5Etfw\">February 1, 2021<\/a><\/blockquote>\n<script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2021-02-01 11:34:51","pin":"0","status":"1"},{"title":"","content":"<p><strong>Expert views from Dr Anil K Sood<\/strong>:<\/p>\n\n<p>1. Good to see a Development Financial Institution (DFI) being set up.&nbsp;<br \/>\n2. We need more capital in the DFI as government contribution so that infrastructure building can be speeded up.&nbsp;<br \/>\n3. On role of states in building infrastructure, the reference is to a nudge. I would have liked to see a National Mission where the state and central governments pool their resources together.<\/p>\n","date":"2021-02-01 11:35:35","pin":"0","status":"1"},{"title":"FM allocates Rs 1.1 lakh crore to railways In FY22","content":"<p>Indi to spend Rs 1.1 lakh crore to Indian Railways in FY22. Of total Rs 1.07 lakh crore of provision to Indian Railway in FY22 is for capital expenditure.<\/p>\n\n<div style=\"text-align:center\">\n<figure class=\"image\" style=\"display:inline-block\"><img alt=\"\" height=\"333\" src=\"https:\/\/images.newindianexpress.com\/uploads\/user\/imagelibrary\/2021\/1\/28\/original\/Indian_Railways_PTI_Image.jpg\" width=\"500\" \/>\n<figcaption><em>For representational purpose. (Photo | PTI)<\/em><\/figcaption>\n<\/figure>\n<\/div>\n","date":"2021-02-01 11:39:44","pin":"0","status":"1"},{"title":"Laying the road to a good showing in Assembly-poll-bound states?","content":"<p>Smart packaging of politics and economics, notes our columnist <strong>Shankkar Aiyar<\/strong> on twitter.<\/p>\n\n<p>His observations of course on the highway projects announced for the Assembly Elections-bound states<\/p>\n\n<p>&nbsp;Tamil Nadu gets an additional 3500 km&nbsp;of highways, Kerala - 1100 km, West Bengal - 675 km, Assam - 1300 km<img alt=\"\" src=\"https:\/\/images.newindianexpress.com\/uploads\/user\/ckeditor_images\/article\/2021\/2\/1\/roads.png\" \/><\/p>\n","date":"2021-02-01 11:40:55","pin":"0","status":"1"},{"title":"Power shot: Rs 3.5 lakh cr for distressed discoms","content":"<p>Distressed discoms gets their due. The Finance Minister allocates Rs 3.5 lakh crore stretching across five years.<\/p>\n","date":"2021-02-01 11:42:01","pin":"0","status":"1"},{"title":"The BSE benchmark Sensex has surged over 443 points","content":"<p><img alt=\"\" height=\"213\" src=\"https:\/\/images.newindianexpress.com\/uploads\/user\/ckeditor_images\/article\/2021\/2\/1\/Capturewwww.JPG\" width=\"550\" \/><\/p>\n","date":"2021-02-01 11:43:51","pin":"0","status":"1"},{"title":"","content":"<p><strong>Expert view from Dr Anil K Sood:<\/strong><\/p>\n\n<p>On electricity distribution, the idea of providing a choice to a consumer is a bit premature. It is important that we first improve the quality of Transmission and Distribution&nbsp;infrastructure before we provide a choice&nbsp;to the consumer.<\/p>\n","date":"2021-02-01 11:45:07","pin":"0","status":"1"},{"title":"","content":"<p>Dr Sood also finds the announcement of&nbsp;setting up an institution for the development of corporate bond market interesting. Looking forward to seeing the details, he says.<\/p>\n","date":"2021-02-01 11:46:36","pin":"0","status":"1"},{"title":"Pneumococcal vaccine to be extended across the country: FM","content":"<p>The pneumococcal vaccine, limited to only 5 states at present, to be rolled out across the country Will avert more than 50,000 child deaths annually, said Finance Minister.<\/p>\n","date":"2021-02-01 11:47:09","pin":"0","status":"1"},{"title":"Government to provide Rs 18,000 crore for public buses","content":"<p>Centre to provide Rs 18,000 crore for public buses, announces FM<\/p>\n","date":"2021-02-01 11:48:21","pin":"0","status":"1"},{"title":"Expert | Allocation for recapitalisation of Public Sector Banks disappointing","content":"<p>Our expert Dr Anil K Sood finds the money the Finance Minister has set aside for the recapitalisation of our distressed Public Sector Banks&nbsp;disappointingly inadequate.<\/p>\n","date":"2021-02-01 11:51:52","pin":"0","status":"1"},{"title":"Rs 3.05 lakh crore allocated to power sector: FM","content":"<p>FM announced Rs 3.05 lakh crore outlay. She also said that 100 more cities to be added in the next 3 years to the gas distribution network.<\/p>\n","date":"2021-02-01 11:52:20","pin":"0","status":"1"},{"title":"Indian Railways has prepared a National Rail Plan for India 2030: FM","content":"<p>The plan is to create a future-ready railways system by 2030 - bringing down logistic cost for industry is at the core of a strategy to enable Make in India, she said.&nbsp;<\/p>\n","date":"2021-02-01 11:53:39","pin":"0","status":"1"},{"title":"","content":"<p><strong>* FDI in insurance sector proposed to be hiked to 74%&nbsp;from 49%<\/strong><\/p>\n\n<p><strong>* Creation of a bad bank to take on NPAs announced too.<\/strong><\/p>\n\n<p>* Rs 20,000 crore additional bank recap will be undertaken for 2021-22<\/p>\n\n<p><\/p>\n","date":"2021-02-01 11:54:02","pin":"0","status":"1"},{"title":"Boost to renewable energy sector","content":"<p>Rs 1,000 crore to solar energy corporation and Rs 1,500 to renewable energy development agency: FM<\/p>\n","date":"2021-02-01 11:55:06","pin":"0","status":"1"},{"title":"'Small Companies' definition modified","content":"<p>The Finance Minister today proposed to revise the definition of &#39;small companies&#39; under Companies Act, 2013 by increasing their threshold for capitalization to not exceeding Rs 50 lakh to not exceeding Rs 2 crore and turnover not exceeding Rs 2 crore to not exceeding Rs 20 crore.<\/p>\n","date":"2021-02-01 11:56:47","pin":"0","status":"1"},{"title":"Sitharaman does a Margaret Thatcher","content":"<p>The Finance Minister sets a definitive agenda for privatisation, notes <strong>Sunitha Natti<\/strong>. Fast-forwarding of strategic disinvestment that will see the closure of sick firms announced. The disinvestment proceeds will rake in Rs 1.75 lakh.<\/p>\n","date":"2021-02-01 11:58:56","pin":"0","status":"1"},{"title":"Expert view | Farm support numbers impressive","content":"<p>At a time when the farm law protests are raging, the Finance Minister has shared impressive numbers on the support provided to the farmers, our expert commentator <strong>Dr Anil K Sood<\/strong> notes. Waiting to look at Annexure 4, he adds. So far the amount is about 50% of agricultural and rural development budget for last year.<\/p>\n","date":"2021-02-01 12:09:18","pin":"0","status":"1"},{"title":"A happy one hour for the Sensex","content":"<p>One hour into the budget speech, the&nbsp;markets have risen further. Sensex is up 868 points. The Dalal Street crowd is happy for now.<\/p>\n","date":"2021-02-01 12:11:28","pin":"0","status":"1"},{"title":"We are committed to welfare of farmers: Sitharaman","content":"<ul>\n\t<li>\n\t<p>1.54 crore farmers benefited from MSP in paddy and what in FY21 vs 1.24 crore YoY<\/p>\n\t<\/li>\n\t<li>\n\t<p>Amount paid to farmers for wheat in FY21 was Rs 75,060 crore vs Rs 62,802 crore in FY20<\/p>\n\t<\/li>\n\t<li>\n\t<p>Amount paid to farmers for paddy in FY21 seen at Rs 1.72 crore Rs vs Rs 1.41 lakh crore in FY20<\/p>\n\t<\/li>\n\t<li>\n\t<p>Amount paid to farmers for pulses in FY21 seen at Rs 10,530 crore vs Rs 8,285<\/p>\n\t<\/li>\n<\/ul>\n","date":"2021-02-01 12:11:47","pin":"0","status":"1"},{"title":"86 per cent beneficiaries covered under one-nation, one-ration","content":"<p>One-nation, one-ration plan under implementation by 32 states and union territories. 69 crore beneficiaries or 86% covered under one-nation, one-ration.<\/p>\n","date":"2021-02-01 12:13:48","pin":"0","status":"1"},{"title":"Expert View | Much-needed succour for the MSMEs","content":"<p>Good to see the growth in support to MSMEs, noted Dr Anil K Sood. They had not received any serious growth in support during the last three years.<\/p>\n","date":"2021-02-01 12:14:15","pin":"0","status":"1"},{"title":"MSME allocation doubled","content":"<p>FM has said that the government of India has set aside Rs 15,700 crore for medium and small enterprises in FY22,&nbsp;double of what was budgeted in the previous fiscal.<\/p>\n","date":"2021-02-01 12:15:50","pin":"0","status":"1"},{"title":"FM unveils scheme for setting up mega textile parks in India","content":"<p>The government unveiled a scheme for setting up mega textile parks in the country, as part of the Centre&#39;s efforts to position India as a fully integrated, globally competitive manufacturing and exporting hub for the sector. &quot;A scheme of mega investment textile parks will be launched in addition to the PLI scheme,&quot; Sitharaman said.<\/p>\n","date":"2021-02-01 12:18:41","pin":"0","status":"1"},{"title":"Expert View | Support to R&D and innovation?","content":"<p>Dr Sood says he was hoping to hear more on policy and financial support for R&amp;D and innovation. It has to be seen if there are more details in the budget documents.<\/p>\n","date":"2021-02-01 12:20:13","pin":"0","status":"1"},{"title":"","content":"<p>FM announces special scheme for welfare of women and children in Assam and West Bengal<\/p>\n","date":"2021-02-01 12:21:59","pin":"0","status":"1"},{"title":"National education policy got a good reception: FM Sitharaman","content":"<p>&quot;Over 15,000 schools to be qualitatively strengthened under National Education Policy,&quot; she said.<\/p>\n\n<div style=\"text-align:center\">\n<figure class=\"image\" style=\"display:inline-block\"><img alt=\"\" height=\"291\" src=\"https:\/\/images.newindianexpress.com\/uploads\/user\/imagelibrary\/2021\/1\/28\/original\/covrprt4055103.jpg\" width=\"500\" \/>\n<figcaption>For representational purpose. (Photo | Meghana Sastry, EPS)<\/figcaption>\n<\/figure>\n<\/div>\n","date":"2021-02-01 12:23:44","pin":"0","status":"1"},{"title":"","content":"<h4><strong>We aim to bring fiscal deficit below 5% of the GDP by 2025-26: FM<\/strong><\/h4>\n","date":"2021-02-01 12:24:52","pin":"0","status":"1"},{"title":"Meat of the matter: It's an expenditure budget of Rs 34.83 lakh crore, announces the FM","content":"<p>FM gets to the meat of the matter. Announces an expenditure budget of Rs 34.83 lakh crore, including an over Rs 5 lakh crore capex. Gross borrowing in next fiscal at Rs 12 lakh crore; fiscal deficit for upcoming financial year pegged at 6.8 pc of GDP.<img alt=\"\" src=\"https:\/\/images.newindianexpress.com\/uploads\/user\/ckeditor_images\/article\/2021\/2\/1\/fiscaldeficit.jpg\" \/><\/p>\n","date":"2021-02-01 12:25:32","pin":"0","status":"1"},{"title":"","content":"<p>In his <strong>expert take<\/strong> on the expenditure announcement, <strong>Dr Anil K Sood<\/strong> says he is pleased to see that the Union Government has not constrained itself by fiscal deficit limits that have held back government spending in the last three years.<\/p>\n","date":"2021-02-01 12:26:57","pin":"0","status":"1"},{"title":"Minimum wages to apply to all categories of workers","content":"<p>Minimum wages to apply to all categories of workers. Women will be allowed to work in all categories, even night shifts with adequate protection.<\/p>\n","date":"2021-02-01 12:27:05","pin":"0","status":"1"},{"title":"","content":"<p><strong>Will take further steps to ease tax compliance: FM Sitharaman<\/strong><\/p>\n","date":"2021-02-01 12:31:52","pin":"0","status":"1"},{"title":"Exemption from filing tax for those above 75","content":"<p>Senior citizens above 75 years of age with only interest income will not have to file income tax returns.<img alt=\"\" src=\"https:\/\/images.newindianexpress.com\/uploads\/user\/ckeditor_images\/article\/2021\/2\/1\/nirmalasitharaman.png\" \/><\/p>\n","date":"2021-02-01 12:34:21","pin":"0","status":"1"},{"title":"","content":"<p>Good to see the increase in tax audit threshold (Rs 5 crore to Rs 10 crore), notes Dr Sood. He also terms the exemption granted on filing of IT returns to those above 75 a nice gesture. Wishes he were 75-plus.<img alt=\"smiley\" height=\"23\" src=\"https:\/\/images.newindianexpress.com\/includes\/ckeditor\/plugins\/smiley\/images\/regular_smile.png\" title=\"smiley\" width=\"23\" \/><\/p>\n","date":"2021-02-01 12:40:46","pin":"0","status":"1"},{"title":"Tax audit limit raised","content":"<p>FM increases tax audit limit from Rs 5 crore to Rs 10 crore<\/p>\n","date":"2021-02-01 12:40:49","pin":"0","status":"1"},{"title":"","content":"<p><strong>Advance tax liability on dividend income shall arrive only after declaration of payment of dividends: FM<\/strong><\/p>\n","date":"2021-02-01 12:41:24","pin":"0","status":"1"},{"title":"","content":"<p><strong>I propose to reduce the time limit for reopening of assessments (tax assessments) to 3 years from the present 6 years: FM Nirmala Sitharaman<\/strong><\/p>\n","date":"2021-02-01 12:44:20","pin":"0","status":"1"},{"title":"Affordable housing projects can avail tax holiday for another year till March 31, 2022: FM","content":"<div style=\"text-align:center\">\n<figure class=\"image\" style=\"display:inline-block\"><img alt=\"\" height=\"279\" src=\"https:\/\/images.newindianexpress.com\/uploads\/user\/imagelibrary\/2021\/1\/12\/original\/BDA_flats_across_city12.jpg\" width=\"500\" \/>\n<figcaption><em>For representational purpose. (File photo)<\/em><\/figcaption>\n<\/figure>\n<\/div>\n","date":"2021-02-01 12:45:34","pin":"0","status":"1"},{"title":"","content":"<p><strong>Details of capital gains and interest from banks, post offices, etc will be pre-filled: FM<\/strong><\/p>\n","date":"2021-02-01 12:47:46","pin":"0","status":"1"},{"title":"Customs duty","content":"<ul>\n\t<li>\n\t<p>Reducing customs duty uniformly to 7.5% on semi, flat and long products of non-alloy, alloy and stainless steel<\/p>\n\t<\/li>\n\t<li>\n\t<p>Exempting duty on steel scrap till March 2022<\/p>\n\t<\/li>\n\t<li>\n\t<p>To provide relief to copper recyclers, reducing duty on copper scrap from 5% to 2.5%<\/p>\n\t<\/li>\n\t<li>\n\t<p>Customs duty on some auto parts to be raised to 15%<\/p>\n\t<\/li>\n\t<li>\n\t<p>Customs duty on cotton increased to 10%, silk to 15%<\/p>\n\t<\/li>\n\t<li>\n\t<p>Customs duty on solar lanterns cut to 5%<\/p>\n\t<\/li>\n<\/ul>\n","date":"2021-02-01 12:49:24","pin":"0","status":"1"},{"title":"","content":"<p><strong>FM extends tax holiday for start-ups for one year<\/strong><\/p>\n","date":"2021-02-01 12:51:13","pin":"0","status":"1"},{"title":"","content":"<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"und\"><a href=\"https:\/\/twitter.com\/hashtag\/Budget2021?src=hash&amp;ref_src=twsrc%5Etfw\">#Budget2021<\/a> <a href=\"https:\/\/twitter.com\/hashtag\/IncomeTax?src=hash&amp;ref_src=twsrc%5Etfw\">#IncomeTax<\/a> <a href=\"https:\/\/t.co\/tuOOz1eKkz\">pic.twitter.com\/tuOOz1eKkz<\/a><\/p>\n&mdash; The New Indian Express (@NewIndianXpress) <a href=\"https:\/\/twitter.com\/NewIndianXpress\/status\/1356140204105453572?ref_src=twsrc%5Etfw\">February 1, 2021<\/a><\/blockquote>\n<script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2021-02-01 12:53:54","pin":"0","status":"1"},{"title":"FM proposes Rs 1,500 crore-scheme to promote digital payments","content":"<p>The government proposed Rs 1,500 crore-scheme to promote digital payments in the country. Finance Minister Nirmala Sitharaman said there has been a manifold increase in digital payments in the recent past.<\/p>\n\n<p>&quot;To give a further boost to digital transactions, I earmark Rs 1,500 crore for a proposed scheme that will provide financial incentive to promote digital payments,&quot; the FM said.<\/p>\n","date":"2021-02-01 13:04:50","pin":"0","status":"1"},{"title":"Sitharaman concludes budget presentation","content":"<p>Finance Minister Nirmala Sithatraman ends the budget speech for 2021 and tables the 15th Finance Commission Report before Lok Sabha.<\/p>\n","date":"2021-02-01 13:07:30","pin":"0","status":"1"},{"title":"First Take | A no-surprises budget","content":"<p><strong>Dr Anil K Sood<\/strong>, Professor and Co-Founder of The Institute for Advanced Studies in Complex Choices, Hyderabad sums up his first impressions of the budget thus:<\/p>\n\n<p>In summary, no surprises at all. It is fortunate that the fiscal deficit limit was not allowed to constrain the government support to the economy when we need it most. On resource mobilisation through privatisation, the challenge will be in implementation. We needed more capital to have been provided to Development Financial Institution and the Public Sector Banks. Credit growth may remain subdued. The government will also need to front-load its expenditure&nbsp;given that private sector will continue to be constrained for capital.<\/p>\n","date":"2021-02-01 13:12:32","pin":"0","status":"1"},{"title":"D-street gives a thumbs up to Budget 2021","content":"<p>Sensex zooms over 1,700 points after Budget 2021; Nifty reclaims 14K<\/p>\n\n<p><img alt=\"\" height=\"312\" src=\"https:\/\/images.newindianexpress.com\/uploads\/user\/ckeditor_images\/article\/2021\/2\/1\/Capturewwww1.JPG\" width=\"450\" \/><\/p>\n","date":"2021-02-01 13:21:58","pin":"0","status":"1"},{"title":"Import duty on parts of mobile phones, chargers raised","content":"<p>The government proposed to impose import duty on components of mobile phones and chargers, to enhance local value addition. Finance Minister Nirmala Sitharaman announced review of 400 exemptions in customs duty including those applicable on the mobile devices segment.<\/p>\n","date":"2021-02-01 13:28:06","pin":"0","status":"1"},{"title":"PM Modi addresses nation after presentation of Union Budget 2021","content":"<div style=\"text-align:center\">\n<figure class=\"image\" style=\"display:inline-block\"><img alt=\"\" height=\"250\" src=\"https:\/\/images.newindianexpress.com\/uploads\/user\/imagelibrary\/2021\/1\/30\/original\/PM_NarendraModi_PTI.jpg\" width=\"500\" \/>\n<figcaption><em>PM Narendra Modi (File Photo | PTI)<\/em><\/figcaption>\n<\/figure>\n<\/div>\n","date":"2021-02-01 15:03:09","pin":"0","status":"1"},{"title":"","content":"<p>PM Modi lauds &#39;Sabka&#39; Budget, says it has boosted India&#39;s self confidence<\/p>\n","date":"2021-02-01 15:03:57","pin":"0","status":"1"},{"title":"","content":"<p>From Covid-related reforms to Atmanirbhar resolve, we moved ahead with this mantra in Budget 2021. It&#39;s an active and not a reactive budget, says PM Modi<\/p>\n","date":"2021-02-01 15:04:59","pin":"0","status":"1"},{"title":"","content":"<p>This was one of rare Budget speeches that elicited so many positive reactions from experts within 1-1.5 years: PM<\/p>\n","date":"2021-02-01 15:06:36","pin":"0","status":"1"},{"title":"","content":"<p>It is&nbsp;a pro-active budget that gives boost to wealth as well as wellness: PM Modi<\/p>\n","date":"2021-02-01 15:07:10","pin":"0","status":"1"},{"title":"Healthcare industry welcomes increased budget allocation for health, well-being","content":"<p>The healthcare industry welcomed the government&#39;s increased allocation for the healthcare sector and said that the move will provide access to medical care for all in the country, fuel job creation and boost economic momentum.<\/p>\n","date":"2021-02-01 15:07:34","pin":"0","status":"1"},{"title":"","content":"<p>Budget aims to widen new opportunities for growth, new openings for youth, new high to human resources: PM Narendra Modi<\/p>\n","date":"2021-02-01 15:10:35","pin":"0","status":"1"},{"title":"","content":"<p>Budget will bring several positive changes for individuals, investors, industry and infrastructure sector: PM Narendra Modi<\/p>\n","date":"2021-02-01 15:10:51","pin":"0","status":"1"},{"title":"","content":"<p><strong>Finance minister Nirmala Sitharaman briefs media on Union Budget 2021<\/strong><\/p>\n","date":"2021-02-01 15:25:10","pin":"0","status":"1"},{"title":"","content":"<p>&quot;We chose to spend big on infrastructure spanning across roads, bridges, ports, power generation and so on. Moreover, we attended to the needs of the healthcare sector,&quot; she said.<\/p>\n","date":"2021-02-01 15:25:44","pin":"0","status":"1"},{"title":"'A get-well-soon budget'","content":"<p>Dr Niranjan Hiranandani, National President NAREDCO, praised the budget, noting, &quot;It is a get-well-soon type of Budget, the &#39;V&#39; shaped recovery being powered by the Covid-19 vaccination program.&quot;&nbsp;<\/p>\n\n<p>He welcomed the Government&#39;s continued focus on affordable housing and termed the second extension of the deadline for the additional Rs 1.5 lakh tax deduction given on loans taken to buy a house in the affordable housing projects segment till 31 March 2022 a welcome move.&nbsp;<\/p>\n\n<p>Tax exemption for notified affordable housing for migrant workers, and the deduction on payment of interest for affordable housing being extended by a year will give a fillip to this emerging segment, he noted.&nbsp;<\/p>\n\n<p>The enhanced spending on public infrastructure projects like ports, railways, airports, warehousing, gas pipelines, metro, economic corridors will give impetus to the employment generation and attract the essential investment needed to lift up the economic revival, Hiranandani stated.<\/p>\n\n<p>Arun M Kumar, Chairman and CEO, KPMG in India too welcomed the budget. He noted that &quot;The Finance Minister has proposed a number of strong steps that should revive economic growth. The proposed acceleration of investment in infrastructure, creation of a development finance institution and asset monetization across key sectors are timely. Notable highlights of the Budget include increased investment in capex, recapitalization of public-sector banks, setting up of an asset reconstruction and management company to take over stressed debt, a new securities market code and permitting increased foreign investment in the insurance sector. In fact, the Minister signaled even bolder steps including privatization of two public-sector banks and one insurance company.<\/p>\n\n<p>&quot;On the revenue side, the budget appropriately assumes increasing collections through growth and also envisages living with a higher fiscal deficit for the next few years. An aggressive disinvestment plan, and the monetization of land and other governmental assets, if effectively executed will greatly help balance the fiscal equation. This is a preferable approach to increasing taxes at this juncture as enterprises and individuals should instead have the resources to spend and as a result create buoyancy in the economy.&nbsp;<\/p>\n\n<p>&quot;On the tax side, there are important steps taken towards easing compliance and facilitating dispute resolution. While there is no increase in income-tax rates, there is an overhaul of customs rates on some items as well as the introduction of an Agriculture Infrastructure and Development cess on certain items.&quot;&nbsp;<br \/>\n&nbsp;<\/p>\n","date":"2021-02-01 15:28:39","pin":"0","status":"1"},{"title":"","content":"<p>We have taken progressive steps for the finance sector. Consumers won&#39;t have to pay more on any product due to the agriculture cess: FM<\/p>\n","date":"2021-02-01 15:30:15","pin":"0","status":"1"},{"title":"","content":"<p>We ensured that the capital expenditure was not delayed during the pandemic. We have given a gliding path on fiscal management: FM<\/p>\n\n<p><\/p>\n","date":"2021-02-01 15:31:49","pin":"0","status":"1"},{"title":"Sensex skyrockets 2,315 points as market cheers Budget 2021","content":"<p>The BSE benchmark Sensex skyrocketed 2,315 points on Monday, propelled by gains in financial stocks, as market participants cheered a growth-oriented Union Budget presented by Finance Minister Nirmala Sitharaman.<\/p>\n\n<p>After touching an intra-day high of 48,764.40, the 30-share Sensex ended 2,314.84 points or 5 per cent higher at 48,600.61. The broader Nifty soared 646.60 points or 4.74 per cent to finish at 14,281.20. <a href=\"https:\/\/www.newindianexpress.com\/business\/2021\/feb\/01\/sensex-skyrockets-2315-points-as-market-cheers-budget-2021-bank-stocks-sparkle-2258039.html\" target=\"_blank\"><strong>(READ MORE)<\/strong><\/a><\/p>\n","date":"2021-02-01 16:23:45","pin":"0","status":"1"},{"title":"Budget Math | How does it all add up?","content":"<p><strong>Dr Anil K Sood<\/strong> shares his back-of-the-envelope calculations of the budget numbers and poses two big questions:<br \/>\n<img alt=\"\" src=\"https:\/\/images.newindianexpress.com\/uploads\/user\/ckeditor_images\/article\/2021\/2\/1\/budgetmath.jpg\" \/><\/p>\n\n<p><img alt=\"\" src=\"https:\/\/images.newindianexpress.com\/uploads\/user\/ckeditor_images\/article\/2021\/2\/1\/budgetmath22.jpg\" \/><\/p>\n\n<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\">Resource Allocation <a href=\"https:\/\/twitter.com\/hashtag\/Budget2021?src=hash&amp;ref_src=twsrc%5Etfw\">#Budget2021<\/a><br \/>\n<br \/>\n1. Pensions Down -7.37%<br \/>\n2. Defense Up 0.94%<br \/>\n3. Subsidies Down -43.67%<br \/>\n4. Interest Up 16.85%<br \/>\n5. Agri Up 2.0%<br \/>\n6. Rural Dev Down -10.0%<br \/>\n<br \/>\nWould it drive consumption growth in post-pandemic India &amp; help become competitive?<a href=\"https:\/\/twitter.com\/nsitharamanoffc?ref_src=twsrc%5Etfw\">@nsitharamanoffc<\/a><\/p>\n&mdash; Anil K Sood (@AnilKSood5) <a href=\"https:\/\/twitter.com\/AnilKSood5\/status\/1356173621022998530?ref_src=twsrc%5Etfw\">February 1, 2021<\/a><\/blockquote>\n<script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2021-02-01 16:32:31","pin":"1","status":"1"},{"title":"Sitharaman on the ball with India's 100th budget","content":"<p>As promised, the Union Budget 2021-22 -- custom-made to support a post-Covid economic recovery -- turned out to be a milestone, writes <strong>Sunitha Natti<\/strong>. There are no new taxes, no new Covid cess&#39; (only farm cess and others), no additional surcharges, and certainly no hike in long term capital gains. <a href=\"http:\/\/cms.newindianexpress.com\/business\/2021\/feb\/01\/wisdom-over-poetic-flourish-sitharaman-on-the-ball-with-indias-100th-budget-2258053.html\" target=\"_blank\"><strong>(READ MORE)<\/strong><\/a><\/p>\n","date":"2021-02-01 17:37:00","pin":"0","status":"1"},{"title":"Devil in budget fine print: Interest on EPF contributions above Rs 2.5 lakh a year to be taxed","content":"<p>Hidden in the fine print of the budget is a blow for many salaried people &ndash; interest on employees&#39; contribution to provident fund beyond Rs 2.5 lakh a year or a tad more than Rs 20,000 a month will no longer be tax-free.&nbsp; (<a href=\"https:\/\/www.newindianexpress.com\/business\/2021\/feb\/01\/devil-in-budget-fine-print-interest-on-epf-contributions-above-rs-25-lakh-a-year-to-be-taxed-2258123.html\" target=\"_blank\"><strong>Read on to find out<\/strong><\/a>)<\/p>\n","date":"2021-02-01 20:36:29","pin":"0","status":"1"},{"title":"Expert Take | 'The budget lacks in confidence, we are under-investing'","content":"<p><iframe allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\" frameborder=\"0\" height=\"450\" src=\"https:\/\/www.youtube.com\/embed\/dS7ctMv_AgQ\" width=\"100%\"><\/iframe><\/p>\n","date":"2021-02-01 21:19:41","pin":"1","status":"1"}]}