{"details":[{"title":"'MUM': It's Mission 'Mopping Up Money' for PTR!","content":"<p>After the din raised by the White Paper, it&#39;s time to go &#39;MUM&#39;.&nbsp;<\/p>\n\n<p>Welcome to our budget day coverage, everyone. Let us begin by cutting to the chase and talk taxes - what you all are truly keen about.<\/p>\n\n<p>To mop up money where possible, PTR on Friday might possibly hike taxes on vehicles - something that has not been done in 15 years. As our editorial noted, though the number of vehicles registered in TN is higher than in the neighbouring states, the tax on them in the state contributes only 0.23% of its total Gross State Domestic Product (GSDP).<\/p>\n\n<p>The Finance Minister will also be tempted to do the same with the electricity tax, but might not bite that bullet given the brutal impact the pandemic has had on household finances.&nbsp;&nbsp;<\/p>\n\n<p>An easier decision for PTR is to tweak existing rules to enhance the tax collected from the sale of IMFL and beer, again something <a href=\"https:\/\/www.newindianexpress.com\/opinions\/editorials\/2021\/aug\/11\/revenue-starved-tn-seeks-way-out-2343093.html\" target=\"_blank\"><strong><em>The New Indian Express<\/em> editorial<\/strong><\/a> had touched upon. This seems a given. Do we see anyone raising their glasses to that? Come on, it&#39;s for the common good. Let&#39;s cheer it in anticipation, folks,<br \/>\n&nbsp;<\/p>\n","date":"2021-08-13 09:49:15","pin":"0","status":"1"},{"title":"The first-ever e-budget","content":"<p>An e-budget it will be by PTR. Tablet computers have been given to all the legislators in the assembly to follow the presentation. It will also be the DMK&#39;s first budget in 10 years.<\/p>\n","date":"2021-08-13 10:09:44","pin":"0","status":"1"},{"title":"Finance Minister of Tamil Nadu Palanivel Thyaga Rajan begins presentation","content":"<p>&quot;Identifying the problem is the first step in solving it. The white paper was aimed at that,&quot; says Rajan.<\/p>\n","date":"2021-08-13 10:15:43","pin":"0","status":"1"},{"title":"State’s revenue has gone down: Rajan","content":"<p>&ldquo;Even though Union Government revue through petrol and diesel tax has increased by 60%, state&rsquo;s revenue has gone down,&rdquo; says Tamil Nadu Finance Minister.<\/p>\n","date":"2021-08-13 10:20:28","pin":"0","status":"1"},{"title":"Income gap","content":"<p>While the pandemic caused a decline in most income heads last fiscal year, revenue receipts as a percentage of GSDP has been declining over the past decade&mdash;falling steadily from nearly 12 per cent a decade ago to just 8.7 per cent in FY2020-21. The rollout of the GST in 2017 has also changed the tax revenue landscape. <a href=\"https:\/\/www.newindianexpress.com\/states\/tamil-nadu\/2021\/aug\/13\/tamil-nadu-budget-its-tightrope-walk-as-cash-supply-seems-abysmallylow-2343990.html\" target=\"_blank\"><strong>(READ MORE)<\/strong><\/a><\/p>\n\n<p style=\"text-align:center\"><img alt=\"\" src=\"https:\/\/images.newindianexpress.com\/uploads\/user\/ckeditor_images\/article\/2021\/8\/13\/dtyjdtyj.jpg\" \/><\/p>\n","date":"2021-08-13 10:22:40","pin":"0","status":"1"},{"title":"E-portal to be formed to ensure transparency in government procurements","content":"<p>&#39;E-procurement will be followed for all tenders. A dedicated e-portal will be formed to ensure transperancy in all government procurements,&#39; says FM.<\/p>\n","date":"2021-08-13 10:26:42","pin":"0","status":"1"},{"title":"Digitisation of all assembly documents","content":"<p>All the assembly documents and files will be digitised, as part of marking 100 years of the Tamil Nadu assembly.<\/p>\n","date":"2021-08-13 10:30:39","pin":"0","status":"1"},{"title":"Kalaignar Karunanidhi Semmozhi Tamizh award announced","content":"<p>Tamil awards named after late CM Karunanidhi, &#39;Kalaignar Karunanidhi Semmozhi Tamizh award&#39;&nbsp;will be given along with Rs&nbsp;10 lakhs cash prize every year in Central Classic Tamil institute.<\/p>\n","date":"2021-08-13 10:37:49","pin":"0","status":"1"},{"title":"Rs 5 crore allotted for various ongoing archaeology activities in the state","content":"<p>A museum to be established near the archaeology site at Keezhadi.<\/p>\n\n<p><img alt=\"\" height=\"266\" src=\"https:\/\/images.newindianexpress.com\/uploads\/user\/ckeditor_images\/article\/2021\/8\/13\/WhatsApp_Image_2021-08-13_at_10.35_.35_AM_(1)_.jpeg\" width=\"500\" \/><\/p>\n\n<p><\/p>\n","date":"2021-08-13 10:43:34","pin":"0","status":"1"},{"title":"Flood relief is not sufficient, will request Center for more funds","content":"<p>&ldquo;4,133 flood-prone areas have been identified and measures will be taken to avert mishaps here. Flood relief is not sufficient and we will request Center to give more for TN for disaster mitigation,&rdquo; says Rajan.<\/p>\n","date":"2021-08-13 10:48:16","pin":"0","status":"1"},{"title":"Despite Covid-19, TN witnessed over 45,000 accidents and 8,000 deaths","content":"<p>&quot;In coordination with health, education and other departments, a comprehensive road safety plan will be set up to prevent road accidents. Rs 500 crore has been allotted to ensure accident free Tamil Nadu,&quot; says FM<\/p>\n\n<p><\/p>\n","date":"2021-08-13 10:52:40","pin":"0","status":"1"},{"title":"Chennai's Kasimedu fishing port will be developed: FM Rajan","content":"<ul>\n\t<li>\n\t<p>Rs 6.25 crores allocated for establishing six fishing harbours in the state.&nbsp;<\/p>\n\t<\/li>\n\t<li>\n\t<p>Rs 433.97 crores announced for establishing fishing harbours and fish landing centers.<\/p>\n\t<\/li>\n\t<li>\n\t<p>Rs 1149.79 crores allotted&nbsp;for fisheries department.<\/p>\n\t<\/li>\n<\/ul>\n\n<div style=\"text-align:center\">\n<figure class=\"image\" style=\"display:inline-block\"><img alt=\"\" height=\"337\" src=\"https:\/\/images.newindianexpress.com\/uploads\/user\/ckeditor_images\/article\/2021\/8\/13\/WhatsApp_Image_2021-08-13_at_11.00_.06_AM_.jpeg\" width=\"600\" \/>\n<figcaption>Kasimedu fish harbour. (Photo | EPS\/P Jawahar)<\/figcaption>\n<\/figure>\n<\/div>\n\n<p><\/p>\n","date":"2021-08-13 10:55:47","pin":"0","status":"1"},{"title":"India's first integrated air quality monitoring system to be set up under TN Pollution Control board","content":"<p>Air quality monitoring centers will be established in all the cities where more than one lakh people are living.<br \/>\n&nbsp;<\/p>\n","date":"2021-08-13 10:59:26","pin":"0","status":"1"},{"title":"Rs 3,548 crore for rural housing scheme; will provide homes for more than 8 lakh families","content":"<p>The Finance Minister has allocated Rs 3,548 crore for rural housing scheme. The aim is to provide homes to more than 8 lakh people. The state has increased its quota of funds for building homes for rural poor, the budget notes.<\/p>\n","date":"2021-08-13 11:04:01","pin":"0","status":"1"},{"title":"A more beautiful Chennai in the offing?","content":"<p>Rs 500 crores have been allocated to construct flyovers in Chennai.&nbsp;Singara Chennai 2.0 will be reviewed. Chennai city will be made free of wall posters. Beautification projects will be carried on various public places in Chenna. A further Rs 2,300 crore will be allotted to plug mixing of sewage into water bodies in Chennai.<\/p>\n","date":"2021-08-13 11:08:11","pin":"0","status":"1"},{"title":"Will ask Centre to double wages under National Rural Employment Guarantee Act, says PTR","content":"<p>&quot; Will urge the union government to increase the MGNREGS daily wage to Rs 300 and increase total number of annual working days to 150,&quot; says the Finance Minister.<\/p>\n","date":"2021-08-13 11:09:43","pin":"0","status":"1"},{"title":"PTR makes a water promise","content":"<p>135 litres of water per person per day in city corporations,&nbsp;Piped drinking water will given to each household in Chennai.<\/p>\n\n<p>90 litres of water per person per day in municipalities and 70 litres of water per person per day in town panchayats will be ensured, assures PTR.&nbsp;&nbsp;<\/p>\n","date":"2021-08-13 11:11:40","pin":"0","status":"1"},{"title":"Jobs for the urban poor in TN","content":"<p>The urban poor who bore the brunt of the covid lockdown will be given employment in maintaining public places and water bodies. Rs 100 crore set aside for this in the budget.<\/p>\n","date":"2021-08-13 11:17:12","pin":"0","status":"1"},{"title":"Rs 3954.44 crores have been allocated to Tamil Nadu slum clearance board","content":"<div style=\"text-align:center\">\n<figure class=\"image\" style=\"display:inline-block\"><img alt=\"\" height=\"400\" src=\"https:\/\/images.newindianexpress.com\/uploads\/user\/ckeditor_images\/article\/2021\/8\/13\/WhatsApp_Image_2021-08-13_at_10.58_.34_AM_.jpeg\" width=\"600\" \/>\n<figcaption>The first day of the budget session being held at Kalaivanar Arangam, on Friday in Chennai&nbsp;. (Photo | EPS\/P Jawahar)<\/figcaption>\n<\/figure>\n<\/div>\n","date":"2021-08-13 11:20:29","pin":"0","status":"1"},{"title":"A billion-dollar World Bank-backed scheme and one involving Asian Development Bank too for Chennai","content":"<p>After deferring the signing of <a href=\"https:\/\/www.newindianexpress.com\/cities\/chennai\/2021\/aug\/13\/tn-budget-2021-dmk-govt-okays-world-bank-funded-chennai-city-partnership-2344213.html\" target=\"_blank\"><strong>World Bank-funded Chennai City Partnership<\/strong><\/a>, the finance minister says the scheme is on and will be implemented over a period of nine years (2021-2030) with a total estimated budget of US$ 1.43 billion.<\/p>\n\n<p>Also announced, a Rs 57 crore integrated stormwater drain network in Kosasthalaiyar Basin backed &nbsp;by the Asian Development Bank. The scheme will help the Chennai Corporation in strengthening the flood protection infrastructure along the entire 128 square kilometers of the basin falling within the city corporation limits, says the Minister.<\/p>\n","date":"2021-08-13 11:22:24","pin":"0","status":"1"},{"title":"TN allots Rs 5421.41 crores for road works","content":"<ul>\n\t<li>\n\t<p>Bypass roads to be laid for 59 municipal towns<\/p>\n\t<\/li>\n\t<li>\n\t<p>Priority will be given to 59 municipalities to establish by-pass roads<\/p>\n\t<\/li>\n\t<li>\n\t<p>17,899.17 crores have been allocated for highways department<\/p>\n\t<\/li>\n\t<li>\n\t<p>Will urge the union government to make the GST Road 6-8 lane<\/p>\n\t<\/li>\n<\/ul>\n\n<div style=\"text-align:center\">\n<figure class=\"image\" style=\"display:inline-block\"><img alt=\"\" height=\"225\" src=\"https:\/\/images.newindianexpress.com\/uploads\/user\/ckeditor_images\/article\/2021\/8\/13\/WhatsApp_Image_2021-08-13_at_11.21_.12_AM_.jpeg\" width=\"500\" \/>\n<figcaption>(Photo | EPS)<\/figcaption>\n<\/figure>\n<\/div>\n","date":"2021-08-13 11:24:37","pin":"0","status":"1"},{"title":"1000 new buses to hit the roads soon!","content":"<p>The transport sector might be losing Rs 59.15 for every km run, but then can it be ignored? Of course not. The Finance Minister allocates&nbsp;Rs 623.59 crores to purchase 1000 new buses.&nbsp;<\/p>\n\n<p><\/p>\n","date":"2021-08-13 11:25:08","pin":"0","status":"1"},{"title":"New metro rail services","content":"<p>*&nbsp;Metro rail service between Kodambakkam to Poonamallee will begin in June 2024. <a href=\"https:\/\/www.newindianexpress.com\/cities\/chennai\/2021\/aug\/13\/kodambakkam-to-poonamalee-chennai-metro-stretch-to-be-operational-by-june-2024-2344207.html\" target=\"_blank\"><strong>(READ MORE)<\/strong><\/a><\/p>\n\n<p>* Tambaram to Kilambakkam line work will start soon.<\/p>\n\n<p>* Work for metro rail to start in Madurai. Detailed Project Report (DPR) will be prepared soon.<\/p>\n\n<p>* Will consult with the Centre on establishing a metro rail network in Coimbatore too.<\/p>\n\n<p>* TN will urge Centre to reconsider the shareholding under the second phase of Chennai Metro Rail project with a sharing pattern of 50:50 between state and Centre as was done in Phase-I, says the Minister.<\/p>\n\n<div style=\"text-align:center\">\n<figure class=\"image\" style=\"display:inline-block\"><img alt=\"\" height=\"330\" src=\"https:\/\/images.newindianexpress.com\/uploads\/user\/ckeditor_images\/article\/2021\/8\/13\/WhatsApp_Image_2021-08-13_at_12.16_.39_PM_.jpeg\" width=\"500\" \/>\n<figcaption>Metro rail (Photo | EPS)<\/figcaption>\n<\/figure>\n<\/div>\n","date":"2021-08-13 11:25:54","pin":"0","status":"1"},{"title":"Industrial park in Thoothukudi district","content":"<ul>\n\t<li>\n\t<p>&quot;An industrial park will be established in Thoothukudi district with investment of Rs 1,000 crore in an area of 1100 acres,&quot; says FM Rajan.<\/p>\n\t<\/li>\n\t<li>\n\t<p>FM also announced the establishment of TIDEL parks at Villupuram, Vellore, Thiruppur and Thoothukudi districts.<\/p>\n\t<\/li>\n<\/ul>\n\n<p><\/p>\n","date":"2021-08-13 11:32:42","pin":"0","status":"1"},{"title":"Electric moves: The 'power' announcements","content":"<p>* Steps to be taken increase power generation capacity in state to 17000 MW<\/p>\n\n<p>* Will work to ensure uninterrupted power supply, says the Finance Minister<\/p>\n\n<div style=\"text-align:center\">\n<figure class=\"image\" style=\"display:inline-block\"><img alt=\"\" height=\"270\" src=\"https:\/\/images.newindianexpress.com\/uploads\/user\/ckeditor_images\/article\/2021\/8\/13\/WhatsApp_Image_2021-08-13_at_11.41_.26_AM_.jpeg\" width=\"600\" \/>\n<figcaption>(Photo | EPS)<\/figcaption>\n<\/figure>\n<\/div>\n","date":"2021-08-13 11:34:30","pin":"0","status":"1"},{"title":"Education: Rs 32599 crores set aside for schools, new education policy to be framed","content":"<p>* The Finance Minister underlines that there has been a&nbsp;drop in student strength in government schools, lists measures to improve the quality in government schools.<\/p>\n\n<p>* Announces that Rs 32599 crores has been allocated to the school education department.<\/p>\n\n<p>* PTR says will take measures to bridge the learning gap caused by the pandemic and lockdown.<\/p>\n\n<p>* Announces that a high-level committee will be formed to frame a new education policy for the state.<\/p>\n\n<p>* To enhance job opportunities, the syllabus will be revised with inputs from industry experts, the finance minsiter says.<\/p>\n\n<p>* Special attention will be given to children of migrant labourers.<\/p>\n\n<p>* A further Rs 5369.09 crores has been allocated to the higher education department.<\/p>\n\n<p>* Ten new government arts and science colleges will be established.<\/p>\n\n<p>* Also announced are plans for smart classrooms in 25 government colleges at the cost of Rs 100 crore.<\/p>\n\n<p>* A TN Siddha University will be established. Initial allocation for it is Rs 2 crore.&nbsp;The aim is to give Siddha medicine importance among traditional medicine systems, says PTR.<\/p>\n","date":"2021-08-13 11:38:38","pin":"0","status":"1"},{"title":"'Coronavirus has left an everlasting scar in our minds'","content":"<ul>\n\t<li>\n\t<p>Even though we have the capacity to vaccinate around 8 lakh per day, we received only around 2 lakh Covid-19 vaccines per day on average<\/p>\n\t<\/li>\n\t<li>\n\t<p>The Finance Minister also says that Rs 241.40 crore was spent to provide assistance to the children of those who lost their parents to Covid<\/p>\n\t<\/li>\n<\/ul>\n\n<div style=\"text-align:center\">\n<figure class=\"image\" style=\"display:inline-block\"><img alt=\"\" height=\"337\" src=\"https:\/\/images.newindianexpress.com\/uploads\/user\/ckeditor_images\/article\/2021\/8\/13\/WhatsApp_Image_2021-08-13_at_11.44_.21_AM_.jpeg\" width=\"600\" \/>\n<figcaption>(Photo | EPS)<\/figcaption>\n<\/figure>\n<\/div>\n\n<p><\/p>\n","date":"2021-08-13 11:47:41","pin":"0","status":"1"},{"title":"Five more Tidel parks announced","content":"<p>* IT sector gets a push. Tidel parks will now be established in Villupuram, Vellore, Chidambaram, Tiruppur and Thoothukudi too.<\/p>\n\n<p>*&nbsp;New Sipcot (State Industries Promotion Corporation of Tamil Nadu) complexes will be established in Thiruvanmamalai, Dharmapuri and other districts.<\/p>\n","date":"2021-08-13 11:59:07","pin":"0","status":"1"},{"title":"Financial city and a leather park announced.","content":"<p>* A financial city will be established at Nandambakkam in Chennai. Rs 165 crore has been set aside.<\/p>\n\n<p>* A leather park will come up at Ranipet district.<\/p>\n","date":"2021-08-13 12:03:52","pin":"0","status":"1"},{"title":"Tamil to become official language in all departments?","content":"<p>Tamil Nadu Finance Minister P T R Palanivel Thiagarajan said that measures will be taken to make Tamil the administrative language in all departments.&nbsp;<\/p>\n","date":"2021-08-13 12:16:09","pin":"0","status":"1"},{"title":"Committee will be formed to set up new ration shops: FM","content":"<p>A committee will be formed to identify and set up new ration shops in required areas, said&nbsp;Palanivel Thiagarajan<\/p>\n","date":"2021-08-13 12:22:56","pin":"0","status":"1"},{"title":"Good news for female civil servants!","content":"<p>&quot;Maternity leave for female civil servants increased&nbsp;from 9 months to 12 months,&quot; says&nbsp;Finance Minister Palanivel Thiaga Rajan.<\/p>\n","date":"2021-08-13 12:43:59","pin":"0","status":"1"},{"title":"Some good news for government employees","content":"<p>Some money is coming the way of government employees. Revised DA announced for them with effect from April 2022.<\/p>\n","date":"2021-08-13 12:45:43","pin":"0","status":"1"},{"title":"Petrol to be cheaper by Rs 3 per litre in TN","content":"<p>The big announcement that will be greeted with a cheer by everyone in TN. The Finance Minister says as per TN CM MK Stalin&#39;s instructions, the state government is reducing its cess on petrol by Rs 3 per litre. The new petrol prices will come into effect from 12 am August 14. The state government will incur a Rs 1160 crore revenue loss because of this.<\/p>\n\n<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\">Ok, Tamil Nadu Finance Minister <a href=\"https:\/\/twitter.com\/ptrmadurai?ref_src=twsrc%5Etfw\">@ptrmadurai<\/a> has just cut <a href=\"https:\/\/twitter.com\/hashtag\/petrol?src=hash&amp;ref_src=twsrc%5Etfw\">#petrol<\/a> cess by Rs 3\/ltr.<br \/>\n<br \/>\nThat throws the ball into the GoI&#39;s court, because not only were central tax hikes far larger, some have argued that states should cut <a href=\"https:\/\/twitter.com\/hashtag\/fueltax?src=hash&amp;ref_src=twsrc%5Etfw\">#fueltax<\/a> first.<br \/>\n<br \/>\nWell now, TN has. Will GoI follow? <a href=\"https:\/\/t.co\/5x6qfLfcDj\">https:\/\/t.co\/5x6qfLfcDj<\/a><\/p>\n&mdash; Jonathan Ananda (@JonathanSAnanda) <a href=\"https:\/\/twitter.com\/JonathanSAnanda\/status\/1426082953600270337?ref_src=twsrc%5Etfw\">August 13, 2021<\/a><\/blockquote>\n<script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>\n\n<p><b>ALSO SEE: India&#39;s fuel tax problem - Why is the Indian government coy about cutting taxes?<\/b><iframe allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\" frameborder=\"0\" height=\"450\" src=\"https:\/\/www.youtube.com\/embed\/G8TaqBY1_eY\" title=\"YouTube video player\" width=\"100%\"><\/iframe><\/p>\n","date":"2021-08-13 12:47:45","pin":"1","status":"1"},{"title":"'Namaku Naame' scheme to be implemented again","content":"<p>The finance minister announced that&nbsp;Kalaignar&#39;s &#39;Namaku Naame&#39; scheme will be implemented again at Rs 100 crore.<\/p>\n","date":"2021-08-13 13:35:52","pin":"0","status":"1"},{"title":"Assistance to MSMEs","content":"<p>A committee chaired by Dr.N.Sundaradevan, I.A.S. (Retd) has been established to study the financial, infrastructural and other issues faced by MSMEs in Tamil Nadu and suggest measures to enable them to thrive.<\/p>\n\n<p>This Government will launch a State Level Credit Guarantee Scheme to enable more MSMEs, particularly micro enterprises to access credit. A digital data driven credit rating system for MSMEs will be established to enable FIs and new age fintech companies to lend more to MSMEs based on their business potential. TAICO Bank will be repurposed to enable lending to MSMEs.<\/p>\n","date":"2021-08-13 13:42:22","pin":"0","status":"1"},{"title":"Facilities at Ayyan Thiruvalluvar statue in Kanniyakumari, Poompuhar to be upgraded","content":"<ul>\n\t<li>\n\t<p>Tourism industry is critical for increasing local employment<\/p>\n\t<\/li>\n\t<li>\n\t<p>The facilities at the Ayyan Thiruvalluvar statue in Kanniyakumari and at Poompuhar will be upgraded and restored to original glory<\/p>\n\t<\/li>\n<\/ul>\n","date":"2021-08-13 13:48:22","pin":"0","status":"1"},{"title":"Provision for Adi Dravidar and Tribal Welfare","content":"<p>The overall allotment for Adi-Dravidar and Tribal Welfare is enhanced to Rs.4,142.33 crore in the Revised Budget Estimates 2021-22.<\/p>\n","date":"2021-08-13 13:51:04","pin":"0","status":"1"},{"title":"Aid for differently abled","content":"<ul>\n\t<li>\n\t<p>To ensure that all the 9,173 eligible persons in the wait list are immediately provided maintenance allowance of Rs1,500 per month the budget for payment of maintenance allowance is being enhanced to Rs 404.64 crore.<\/p>\n\t<\/li>\n\t<li>\n\t<p>The budget provision for aids and appliances has been enhanced to Rs 50.66 crore to ensure that 9,185 persons in the waiting list are provided with the appliances of their choice during 2021-22.<\/p>\n\t<\/li>\n<\/ul>\n","date":"2021-08-13 13:59:27","pin":"0","status":"1"},{"title":"","content":"<p><iframe allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\" frameborder=\"0\" height=\"315\" src=\"https:\/\/www.youtube.com\/embed\/F_CVW9507go\" title=\"YouTube video player\" width=\"100%\"><\/iframe><\/p>\n","date":"2021-08-13 14:48:04","pin":"0","status":"1"}]}