{"details":[{"title":"Russia vetoes UN resolution to halt attack on Ukraine as India, China abstain at UNSC","content":"<p>UN Security Council resolution demanding that Moscow stop its attack on Ukraine and withdraw all troops faced a straightforward defeat. Friday&#39;s vote was 11-1, with China, India and the United Arab Emirates abstaining. It showed significant but not total opposition to Russia&#39;s invasion of its smaller, militarily weaker neighbour. <strong><a href=\"http:\/\/newindianexpress.com\/live\/2022\/feb\/25\/russia-ukraine-war-live-updates-india-abstains-from-voting-at-unsc-on-ukraine-crisis-russia-vetoes-2423362.html\" target=\"_blank\">(CHECK THE HIGHLIGHTS HERE)<\/a><\/strong><\/p>\n","date":"2022-02-26 07:30:24","pin":"0","status":"1"},{"title":"Ukraine says it has shot down military plane","content":"<p>Ukraine&#39;s military said it has shot down a Russian military transport plane with paratroopers on board. According to a statement from the military&#39;s General Staff, the Il-76 heavy transport plane was shot down near Vasylkiv, a city 40 kilometres south of Kyiv. The Russian military has not commented on the incident so far, and the report could not be immediately verified.<\/p>\n","date":"2022-02-26 07:31:15","pin":"0","status":"1"},{"title":"WATCH | Indian students stranded in Ukraine narrate situation amid Russian attack","content":"<p><iframe allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\" frameborder=\"0\" height=\"450\" src=\"https:\/\/www.youtube.com\/embed\/hDtrxV9LTdE\" title=\"YouTube video player\" width=\"100%\"><\/iframe><\/p>\n","date":"2022-02-26 07:33:02","pin":"0","status":"1"},{"title":"India-Russia relations distinct from Washington's equation with Moscow, that's okay: US","content":"<p>State Department spokesperson Ned Price noted that the US shares important interests and values with India. <strong><a href=\"https:\/\/www.newindianexpress.com\/world\/2022\/feb\/26\/india-russia-relations-distinct-from-washingtons-equation-with-moscow-thats-okay-us-2423969.html\" target=\"_blank\">(READ FULL STORY HERE)<\/a><\/strong><\/p>\n","date":"2022-02-26 07:34:24","pin":"0","status":"1"},{"title":"Will Japan join in Russia sanctions? Seems unclear till now","content":"<ul>\n\t<li>Japanese Foreign Minister Yoshimasa Hayashi said he spoke with his U. S. counterpart, Secretary of State Antony Blinken, on the phone on Saturday and agreed they must respond to Russian invasion of Ukraine properly to prevent it from becoming &quot;a wrong lesson&quot; because of its potential influence in Asia and the Indo-Pacific region.<\/li>\n\t<li>Hayashi declined to comment if Japan plans to join the United States, Britain and the European Union in imposing sanctions on Russian President Vladimir Putin and Foreign Minister Sergey Lavrov.<\/li>\n\t<li>He said Japan will closely stay in touch with other Group of Seven members and the international society while watching the development.<\/li>\n\t<li>Hayashi told reporters that he and Blinken reassured their commitment to work closely with the rest of the international society.<\/li>\n\t<li>They agreed that it is necessary to respond to Russia properly and to absolutely reject the unilateral act to change the status quo and not leave &quot;a wrong lesson.<\/li>\n<\/ul>\n","date":"2022-02-26 08:38:06","pin":"0","status":"1"},{"title":"Ukrainians flee to neighbouring countries in search of safety","content":"<ul>\n\t<li>Thousands have been fleeing Ukraine to escape the destruction caused by the Russian attack on their homeland.<\/li>\n\t<li>With men of military age banned from leaving the country, most of those who crossed borders were women, children and the elderly.<\/li>\n\t<li>Cars were backed up for several miles at some border crossings as authorities in Poland, Slovakia, Hungary, Romania and Moldova mobilized to receive the Ukrainians, providing shelter, food and legal help.<\/li>\n<\/ul>\n\n<p><a href=\"https:\/\/www.newindianexpress.com\/world\/2022\/feb\/26\/ukrainians-flee-war-seeking-safety-across-western-borders-2423972.html\" target=\"_blank\"><strong>Read more<\/strong><\/a><\/p>\n\n<div style=\"text-align:center\">\n<figure class=\"image\" style=\"display:inline-block\"><img alt=\"\" height=\"200\" src=\"https:\/\/images.newindianexpress.com\/uploads\/user\/ckeditor_images\/article\/2022\/2\/26\/Ukraine_AP(4).jpg\" width=\"400\" \/>\n<figcaption>People fleeing the conflict from neighboring Ukraine, receive hot beverages at the border crossing in Medyka, southeastern Poland, on Friday, Feb. 25, 2022. (Photo | AP)<\/figcaption>\n<\/figure>\n<\/div>\n","date":"2022-02-26 08:41:01","pin":"0","status":"1"},{"title":"Ukrainian army says it has repulsed an attack on one of Kyiv's main avenues","content":"<ul>\n\t<li>Russia &quot;attacked one of the military units on Victory Avenue in Kyiv. The attack was repulsed,&quot; Ukraine&#39;s army said on its verified Facebook page, without specifying where exactly the incident took place.<\/li>\n\t<li>AFP reported that there were loud explosions heard in central Kyiv early on Saturday, February 26.<\/li>\n<\/ul>\n\n<p><a href=\"https:\/\/www.newindianexpress.com\/world\/2022\/feb\/26\/ukraine-repulsed-russian-attack-on-main-kyiv-avenue-army-2423974.html\" target=\"_blank\"><strong>Read More<\/strong><\/a><\/p>\n\n<div style=\"text-align:center\">\n<figure class=\"image\" style=\"display:inline-block\"><img alt=\"\" height=\"200\" src=\"https:\/\/images.newindianexpress.com\/uploads\/user\/imagelibrary\/2022\/2\/26\/original\/Ukraine_AP5.jpg\" width=\"400\" \/>\n<figcaption>Ukrainian soldiers take position on a bridge inside the city of Kyiv, Ukraine, Friday, Feb. 25, 2022. (Photo | AP)<\/figcaption>\n<\/figure>\n<\/div>\n","date":"2022-02-26 08:48:03","pin":"0","status":"1"},{"title":"Australia announces sanctions against Russian lawmakers","content":"<ul>\n\t<li>Australia is imposing sanctions against all 339 members of the Russian parliament as well as eight oligarchs close to Putin.<\/li>\n\t<li>The country is also considering sanctions against Russian President Vladimir Putin as well as his Foreign Minister Sergei Lavrov over Russia&rsquo;s invasion of Ukraine.<\/li>\n\t<li>Australian Foreign Minister Marise Payne said, &quot;it is an exceptional step to sanction leaders, but this is an exceptional situation.&quot;<\/li>\n<\/ul>\n","date":"2022-02-26 08:51:46","pin":"0","status":"1"},{"title":"US to impose sanctions on Russian president Putin and Foreign Minister Lavrov","content":"<ul>\n\t<li>The US is following the lead of UK and the European Union in imposing sanctions against Russian leaders Vladimir Putin and Sergey Lavrov, AFP reported.<\/li>\n\t<li>A travel ban could also be a part of these sanctions, White House Press Secretary Jen Psaki said.<\/li>\n\t<li>Russian foreign ministry spokesperson has responded to these sanctions saying that &quot;we have reached the line after which the point of no return begins.&quot;<\/li>\n\t<li>The latest measures add to a tranche of sanctions that will hit four Russian banks, cut off more than half of Russia&#39;s technology imports and target several of the country&#39;s oligarchs.<\/li>\n<\/ul>\n\n<div style=\"text-align:center\">\n<figure class=\"image\" style=\"display:inline-block\"><img alt=\"\" height=\"200\" src=\"https:\/\/images.newindianexpress.com\/uploads\/user\/ckeditor_images\/article\/2022\/2\/26\/Sergey_Lavrov_AP(1).jpg\" width=\"400\" \/>\n<figcaption>Russian Foreign Minister Sergey Lavrov (Photo | AP)<\/figcaption>\n<\/figure>\n<\/div>\n\n<p><\/p>\n","date":"2022-02-26 09:03:11","pin":"0","status":"1"},{"title":"Major disruptions to internet across Ukraine as fighting spreads","content":"<ul>\n\t<li>Network monitoring organisation NetBlocks in a report confirmed significant disruptions to internet service in Kharkiv, Ukraine&rsquo;s second-largest city on the morning of Thursday 24 February 2022.<\/li>\n\t<li>The report also said that disruptions have subsequently been tracked across much of Ukraine as fighting spread.<\/li>\n\t<li>Internet disruptions have reached Kyiv by Saturday, Feb 26 morning, owing to power outages, cyberattacks and exodus. This incident comes as fighting is underway in Vasylkiv and Kyiv.<\/li>\n\t<li>Net Blocks also reported real-time network data showing major disruption to Ukraine&#39;s internet backbone provider GigaTrans, which supplies connectivity to many other networks.<\/li>\n\t<li>&quot;While connectivity remained available through other routes and the disruption was brief, the incident is understood to have had significant impact to telecommunications infrastructure,&quot; the NetBlocks report read.<\/li>\n<\/ul>\n\n<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\">Confirmed: Real-time network data show a major disruption to <a href=\"https:\/\/twitter.com\/hashtag\/Ukraine?src=hash&amp;ref_src=twsrc%5Etfw\">#Ukraine<\/a>&#39;s internet backbone provider GigaTrans, which supplies connectivity to many other networks. The incident comes as heavy fighting is reported in <a href=\"https:\/\/twitter.com\/hashtag\/Vasylkiv?src=hash&amp;ref_src=twsrc%5Etfw\">#Vasylkiv<\/a> and <a href=\"https:\/\/twitter.com\/hashtag\/Kyiv?src=hash&amp;ref_src=twsrc%5Etfw\">#Kyiv<\/a><br \/>\n<br \/>\nBackground: <a href=\"https:\/\/t.co\/S0qJQ7CbNv\">https:\/\/t.co\/S0qJQ7CbNv<\/a> <a href=\"https:\/\/t.co\/EksnZjs9Ay\">pic.twitter.com\/EksnZjs9Ay<\/a><\/p>\n&mdash; NetBlocks (@netblocks) <a href=\"https:\/\/twitter.com\/netblocks\/status\/1497409488403505153?ref_src=twsrc%5Etfw\">February 26, 2022<\/a><\/blockquote>\n<script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2022-02-26 09:31:58","pin":"0","status":"1"},{"title":"Indian students stranded at Polish border; Guidelines to cross yet to arrive","content":"<ul>\n\t<li>Hundreds of Indian students from Lviv and other western cities have reached the Ukraine-Poland border but are unable to cross as there are no guidelines in place from the Indian embassy in Ukraine.<\/li>\n\t<li>Noting the developments, the embassy in Kyiv released an advisory asking students and other Indians living in the western cities to not move to the border without coordinating with the embassy. &quot;...the embassy id working with our embassies in neighbouring countries for coordinated evacuation of our citizens,&quot; the advisory read.<\/li>\n<\/ul>\n\n<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\">Advisory to all Indian Nationals\/Students in Ukraine<br \/>\nas on 26 February 2022 <a href=\"https:\/\/twitter.com\/mea?ref_src=twsrc%5Etfw\">@mea<\/a> <a href=\"https:\/\/twitter.com\/NewIndianXpress?ref_src=twsrc%5Etfw\">@NewIndianXpress<\/a> <a href=\"https:\/\/t.co\/ZRE4U7kNTZ\">pic.twitter.com\/ZRE4U7kNTZ<\/a><\/p>\n&mdash; Yeshi Seli (@YeshiSeli) <a href=\"https:\/\/twitter.com\/YeshiSeli\/status\/1497414771268005890?ref_src=twsrc%5Etfw\">February 26, 2022<\/a><\/blockquote>\n<script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2022-02-26 09:53:01","pin":"0","status":"1"},{"title":"Belarus sovereignty also at risk as Russia uses its territory to attack Ukraine","content":"<ul>\n\t<li>Russia had grouped some 30,000 troops in Belarus ostensibly for exercises in the last weeks. They had been due to leave earlier in February but their presence was then extended indefinitely.<\/li>\n\t<li>&quot;With Russian tanks in Belarus, Lukashenko could remain the face of the regime with the real power lying elsewhere,&quot; Olga Dryndova, editor of Belarus-Analysen at the Research Centre for East European Studies at the University of Bremen told AFP.<\/li>\n<\/ul>\n\n<p><a href=\"https:\/\/www.newindianexpress.com\/world\/2022\/feb\/26\/belarus-sovereignty-also-at-risk-as-russia-attacks-ukraine-2423978.html\" target=\"_blank\"><strong>Read more<\/strong><\/a><\/p>\n\n<p style=\"text-align:center\"><img alt=\"\" height=\"294\" src=\"https:\/\/images.newindianexpress.com\/uploads\/user\/imagelibrary\/2022\/2\/26\/original\/lukashenko.jpg\" width=\"400\" \/><\/p>\n","date":"2022-02-26 09:55:00","pin":"0","status":"1"},{"title":"Ukrainian President refuses to leave Kyiv despite US offer to evacuate","content":"<ul>\n\t<li>Ukrainian President Volodymyr Zelenskyy has turned down the US government offer to evacuate him out of Kyiv on Saturday Feb 26.<\/li>\n\t<li>&ldquo;The fight is here; I need ammunition, not a ride,&rdquo; Zelenskyy is understood to have said to the American officials who brought him the proposal according to an AP report.<\/li>\n<\/ul>\n\n<p><a href=\"https:\/\/www.newindianexpress.com\/world\/2022\/feb\/26\/i-need-ammunition-not-a-ride-ukraine-president-zelenskyy-declines-us-offer-to-evacuate-kyiv-2424012.html\" target=\"_blank\"><strong>Read more<\/strong><\/a><\/p>\n","date":"2022-02-26 10:09:03","pin":"0","status":"1"},{"title":"Air raid alerts sounded in multiple Ukrainian cities","content":"<ul>\n\t<li>Air raid alerts have gone off in multiple cities including Lviv (a western Ukrainian city close to Poland), Lutsk, Uman, Vinnytsia, Rivne, Kherson and Cherkasy.<\/li>\n\t<li>People in these cities are being asked to reach their nearest shelters, including underground metro stations<\/li>\n<\/ul>\n","date":"2022-02-26 10:21:49","pin":"0","status":"1"},{"title":"Russian forces push further into Kyiv","content":"<ul>\n\t<li>The clashes in Kyiv have reportedly reached the Beresteyskaya metro station which is in the central part of the city. Two vehicles and a tank are understood to be destroyed. Ukraine&#39;s 101st Brigade is said to have destroyed the Russian columns at the station.<\/li>\n\t<li>The Ukrainian military has earlier said it has succeeded in stopping the offensive at Peremohy avenue.<\/li>\n<\/ul>\n\n<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\">This morning: Smoke rising near the <a href=\"https:\/\/twitter.com\/hashtag\/Kyiv?src=hash&amp;ref_src=twsrc%5Etfw\">#Kyiv<\/a> Zoo situated along Peremoy Avenue (via <a href=\"https:\/\/twitter.com\/SergUA63?ref_src=twsrc%5Etfw\">@SergUA63<\/a>) <a href=\"https:\/\/t.co\/43oVqkbL2k\">pic.twitter.com\/43oVqkbL2k<\/a><\/p>\n&mdash; Michael A. Horowitz (@michaelh992) <a href=\"https:\/\/twitter.com\/michaelh992\/status\/1497431484902354947?ref_src=twsrc%5Etfw\">February 26, 2022<\/a><\/blockquote>\n<script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2022-02-26 10:34:03","pin":"0","status":"1"},{"title":"Facebook bans Russian state media ads","content":"<ul>\n\t<li>Facebook is barring Russian state media from running ads or monetising on its platforms anywhere in the world.<\/li>\n\t<li>&quot;<span class=\"css-901oao css-16my406 r-poiln3 r-bcqeeo r-qvutc0\">We also continue to apply labels to additional Russian state media,&quot; Natha<\/span>niel Gleicher, Facebook&#39;s Head of Security said. &quot;T<span class=\"css-901oao css-16my406 r-poiln3 r-bcqeeo r-qvutc0\">hese changes have already begun rolling out and will continue into the weekend.<\/span>&quot;<\/li>\n<\/ul>\n\n<p><a href=\"https:\/\/www.newindianexpress.com\/world\/2022\/feb\/26\/facebook-bans-russia-state-media-from-running-ads-monetising-2424005.html\" target=\"_blank\"><strong>Read more<\/strong><\/a><\/p>\n\n<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\">1\/ We are now prohibiting Russian state media from running ads or monetizing on our platform anywhere in the world. We also continue to apply labels to additional Russian state media. These changes have already begun rolling out and will continue into the weekend.<\/p>\n&mdash; Nathaniel Gleicher (@ngleicher) <a href=\"https:\/\/twitter.com\/ngleicher\/status\/1497417241947607043?ref_src=twsrc%5Etfw\">February 26, 2022<\/a><\/blockquote>\n<script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2022-02-26 10:40:42","pin":"0","status":"1"},{"title":"Officials urge Kyiv residents to take shelter as street fighting breaks out","content":"<ul>\n\t<li>As Russian forces continue to storm into the Ukrainian capital, Kyiv, street fighting is being reported from across the city.<\/li>\n\t<li>The city officials in Kyiv urged residents to take shelter, to stay away from windows and to take precautions to avoid flying debris or bullets.<\/li>\n<\/ul>\n","date":"2022-02-26 11:10:40","pin":"0","status":"1"},{"title":"US approves $600 million aid for Ukraine, including $350 million for the military","content":"<ul>\n\t<li>The United States has approved a $ 350 million assistance to the Ukraine military.<\/li>\n\t<li>U.S. President Joe Biden signed a decree to provide immediate assistance to Ukraine to fight out the Russian forces that are pressing into its capital, Kyiv.<\/li>\n<\/ul>\n","date":"2022-02-26 11:26:13","pin":"0","status":"1"},{"title":"RECAP: Fight for Kyiv underway as Russians press forward","content":"<ul>\n\t<li>Fierce fighting broke out as the Russians who continued to press towards the centre of Kyiv were met with fierce resistance from the Ukrainian army.<\/li>\n\t<li>Citizens have been advised by the city authorities to stay indoors, away from windows, preferably in basements to avoid being hit by flying debris or bulelts.<\/li>\n\t<li>Ukrainian forces have claimed that Russian attacks have been repulsed in multiple areas in Kyiv including the Beresteyskaya metro station and the Kyiv zoo in Peremohy Avenue.<\/li>\n\t<li>Air raid alerts have been issued in cities across Ukraine, including Lviv in Western Ukraine, close to the Polish border.<\/li>\n\t<li>With the Russian aggression being met with surprisingly stiff resistance, sources on the ground fear there is worse to follow<\/li>\n<\/ul>\n","date":"2022-02-26 11:38:25","pin":"0","status":"1"},{"title":"'We won't lay down our arms' Zelenskyy says in new video","content":"<ul>\n\t<li>Ukrainian President Volodymyr Zelenskyy released a video filmed in central Kyiv. He has earlier refused to take American help to be evacuated out of&nbsp; Kyiv and has been overseeing the defence measures on the ground.<\/li>\n\t<li>In the video, Zelenskyy refuted the claims that he called on the army to lay down their arms.<\/li>\n\t<li>&quot;<span class=\"css-901oao css-16my406 r-poiln3 r-bcqeeo r-qvutc0\">I&#39;m here. We won&#39;t lay down our arms. We will defend our state,&quot; he said in the video.<\/span><\/li>\n<\/ul>\n\n<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\">Zelensky posts another video filmed in central Kyiv.<br \/>\n<br \/>\n&quot;There&#39;s a lot of fake information online that I call on our army to lay down arms, and that there&#39;s evacuation,&quot; he said.<br \/>\n<br \/>\n&quot;I&#39;m here. We won&#39;t lay down our arms. We will defend our state.&quot; <a href=\"https:\/\/t.co\/VKVY4XRUip\">pic.twitter.com\/VKVY4XRUip<\/a><\/p>\n&mdash; The Kyiv Independent (@KyivIndependent) <a href=\"https:\/\/twitter.com\/KyivIndependent\/status\/1497452921063194624?ref_src=twsrc%5Etfw\">February 26, 2022<\/a><\/blockquote>\n<script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2022-02-26 11:46:02","pin":"0","status":"1"},{"title":"People across the world take to streets in support of Ukraine","content":"<p>Citizens of various countries across the world have come out on streets to express solidarity with Ukrainians as they fight a deadly occupation by Vladimir Putin&#39;s Russia.<\/p>\n\n<div style=\"text-align:center\">\n<figure class=\"image\" style=\"display:inline-block\"><img alt=\"\" height=\"200\" src=\"https:\/\/images.newindianexpress.com\/uploads\/user\/ckeditor_images\/article\/2022\/2\/26\/Ukraine_Italy_AP.jpg\" width=\"400\" \/>\n<figcaption>People gather to demonstrate in Duomo Square, Milan, Italy, Friday, Feb. 25, 2022, following the Russian attack of Ukraine. (Photo | AP)<\/figcaption>\n<\/figure>\n<\/div>\n","date":"2022-02-26 12:10:55","pin":"0","status":"1"},{"title":"People across the world take to streets in support of Ukraine","content":"<p>Citizens of various countries across the world have come out on streets to express solidarity with Ukrainians as they fight a deadly occupation by Vladimir Putin&#39;s Russia.<\/p>\n\n<div style=\"text-align:center\">\n<figure class=\"image\" style=\"display:inline-block\"><img alt=\"\" height=\"200\" src=\"https:\/\/images.newindianexpress.com\/uploads\/user\/ckeditor_images\/article\/2022\/2\/26\/Ukraine_Italy_AP(1).jpg\" width=\"400\" \/>\n<figcaption>People gather for a candlelight procession in Bologna, Italy, following the Russian attack on Ukraine.&nbsp; (Photo | AP)<\/figcaption>\n<\/figure>\n<\/div>\n","date":"2022-02-26 12:13:39","pin":"0","status":"1"},{"title":"","content":"<p>Citizens of various countries across the world have come out on streets to express solidarity with Ukrainians as they fight a deadly occupation by Vladimir Putin&#39;s Russia.<\/p>\n\n<div style=\"text-align:center\">\n<figure class=\"image\" style=\"display:inline-block\"><img alt=\"\" height=\"200\" src=\"https:\/\/images.newindianexpress.com\/uploads\/user\/ckeditor_images\/article\/2022\/2\/26\/Ukraine_Greece_AP(1).jpg\" width=\"400\" \/>\n<figcaption>Supporters of the Greek Communist party march during a protest against the Russian invasion of Ukraine, in Athens, on Friday, Feb. 25, 2022. (Photo | AP)<\/figcaption>\n<\/figure>\n<\/div>\n","date":"2022-02-26 12:16:52","pin":"0","status":"1"},{"title":"BREAKING: Russian news agency says Ukraine's Melitopol captured","content":"<ul>\n\t<li>Russian troops have captured the city of Melitopol, Russia&rsquo;s Interfax news agency cited the Russian defence ministry as saying on Saturday.<\/li>\n\t<li>Melitopol is located in Ukraine&rsquo;s southeastern Zaporizhzhya region close to the coast of Sea of Azov.<\/li>\n\t<li>The ministry also said Russia has used air- and ship-based cruise missiles to carry out overnight strikes on military targets in Ukraine.<\/li>\n<\/ul>\n\n<p><\/p>\n","date":"2022-02-26 12:24:51","pin":"0","status":"1"},{"title":"Air raid alerts in Kyiv; Ukrainian forces repel Russians in Vasylkiv","content":"<ul>\n\t<li>Air raid alerts were issued in Kyiv and Zhytomyr, a town that is 140 km to the west of the capital.<\/li>\n\t<li>Authorities have urged the residents to find their nearest shelters.<\/li>\n\t<li>Ukrainian forces have also claimed to have repelled Russian forces in Vasylkiv, which is just 40 km to the Southwest of the Ukrainian capital.<\/li>\n<\/ul>\n","date":"2022-02-26 12:29:56","pin":"0","status":"1"},{"title":"Zelensky says Western 'partners' are sending weapons to Ukraine","content":"<p>A new day on the diplomatic frontline began with a conversation with Emmanuel Macron, tweeted Ukrainian President Volodymyr Zelenskyy.<\/p>\n\n<p>He added that the anti-war coalition is working and his country&#39;s western partners are sending help in the form of weapons.<\/p>\n\n<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\">A new day on the diplomatic frontline began with a conversation with <a href=\"https:\/\/twitter.com\/EmmanuelMacron?ref_src=twsrc%5Etfw\">@EmmanuelMacron<\/a>. Weapons and equipment from our partners are on the way to Ukraine. The anti-war coalition is working!<\/p>\n&mdash; ????????? ?????????? (@ZelenskyyUa) <a href=\"https:\/\/twitter.com\/ZelenskyyUa\/status\/1497456125431717888?ref_src=twsrc%5Etfw\">February 26, 2022<\/a><\/blockquote>\n<script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2022-02-26 12:32:53","pin":"0","status":"1"},{"title":"Indian students stuck in Kharkiv","content":"<p>As the fighting in Ukraine intensifies by the hour, Indian students find themselves in a dangerous situation.<\/p>\n\n<p>With the Indian embassy in Kyiv giving no clear guidelines about a possible evacuation, the students wait in agony.<\/p>\n\n<p>TNIE has accessed visuals of students who are stuck in Kharkiv, a city on the eastern front of the Russia-Ukraine battle.<\/p>\n\n<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\">Students stuck in Ukraine&rsquo;s Kharkiv ?<a href=\"https:\/\/twitter.com\/NewIndianXpress?ref_src=twsrc%5Etfw\">@NewIndianXpress<\/a>? ?<a href=\"https:\/\/twitter.com\/TheMornStandard?ref_src=twsrc%5Etfw\">@TheMornStandard<\/a>? <a href=\"https:\/\/t.co\/EtjsaiOyf1\">pic.twitter.com\/EtjsaiOyf1<\/a><\/p>\n&mdash; Ankita Upadhyay (@ankitaup) <a href=\"https:\/\/twitter.com\/ankitaup\/status\/1497454934178275333?ref_src=twsrc%5Etfw\">February 26, 2022<\/a><\/blockquote>\n<script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2022-02-26 12:47:57","pin":"0","status":"1"},{"title":"Russian missiles hit residential building in Kyiv","content":"<ul>\n\t<li>Ukraine&#39;s foreign minister has shared the picture of a partially destroyed apartment building in Kyiv after being hit by a missile.<\/li>\n\t<li>Videos shared by multiple journalists showed a missile hitting a private flat in the apartment complex in Lobanovsky Avenue 6, in the centre of Kyiv. The building is located less than 5 km from the Kyiv airport.<\/li>\n\t<li>The number of casualties is yet to be known.<\/li>\n<\/ul>\n\n<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\">Kyiv, our splendid, peaceful city, survived another night under attacks by Russian ground forces, missiles. One of them has hit a residential apartment in Kyiv. I demand the world: fully isolate Russia, expel ambassadors, oil embargo, ruin its economy. Stop Russian war criminals! <a href=\"https:\/\/t.co\/c3ia46Ctjq\">pic.twitter.com\/c3ia46Ctjq<\/a><\/p>\n&mdash; Dmytro Kuleba (@DmytroKuleba) <a href=\"https:\/\/twitter.com\/DmytroKuleba\/status\/1497463617767227395?ref_src=twsrc%5Etfw\">February 26, 2022<\/a><\/blockquote>\n<script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>\n\n<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\">This apartment building in Kyiv was hit by shelling overnight, according to news agency <a href=\"https:\/\/twitter.com\/unian?ref_src=twsrc%5Etfw\">@unian<\/a>.<br \/>\n<br \/>\nRussian MFA Sergei Lavrov said yesterday that &quot;nobody is going to attack the people of Ukraine,&quot; and there would be&quot;no strikes on civilian infrastructure.&quot; <a href=\"https:\/\/t.co\/0T0BO9HYv0\">pic.twitter.com\/0T0BO9HYv0<\/a><\/p>\n&mdash; max seddon (@maxseddon) <a href=\"https:\/\/twitter.com\/maxseddon\/status\/1497462017925472261?ref_src=twsrc%5Etfw\">February 26, 2022<\/a><\/blockquote>\n<script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>\n\n<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\">Russian missile strike last night on an apartment block in Lobanovsky Avenue in central Kyiv. A large chunk torn out of the building, with multiple floors destroyed and smoke burning this morning. Number of casualties unknown <a href=\"https:\/\/t.co\/bkJ07QdiOT\">pic.twitter.com\/bkJ07QdiOT<\/a><\/p>\n&mdash; Luke Harding (@lukeharding1968) <a href=\"https:\/\/twitter.com\/lukeharding1968\/status\/1497467121227472898?ref_src=twsrc%5Etfw\">February 26, 2022<\/a><\/blockquote>\n<script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>\n\n<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\">Missile strikes an apartment building in Kyiv.<br \/>\n<br \/>\nAfter heavy fighting in the capital overnight, a residential apartment building not far from the Kyiv International Airport (Zhuliany) was struck by Russian missile attacks. There are no reported deaths. <a href=\"https:\/\/t.co\/8yau9qyEZ9\">pic.twitter.com\/8yau9qyEZ9<\/a><\/p>\n&mdash; The Kyiv Independent (@KyivIndependent) <a href=\"https:\/\/twitter.com\/KyivIndependent\/status\/1497468323633811457?ref_src=twsrc%5Etfw\">February 26, 2022<\/a><\/blockquote>\n<script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2022-02-26 12:56:15","pin":"0","status":"1"},{"title":"","content":"<p><strong>&#39;This war will last,&#39; warns French President Macron on Ukraine<\/strong><\/p>\n","date":"2022-02-26 13:01:53","pin":"0","status":"1"},{"title":"Babies of war","content":"<ul>\n\t<li>A baby was reportedly born in Kyiv subway, now being used as a bomb shelter, overnight on February 25.<\/li>\n\t<li>With air raid alerts blaring during the night, residents of the Ukrainian capital were forced to shelter in underground structures.<\/li>\n<\/ul>\n\n<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\">A baby was born in Kyiv subway, now being used as a bomb shelter, overnight on Feb. 25.<br \/>\n<br \/>\nAmid ongoing air raids as part of Russia&rsquo;s war against Ukraine, people all across the country have been taking shelter underground and in subway stations. <a href=\"https:\/\/t.co\/G0RalS98EL\">pic.twitter.com\/G0RalS98EL<\/a><\/p>\n&mdash; The Kyiv Independent (@KyivIndependent) <a href=\"https:\/\/twitter.com\/KyivIndependent\/status\/1497465416179982338?ref_src=twsrc%5Etfw\">February 26, 2022<\/a><\/blockquote>\n<script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2022-02-26 13:09:58","pin":"0","status":"1"},{"title":"Andhra Pradesh government in contact with 423 affected students from state in Ukraine","content":"<p>The Andhra Pradesh government has so far traced 423 students from the state studying in war-hit Ukraine and established contact with them, a senior official said on Saturday.<\/p>\n","date":"2022-02-26 14:05:04","pin":"0","status":"1"},{"title":"Running short of essentials, Tamil Nadu students stranded in Ukraine send SOS for early evacuation","content":"<p>As Russia&#39;s offensive against Ukraine continued on Saturday, Indian students hailing from Tamil Nadu made a fervent appeal for their early evacuation, saying they were short on supplies and virtually feared for their lives amidst repeated sounds of explosions.<\/p>\n","date":"2022-02-26 14:08:09","pin":"0","status":"1"},{"title":"Do not move to border posts without coordination with us: Indian embassy in Ukraine","content":"<p>With Russian troops advancing on Kyiv and other key cities, India on Saturday asked its nationals stranded in Ukraine to exercise caution at all times and not move towards any border post to exit the country without prior coordination with its officials.<\/p>\n","date":"2022-02-26 14:16:32","pin":"0","status":"1"},{"title":"Ukraine crisis: Air India evacuation flight expected to land in Mumbai at 8 pm","content":"<p>An Air India Boeing aircraft, which departed from the Chhatrapati Shivaji Maharaj International Airport here for Romanian capital Bucharest early morning on Saturday to bring back Indian citizens stranded in Ukraine due to the Russian military offensive, is expected to arrive here at 8 pm, the airport operator said.<\/p>\n","date":"2022-02-26 14:22:26","pin":"0","status":"1"},{"title":"Tamil Nadu CM MK Stalin speaks to stranded TN students in Ukraine","content":"<p>Tamil Nadu Chief Minister MK Stalin on Saturday spoke to some of the students from the state stranded in Ukraine, against which Russia has mounted a military offensive since February 24.<\/p>\n","date":"2022-02-26 14:28:00","pin":"0","status":"1"},{"title":"Russia's invasion of Ukraine: Latest Developments","content":"<p><strong>Battle for Kyiv<\/strong><\/p>\n\n<p>Ukrainian soldiers beat back a Russian attack in the capital Kyiv only hours after President Volodymyr Zelensky warns Moscow would attempt to take the city before dawn.&nbsp;<\/p>\n\n<p><strong>Civilians against tanks<\/strong><\/p>\n\n<p>Civilians -- some of whom have never held a gun before -- prepare to battle with Russian tanks with the Ukrainian defence ministry urging them &quot;to make Molotov cocktails and neutralise the enemy&quot;.&nbsp;<\/p>\n\n<p><strong>Dead in the streets<\/strong><\/p>\n\n<p>After an earlier Russian attack was repulised in the centre of the city, AFP saw a dead man in civilian clothes lying sprawled on the pavement as nearby medics helped another whose car was crushed by an armoured vehicle.<\/p>\n\n<p><strong>Cruise missile attacks<\/strong><\/p>\n\n<p>Russia says it is bombarding Ukraine&#39;s military infrastructure with air- and sea-based cruise missiles.<\/p>\n","date":"2022-02-26 14:33:49","pin":"0","status":"1"},{"title":"Urgently carry out evacuation of Indian students from Ukraine: Rahul Gandhi to Modi government","content":"<p>Congress leader Rahul Gandhi on Saturday highlighted the plight of Indian students stuck in Ukraine and appealed to the central government to carry out their evacuation urgently.<\/p>\n\n<p>&quot;Visuals of Indian students in bunkers are disturbing. Many are stuck in eastern Ukraine which is under heavy attack. My thoughts are with their worried family members. Again, I appeal to Government of India to execute urgent evacuation,&quot; Gandhi said on Twitter.<\/p>\n","date":"2022-02-26 14:42:16","pin":"0","status":"1"},{"title":"Russia's invasion of Ukraine: Latest Developments","content":"<p><strong>Putin, Lavrov sanctioned<\/strong><\/p>\n\n<p>The United States and the European Union add Russian leader Vladimir Putin and Foreign Minister Sergei Lavrov to their sanctions list. British Prime Minister Boris Johnson also says he is planning &quot;imminent&quot; sanctions against them.<\/p>\n\n<p><strong>NATO deploys force<\/strong><\/p>\n\n<p>NATO chief Jens Stoltenberg says the alliance is deploying its rapid response forces to bolster defences on its eastern flank.<\/p>\n\n<p><strong>Chernobyl radiation increases<\/strong><\/p>\n\n<p>Ukrainian officials say radiation levels have increased in the Chernobyl exclusion zone and warn the capture of the plant by Russian soldiers could have &quot;terrible consequences&quot;.<\/p>\n\n<p><strong>Council of Europe suspends Russia<\/strong><\/p>\n\n<p>The Council of Europe says it is suspending Russia from the rights body over the attack against Ukraine.<\/p>\n\n<p><strong>Spain and Rome protests<\/strong><\/p>\n\n<p>Anti-war rallies against the invasion are held in Madrid, Rome and Barcelona with Russians marching alongside Ukrainians.<\/p>\n","date":"2022-02-26 14:45:44","pin":"0","status":"1"},{"title":"MoE appeals to Indian students stranded in Ukraine to follow guidelines issued by MEA, embassy","content":"<p>The Ministry of Education (MoE) appealed to the Indian students stranded in Ukraine on Saturday to follow all the guidelines issued by the Ministry of External Affairs (MEA) and the Indian embassy. It also assured the students that all possible efforts are being made by the government to bring them back from Ukraine.<\/p>\n","date":"2022-02-26 14:50:06","pin":"0","status":"1"},{"title":"Cyprus confirmed it will not block the decision to ban Russia from SWIFT","content":"<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\">This is potentially a bigger deal than even Germany signing on &ndash; Cyprus is one of Russia&#39;s biggest foreign investors (it&#39;s Russians with Cypriot offshore companies investing back in Russia) and the second biggest bank in Cyprus is Russian <a href=\"https:\/\/t.co\/nKOZfE1dg6\">https:\/\/t.co\/nKOZfE1dg6<\/a><\/p>\n&mdash; max seddon (@maxseddon) <a href=\"https:\/\/twitter.com\/maxseddon\/status\/1497498400727654401?ref_src=twsrc%5Etfw\">February 26, 2022<\/a><\/blockquote>\n<script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2022-02-26 14:55:12","pin":"0","status":"1"},{"title":"Russia's invasion of Ukraine: Latest Developments","content":"<p><strong>Ukrainian forces resisting<\/strong><\/p>\n\n<p>Ukrainian forces are putting up resistance and inflicting damage on Russia&#39;s invading military as it seeks to push deeper into the country, NATO chief Jens Stoltenberg says after an alliance video summit.&nbsp;<\/p>\n\n<p><strong>&#39;Take power&#39;, Putin says<\/strong><\/p>\n\n<p>Russian President Vladimir Putin calls on the Ukrainian army to overthrow the government whose leaders he describes as &quot;terrorists&quot; and &quot;a gang of drug addicts and neo-Nazis&quot;.<\/p>\n\n<p><strong>Battles north of Kyiv<\/strong><\/p>\n\n<p>Ukraine says it is battling with Russian armoured units in two locations between 40 and 80 kilometres (25 and 50 miles) north of Kyiv.&nbsp;<\/p>\n\n<p><strong>Three Russian aircraft shot down<\/strong><\/p>\n\n<p>Ukraine claims to have shot down a Russian bomber and helicopter in the east as well as a transport plane southwest of Kyiv.<\/p>\n\n<p><strong>50,000 flee country<\/strong><\/p>\n\n<p>More than 50,000 people have fled Ukraine since the start of the Russian invasion, mainly to Poland and Moldova, the United Nations refugee chief says.<\/p>\n","date":"2022-02-26 15:01:48","pin":"0","status":"1"},{"title":"Russia has begun redeploying reserve units on the border: MFA of Ukraine","content":"<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\">The third day of ???????? military operation against Ukraine is underway. The enemy has begun redeploying reserve units on the border w\/ ????????, continues to carry out air strikes on airfields, groups of troops of the ???????? AF in Eastern Ukraine and in the Northern part of KYIV region. 1\/4<\/p>\n&mdash; MFA of Ukraine ???????? (@MFA_Ukraine) <a href=\"https:\/\/twitter.com\/MFA_Ukraine\/status\/1497500448017698817?ref_src=twsrc%5Etfw\">February 26, 2022<\/a><\/blockquote>\n<script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2022-02-26 15:08:39","pin":"0","status":"1"},{"title":"MEA Jaishankar assures CM Bommai full cooperation in evacuating Indians stranded in Ukraine","content":"<p>External Affairs Minister S Jaishankar on Saturday assured Karnataka Chief Minister Basavaraj Bommai full cooperation and support from the Government of India to evacuate people from Karnataka who are stranded in Ukraine.<\/p>\n","date":"2022-02-26 15:18:17","pin":"0","status":"1"},{"title":"Centre making all-out efforts to bring back Indians stranded in Ukraine: Haryana government","content":"<p>The Haryana government has assured the state&#39;s residents who are stuck in Ukraine due to a Russian military offensive that the Centre is making all-out efforts to evacuate stranded Indians. Officials of the Haryana government&#39;s Foreign Cooperation Department interacted with some members of the Haryanvi community stuck in Ukraine and their relatives back home virtually on Friday.<\/p>\n","date":"2022-02-26 15:26:10","pin":"0","status":"1"},{"title":"Single air strikes were carried out in many districts across Ukraine: MFA of Ukraine","content":"<blockquote class=\"twitter-tweet\" data-conversation=\"none\">\n<p dir=\"ltr\" lang=\"en\">Single air strikes were carried out in the districts of SUMY, POLTAVA, MARIUPOL. From the Black Sea, ???????? launched Caliber naval-based cruise missiles across Ukraine. Tactical aviation operations from the territory of Belarus and the TOT Crimea are controlled by ???????? Air Forces. 2\/4<\/p>\n&mdash; MFA of Ukraine ???????? (@MFA_Ukraine) <a href=\"https:\/\/twitter.com\/MFA_Ukraine\/status\/1497500449884225539?ref_src=twsrc%5Etfw\">February 26, 2022<\/a><\/blockquote>\n<script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2022-02-26 15:33:11","pin":"0","status":"1"},{"title":"Ukrainian Vice PM Mykhailo Fedorov calls upon Tim Cook to block Russian users","content":"<p>Vice Prime Minister of Ukraine, Mykhailo Fedorov, on Saturday urged Apple CEO Tim Cook to stop supplying products and services to Russian users as a response to its invasion of Ukraine.<\/p>\n","date":"2022-02-26 15:40:24","pin":"0","status":"1"},{"title":"Russia using tactical aircraft civilian infrastructure facilities: MFA of Ukraine","content":"<blockquote class=\"twitter-tweet\" data-conversation=\"none\">\n<p dir=\"ltr\" lang=\"en\">???????? has repeatedly used operational and tactical aircraft in the areas of YUZHNYI and ODESA, at OZERNE airfield, and at civilian infrastructure facilities in the KYIV region. 3\/4<\/p>\n&mdash; MFA of Ukraine ???????? (@MFA_Ukraine) <a href=\"https:\/\/twitter.com\/MFA_Ukraine\/status\/1497500451788500997?ref_src=twsrc%5Etfw\">February 26, 2022<\/a><\/blockquote>\n<script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2022-02-26 15:45:31","pin":"0","status":"1"},{"title":"Union Cabinet apprised of situation in Ukraine, efforts to bring back Indians","content":"<p>The Union Cabinet was learnt to have been briefed on Saturday about the situation in Ukraine and efforts being taken to evacuate Indian nationals from the war-hit country. The Cabinet Committee on Security is also learnt to have met on Saturday amid the crisis in Ukraine after it was attacked by Russia.<\/p>\n","date":"2022-02-26 15:55:07","pin":"0","status":"1"},{"title":"Russia trying to secure a quick victory: MFA of Ukraine","content":"<blockquote class=\"twitter-tweet\" data-conversation=\"none\">\n<p dir=\"ltr\" lang=\"en\">???????? is still trying to secure a quick victory, developing an offensive in the direction of the settlements: KYIV, CHERNIHIV, SUMY, HLUHIV, KHARKIV, KHERSON and ZAPORIZHZIA. 4\/4<a href=\"https:\/\/twitter.com\/hashtag\/StopRussianAggression?src=hash&amp;ref_src=twsrc%5Etfw\">#StopRussianAggression<\/a> <a href=\"https:\/\/twitter.com\/hashtag\/StandWithUkraine?src=hash&amp;ref_src=twsrc%5Etfw\">#StandWithUkraine<\/a><\/p>\n&mdash; MFA of Ukraine ???????? (@MFA_Ukraine) <a href=\"https:\/\/twitter.com\/MFA_Ukraine\/status\/1497500453742993411?ref_src=twsrc%5Etfw\">February 26, 2022<\/a><\/blockquote>\n<script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2022-02-26 16:09:02","pin":"0","status":"1"},{"title":"First Air India evacuation flight departs from Bucharest with 219 Indians","content":"<p>Air India&#39;s first evacuation flight departed from Romanian capital Bucharest on Saturday afternoon for Mumbai with 219 Indian nationals who were stranded in Ukraine due to the ongoing Russian military offensive, officials said.<\/p>\n","date":"2022-02-26 16:13:15","pin":"0","status":"1"},{"title":"Ukraine crisis: Kerala government to bear airfare of students from Mumbai & Delhi to state","content":"<p>The Kerala government will bear the cost of flight tickets for the students arriving in Delhi and Mumbai on evacuation flights arranged by the Union Government from Ukraine which is under attack from Russian forces, state Chief Minister Pinarayi Vijayan said on Saturday.<\/p>\n","date":"2022-02-26 16:21:25","pin":"0","status":"1"},{"title":"Honesty, reassurance: How to talk to kids about Ukraine","content":"<p>Though the invasion, for U.S. kids, is playing out several thousand miles from home, social media and television coverage can make it seem just next door. <strong>(<a href=\"https:\/\/www.newindianexpress.com\/world\/2022\/feb\/26\/honesty-reassurance-how-to-talk-to-kids-about-ukraine-2424015.html\" target=\"_blank\">READ MORE<\/a>)<\/strong><\/p>\n","date":"2022-02-26 16:34:19","pin":"0","status":"1"},{"title":"EXPLAINER: What does Ukraine invasion mean for energy bills?","content":"<p>The world is already facing high energy prices and a supply crunch that has hit consumers with high utility bills and pain at the gasoline pump.<strong> (<a href=\"https:\/\/www.newindianexpress.com\/world\/2022\/feb\/26\/explainer-what-does-ukraine-invasion-mean-for-energy-bills-2424017.html\" target=\"_blank\">READ MORE<\/a>)<\/strong><\/p>\n","date":"2022-02-26 16:39:00","pin":"0","status":"1"},{"title":"Serbia rejects Western calls to join sanctions on Russia","content":"<p>Serbia remained a rare European state not to join a call for Western sanctions against Moscow for its invasion of a sovereign European state. <strong>(<a href=\"https:\/\/www.newindianexpress.com\/world\/2022\/feb\/26\/serbia-rejects-western-calls-to-join-sanctions-on-russia-2424021.html\" target=\"_blank\">READ MORE<\/a>)<\/strong><\/p>\n","date":"2022-02-26 16:48:25","pin":"0","status":"1"},{"title":"France supports banning Russia from SWIFT: Minister of Foreign Affairs of Ukraine","content":"<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\">&quot;France supports banning Russia from SWIFT. I urged to immediately introduce the third package of EU sanctions to stop Russian invasion. France is also ready to supply weapons and military equipment to help Ukraine defend itself.&quot;<a href=\"https:\/\/twitter.com\/DmytroKuleba?ref_src=twsrc%5Etfw\">@DmytroKuleba<\/a><\/p>\n&mdash; KyivPost (@KyivPost) <a href=\"https:\/\/twitter.com\/KyivPost\/status\/1497530679025934336?ref_src=twsrc%5Etfw\">February 26, 2022<\/a><\/blockquote>\n<script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2022-02-26 16:57:27","pin":"0","status":"1"},{"title":"NATO leaders agree to bolster eastern forces after invasion","content":"<p>Stoltenberg did not say how many troops would be sent or where they might go, but he did confirm that the move would involve land, sea and air power. <strong>(<a href=\"https:\/\/www.newindianexpress.com\/world\/2022\/feb\/26\/nato-leaders-agree-to-bolster-eastern-forces-after-invasion-2424022.html\" target=\"_blank\">READ MORE<\/a>)<\/strong><\/p>\n","date":"2022-02-26 17:10:39","pin":"0","status":"1"},{"title":"Protests resume as Russia seeks to quash invasion critics","content":"<p>The rallies on Friday night appeared smaller than on Thursday, when thousands took to the streets across Russia. <strong>(<a href=\"https:\/\/www.newindianexpress.com\/world\/2022\/feb\/26\/protests-resume-as-russia-seeks-to-quash-invasion-critics-2424024.html\" target=\"_blank\">READ MORE<\/a>)<\/strong><\/p>\n","date":"2022-02-26 17:21:04","pin":"0","status":"1"},{"title":"We 'derailed' Russian attack plan, says Ukraine President Volodymyr Zelenskyy","content":"<p>Ukraine President Volodymyr Zelenskyy stated that the Ukrainian forces have managed to&nbsp;&#39;derailed&#39; Russian attack plan.<\/p>\n","date":"2022-02-26 17:24:12","pin":"0","status":"1"},{"title":"US sanctions on Russian oligarchs miss richest of rich","content":"<p>Some oligarchs have also obtained dual citizenship in Britain and other Western countries, adding legal complications to attempts to unilaterally seize their assets. <strong>(<a href=\"https:\/\/www.newindianexpress.com\/world\/2022\/feb\/26\/us-sanctions-on-russian-oligarchs-miss-richest-of-rich-2424029.html\" target=\"_blank\">READ MORE<\/a>)<\/strong><\/p>\n","date":"2022-02-26 17:31:07","pin":"0","status":"1"},{"title":"Russia-Ukraine War: Street fighting begins in Kyiv; people urged to seek shelter","content":"<p>The street clashes followed fighting that pummeled bridges, schools and apartment buildings, and resulted in hundreds of casualties. <strong>(<a href=\"https:\/\/www.newindianexpress.com\/world\/2022\/feb\/26\/russia-ukraine-war-street-fighting-begins-in-kyiv-people-urged-to-seek-shelter-2424034.html\" target=\"_blank\">READ MORE<\/a>)<\/strong><\/p>\n","date":"2022-02-26 17:35:23","pin":"0","status":"1"},{"title":"Ukraine invasion: What to know as Russian forces target Kyiv","content":"<p>After a barrage of airstrikes on cities and military bases around the country, Russian forces were closing in on Ukraine&#39;s capital on Saturday. <strong>(<a href=\"https:\/\/www.newindianexpress.com\/world\/2022\/feb\/26\/ukraine-invasion-what-to-know-as-russian-forces-target-kyiv-2424039.html\" target=\"_blank\">READ MORE<\/a>)<\/strong><\/p>\n","date":"2022-02-26 17:41:11","pin":"0","status":"1"},{"title":"US or Russia? Ukraine crisis poses dilemma for wealthy Gulf","content":"<p>Middle East experts say their reticence is understandable given what&#39;s at play - energy, money and security. <strong>(<a href=\"https:\/\/www.newindianexpress.com\/world\/2022\/feb\/26\/us-or-russia-ukraine-crisis-poses-dilemma-for-wealthy-gulf-2424053.html\" target=\"_blank\">READ MORE<\/a>)<\/strong><br \/>\n&nbsp;<\/p>\n","date":"2022-02-26 17:45:20","pin":"0","status":"1"},{"title":"Rocket impact reported against a building in Chernihiv Bjelova","content":"<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\">Rocket impact reported against a building in Chernihiv Bjelova street <a href=\"https:\/\/twitter.com\/hashtag\/Ukraine?src=hash&amp;ref_src=twsrc%5Etfw\">#Ukraine<\/a> <a href=\"https:\/\/t.co\/6GzMq7KQ5y\">pic.twitter.com\/6GzMq7KQ5y<\/a><\/p>\n&mdash; Michael A. Horowitz (@michaelh992) <a href=\"https:\/\/twitter.com\/michaelh992\/status\/1497545311828463616?ref_src=twsrc%5Etfw\">February 26, 2022<\/a><\/blockquote>\n<script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2022-02-26 17:51:39","pin":"0","status":"1"},{"title":"Six Manipuri students stranded in war-hit Ukraine en route to Romania: CM Biren Singh","content":"<p>Manipur Chief Minister N Biren Singh on Saturday said six students from the state, who have been stranded in war-ravaged Ukraine, are on their way to Romania in a specially arranged bus, as part of the evacuation mission.<\/p>\n","date":"2022-02-26 18:03:21","pin":"0","status":"1"},{"title":"Indian students rush to reach Ukraine-Poland border, only to find long queues","content":"<p>Amid chaos and confusion, 21-year-old medical student Mehul Rathore and his elder sister Meghna travelled in a bus for 200 kilometres from the Ukrainian city of Ternopil and walked for around 20 kilometres at night in freezing cold to reach the Ukraine-Poland border to seek safe shelter in Poland, but they have no option other than waiting in a long queue, that too in uncertainty.<\/p>\n","date":"2022-02-26 18:12:38","pin":"0","status":"1"},{"title":"Indian govt taking all necessary measures to bring back students, says Union Minister G Kishan Reddy","content":"<p>Amid the ongoing tensions in Ukraine and India&#39;s attempts to bring back stranded students from the Eastern European country, Union Minister G Kishan Reddy on Saturday said that the Central government is taking all necessary measures to evacuate its citizens from the country.<\/p>\n","date":"2022-02-26 18:19:02","pin":"0","status":"1"},{"title":"Working for safe evacuation of stranded Goans, says CM Pramod Sawant","content":"<p>The Goa government is working with the Embassy of India to ensure safe evacuation of stranded Goans from Ukraine, which has been invaded by Russia, Chief Minister Pramod Sawant said on Saturday.<\/p>\n","date":"2022-02-26 18:31:34","pin":"0","status":"1"},{"title":"Ukraine crisis will affect poor sections, remote areas severely: Former Jammu & Kashmir CM Farooq Abdullah","content":"<p>National Conference president Farooq Abdullah on Saturday said the Russia-Ukraine war will affect the entire world including India, causing spike in inflation that will severely hit the poor sections and remote areas of the country.<\/p>\n","date":"2022-02-26 18:41:07","pin":"0","status":"1"},{"title":"Indian embassy in Hungary issues new advisory for citizens in Ukraine desiring to be evacuated","content":"<p>The Indian Embassy in Hungary on Saturday issued a fresh advisory for Indians in Ukraine baring them not to cross the border from other checkpoints than Zahony- Uzhhorod as there is no presence of the Indian Embassy unit to facilitate entry into the Hungarian side.<\/p>\n","date":"2022-02-26 18:58:36","pin":"0","status":"1"},{"title":"Indian students in Ukraine must carry national flag on vehicles: Union Minister G Kishan Reddy","content":"<p>Indian students stranded in crisis-stricken Ukraine are advised to carry the national flag on their vehicles for safety, said Union Minister G Kishan Reddy on Saturday.<\/p>\n","date":"2022-02-26 19:01:32","pin":"0","status":"1"},{"title":"Ukraine President Volodymyr Zelenskyy speaks to PM Modi, seeks political support in UNSC","content":"<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\">Spoke with&nbsp;Prime Minister <a href=\"https:\/\/twitter.com\/narendramodi?ref_src=twsrc%5Etfw\">@narendramodi<\/a>. Informed of the course of repulsing aggression. More than 100,000 invaders are on our land. They insidiously fire on residential buildings. Urged to give us political support in&nbsp;Security Council. Stop the aggressor together!<\/p>\n&mdash; ????????? ?????????? (@ZelenskyyUa) <a href=\"https:\/\/twitter.com\/ZelenskyyUa\/status\/1497555947023224836?ref_src=twsrc%5Etfw\">February 26, 2022<\/a><\/blockquote>\n<script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2022-02-26 19:05:50","pin":"1","status":"1"},{"title":"130 Himachal Pradesh residents stuck in Ukraine: CM Jai Ram Thakur","content":"<p>Himachal Pradesh Chief Minister Jai Ram Thakur on Saturday told the state Assembly that 130 state residents are stuck in Ukraine and 32 of them are being brought back to India on two chartered flights.<\/p>\n\n<p>(<strong><a href=\"https:\/\/www.newindianexpress.com\/nation\/2022\/feb\/26\/130-himachal-pradesh-residents-stuck-in-ukraine-cm-thakur-2424119.html\" target=\"_blank\">READ FULL STORY HERE<\/a><\/strong>)<\/p>\n","date":"2022-02-26 19:10:34","pin":"0","status":"1"},{"title":"'Checkpoints sensitive': Indians in Ukraine advised not to go to border posts on their own","content":"<p>The Embassy of India in Kyiv, Ukraine, issued another advisory on Saturday urging Indian nationals not to move to any of the border posts without prior coordination with Government of India officials.<\/p>\n\n<p>(<a href=\"https:\/\/www.newindianexpress.com\/nation\/2022\/feb\/26\/border-checkpoints-sensitive-indians-in-ukraine-advised-not-to-go-to-border-posts-on-their-own-2424125.html\" target=\"_blank\"><strong>CLICK HERE FOR FULL REPORT<\/strong><\/a>)<\/p>\n","date":"2022-02-26 19:11:48","pin":"0","status":"1"},{"title":"Counter sanctions: Russia may opt out of nuclear arms deal, cut diplomatic ties, freeze assets","content":"<p style=\"text-align:center\"><img alt=\"\" height=\"434\" src=\"https:\/\/images.newindianexpress.com\/uploads\/user\/ckeditor_images\/article\/2022\/2\/26\/rus.jpg\" width=\"650\" \/><\/p>\n\n<p>Moscow may respond to Western sanctions by opting out of the last nuclear arms deal with the US, cutting diplomatic ties with Western nations and freezing their assets, a senior Russian official warned Saturday as Russia&#39;s ties with the West dived to new lows over its invasion of Ukraine.<\/p>\n","date":"2022-02-26 20:11:36","pin":"0","status":"1"},{"title":"Russia halts space launches from French Guiana over sanctions","content":"<p>Russia is suspending space launches from French Guiana and withdrawing its technical personnel in response to EU sanctions over Moscow&#39;s invasion of Ukraine, the space agency said Saturday.<\/p>\n","date":"2022-02-26 20:24:00","pin":"0","status":"1"},{"title":"Russia bars flights from Bulgaria, Poland, Czech Republic","content":"<p>Russia on Saturday closed its airspace to flights from Bulgaria, Poland, and the Czech Republic in tit-for-tat punitive measures following Moscow&#39;s invasion of Ukraine. Britain has banned Russian flagship carrier Aeroflot from flying over the UK and several countries, including Bulgaria, Poland, and the Czech Republic, have closed their airspace to Russian carriers.<\/p>\n","date":"2022-02-26 20:24:20","pin":"0","status":"1"},{"title":"First evacuation flight carrying 219 Indians lands in Mumbai","content":"<p>The first evacuation flight carrying 219 passengers from Ukraine, has landed in Mumbai.&nbsp;<\/p>\n\n<p>&quot;Since the beginning of this crisis, our main objective was to bring back each &amp; every Indian stranded in Ukraine. 219 students have arrived here. This was the first batch, the second will reach Delhi soon. We&#39;ll not stop until all of them are back home,&quot; tweeted Union Minister Piyush Goyal.<\/p>\n\n<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\"><a href=\"https:\/\/twitter.com\/hashtag\/WATCH?src=hash&amp;ref_src=twsrc%5Etfw\">#WATCH<\/a> | Union Minister Piyush Goyal welcomes the Indian nationals safely evacuated from Ukraine at Mumbai airport <a href=\"https:\/\/t.co\/JGKReJE1ct\">pic.twitter.com\/JGKReJE1ct<\/a><\/p>\n&mdash; ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1497586662968557570?ref_src=twsrc%5Etfw\">February 26, 2022<\/a><\/blockquote>\n<script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2022-02-26 20:55:45","pin":"0","status":"1"},{"title":"Ukraine says ready for talks but not with unacceptable conditions","content":"<div style=\"text-align:center\">\n<figure class=\"image\" style=\"display:inline-block\"><img alt=\"\" height=\"423\" src=\"https:\/\/images.newindianexpress.com\/uploads\/user\/ckeditor_images\/article\/2022\/2\/26\/war_zone1.jpg\" width=\"650\" \/>\n<figcaption>Ukrainian soldiers at the site after a fight with Russian troops in Kyiv on Saturday. (Photo | AFP)<\/figcaption>\n<\/figure>\n<\/div>\n\n<p>Ukraine on Saturday rejected Russian suggestions that it was refusing to negotiate a ceasefire but said it was not ready to accept unacceptable conditions, according to media reports.<\/p>\n","date":"2022-02-26 21:15:04","pin":"0","status":"1"},{"title":"Russian Army ordered to broaden Ukraine advance","content":"<p>The Russian army has been ordered&nbsp;to broaden its offensive in Ukraine &ldquo;from all directions&rdquo; after Kyiv refused to hold talks in Belarus, Moscow&rsquo;s defence ministry said in a statement Saturday. &ldquo;After the Ukrainian side rejected the negotiation process, today all units were given orders to develop the advance from all directions in accordance with the operation&rsquo;s plans,&rdquo; Russian Army spokesman Igor Konashenkov said in a statement.<\/p>\n","date":"2022-02-26 21:24:04","pin":"0","status":"1"},{"title":"Britain deploys troops to bolster NATO's eastern front","content":"<p>UK&rsquo;s Royal Navy, British Army and Royal Air Force deployed to bolster NATO&rsquo;s eastern front.<\/p>\n\n<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\">UK <a href=\"https:\/\/twitter.com\/RoyalNavy?ref_src=twsrc%5Etfw\">@RoyalNavy<\/a>, <a href=\"https:\/\/twitter.com\/BritishArmy?ref_src=twsrc%5Etfw\">@BritishArmy<\/a> and <a href=\"https:\/\/twitter.com\/RoyalAirForce?ref_src=twsrc%5Etfw\">@RoyalAirForce<\/a> deploy to bolster <a href=\"https:\/\/twitter.com\/NATO?ref_src=twsrc%5Etfw\">@NATO<\/a>&#39;s eastern front.<br \/>\n<br \/>\nHMS Diamond to join HMS Trent<br \/>\nChallenger 2 tanks arrive in ????????<br \/>\nRAF Typhoon jets completing air policing missions<br \/>\n<br \/>\nRead more: <a href=\"https:\/\/t.co\/PTwYWP5OUb\">https:\/\/t.co\/PTwYWP5OUb<\/a> and <a href=\"https:\/\/t.co\/twB9hFmXpO\">https:\/\/t.co\/twB9hFmXpO<\/a> <a href=\"https:\/\/t.co\/npLIPInC6K\">pic.twitter.com\/npLIPInC6K<\/a><\/p>\n&mdash; Ministry of Defence ???????? (@DefenceHQ) <a href=\"https:\/\/twitter.com\/DefenceHQ\/status\/1497582308588720144?ref_src=twsrc%5Etfw\">February 26, 2022<\/a><\/blockquote>\n<script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2022-02-26 21:35:50","pin":"0","status":"1"},{"title":"Second evacuation flight departs from Romania with 250 Indians","content":"<p>EAM S Jaishankar said the second Air India flight for evacuation of Indian nationals stranded in Ukraine has departed from Bucharest with 250 passengers.<\/p>\n\n<p><\/p>\n\n<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\"><a href=\"https:\/\/twitter.com\/hashtag\/OperationGanga?src=hash&amp;ref_src=twsrc%5Etfw\">#OperationGanga<\/a> continues.<br \/>\n<br \/>\nThe second flight from Bucharest has taken off for Delhi with 250 Indian nationals. <a href=\"https:\/\/t.co\/zml6OPNirN\">pic.twitter.com\/zml6OPNirN<\/a><\/p>\n&mdash; Dr. S. Jaishankar (@DrSJaishankar) <a href=\"https:\/\/twitter.com\/DrSJaishankar\/status\/1497600102076014593?ref_src=twsrc%5Etfw\">February 26, 2022<\/a><\/blockquote>\n<script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2022-02-26 21:37:23","pin":"0","status":"1"},{"title":"More US military aid to arrive in Ukraine soon","content":"<p>A USD 350 million package of additional US military assistance to Ukraine announced on Saturday includes &quot;anti-armour, small arms and various munitions, body armour and related equipment,&quot; according to John Kirby, the Pentagon press secretary.<\/p>\n\n<p>Separately, a senior defense official said the assistance includes Javelin anti-tank weapons and that it will be delivered to Ukraine in phases and as soon as possible. The official, who spoke on condition of anonymity to discuss internal planning, said the US has delivered military assistance to Ukraine by unspecified means as recently as &quot;the last couple of days&quot;,&nbsp;and that ground routes for delivery of the additional material would certainly be on the list of options we would consider.<\/p>\n","date":"2022-02-26 22:49:56","pin":"0","status":"1"},{"title":"Curfew extended until early Monday","content":"<p>Authorities in Ukraine&#39;s capital of Kyiv extend a curfew until early Monday amid fighting with Russian troops, reports AP.<\/p>\n","date":"2022-02-26 22:51:27","pin":"0","status":"1"},{"title":"Miles-long lines of cars clog Ukraine borders","content":"<p>Lines of vehicles miles long are clogging border crossings out of Ukraine, as tens of thousands rush to neighboring countries to escape danger from invading Russian troops.<\/p>\n\n<p>Nearly 120,000 people have so far fled Ukraine into Poland and other neighbouring countries in the wake of Russian invasion, the UN refugee agency said Saturday.<\/p>\n\n<p>The largest numbers were arriving in Poland, where 2 million Ukrainians have already settled to work in recent years.&nbsp;Poland&#39;s government said Saturday that more than 100,000 Ukrainians had crossed the Polish-Ukrainian border in the past 48 hours alone.&nbsp;<\/p>\n\n<p>At the border town of Medyka, the line of vehicles waiting to enter Poland stretched many miles into Ukraine.<img alt=\"\" src=\"https:\/\/images.newindianexpress.com\/uploads\/user\/ckeditor_images\/article\/2022\/2\/26\/AP22057615771624.jpg\" \/><\/p>\n\n<p><\/p>\n","date":"2022-02-26 22:59:04","pin":"0","status":"1"},{"title":"Russia releases images of captured Chernobyl plant","content":"<p>The Russian military on Saturday released images of the Chernobyl nuclear plant in Ukraine that it seized after President Vladimir Putin launched an invasion of the country this week.&nbsp;<\/p>\n\n<p>Russian troops took control of the area -- one of the most radioactive places on earth -- on the first day of their offensive into Ukraine.&nbsp;<\/p>\n\n<p>Images released by Moscow&#39;s defence ministry showed Russian soldiers patrolling the plant, which is encased in a giant sarcophagus, with snipers dressed in black uniforms and a tank parked on the territory.&nbsp;<\/p>\n","date":"2022-02-26 23:23:57","pin":"0","status":"1"},{"title":"Zelenskyy welcomes offers to moderate talks with Russia","content":"<p>Ukrainian President is welcoming efforts to open talks with Russia.<\/p>\n\n<p>In a video message Saturday, Zelenskyy said that Turkish President Recep Tayyip Erdogan and Azerbaijani President Ilham Aliyev offered to help organise talks and that &quot;we can only welcome that&quot;.<\/p>\n\n<p>Diplomatic efforts to end the bloodshed have so far faltered.<\/p>\n\n<p>Zelenskyy offered Friday to negotiate a key Russian demand: that Ukraine declare itself neutral and abandon its ambition of joining NATO. But movement to actually advance any diplomacy has appeared to sputter.<\/p>\n","date":"2022-02-27 00:19:06","pin":"0","status":"1"},{"title":"Air India's second flight carrying 250 Indians from Ukraine lands in Delhi","content":"<p><img alt=\"\" src=\"https:\/\/images.newindianexpress.com\/uploads\/user\/imagelibrary\/2022\/2\/26\/original\/indians.jpg\" \/>Air India&#39;s second evacuation flight from Romanian capital Bucharest carrying 250 Indian nationals who were stranded in Ukraine landed at the Delhi airport in the early hours of Sunday, government officials said. Civil Aviation Minister Jyotiraditya Scindia welcomed the evacuees at the airport by handing out roses to them.<\/p>\n\n<p><a href=\"https:\/\/www.newindianexpress.com\/nation\/2022\/feb\/27\/air-indias-second-flight-carrying-250-indian-evacuees-from-ukraine-lands-in-delhi-2424310.html\" target=\"_blank\"><strong>Click here to read more<\/strong><\/a><\/p>\n","date":"2022-02-27 05:23:52","pin":"0","status":"1"},{"title":"US, EU, UK agree to remove selected Russian banks from SWIFT","content":"<p>The United States, European Union and United Kingdom agreed to block &quot;selected&quot; Russian banks from the SWIFT global financial messaging system and to impose &quot;restrictive measures&quot; on its central bank in retaliation for its invasion of Ukraine.<\/p>\n\n<p><a href=\"https:\/\/www.newindianexpress.com\/world\/2022\/feb\/27\/us-eu-uk-agree-to-remove-selected-russian-banks-from-swift-2424308.html\" target=\"_blank\"><strong>Click here to read more<\/strong><\/a><\/p>\n\n<p><img alt=\"\" height=\"207\" src=\"https:\/\/images.newindianexpress.com\/uploads\/user\/imagelibrary\/2022\/2\/26\/original\/Ukraine_Protests_AP_2.jpg\" width=\"300\" \/><\/p>\n","date":"2022-02-27 05:27:33","pin":"0","status":"1"},{"title":"Good to be back: Indians evacuated from Ukraine","content":"<p>Indian nationals, mostly students, who were evacuated from Ukraine heaved a sigh of relief as the Air India flight carrying them landed at the airport in the early hours of Sunday.<\/p>\n\n<p>Suriya Subhash from Maharashtra&#39;s Solapur, who was among the 250 Indian citizens brought back on the flight from Romanian capital Bucharest, said she was relieved to be back in her country after a &quot;hectic journey&quot;.<\/p>\n","date":"2022-02-27 07:10:26","pin":"0","status":"1"},{"title":"OPINION | Ukraine crisis and its implications for India","content":"<p>Russian President Vladimir Putin has stunned the global community with his ruthless use of military force to alter the political map of central Europe and the implications of this action are complex and multi-layered. &nbsp;The immediate fallout is on the urban citizenry &nbsp;of &nbsp;Ukraine whose population roughly is pegged at 41 million. Television visuals of the destruction of military assets by Russian ordnance &nbsp;bear similarity to the deadly convulsions witnessed in Iraq, Syria and Afghanistan in the last two decades. <a href=\"https:\/\/www.newindianexpress.com\/opinions\/columns\/2022\/feb\/27\/ukraine-crisis-and-its-implications-for-india-2424200.html\" target=\"_blank\"><strong>(READ MORE)<\/strong><\/a><\/p>\n","date":"2022-02-27 08:00:14","pin":"0","status":"1"},{"title":"Indian Embassy issues notice","content":"<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\">Indian Embassy in Slovakia has issued a statement saying those in proximity to their border should fill a google form and connect <a href=\"https:\/\/twitter.com\/mea?ref_src=twsrc%5Etfw\">@mea<\/a> <a href=\"https:\/\/twitter.com\/NewIndianXpress?ref_src=twsrc%5Etfw\">@NewIndianXpress<\/a> <a href=\"https:\/\/t.co\/Nl6hIP2xdm\">pic.twitter.com\/Nl6hIP2xdm<\/a><\/p>\n&mdash; Yeshi Seli (@YeshiSeli) <a href=\"https:\/\/twitter.com\/YeshiSeli\/status\/1497755353270079488?ref_src=twsrc%5Etfw\">February 27, 2022<\/a><\/blockquote>\n<script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2022-02-27 08:12:53","pin":"0","status":"1"},{"title":"State governments set up help desks","content":"<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\">State Govts set up help desks&amp;appoint Nodal Officers to assist people from their state amid <a href=\"https:\/\/twitter.com\/hashtag\/RussiaUkraineConflict?src=hash&amp;ref_src=twsrc%5Etfw\">#RussiaUkraineConflict<\/a><br \/>\n<br \/>\nKarnataka Help Desk&#39;s Ravi Kumar, at Delhi&#39;s IGI Airport, says, &quot;We&#39;ve instructions to drop people from our state at Karnataka Bhawan; dropped 13 children till now&quot; <a href=\"https:\/\/t.co\/D9tHLzDKg7\">pic.twitter.com\/D9tHLzDKg7<\/a><\/p>\n&mdash; ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1497763371248402432?ref_src=twsrc%5Etfw\">February 27, 2022<\/a><\/blockquote>\n<script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2022-02-27 08:17:13","pin":"0","status":"1"},{"title":"Russian forces blow up gas pipeline in Kharkiv","content":"<p>The Ukrainian president&#39;s office said Russian forces blew up a gas pipeline in Kharkiv, the country&#39;s second-largest city.&nbsp;The State Service of Special Communication and Information Protection warned that the explosion, which it said looked like a mushroom cloud, could cause an &quot;environmental catastrophe&quot; and advised residents to cover their windows with damp cloth or gauze and to drink plenty of fluids.<\/p>\n","date":"2022-02-27 08:28:13","pin":"0","status":"1"},{"title":"Russia now 'a global economic and financial pariah', says a US official","content":"<div style=\"text-align:center\">\n<figure class=\"image\" style=\"display:inline-block\"><img alt=\"\" height=\"300\" src=\"https:\/\/images.newindianexpress.com\/uploads\/user\/ckeditor_images\/article\/2022\/2\/27\/Ukraine_(7).jpg\" width=\"600\" \/>\n<figcaption>People rally against the Russian invasion of Ukraine. (Photo | AP)<\/figcaption>\n<\/figure>\n<\/div>\n","date":"2022-02-27 08:31:23","pin":"0","status":"1"},{"title":"Road signs being removed from Ukraine","content":"<p>A Ukrainian company in charge of building and maintaining roads said it was removing all road signs that could be used by invading Russian forces to find their way around the country: Reuters<\/p>\n","date":"2022-02-27 08:35:32","pin":"0","status":"1"},{"title":"Measures being taken to further isolate Russia","content":"<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\">POTUS and the leaders of the European Commission, France, Germany, Italy, the UK, and Canada decided to take specific measures to further isolate Russia from the international financial system <a href=\"https:\/\/twitter.com\/mea?ref_src=twsrc%5Etfw\">@mea<\/a> ?<a href=\"https:\/\/twitter.com\/NewIndianXpress?ref_src=twsrc%5Etfw\">@NewIndianXpress<\/a>? <a href=\"https:\/\/t.co\/cmavdo9yj7\">https:\/\/t.co\/cmavdo9yj7<\/a><\/p>\n&mdash; Yeshi Seli (@YeshiSeli) <a href=\"https:\/\/twitter.com\/YeshiSeli\/status\/1497758991862341632?ref_src=twsrc%5Etfw\">February 27, 2022<\/a><\/blockquote>\n<script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2022-02-27 08:42:55","pin":"0","status":"1"},{"title":"US bars drop Russian vodka, promote Ukraine's","content":"<p>Some bars and liquor stores in US think they&#39;ve found a potent way to punish Russia for invading Ukraine: They&#39;re pulling Russian vodka off their shelves and promoting Ukrainian brands instead.<\/p>\n\n<p>&quot;I woke up yesterday morning, and I saw that Russia had invaded Ukraine. You wonder what you can do,&#39;&#39; said Bob Quay, owner of Bob&#39;s Bar in Grand Rapids, Michigan.<\/p>\n\n<div style=\"text-align:center\">\n<figure class=\"image\" style=\"display:inline-block\"><img alt=\"\" height=\"300\" src=\"https:\/\/images.newindianexpress.com\/uploads\/user\/ckeditor_images\/article\/2022\/2\/27\/Ukraine_(8).jpg\" width=\"600\" \/>\n<figcaption><em>An empty space on a liquor shelf where Russian vodka used to be located at The Sidetrack, a gay bar on the north side of Chicago. (Photo | AP)<\/em><\/figcaption>\n<\/figure>\n<\/div>\n","date":"2022-02-27 08:47:26","pin":"0","status":"1"},{"title":"198 people killed; over 1,000 wounded: Ukrainian health minister","content":"<p>The Ukrainian health minister says that 198 people have been killed and more than 1,000 others have been wounded in the Russian offensive. Health Minister Viktor Lyashko said Saturday that there were three children among those killed. His statement made it unclear whether the casualties included both military and civilians.<\/p>\n\n<p>He said another 1,115 people, including 33 children, were wounded in the Russian invasion that began Thursday with massive air and missile strikes and troops forging into Ukraine from the north, east and south.<\/p>\n","date":"2022-02-27 09:22:17","pin":"0","status":"1"},{"title":"Third flight with 240 Indian nationals takes off from Hungary for Delhi","content":"<div style=\"text-align:center\">\n<figure class=\"image\" style=\"display:inline-block\"><img alt=\"\" height=\"450\" src=\"https:\/\/images.newindianexpress.com\/uploads\/user\/ckeditor_images\/article\/2022\/2\/27\/FMj5NgJakAYdmfy.png\" width=\"600\" \/>\n<figcaption><em>&nbsp;Flight with 240 Indian nationals takes off from Hungary for Delhi. (Photo | ANI)<\/em><\/figcaption>\n<\/figure>\n<\/div>\n","date":"2022-02-27 09:33:45","pin":"0","status":"1"},{"title":"Bihar government launches helpline for students trapped in Ukraine","content":"<p>With the evacuation of Indian students trapped in Ukraine picking up speed, the Bihar government has started helplines for boys and girls hailing from the state who had gone to the war-torn country for pursuing higher education and are now anxious to make an exit in the wake of the military crisis. The helpline numbers issued by the state Disaster Management Department are 0612-2294204, 0612-1070 and 7070290170.<\/p>\n","date":"2022-02-27 10:05:17","pin":"0","status":"1"},{"title":"Elon Musk extends help to Ukraine","content":"<p>Elon Musk says his company SpaceX&#39;s Starlink satellite broadband service had been activated in Ukraine, after a Kyiv official urged the tech titan to provide his embattled country with stations.<\/p>\n","date":"2022-02-27 10:14:05","pin":"0","status":"1"},{"title":"","content":"<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\">13 students from <a href=\"https:\/\/twitter.com\/hashtag\/Ukraine?src=hash&amp;ref_src=twsrc%5Etfw\">#Ukraine<\/a> reached <a href=\"https:\/\/twitter.com\/hashtag\/Delhi?src=hash&amp;ref_src=twsrc%5Etfw\">#Delhi<\/a> in 2nd batch, 5 in 1st batch. Will reach <a href=\"https:\/\/twitter.com\/hashtag\/Bengaluru?src=hash&amp;ref_src=twsrc%5Etfw\">#Bengaluru<\/a> soon<br \/>\n12 from <a href=\"https:\/\/twitter.com\/hashtag\/mumbai?src=hash&amp;ref_src=twsrc%5Etfw\">#mumbai<\/a> reached <a href=\"https:\/\/twitter.com\/BLRAirport?ref_src=twsrc%5Etfw\">@BLRAirport<\/a> 8.45am:<a href=\"https:\/\/twitter.com\/KarnatakaSNDMC?ref_src=twsrc%5Etfw\">@KarnatakaSNDMC<\/a>.<a href=\"https:\/\/twitter.com\/NewIndianXpress?ref_src=twsrc%5Etfw\">@NewIndianXpress<\/a> <a href=\"https:\/\/twitter.com\/XpressBengaluru?ref_src=twsrc%5Etfw\">@XpressBengaluru<\/a> <a href=\"https:\/\/twitter.com\/KannadaPrabha?ref_src=twsrc%5Etfw\">@KannadaPrabha<\/a> <a href=\"https:\/\/twitter.com\/santwana99?ref_src=twsrc%5Etfw\">@santwana99<\/a> <a href=\"https:\/\/twitter.com\/NammaBengaluroo?ref_src=twsrc%5Etfw\">@NammaBengaluroo<\/a> <a href=\"https:\/\/twitter.com\/NammaKarnataka_?ref_src=twsrc%5Etfw\">@NammaKarnataka_<\/a> <a href=\"https:\/\/twitter.com\/CMofKarnataka?ref_src=twsrc%5Etfw\">@CMofKarnataka<\/a> <a href=\"https:\/\/twitter.com\/PMOIndia?ref_src=twsrc%5Etfw\">@PMOIndia<\/a> <a href=\"https:\/\/t.co\/sBshD30F0q\">pic.twitter.com\/sBshD30F0q<\/a><\/p>\n&mdash; Bosky Khanna (@BoskyKhanna) <a href=\"https:\/\/twitter.com\/BoskyKhanna\/status\/1497797296892776449?ref_src=twsrc%5Etfw\">February 27, 2022<\/a><\/blockquote>\n<script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2022-02-27 10:49:44","pin":"0","status":"1"},{"title":"Oil depot in Vasilkyv hit and is on fire","content":"<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\">An oil depot in Vasilkyv has been hit during the night and is on fire. Kyiv authorities ask that people keep their window tightly shut <a href=\"https:\/\/t.co\/XdEytm56hq\">pic.twitter.com\/XdEytm56hq<\/a><\/p>\n&mdash; Michael A. Horowitz (@michaelh992) <a href=\"https:\/\/twitter.com\/michaelh992\/status\/1497788600921968645?ref_src=twsrc%5Etfw\">February 27, 2022<\/a><\/blockquote>\n<script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2022-02-27 10:54:57","pin":"0","status":"1"},{"title":"China postpones evacuation of citizens","content":"<ul>\n\t<li>\n\t<p>China&#39;s envoy to Ukraine said current conditions were too unsafe to evacuate citizens, days after the embassy said it would prepare plans to help people leave after the Russian invasion.<\/p>\n\t<\/li>\n\t<li>\n\t<p>In a lengthy video message on the embassy&#39;s official WeChat account, Chinese ambassador Fan Xianrong sought to dispel rumours he had left Kyiv and reassure Chinese nationals left stranded in the war-torn country.<\/p>\n\t<\/li>\n\t<li>\n\t<p>&quot;We must wait until it is safe before leaving,&quot; said Fan from his office, seated in front of a Chinese flag and what appeared to be a fold-out camp bed frame.<\/p>\n\t<\/li>\n\t<li>\n\t<p>&quot;As long as safety conditions are met and everyone&#39;s safety is guaranteed, we will make appropriate arrangements.&quot;<\/p>\n\t<\/li>\n<\/ul>\n","date":"2022-02-27 11:09:19","pin":"0","status":"1"},{"title":"Russia praises India's 'balanced' stance on Ukraine","content":"<p>Russia has praised India&#39;s &quot;independent and balanced&quot; position after Delhi abstained from a UN Security Council vote that deplored Moscow&#39;s &quot;aggression&quot; against Ukraine. India, along with China and the UAE, did not vote on the resolution Friday, a move in line with the fine balance Delhi has sought to strike between partnerships with Moscow and Western allies.<\/p>\n","date":"2022-02-27 11:25:14","pin":"0","status":"1"},{"title":"Russians enter Kharkiv","content":"<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\">Russians have entered Kharkiv. Street battles audible <a href=\"https:\/\/t.co\/JX1eZfCe9h\">pic.twitter.com\/JX1eZfCe9h<\/a><\/p>\n&mdash; Roland Oliphant (@RolandOliphant) <a href=\"https:\/\/twitter.com\/RolandOliphant\/status\/1497813928516243457?ref_src=twsrc%5Etfw\">February 27, 2022<\/a><\/blockquote>\n<script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2022-02-27 11:41:23","pin":"0","status":"1"},{"title":"Russia claims to have besieged two big cities in south and southeast of Ukraine","content":"<p>Moscow claimed its troops had &quot;entirely&quot; besieged the southern Ukrainian city of Kherson and the city of Berdyansk in the southeast, as the Russian army pressed ahead with the invasion of the pro-Western country.<\/p>\n\n<p>&quot;Over the past 24 hours, the cities of Kherson and Berdyansk have been completely blocked by the Russian armed forces,&quot; defence ministry spokesman Igor Konashenkov said in a statement carried by Russian news agencies.<\/p>\n","date":"2022-02-27 11:50:50","pin":"0","status":"1"},{"title":"","content":"<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\">Students stuck at Poland border. Around 900 students are waiting for a confirmation from Indian Embassy ?<a href=\"https:\/\/twitter.com\/NewIndianXpress?ref_src=twsrc%5Etfw\">@NewIndianXpress<\/a>? ?<a href=\"https:\/\/twitter.com\/MEAIndia?ref_src=twsrc%5Etfw\">@MEAIndia<\/a>? <a href=\"https:\/\/t.co\/xwZARSrp2m\">pic.twitter.com\/xwZARSrp2m<\/a><\/p>\n&mdash; Ankita Upadhyay (@ankitaup) <a href=\"https:\/\/twitter.com\/ankitaup\/status\/1497821346625376263?ref_src=twsrc%5Etfw\">February 27, 2022<\/a><\/blockquote>\n<script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2022-02-27 12:06:29","pin":"0","status":"1"},{"title":"","content":"<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\">It&rsquo;s Special Forces Day in Russia. Putin thanks them in this video address.<br \/>\n<br \/>\n&ldquo;Particular gratitude to those who in these days are heroically fulfilling their warrior&rsquo;s duty during the special operation to help the people&rsquo;s republics of the Donbas,&rdquo; he says. <a href=\"https:\/\/t.co\/9eOQVKYjUt\">pic.twitter.com\/9eOQVKYjUt<\/a><\/p>\n&mdash; max seddon (@maxseddon) <a href=\"https:\/\/twitter.com\/maxseddon\/status\/1497826706878566400?ref_src=twsrc%5Etfw\">February 27, 2022<\/a><\/blockquote>\n<script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2022-02-27 12:25:29","pin":"0","status":"1"},{"title":"Finland closes airspace to Russian planes","content":"<blockquote class=\"twitter-tweet\" data-conversation=\"none\">\n<p dir=\"ltr\" lang=\"en\"><a href=\"https:\/\/twitter.com\/hashtag\/BREAKING?src=hash&amp;ref_src=twsrc%5Etfw\">#BREAKING<\/a> Finland to close airspace to Russian planes: ministry <a href=\"https:\/\/t.co\/1HedGLHov3\">pic.twitter.com\/1HedGLHov3<\/a><\/p>\n&mdash; AFP News Agency (@AFP) <a href=\"https:\/\/twitter.com\/AFP\/status\/1497832823310663681?ref_src=twsrc%5Etfw\">February 27, 2022<\/a><\/blockquote>\n<script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2022-02-27 12:48:20","pin":"0","status":"1"},{"title":"Ukrainian Air Force shoots down cruise missile launched at Ukraine's capital","content":"<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\">Minutes ago, Ukrainian Air Force shot down a cruise missile launched at the capital of Ukraine, Kyiv, by a TU-22 bomber from the territory of Belarus. This is another war crime committed against Ukraine and its people. <a href=\"https:\/\/twitter.com\/hashtag\/StopRussianAggression?src=hash&amp;ref_src=twsrc%5Etfw\">#StopRussianAggression<\/a><\/p>\n&mdash; Oleg Nikolenko (@OlegNikolenko_) <a href=\"https:\/\/twitter.com\/OlegNikolenko_\/status\/1497833836226527235?ref_src=twsrc%5Etfw\">February 27, 2022<\/a><\/blockquote>\n<script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2022-02-27 12:55:53","pin":"0","status":"1"},{"title":"Indian students who were stuck in Ukraine arrive at Chennai","content":"<blockquote class=\"twitter-tweet\" data-conversation=\"none\">\n<p dir=\"ltr\" lang=\"en\">Indian students who were pursuing medical studies in <a href=\"https:\/\/twitter.com\/hashtag\/Ukraine?src=hash&amp;ref_src=twsrc%5Etfw\">#Ukraine<\/a> arrived at Chennai International Airport.<br \/>\nExpress photos | <a href=\"https:\/\/twitter.com\/ddmallick?ref_src=twsrc%5Etfw\">@ddmallick<\/a>.<a href=\"https:\/\/twitter.com\/xpresstn?ref_src=twsrc%5Etfw\">@xpresstn<\/a> <a href=\"https:\/\/t.co\/2G2inDO3fH\">pic.twitter.com\/2G2inDO3fH<\/a><\/p>\n&mdash; The New Indian Express (@NewIndianXpress) <a href=\"https:\/\/twitter.com\/NewIndianXpress\/status\/1497836328418877443?ref_src=twsrc%5Etfw\">February 27, 2022<\/a><\/blockquote>\n<script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2022-02-27 13:02:35","pin":"0","status":"1"},{"title":"BREAKING NEWS: Ukraine President Zelenskyy says ready for talks with Russia","content":"<p>Ukraine President Volodymyr Zelenskyy says ready for talks with Russia, but not in Belarus.<\/p>\n","date":"2022-02-27 13:46:22","pin":"0","status":"1"},{"title":"Air India flights carrying 490 Indian evacuees from Ukraine land in Delhi","content":"<p>Air India&#39;s two evacuation flights, one from Romanian capital Bucharest and another from Hungarian capital Budapest, carrying 490 Indian nationals who were stranded in Ukraine landed at the Delhi airport on Sunday morning, government officials said.<\/p>\n","date":"2022-02-27 13:56:37","pin":"0","status":"1"},{"title":"Indian diaspora is advised to move away from conflict zones: Embassy of India in Kyiv","content":"<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\">Ukraine Railways is additionally organising emergency trains at no cost, first come basis from Kyiv. Schedule can be found at train stations.<br \/>\n????????n diaspora is advised to move away from conflict zones to the Western region subject to security situation and the extant regulations.<\/p>\n&mdash; India in Ukraine (@IndiainUkraine) <a href=\"https:\/\/twitter.com\/IndiainUkraine\/status\/1497850990225203206?ref_src=twsrc%5Etfw\">February 27, 2022<\/a><\/blockquote>\n<script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2022-02-27 14:08:23","pin":"0","status":"1"},{"title":"Government working tirelessly to bring back Indians stuck in Ukraine: PM Narendra Modi","content":"<p>The government is working tirelessly to bring back all Indians stuck in Ukraine, Prime Minister Narendra Modi said on Sunday.<\/p>\n","date":"2022-02-27 14:19:01","pin":"0","status":"1"},{"title":"WATCH| Heavy clashes ongoing in Hostomel area near Kyiv","content":"<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\">Heavy clashes ongoing in Hostomel area near Kyiv <a href=\"https:\/\/twitter.com\/hashtag\/Ukraine?src=hash&amp;ref_src=twsrc%5Etfw\">#Ukraine<\/a> <a href=\"https:\/\/t.co\/HRxYSRXhMf\">pic.twitter.com\/HRxYSRXhMf<\/a><\/p>\n&mdash; Michael A. Horowitz (@michaelh992) <a href=\"https:\/\/twitter.com\/michaelh992\/status\/1497855852191129604?ref_src=twsrc%5Etfw\">February 27, 2022<\/a><\/blockquote>\n<script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2022-02-27 14:40:35","pin":"0","status":"1"},{"title":"Kerala Minister P Rajeev receives students who arrived at Kochi Airport","content":"<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\">Minister <a href=\"https:\/\/twitter.com\/PRajeevOfficial?ref_src=twsrc%5Etfw\">@PRajeevOfficial<\/a> receive students who arrived at <a href=\"https:\/\/twitter.com\/KochiAirport?ref_src=twsrc%5Etfw\">@KochiAirport<\/a> from war-torn Ukraine on Sunday afternoon. 11 students reached Kochi today. <a href=\"https:\/\/twitter.com\/NewIndianXpress?ref_src=twsrc%5Etfw\">@NewIndianXpress<\/a> <a href=\"https:\/\/twitter.com\/xpresskerala?ref_src=twsrc%5Etfw\">@xpresskerala<\/a> <a href=\"https:\/\/t.co\/szAbjaTEsE\">pic.twitter.com\/szAbjaTEsE<\/a><\/p>\n&mdash; Rajesh Abraham???????? (@pendown) <a href=\"https:\/\/twitter.com\/pendown\/status\/1497855160537989120?ref_src=twsrc%5Etfw\">February 27, 2022<\/a><\/blockquote>\n<script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2022-02-27 14:56:22","pin":"0","status":"1"},{"title":"Vladimir Putin has been suspended as honorary president of IJF","content":"<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\"><a href=\"https:\/\/twitter.com\/hashtag\/UPDATE?src=hash&amp;ref_src=twsrc%5Etfw\">#UPDATE<\/a> Russian president Vladimir Putin has been suspended as honorary president of the International Judo Federation (IJF) due to Russia&#39;s invasion of Ukraine the sport&#39;s governing body announced<a href=\"https:\/\/twitter.com\/hashtag\/AFPSports?src=hash&amp;ref_src=twsrc%5Etfw\">#AFPSports<\/a> <a href=\"https:\/\/t.co\/mQsdTkHQRk\">pic.twitter.com\/mQsdTkHQRk<\/a><\/p>\n&mdash; AFP News Agency (@AFP) <a href=\"https:\/\/twitter.com\/AFP\/status\/1497864948009078785?ref_src=twsrc%5Etfw\">February 27, 2022<\/a><\/blockquote>\n<script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2022-02-27 15:11:25","pin":"0","status":"1"},{"title":"CM Hemant Soren, sending a list of persons from Jharkhand stuck in Ukraine to MHA","content":"<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\">CM Hemant Soren, sending a list of persons from Jharkhand stuck in Ukraine, has requested MHA to direct concerned officials to take proper steps for their safe return. <a href=\"https:\/\/twitter.com\/NewIndianXpress?ref_src=twsrc%5Etfw\">@NewIndianXpress<\/a> <a href=\"https:\/\/twitter.com\/TheMornStandard?ref_src=twsrc%5Etfw\">@TheMornStandard<\/a> <a href=\"https:\/\/t.co\/LYXJLEtlax\">pic.twitter.com\/LYXJLEtlax<\/a><\/p>\n&mdash; Mukesh Ranjan (@Mukesh_TNIE) <a href=\"https:\/\/twitter.com\/Mukesh_TNIE\/status\/1497870906877964293?ref_src=twsrc%5Etfw\">February 27, 2022<\/a><\/blockquote>\n<script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2022-02-27 15:23:36","pin":"0","status":"1"},{"title":"Russia-Ukraine conflict could last a 'number of years': British Foreign Secretary","content":"<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\"><a href=\"https:\/\/twitter.com\/hashtag\/UPDATE?src=hash&amp;ref_src=twsrc%5Etfw\">#UPDATE<\/a> The Russia-Ukraine conflict could last a &quot;number of years&quot; and the world needs to be prepared for Moscow &quot;to seek to use even worse weapons&quot;, British Foreign Secretary Liz Truss warned Sunday <a href=\"https:\/\/t.co\/VhbBAHH7LH\">pic.twitter.com\/VhbBAHH7LH<\/a><\/p>\n&mdash; AFP News Agency (@AFP) <a href=\"https:\/\/twitter.com\/AFP\/status\/1497870668800614400?ref_src=twsrc%5Etfw\">February 27, 2022<\/a><\/blockquote>\n<script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2022-02-27 15:43:59","pin":"0","status":"1"},{"title":"UP polls a fight between dynasts, diehard nationalists: PM Modi","content":"<p>PM Narendra Modi on Sunday said the Uttar Pradesh elections are a fight between the dynasts and diehard nationalists, which the opposition parties do not understand.<\/p>\n","date":"2022-02-27 16:00:29","pin":"0","status":"1"},{"title":"Air India evacuation flights costing Rs 7-8 lakh per hour: Source","content":"<p>As Air India ferries hundreds of Indians stranded in Ukraine, the cost of operating a two-way evacuation flight will be more than Rs 1.10 crore and the amount will go up depending on the duration of the flights. <strong>(<a href=\"https:\/\/www.newindianexpress.com\/nation\/2022\/feb\/27\/air-india?-evacuation-flights-costing-rs-7-8-lakh-per-hour-source-2424379.html\" target=\"_blank\">READ MORE<\/a>)<\/strong><\/p>\n","date":"2022-02-27 16:14:37","pin":"0","status":"1"},{"title":"Kerala CM Pinarayi Vijayan writes to PM Narendra Modi for helping Indians trapped in Ukraine","content":"<p>Kerala CM Pinarayi Vijayan sent a letter to PM Narendra Modi seeking his immediate intervention to bring all Indians, most of them students, back from war-hit cities of Ukraine. In the letter, he said some of the Indians have taken refuge in bunkers in eastern cities like Kyiv, Kharkiv and Sumi with food and water shortage.<\/p>\n","date":"2022-02-27 16:32:16","pin":"0","status":"1"},{"title":"Fortunate to be back home, say students on return from Ukraine","content":"<p>Tears of joy, happy faces and smiles marked the arrival of the first batch of 56 students to their home state Gujarat from Ukraine on Sunday, as anxious parents welcomed them upon arrival from Mumbai after an overnight journey. <strong>(<a href=\"https:\/\/www.newindianexpress.com\/nation\/2022\/feb\/27\/fortunate-to-be-back-home-say-gujarat-students-on-return-from-ukraine-2424377.html\" target=\"_blank\">READ MORE<\/a>)<\/strong><\/p>\n","date":"2022-02-27 16:46:08","pin":"0","status":"1"},{"title":"Belgium closing its airspace to Russian flights","content":"<blockquote class=\"twitter-tweet\" data-conversation=\"none\">\n<p dir=\"ltr\" lang=\"en\"><a href=\"https:\/\/twitter.com\/hashtag\/UPDATE?src=hash&amp;ref_src=twsrc%5Etfw\">#UPDATE<\/a> Belgium is closing its airspace to Russian flights, the country&#39;s prime minister said on Sunday, adding to a growing number of EU countries that have done the same <a href=\"https:\/\/t.co\/afU6bMJZm6\">pic.twitter.com\/afU6bMJZm6<\/a><\/p>\n&mdash; AFP News Agency (@AFP) <a href=\"https:\/\/twitter.com\/AFP\/status\/1497887484239302660?ref_src=twsrc%5Etfw\">February 27, 2022<\/a><\/blockquote>\n<script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2022-02-27 16:52:05","pin":"0","status":"1"},{"title":"Puducherry government ???????to bear travel expenses of its students in Ukraine","content":"<p>Puducherry CM N Rangasamy on Sunday announced that the territorial government would bear the travel expenses of the students returning to the Union Territory from war-torn Ukraine, where they are stranded now.<\/p>\n","date":"2022-02-27 17:00:20","pin":"0","status":"1"},{"title":"Indian citizens being evacuated from Ukraine through Romania and Hungary","content":"<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\"><a href=\"https:\/\/twitter.com\/hashtag\/UkraineRussiaCrisis?src=hash&amp;ref_src=twsrc%5Etfw\">#UkraineRussiaCrisis<\/a> Indian citizens are being evacuated from Ukraine through Romania &amp; Hungary. We are continuously exploring and working to open up more borders with the neighboring countries for our citizens: Embassy of India in Kyiv, Ukraine in an advisory to Indian nationals <a href=\"https:\/\/t.co\/SQPe0L0fm1\">pic.twitter.com\/SQPe0L0fm1<\/a><\/p>\n&mdash; ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1497887856064626689?ref_src=twsrc%5Etfw\">February 27, 2022<\/a><\/blockquote>\n<script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2022-02-27 17:09:26","pin":"0","status":"1"},{"title":"We has submitted its application against Russia to the ICJ: Ukraine President","content":"<p>Ukraine has submitted its application against Russia to the ICJ. Russia must be held accountable for manipulating notion of genocide to justify aggression. We request urgent decision ordering Russia to cease military activity now &amp; expect trials to start next week: Ukraine President<\/p>\n","date":"2022-02-27 17:29:30","pin":"0","status":"1"},{"title":"Russian Orthodox patriarch calls Moscow's foes in Ukraine 'evil forces'","content":"<blockquote class=\"twitter-tweet\" data-conversation=\"none\">\n<p dir=\"ltr\" lang=\"en\"><a href=\"https:\/\/twitter.com\/hashtag\/BREAKING?src=hash&amp;ref_src=twsrc%5Etfw\">#BREAKING<\/a> Russian Orthodox patriarch calls Moscow&#39;s foes in Ukraine &#39;evil forces&#39; <a href=\"https:\/\/t.co\/rjVUEw18pt\">pic.twitter.com\/rjVUEw18pt<\/a><\/p>\n&mdash; AFP News Agency (@AFP) <a href=\"https:\/\/twitter.com\/AFP\/status\/1497888108834172932?ref_src=twsrc%5Etfw\">February 27, 2022<\/a><\/blockquote>\n<script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2022-02-27 17:39:16","pin":"0","status":"1"},{"title":"More than 368,000 people had fled Ukraine: UN refugee agency","content":"<p>The UN refugee agency said Sunday more than 368,000 people had fled Ukraine since Russia invaded on Thursday.<\/p>\n","date":"2022-02-27 17:51:23","pin":"0","status":"1"},{"title":"Emotions run high at Delhi airport as parents welcome children from Ukraine; others await rescue","content":"<p>Air India&#39;s third evacuation flight, AI1940, which was scheduled to land here at around 7 am, reached a couple of hours late at 9.20 am. <strong>(<a href=\"https:\/\/www.newindianexpress.com\/cities\/delhi\/2022\/feb\/27\/emotions-run-high-at-delhi-airport-as-parents-welcome-children-from-ukraine-others-await-rescue-2424399.html\" target=\"_blank\">READ MORE<\/a>)<\/strong><\/p>\n","date":"2022-02-27 18:00:17","pin":"0","status":"1"},{"title":"Stranded Jharkhand student in Ukraine seeks BJP MP Jayant Sinha's help for safe return","content":"<p>Danish Hassan and three other students from the district are pursuing studies in different medical universities in the East European country.<strong> (<a href=\"https:\/\/www.newindianexpress.com\/nation\/2022\/feb\/27\/stranded-jharkhand-student-in-ukraine-seeks-bjp-mp-jayant-sinhas-help-for-safe-return-2424401.html\" target=\"_blank\">READ MORE<\/a>)<\/strong><\/p>\n","date":"2022-02-27 18:18:49","pin":"0","status":"1"},{"title":"1,200 students from Maharashtra stranded, 300 have contacted kin, says Vijay Wadettiwar","content":"<p>Maharashtra Minister Vijay Wadettiwar on Sunday said some 1,200 students from the state are stranded in Ukraine, which has been invaded by Russia, of which just 300 have been able to contact their parents.<\/p>\n","date":"2022-02-27 18:30:50","pin":"0","status":"1"},{"title":"Walked along to reach Romanian border, says TN student returnee from Ukraine","content":"<p>Indian students had to walk for about 5-8 kilometers to reach the Romanian border from battle scarred Ukraine, a Tamil Nadu student who arrived from the eastern European nation said here on Sunday.<\/p>\n","date":"2022-02-27 18:41:54","pin":"0","status":"1"},{"title":"Working to facilitate more border transit points: Indian embassy in Ukraine","content":"<p>The Indian embassy in Ukraine on Sunday said it is continuously exploring to facilitate opening up more border transit points with neighbouring countries for the evacuation of Indian citizens from Ukraine. In an advisory, the embassy said it is closely monitoring the developing situation, especially in the eastern regions of Ukraine, and that it is in constant touch with the authorities for the safety of Indian citizens.<\/p>\n","date":"2022-02-27 18:55:58","pin":"0","status":"1"},{"title":"Second day of evacuation: Air India's three more flights bring back 688 Indians from Ukraine","content":"<p>As many as 688 Indian nationals returned here on Sunday from strife-torn Ukraine on board three Air India evacuation flights from Romanian capital Bucharest and Hungarian capital Budapest. Civil Aviation Minister Jyotiraditya Scindia said that approximately 13,000 Indians are stranded in Ukraine as of now, and the government is making efforts to bring them back as soon as possible.<\/p>\n","date":"2022-02-27 19:02:07","pin":"0","status":"1"},{"title":"Working to facilitate more border transit points: Indian embassy in Ukraine","content":"<p>In an advisory especially in the eastern regions of Ukraine, and that it is in constant touch with the authorities for the safety of Indian citizens.<strong> (<a href=\"https:\/\/www.newindianexpress.com\/nation\/2022\/feb\/27\/working-to-facilitate-more-border-transit-points-indian-embassy-in-ukraine-2424415.html\" target=\"_blank\">READ MORE<\/a>)<\/strong><\/p>\n","date":"2022-02-27 19:16:46","pin":"0","status":"1"},{"title":"Ukraine crisis: Putin puts Russia's nuclear forces on alert, cites sanctions","content":"<p>The order means Putin has ordered Russia&rsquo;s nuclear weapons prepared for increased readiness to launch, raising the threat that the tensions could boil over into nuclear warfare. In giving it, the Russian leader also cited hard-hitting financial sanctions imposed by the West against Russia, including Putin himself. <strong><a href=\"https:\/\/www.newindianexpress.com\/world\/2022\/feb\/27\/ukraine-crisis-putin-puts-russias-nuclear-forces-on-alert-cites-sanctions-2424427.html\" target=\"_blank\">(READ FULL STORY HERE)<\/a><\/strong><\/p>\n","date":"2022-02-27 20:04:12","pin":"0","status":"1"},{"title":"Diplomats from both the countries to meet at Belarus border as protests break out at Moscow","content":"<p>Ukrainian President Volodymyr Zelenskyy office said Sunday on the Telegram messaging app that the two sides would meet at an unspecified location on the Belarusian border and did not give a precise time for the meeting. <strong><a href=\"https:\/\/www.newindianexpress.com\/world\/2022\/feb\/27\/russia-ukarine-war-diplomats-from-both-the-countries-to-meet-at-belarus-border-as-protests-break-ou-2424428.html\" target=\"_blank\">(READ FULL STORY HERE)<\/a><\/strong><\/p>\n","date":"2022-02-27 20:22:33","pin":"0","status":"1"},{"title":"Biden's Russia sanctions may let Moscow profit from oil, gas","content":"<p>Following Russia&#39;s invasion of Ukraine, Biden defended his decision to preserve access to Russian energy in order &ldquo;to limit the pain the American people are feeling at the gas pump.&rdquo; But some academics, lawmakers and other analysts say that excluding an industry at the heart of the Russian economy essentially limits the sanctions and could embolden Russian President Vladimir Putin. <strong><a href=\"https:\/\/www.newindianexpress.com\/business\/2022\/feb\/27\/ukraine-crisis-bidens-russia-sanctions-may-let-moscow-profit-from-oil-gas-2424429.html\" target=\"_blank\">(READ FULL STORY HERE)<\/a><\/strong><\/p>\n","date":"2022-02-27 20:30:03","pin":"0","status":"1"},{"title":"EXPLAINER: How is Russia-Ukraine war linked to religion?","content":"<p>Ukraine&rsquo;s tangled political history with Russia has its counterpart in the religious landscape, with Ukraine&rsquo;s majority Orthodox Christian population divided between an independent-minded group based in Kyiv and another loyal to its patriarch in Moscow. But while there have been appeals to religious nationalism in both Russia and Ukraine, religious loyalty doesn&rsquo;t mirror political fealty amid Ukraine&#39;s fight for survival. <strong><a href=\"https:\/\/www.newindianexpress.com\/world\/2022\/feb\/27\/explainer-how-is-russia-ukraine-war-linked-to-religion-2424430.html\" target=\"_blank\">(READ FULL STORY HERE)<\/a><\/strong><\/p>\n","date":"2022-02-27 20:37:41","pin":"0","status":"1"},{"title":"Ukraine invasion: What to know as Putin alerts nuclear force","content":"<p>Vladimir Putin put his nuclear forces on increased alert on Sunday in an unprecedented escalation of tension with the West over Russia&rsquo;s massive conventional assault of Ukraine, which entered its fourth day with fighting in the streets of the country&rsquo;s second-largest city. <strong><a href=\"https:\/\/www.newindianexpress.com\/world\/2022\/feb\/27\/ukraine-invasion-what-to-know-as-putin-alerts-nuclear-force-2424431.html\" target=\"_blank\">(READ FULL STORY HERE)<\/a><\/strong><\/p>\n","date":"2022-02-27 20:43:30","pin":"0","status":"1"},{"title":"France joins others closing airspace to Russia","content":"<ul>\n\t<li>France is joining many other European countries in closing their airspace to all Russian aircraft as the West ramps up pressure on Russian President Vladimir Putin for ordering an invasion of Ukraine. Germany, Austria, Italy, the Czech Republic, Poland, Slovenia, Estonia, Latvia, Lithuania, Romania and Luxembourg have already announced they were closing their respective airspace to Russian planes.<\/li>\n\t<li>&quot;To the Russian invasion of Ukraine, Europe responds with total unity,&quot;&nbsp;Transport Minister Jean-Baptiste Djebbari tweeted Sunday.<\/li>\n\t<li>Separately, Air France announced that it was suspending flights to and from Russia for safety reasons &quot;until further notice.&quot;<\/li>\n\t<li>France is joining many other European countries in closing their airspace to all Russian aircraft as the West ramps up pressure on Russian President Vladimir Putin for ordering an invasion of Ukraine. Germany, Austria, Italy, the Czech Republic, Poland, Slovenia, Estonia, Latvia, Lithuania, Romania and Luxembourg have already announced they were closing their respective airspace to Russian planes.<\/li>\n\t<li>&quot;To the Russian invasion of Ukraine, Europe responds with total unity,&quot;&nbsp;Transport Minister Jean-Baptiste Djebbari tweeted Sunday.<\/li>\n\t<li>Separately, Air France announced that it was suspending flights to and from Russia for safety reasons &quot;until further notice.<\/li>\n<\/ul>\n","date":"2022-02-27 20:45:17","pin":"0","status":"1"},{"title":"EXPLAINER | Ukraine invasion spotlights the delicate state of democracy","content":"<p>&ldquo;Peace. Human rights. Dignity for all. Equality. Justice. Solidarity. Like never before, core values are in the crosshairs,&rdquo; Antonio Guterres said. &ldquo;A sense of impunity is taking hold.&rdquo; <strong><a href=\"https:\/\/www.newindianexpress.com\/world\/2022\/feb\/27\/explainer--ukraine-invasion-spotlights-the-delicate-state-of-democracy-2424435.html\" target=\"_blank\">(READ FULL STORY HERE)<\/a><\/strong><\/p>\n","date":"2022-02-27 21:29:05","pin":"0","status":"1"},{"title":"Greece sending defense aid to Ukraine","content":"<ul>\n\t<li>Authorities say Greece is sending ammunition, assault rifles and missile launchers to Ukraine in response to a request by Ukraine&#39;s government.<\/li>\n\t<li>The military aid was decided at a meeting Sunday morning between Prime Minister Kyriakos Mitsotakis and senior defense officials.<\/li>\n\t<li>A C-130 plane with the equipment has arrived in Poland, and a second one will arrive later, a Defense Ministry official said.<\/li>\n\t<li>Two more planes carrying humanitarian aid such as blankets and food have also left Athens International Airport for Poland, the spokesman said.<\/li>\n<\/ul>\n","date":"2022-02-27 21:31:05","pin":"0","status":"1"},{"title":"Now, Canada shuts airspace to Russia too","content":"<ul>\n\t<li>Canada is joining many European countries in closing its airspace to all Russian aircraft as the West ramps up pressure on Russia for invading Ukraine.<\/li>\n\t<li>Transport Minister Omar Alghabra said Sunday that Canada will hold Russia accountable for its unprovoked attacks.<\/li>\n\t<li>Most European countries have either announced they are closing their airspace or said they intend to do so.<\/li>\n\t<li>So far Spain, Greece, Serbia and Turkey are among the few left that haven&#39;t joined in the move against Russia.<\/li>\n<\/ul>\n","date":"2022-02-27 22:00:02","pin":"0","status":"1"},{"title":"EU shuts airspace to Russian airlines; will buy Ukraine arms","content":"<ul>\n\t<li>The European Union&rsquo;s chief executive says the 27-nation bloc will close its airspace to Russian airlines, fund supplies of weapons to Ukraine and ban some pro-Kremlin media outlets in response to Russia&rsquo;s invasion. European Commission President Ursula von der Leyen said Sunday that &ldquo;for the first time ever, the European Union will finance the purchase and delivery of weapons and other equipment to a country that is under attack.&rdquo;<\/li>\n\t<li>Von der Leyen added that &ldquo;we are shutting down the EU airspace for Russians. We are proposing a prohibition on all Russian-owned, Russian registered or Russian-controlled aircraft. These aircraft will no more be able to land in, take off or overfly the territory of the EU.&rdquo;<\/li>\n\t<li>She said also the EU will ban &ldquo;the Kremlin&rsquo;s media machine. The state-owned Russia Today and Sputnik, as well as their subsidiaries, will no longer be able to spread their lies to justify Putin&rsquo;s war and to sow division in our union.&rdquo;<\/li>\n\t<li>Von der Leyen added that the EU will also target Belarus President Alexander Lukashenko for supporting Russia&rsquo;s widespread military campaign in Ukraine.<\/li>\n\t<li>&ldquo;We will hit Lukashenko&rsquo;s regime with a new package of sanctions,&rdquo; she said.<\/li>\n<\/ul>\n","date":"2022-02-27 22:30:45","pin":"0","status":"1"},{"title":"Three more flights bring back 688 Indians from Ukraine, Government says taking steps to ensure return of all stranded citizens","content":"<p>Approximately 13,000 Indians are in Ukraine as of now, Civil Aviation Minister Jyotiraditya Scindia, who received the evacuees at the Delhi airport this morning, said. <strong><a href=\"http:\/\/newindianexpress.com\/nation\/2022\/feb\/27\/three-more-flights-bring-back-688-indians-from-ukraine-government-says-taking-steps-to-ensure-retur-2424441.html\" target=\"_blank\">(READ FULL STORY HERE)<\/a><\/strong><\/p>\n","date":"2022-02-27 23:04:33","pin":"0","status":"1"},{"title":"Belarusians protest Russian attack on Ukraine","content":"<ul>\n\t<li>Hundreds of people protested Russia&rsquo;s invasion of Ukraine in Belarus on Sunday. The protests came despite the fact that the authoritarian Belarusian government has sided with Moscow.<\/li>\n\t<li>The anti-war rallies spanned at least 12 Belarusian cities, and human rights advocates reported that more than 170 people have been arrested. In the capital of Minsk, demonstrators marched in different parts of the city carrying Ukrainian flags. A large pile of flowers kept growing at the building of Ukraine&rsquo;s Embassy.<\/li>\n\t<li>Pavel Latushko, Belarusian top opposition figure in exile in Poland, condemned Belarus&rsquo; role in the Russian attack on Ukraine.<\/li>\n\t<li>&ldquo;The illegitimate regime in Belarus, headed by the usurper of power (President Alexander) Lukashenko, has made our country an accomplice in the aggression against the brotherly Ukrainian people,&rdquo; Latushko said.<\/li>\n\t<li>&ldquo;We consider aggression against Ukraine an international crime on the part of the Russian and Belarusian regimes.&rdquo;<\/li>\n<\/ul>\n","date":"2022-02-27 23:17:24","pin":"0","status":"1"},{"title":"66,000 Ukrainian refugees enter Hungary so far","content":"<ul>\n\t<li>Some 66,000 refugees have entered Hungary from Ukraine since the beginning of the Russian invasion on Thursday, with more than 23,000 entering on Saturday alone, according to the Hungarian police and Hungary&rsquo;s foreign minster.<\/li>\n\t<li>Speaking from a border station between Zahony, Hungary and Chop, Ukraine on Sunday, Foreign Minister Peter Szijjarto said that his government would send 100,000 liters (about 26,400 gallons) of gasoline and diesel to Ukrainian authorities for use by paramedics, medical institutions and disaster management. &ldquo;Hungary has a role to play in humanitarian disaster response and relief,&rdquo; Szijjarto said.<\/li>\n\t<li>Some 28 tons of food aid has also been sent into Ukraine so far, Szijjarto said, adding that Hungary would provide 1 million euros ($1.1 million) in aid to Ukraine on Monday.<\/li>\n\t<li>Hungary&rsquo;s government has said it will allow all citizens and legal residents of Ukraine to enter Hungary as refugees, emphasizing that none will be turned away if they can prove legal status in Ukraine.<\/li>\n\t<li>Refugees arriving from Ukraine to the border town of Zahony will be able to continue their journey with a free &ldquo;solidarity ticket&rdquo; to any destination in Hungary, Hungarian state railway company MAV wrote in a statement Sunday.<\/li>\n<\/ul>\n","date":"2022-02-27 23:34:33","pin":"0","status":"1"},{"title":"We are encircled but full of fight': Kyiv Mayor's message to Russia","content":"<p>In an interview with The Associated Press on Sunday, after a grueling night of Russian attacks on the outskirts of the city, mayor Vitali Klitschko was silent for several seconds when asked if there were plans to evacuate civilians if Russian troops managed to take Kyiv. <strong><a href=\"https:\/\/www.newindianexpress.com\/world\/2022\/feb\/27\/we-are-encircled-but-full-of-fight-kyiv-mayors-message-to-russia-2424449.html\" target=\"_blank\">(READ FULL STORY HERE)<\/a><\/strong><\/p>\n","date":"2022-02-27 23:37:14","pin":"0","status":"1"},{"title":"Volunteers extend help to thousands of refugees from Ukraine amid Russian aggression","content":"<p>Sitting with her teenage daughter in a hotel foyer in northern Romania, 38-year-old Viktoriya Smishchkyk breaks down in tears as she recounts her departure from Ukraine. <strong><a href=\"https:\/\/www.newindianexpress.com\/world\/2022\/feb\/27\/volunteers-extend-help-to-thousands-of-refugees-from-ukraine-amid-russian-aggression-2424447.html\" target=\"_blank\">(READ FULL STORY HERE)<\/a><\/strong><\/p>\n","date":"2022-02-27 23:38:45","pin":"0","status":"1"},{"title":"Protesters in France denounce Vladimir Putin","content":"<ul>\n\t<li>Hundreds of people protested on Sunday in Paris and in the Riviera city of Nice against Russia&rsquo;s invasion of Ukraine, with Ukrainian flags and those of other eastern European nations hoisted high.<\/li>\n\t<li>Some Russians opposed to the war were in the Paris crowd. It was the second day of protests directed at Russian President Vladimir Putin around France, among a string of weekend rallies across Europe.<\/li>\n\t<li>On the famed Promenade des Anglais in Nice, a hub for Ukrainians, hundreds of people chanted slogans against the war Putin is waging and urged NATO nations to protect them from Russian bombs. Protesters carried Ukrainian, Moldovan, Georgian and Chechen flags and banners denouncing Putin.<\/li>\n<\/ul>\n","date":"2022-02-27 23:40:01","pin":"0","status":"1"},{"title":"PM Modi holds high-level meeting on Ukraine crisis","content":"<ul>\n\t<li>Prime Minister Narendra Modi chaired a high-level meeting on the Ukraine crisis on Sunday and asserted that ensuring the safety of Indian students and evacuating them is the government&#39;s top priority, official sources said.<\/li>\n\t<li>It was also decided at the meeting to further enhance cooperation with the neighbouring countries of Ukraine to expedite the evacuation of Indian students, they said.<\/li>\n\t<li>External Affairs Minister S Jaishankar was part of the meeting, which was also attended by top government officials, including National Security Advisor (NSA) Ajit Doval. The meeting lasted for over two hours, the sources said.<\/li>\n\t<li>Modi presided over the meeting immediately upon his return from Uttar Pradesh, where he addressed public meetings as part of the Bharatiya Janata Party&#39;s (BJP) campaign for the state Assembly polls.<\/li>\n\t<li>A large number of Indians, mostly students, are stranded in Ukraine following Russia&#39;s attack on the country. India has begun evacuating them and over 900 people have been brought back since Saturday.<\/li>\n\t<li>Modi has also spoken to Russian President Vladimir Putin and Ukrainian leader Volodymyr Zelensky, with India calling for dialogue to defuse the crisis.<\/li>\n<\/ul>\n","date":"2022-02-27 23:40:57","pin":"1","status":"1"},{"title":"IndiGo to operate flights to Budapest, Bucharest to bring back Indians","content":"<ul>\n\t<li>The country&#39;s largest carrier IndiGo will operate flights to Budapest and Bucharest to bring back Indians who are stranded in Ukraine, according to an airline official.<\/li>\n\t<li>For now, the airline has decided to operate one flight each to Budapest (Hungary) and Bucharest (Romania). The flights will be operated through Istanbul. Earlier, the carrier was scheduled to operate two flights to Budapest.<\/li>\n\t<li>The official on Sunday said the schedule has been revised and now one flight will leave for Budapest from Istanbul on Monday and return to Delhi on Tuesday.<\/li>\n\t<li>Another flight will leave from Istanbul to Bucharest on Monday and return to Delhi on Tuesday, as per the official.<\/li>\n\t<li>The reason for the revision in schedule could not be immediately ascertained. Amid the intensifying conflict between Ukraine and Russia, the Indian government is bringing back its citizens stranded in Ukraine.<\/li>\n<\/ul>\n","date":"2022-02-27 23:44:12","pin":"0","status":"1"},{"title":"Russia confirms casualties in Ukraine attack","content":"<ul>\n\t<li>The Russian military said Sunday that some of its troops were killed and some were wounded in Ukraine -- admitting for the first time that it had suffered casualties since the Russian invasion.<\/li>\n\t<li>Russian Defense Ministry spokesman Maj. Gen. Igor Konashenkov said Sunday &ldquo;there are dead and wounded among our comrades,&rdquo; without offering any numbers, but adding that Russia&rsquo;s losses were &ldquo;many times&rdquo; fewer than those of Ukraine&rsquo;s forces. It was the first time Russian military officials mentioned casualties on their side.<\/li>\n\t<li>Ukraine has claimed that its forces killed 3,500 Russian troops. Konashenkov also said that since the start of the attack Thursday, the Russian military have hit 1,067 Ukrainian military facilities, including 27 command posts and communication centers, 38 air defense missile system and 56 radar stations.<\/li>\n\t<li>Konashenkov&rsquo;s claims and Ukraine&rsquo;s allegations that its forces killed thousands of Russian troops can&rsquo;t be independently verified.<\/li>\n<\/ul>\n","date":"2022-02-28 00:31:07","pin":"0","status":"1"},{"title":"Russia confirms casualties in Ukraine attack","content":"<ul>\n\t<li>The Russian military said Sunday that some of its troops were killed and some were wounded in Ukraine -- admitting for the first time that it had suffered casualties since the Russian invasion.<\/li>\n\t<li>Russian Defense Ministry spokesman Maj. Gen. Igor Konashenkov said Sunday &ldquo;there are dead and wounded among our comrades,&rdquo; without offering any numbers, but adding that Russia&rsquo;s losses were &ldquo;many times&rdquo; fewer than those of Ukraine&rsquo;s forces. It was the first time Russian military officials mentioned casualties on their side.<\/li>\n\t<li>Ukraine has claimed that its forces killed 3,500 Russian troops. Konashenkov also said that since the start of the attack Thursday, the Russian military have hit 1,067 Ukrainian military facilities, including 27 command posts and communication centers, 38 air defense missile system and 56 radar stations.<\/li>\n\t<li>Konashenkov&rsquo;s claims and Ukraine&rsquo;s allegations that its forces killed thousands of Russian troops can&rsquo;t be independently verified.<\/li>\n<\/ul>\n","date":"2022-02-28 00:31:53","pin":"0","status":"1"},{"title":"Russia confirms casualties in Ukraine attack","content":"<ul>\n\t<li>The Russian military said Sunday that some of its troops were killed and some were wounded in Ukraine -- admitting for the first time that it had suffered casualties since the Russian invasion.<\/li>\n\t<li>Russian Defense Ministry spokesman Maj. Gen. Igor Konashenkov said Sunday &ldquo;there are dead and wounded among our comrades,&rdquo; without offering any numbers, but adding that Russia&rsquo;s losses were &ldquo;many times&rdquo; fewer than those of Ukraine&rsquo;s forces. It was the first time Russian military officials mentioned casualties on their side.<\/li>\n\t<li>Ukraine has claimed that its forces killed 3,500 Russian troops. Konashenkov also said that since the start of the attack Thursday, the Russian military have hit 1,067 Ukrainian military facilities, including 27 command posts and communication centers, 38 air defense missile system and 56 radar stations.<\/li>\n\t<li>Konashenkov&rsquo;s claims and Ukraine&rsquo;s allegations that its forces killed thousands of Russian troops can&rsquo;t be independently verified.<\/li>\n<\/ul>\n","date":"2022-02-28 00:32:14","pin":"0","status":"1"},{"title":"Despair and fear, relief and joy of Malayali students stranded in Ukrainian: Two sides of crisis there","content":"<p>Videos went viral of Malayali students, huddled in bunkers or underground metro stations in various parts of eastern Ukraine in below freezing temperatures, crying out for help or to evacuate them as they began running out of food and water which was difficult to procure in view of the constant shelling and gunfire around them. <strong><a href=\"https:\/\/www.newindianexpress.com\/states\/kerala\/2022\/feb\/28\/despair-and-fear-relief-and-joy-of-malayali-students-stranded-in-ukrainian-two-sides-of-crisis-the-2424464.html\" target=\"_blank\">(READ FULL STORY HERE)<\/a><\/strong><\/p>\n","date":"2022-02-28 00:33:51","pin":"0","status":"1"},{"title":"Signs emerge of damage to Russian economy","content":"<ul>\n\t<li>Some early signs are emerging of significant economic consequences to Russia following its invasion of Ukraine three days ago.<\/li>\n\t<li>While official quotes for the Russian ruble were unchanged at roughly 84 rubles to the dollar, one online Russian bank, Tinkoff, was giving an unofficial exchange rate of 152 rubles over the weekend.<\/li>\n\t<li>Videos from Russia showed long lines of Russians trying to withdraw cash from ATMs, while the Russian Central Bank issued a statement calling for calm, in an effort to avoid bank runs.<\/li>\n\t<li>Reports also showed that Visa and Mastercard were no longer being accepted for those with international bank accounts.<\/li>\n\t<li>&ldquo;Banks and credit card companies dealing with Russia are going into lock down mode given the fast pace and increasing bite of the sanctions,&rdquo; said Amanda DeBusk, a partner with Dechert LLP.<\/li>\n\t<li>Russia may have to temporarily close bank branches or declare a national bank holiday to protect its financial system, analysts said.<\/li>\n\t<li>&ldquo;If there&rsquo;s a full-scale banking panic, that&rsquo;s a driver of crisis in its own right,&rdquo; said Adam Tooze, a professor of history at Columbia University and Director of the European Institute.<\/li>\n\t<li>&ldquo;A rush into dollars by the Russian general population moves things into an entirely new domain of financial warfare.&rdquo;<\/li>\n<\/ul>\n","date":"2022-02-28 00:46:46","pin":"0","status":"1"},{"title":"MEA launches dedicated Twitter handle for students trapped in Ukraine","content":"<p>The Ministry of External Affairs (MEA) on Sunday activated a dedicated Twitter handle, &quot;OpGanga Helpline&quot; (@opganga), to assist in the evacuation of Indian nationals from war-torn Ukraine. The mission to evacuate the stranded Indians from Ukraine has been named as &quot;Operation Ganga&quot;. <strong><a href=\"https:\/\/www.newindianexpress.com\/nation\/2022\/feb\/28\/mea-launches-dedicated-twitter-handle-for-students-trapped-in-ukraine-2424469.html\" target=\"_blank\">(READ FULL STORY HERE)<\/a><\/strong><\/p>\n","date":"2022-02-28 00:57:25","pin":"0","status":"1"},{"title":"Ukraine files genocide case against Russia at UN's top court","content":"<p>In its filing, Ukraine has accused Moscow of planning genocide and asked the court to intervene to halt the invasion and order Russia to pay reparations.<\/p>\n\n<p>The case says Russia launched its invasion of Ukraine based on false claims of acts of genocide in the Luhansk and Donetsk regions of eastern Ukraine and now is planning genocidal acts in Ukraine.<\/p>\n\n<p><a href=\"https:\/\/www.newindianexpress.com\/world\/2022\/feb\/28\/ukraine-files-genocide-case-against-russia-at-uns-top-court-2424520.html\" target=\"_blank\"><strong>Read more<\/strong><\/a><\/p>\n","date":"2022-02-28 02:10:09","pin":"0","status":"1"},{"title":"India abstains from voting on resolution passed in UNSC referring matter to UNGA for Special Emergency Session","content":"<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\">3 countries, including India, China, UAE abstained from voting. 11 countries voted in favour of the resolution, while Russia used its veto power (to block the resolution). <a href=\"https:\/\/t.co\/XJXlxn7Wip\">pic.twitter.com\/XJXlxn7Wip<\/a><\/p>\n&mdash; ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1498038865604800512?ref_src=twsrc%5Etfw\">February 27, 2022<\/a><\/blockquote>\n<script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2022-02-28 02:27:18","pin":"0","status":"1"}]}