{"details":[{"title":"Three countries, including India, China, UAE abstained from voting against Russia at UNSC","content":"<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\">Correction: 3 countries, including India, China, UAE abstained from voting. 11 countries voted in favour of the resolution, while Russia rejected the resolution using a procedural vote<a href=\"https:\/\/twitter.com\/hashtag\/UkraineRussiaConflict?src=hash&amp;ref_src=twsrc%5Etfw\">#UkraineRussiaConflict<\/a> <a href=\"https:\/\/t.co\/45x55yg5NK\">pic.twitter.com\/45x55yg5NK<\/a><\/p>\n&mdash; ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1498042590939447296?ref_src=twsrc%5Etfw\">February 27, 2022<\/a><\/blockquote>\n<script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2022-02-28 03:03:56","pin":"0","status":"1"},{"title":"India abstains from voting on resolution passed in UNSC referring matter to UNGA for Special Emergency Session","content":"<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\">India abstains from voting on a resolution passed with 11 votes in UNSC referring to the matter to UNGA for Special Emergency Session on <a href=\"https:\/\/twitter.com\/hashtag\/RussiaUkraineConflict?src=hash&amp;ref_src=twsrc%5Etfw\">#RussiaUkraineConflict<\/a> <a href=\"https:\/\/t.co\/MtaV2uWqCs\">pic.twitter.com\/MtaV2uWqCs<\/a><\/p>\n&mdash; ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1498033393594138625?ref_src=twsrc%5Etfw\">February 27, 2022<\/a><\/blockquote>\n<script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2022-02-28 03:05:17","pin":"0","status":"1"},{"title":"Ukraine files genocide case against Russia at International Court of Justice","content":"<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\">Ukraine institutes proceedings against the Russian Federation before the International Court of Justice and requests the Court to indicate provisional measures <a href=\"https:\/\/t.co\/A6WXxxKTPs\">pic.twitter.com\/A6WXxxKTPs<\/a><\/p>\n&mdash; ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1498049478452215810?ref_src=twsrc%5Etfw\">February 27, 2022<\/a><\/blockquote>\n<script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>\n\n<p>(<a href=\"https:\/\/www.newindianexpress.com\/world\/2022\/feb\/28\/ukraine-files-genocide-case-against-russia-at-uns-top-court-2424520.html\" target=\"_blank\"><strong>READ FULL REPORT HERE<\/strong><\/a>)<\/p>\n","date":"2022-02-28 03:08:57","pin":"0","status":"1"},{"title":"Deeply concerned about the safety & security of the Indian nationals:  Indian envoy to UN","content":"<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\"><a href=\"https:\/\/twitter.com\/hashtag\/WATCH?src=hash&amp;ref_src=twsrc%5Etfw\">#WATCH<\/a> | India&#39;s Permanent Rep to UN, TS Tirumurti, speaks at the UNSC meeting on <a href=\"https:\/\/twitter.com\/hashtag\/RussiaUkraineConflict?src=hash&amp;ref_src=twsrc%5Etfw\">#RussiaUkraineConflict<\/a>, says, &quot;we continue to be deeply concerned about the safety &amp; security of the Indian nationals including a large number of Indian students who are still stranded in Ukraine.&quot; <a href=\"https:\/\/t.co\/ZXoWcsv07Z\">pic.twitter.com\/ZXoWcsv07Z<\/a><\/p>\n&mdash; ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1498037758757326848?ref_src=twsrc%5Etfw\">February 27, 2022<\/a><\/blockquote>\n<script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2022-02-28 04:19:01","pin":"0","status":"1"},{"title":"Russia cannot stop the world from coming together to condemn its invasion of Ukraine: UK at UNSC","content":"<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\">Russia again was isolated in opposing this resolution. But it cannot stop the world from coming together to condemn its invasion of Ukraine. We urge all members of the UN to call for the immediate withdrawal of the Russian forces &amp; end this war: UK representative at UNSC <a href=\"https:\/\/t.co\/9imrTw1GWQ\">pic.twitter.com\/9imrTw1GWQ<\/a><\/p>\n&mdash; ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1498045042505940992?ref_src=twsrc%5Etfw\">February 27, 2022<\/a><\/blockquote>\n<script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2022-02-28 04:19:36","pin":"0","status":"1"},{"title":"16 children were killed since February 24, more than 350,000 have no access to education: Ukraine at UNSC","content":"<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\">Enemy losses as of Feb 27 have amounted to nearly 4,300 &amp;over 200 taken as prisoners of war; Russia denies. Ukraine had opened a hotline for relatives of Russian soldiers who can&#39;t be contacted; over 100 calls from Russian mothers were received during the 1st hr: Ukraine at UNSC <a href=\"https:\/\/t.co\/r4Xd3TtvtC\">pic.twitter.com\/r4Xd3TtvtC<\/a><\/p>\n&mdash; ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1498066799304536066?ref_src=twsrc%5Etfw\">February 27, 2022<\/a><\/blockquote>\n<script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2022-02-28 04:20:55","pin":"0","status":"1"},{"title":"Pro-Ukraine rally held in front of White House on February 27","content":"<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\">A pro-Ukraine rally was held in front of the White House on Feb 27, urging Russian President Vladimir Putin to call off <a href=\"https:\/\/twitter.com\/hashtag\/RussiaUkraineConflict?src=hash&amp;ref_src=twsrc%5Etfw\">#RussiaUkraineConflict<\/a>; also calling on US President Joe Biden to take stronger actions. <a href=\"https:\/\/t.co\/UklbmX5J6A\">pic.twitter.com\/UklbmX5J6A<\/a><\/p>\n&mdash; ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1498055684440870912?ref_src=twsrc%5Etfw\">February 27, 2022<\/a><\/blockquote>\n<script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2022-02-28 04:57:20","pin":"0","status":"1"},{"title":"Ukraine President Zelensky spoke with European Commission chief about strengthening country's defense capabilities","content":"<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\">Also had a phone conversation with <a href=\"https:\/\/twitter.com\/vonderleyen?ref_src=twsrc%5Etfw\">@vonderleyen<\/a>. Talked about concrete decisions on strengthening Ukraine&#39;s defense capabilities, macro-financial assistance and Ukraine&#39;s membership in the <a href=\"https:\/\/twitter.com\/hashtag\/EU?src=hash&amp;ref_src=twsrc%5Etfw\">#EU<\/a>.<\/p>\n&mdash; ????????? ?????????? (@ZelenskyyUa) <a href=\"https:\/\/twitter.com\/ZelenskyyUa\/status\/1498079039235502081?ref_src=twsrc%5Etfw\">February 27, 2022<\/a><\/blockquote>\n<script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2022-02-28 05:33:20","pin":"0","status":"1"},{"title":"Belarus detains 500-plus at invasion protests","content":"<p>The Viasna human rights center released the names of 530 people detained Sunday across Belarus, where demonstrations against the war spanned at least 12 cities, AP reported.<\/p>\n\n<p>In Minsk, demonstrators marched in different parts of the city carrying Ukrainian flags. A large pile of flowers kept growing at the building of Ukraine&rsquo;s Embassy.<\/p>\n\n<p>The Belarusian government has been aiding Russia in its war against Ukraine.<\/p>\n\n<div style=\"text-align:center\">\n<figure class=\"image\" style=\"display:inline-block\"><img alt=\"\" height=\"200\" src=\"https:\/\/images.newindianexpress.com\/uploads\/user\/ckeditor_images\/article\/2022\/2\/28\/Russia_Ukraine_AP(1).jpg\" width=\"400\" \/>\n<figcaption>A man holds a poster that reads &quot;No War&quot; as people lay flowers near the place where Russian opposition leader Boris Nemtsov was gunned down in Moscow, Russia, Feb 27, 2022. (Photo | AP)<\/figcaption>\n<\/figure>\n<\/div>\n","date":"2022-02-28 06:03:41","pin":"0","status":"1"},{"title":"US, G7 ministers in conversation with Ukrainian FM Dmytro Kuleba express united support","content":"<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\">US Secretary of State, Antony Blinken, &amp; G7 FMs spoke with Ukrainian FM Dmytro Kuleba &quot;to express united support for Ukraine; will hold Russia accountable for its... invasion, &amp; continue to provide security, economic, &amp; humanitarian assistance to Ukraine.&quot;<a href=\"https:\/\/twitter.com\/hashtag\/RussiaUkraineCrisis?src=hash&amp;ref_src=twsrc%5Etfw\">#RussiaUkraineCrisis<\/a> <a href=\"https:\/\/t.co\/MftbER5i5K\">pic.twitter.com\/MftbER5i5K<\/a><\/p>\n&mdash; ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1498103663893839873?ref_src=twsrc%5Etfw\">February 28, 2022<\/a><\/blockquote>\n<script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2022-02-28 07:17:54","pin":"0","status":"1"},{"title":"Russian President Vladimir Putin puts nuclear forces on high alert, escalating tensions","content":"<p>Russian President Vladimir Putin dramatically escalated East-West tensions by ordering Russian nuclear forces put on high alert Sunday, while Ukraine&#39;s embattled leader agreed to talks with Moscow as Putin&#39;s troops and tanks drove deeper into the country, closing in around the capital.<\/p>\n\n<p>(<a href=\"https:\/\/www.newindianexpress.com\/world\/2022\/feb\/28\/ukraine-vows-no-capitulation-at-talks-putin-orders-nuclear-alert-2424634.html\" target=\"_blank\">CLICK HERE FOR FULL STORY<\/a>)<\/p>\n","date":"2022-02-28 07:47:36","pin":"0","status":"1"},{"title":"Belarus holds constitutional vote as crisis in Ukraine rages","content":"<p>Belarusians cast ballots in a constitutional referendum that the country&#39;s authoritarian leader called to cement his 27-year old grip on power, even as he offers the country&#39;s territory to his ally Russia to invade Ukraine.&nbsp;<\/p>\n\n<p>Belarusian President Alexander Lukashenko, who has edged even closer to Russia amid crippling Western sanctions over his crackdown on domestic protests, said he was confident that Belarusians will support a set of constitutional amendments that would allow him to stay in power until 2035.<\/p>\n","date":"2022-02-28 08:38:00","pin":"0","status":"1"},{"title":"UN to hold 2 meetings today on Russia's invasion of Ukraine","content":"<p>The U.N.&rsquo;s two major bodies -- the 193-nation General Assembly and the more powerful 15-member Security Council -- will hold separate meetings on Russia&rsquo;s invasion of Ukraine, a reflection of widespread international demands for an immediate cease-fire and escalating concern for the plight of millions of Ukrainians caught up in the war.<\/p>\n\n<div style=\"text-align:center\">\n<figure class=\"image\" style=\"display:inline-block\"><img alt=\"\" height=\"300\" src=\"https:\/\/images.newindianexpress.com\/uploads\/user\/ckeditor_images\/article\/2022\/2\/28\/UN.jpg\" width=\"600\" \/>\n<figcaption><em>Ambassadors speak during a Security Council meeting at United Nations headquarters. (Photo | AP)<\/em><\/figcaption>\n<\/figure>\n<\/div>\n","date":"2022-02-28 08:46:48","pin":"0","status":"1"},{"title":"Australia to provide lethal military equipment to Ukraine","content":"<ul>\n\t<li>\n\t<p>Australia will provide lethal military equipment to Ukraine to help the Ukrainians resist the Russian invasion.<\/p>\n\t<\/li>\n\t<li>\n\t<p>The Australian government&#39;s announcement Monday gave no details on what material it may be sending. The move follows an offer on Friday of non-lethal military equipment, medical supplies and a $3 million contribution to a NATO trust fund for support of the besieged country.<\/p>\n\t<\/li>\n\t<li>\n\t<p>Australia has imposed sanctions on more than 350 Russian individuals, including Russian President Vladimir Putin since Thursday.<\/p>\n\t<\/li>\n<\/ul>\n","date":"2022-02-28 08:49:51","pin":"0","status":"1"},{"title":"Russian ruble tanks almost 30 per cent after latest sanctions","content":"<p>Russia&#39;s ruble plunged nearly 30 per cent against the dollar Monday after world powers imposed fresh, harsher sanctions on Moscow over its invasion of Ukraine.<\/p>\n\n<p>The ruble was indicated to be down 27 percent at 114.33 per dollar in offshore trading, according to Bloomberg News.<\/p>\n","date":"2022-02-28 09:29:00","pin":"0","status":"1"},{"title":"Biden, allies to talk to coordinate Ukraine response: White House","content":"<p>US President Joe Biden will hold a secure call with allies and partners on Monday to discuss &quot;developments&quot; in Russia&#39;s attack on Ukraine and &quot;coordinate our united response,&quot; the White House said.<\/p>\n\n<p>The administration did not elaborate on who would participate in the call, which will take place at 11:15 am (1615 GMT).<\/p>\n","date":"2022-02-28 09:34:57","pin":"0","status":"1"},{"title":"Canada to send non-lethal military equipment to Ukraine","content":"<p>Canada announced that it would ship non-lethal protective military equipment such as helmets to Ukraine&#39;s army, but again ruled out sending troops in against Russian forces.<\/p>\n\n<p>Ukrainian troops need bulletproof vests, helmets, gas masks and night vision equipment, Canadian Foreign Affairs Minister Melanie Joly said at a press conference.<\/p>\n","date":"2022-02-28 09:39:43","pin":"0","status":"1"},{"title":"'Another war': Afghan flees Russian bombs in Ukraine","content":"<p>After leaving Afghanistan a year ago, Ajmal Rahmani believed he had found a haven of peace in Ukraine. This week, he and his family had to flee again -- this time to Poland to the sounds of Russian bombs. &quot;I run from one war, come to another country and another war starts. Very bad luck,&quot; Rahmani said.<\/p>\n","date":"2022-02-28 09:48:52","pin":"0","status":"1"},{"title":"Kyiv mayor proud of citizens' spirit, anxious about future","content":"<p>As Russian troops draw closer to the Ukrainian capital, Kyiv&#39;s mayor is filled with pride over his citizens&#39; spirit yet anxious about how long they can hold out. Mayor Vitali Klitschko was silent for several seconds when asked if there were plans to evacuate civilians if Russian troops managed to take Kyiv.<\/p>\n","date":"2022-02-28 10:09:36","pin":"0","status":"1"},{"title":"We can't abandon our own people: Rahul Gandhi","content":"<p>Congress leader Rahul Gandhi asked the government to urgently share its evacuation plan with those stranded in Ukraine and their families as he shared a video of some students being harassed by the military there.<\/p>\n\n<p>&quot;My heart goes out to the Indian students suffering such violence and their family watching these videos. No parent should go through this,&quot; he said on Twitter while sharing the video of some students.<\/p>\n","date":"2022-02-28 10:31:51","pin":"0","status":"1"},{"title":"Canada closes airspace to all Russian carriers","content":"<p>Canada has closed its airspace to all Russian carriers in protest at the Russian invasion of Ukraine, Ottawa announced. But the ban was quickly tested when, according to Canadian officials, a plane operated by Russian airline Aeroflot flew over the country. Aeroflot flight 111 had departed Miami, Florida, bound for Moscow.<\/p>\n","date":"2022-02-28 10:49:13","pin":"0","status":"1"},{"title":"PM Modi to chair meeting on Ukraine crisis","content":"<p>PM Modi to chair meeting on Ukraine crisis, some ministers may go to its neighbouring countries to coordinate evacuations: Sources<\/p>\n\n<div style=\"text-align:center\">\n<figure class=\"image\" style=\"display:inline-block\"><img alt=\"\" height=\"300\" src=\"https:\/\/images.newindianexpress.com\/uploads\/user\/imagelibrary\/2022\/2\/12\/original\/Narendra_Modi_AP.jpg\" width=\"600\" \/>\n<figcaption><em>Prime Minister Narendra Modi. (Photo | PTI)<\/em><\/figcaption>\n<\/figure>\n<\/div>\n","date":"2022-02-28 11:01:11","pin":"0","status":"1"},{"title":"Four ministers to travel to Ukraine's neighbouring countries","content":"<p>Stepping up its efforts to evacuate Indian students stranded in war-hit Ukraine, the Centre on Monday decided that Union ministers Hardeep Puri, Jyotiraditya Scindia, Kiren Rijiju and R&nbsp;K Singh will travel to its neighbouring countries to coordinate the evacuation mission and help students, government sources said. <a href=\"https:\/\/www.newindianexpress.com\/nation\/2022\/feb\/28\/four-ministers-to-travel-to-ukraines-neighbouring-countries-to-coordinate-evacuation-of-indians-2424653.html\" target=\"_blank\"><strong>(READ MORE)<\/strong><\/a><\/p>\n","date":"2022-02-28 11:33:11","pin":"0","status":"1"},{"title":"Air India's fifth evacuation flight lands in Delhi with 249 Indians","content":"<ul>\n\t<li>\n\t<p>Air India&#39;s fifth evacuation flight came from Romanian capital Bucharest to Delhi on Monday morning with 249 Indian nationals who were stranded in Ukraine amid the Russian military offensive, officials said.<\/p>\n\t<\/li>\n\t<li>\n\t<p>India began evacuation of its citizens from Romania and Hungary&nbsp;neighbouring countries of Ukraine from Saturday onwards.<\/p>\n\t<\/li>\n\t<li>\n\t<p>Tata Group-owned Air India has evacuated a total of 1,156 Indian nationals in five evacuation flights till now. Officials said one more evacuation flight is expected to land in Delhi on Monday.<\/p>\n\t<\/li>\n<\/ul>\n","date":"2022-02-28 11:47:42","pin":"0","status":"1"},{"title":"Assam government opens helpline for people stranded in war-hit Ukraine","content":"<p>Ten students from Assam stranded in war-torn Ukraine have been evacuated along with other Indians so far and they have reached New Delhi and Mumbai on separate flights, the state administration said.<\/p>\n\n<p>The Assam government said it has been in constant touch with the Ministry of External Affairs to ensure safe return of all people from the state, who are stuck in the restive country.<\/p>\n","date":"2022-02-28 12:04:36","pin":"0","status":"1"},{"title":"Problems, disagreements best resolved through dialogue: Dalai Lama on Ukraine crisis","content":"<p>Tibetan spiritual leader the Dalai Lama on Monday expressed anguish over the Ukraine crisis, and said that problems and disagreements are best resolved through dialogue. War is outdated and non-violence is the only way, the Nobel peace prize winner said on the Russian offensive in Ukraine. <a href=\"https:\/\/www.newindianexpress.com\/nation\/2022\/feb\/28\/problems-disagreements-best-resolved-through-dialogue-dalai-lama-on-ukraine-crisis-2424658.html\" target=\"_blank\"><strong>(READ MORE)<\/strong><\/a><\/p>\n","date":"2022-02-28 12:20:17","pin":"0","status":"1"},{"title":"Ukraine says Russian troops 'reduced pace of offensive'","content":"<p>The Ukrainian military said on Monday that Russian troops had slowed down &quot;the pace of the offensive&quot;, as Moscow&#39;s assault against Ukraine went into its fifth day. &quot;The Russian occupiers have reduced the pace of the offensive, but are still trying to develop success in some areas,&quot; the general staff of the armed forces said.<\/p>\n\n<div style=\"text-align:center\">\n<figure class=\"image\" style=\"display:inline-block\"><img alt=\"\" height=\"300\" src=\"https:\/\/images.newindianexpress.com\/uploads\/user\/ckeditor_images\/article\/2022\/2\/28\/Russia_(3).jpg\" width=\"600\" \/>\n<figcaption><em>&nbsp;A Russian armored personnel carrier burns amid damaged and abandoned light utility vehicles after fighting in Kharkiv. (Photo | AP)<\/em><\/figcaption>\n<\/figure>\n<\/div>\n\n<p><\/p>\n","date":"2022-02-28 12:29:31","pin":"0","status":"1"},{"title":"Russia's central bank hikes key rate to 20 per cent","content":"<p>Russia&#39;s central bank announced it was raising its key interest rate to 20 per cent from 9.5 per cent as the West pummelled the country with sanctions over Moscow&#39;s invasion of Ukraine.<\/p>\n\n<p>&quot;The Bank of Russia&#39;s board of directors has decided to raise the key rate to 20 per cent,&quot; the central bank said in a statement carried by Russian news agencies.<\/p>\n","date":"2022-02-28 12:39:58","pin":"0","status":"1"},{"title":"","content":"<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\">Sakeer Aboobakkar, 21, a first year medical student from Bukovinian State Medical University in war torn Ukraine, being embraced by his father and sister upon arriving at Chennai International Airport in India on 27t February.<a href=\"https:\/\/twitter.com\/hashtag\/ukraine?src=hash&amp;ref_src=twsrc%5Etfw\">#ukraine<\/a> <a href=\"https:\/\/twitter.com\/hashtag\/UkraineRussiaConflict?src=hash&amp;ref_src=twsrc%5Etfw\">#UkraineRussiaConflict<\/a><a href=\"https:\/\/twitter.com\/NewIndianXpress?ref_src=twsrc%5Etfw\">@NewIndianXpress<\/a> <a href=\"https:\/\/t.co\/QSS5LUzwFP\">pic.twitter.com\/QSS5LUzwFP<\/a><\/p>\n&mdash; Debadatta Mallick (@ddmallick) <a href=\"https:\/\/twitter.com\/ddmallick\/status\/1498194405445959681?ref_src=twsrc%5Etfw\">February 28, 2022<\/a><\/blockquote>\n<script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2022-02-28 12:57:20","pin":"0","status":"1"},{"title":"Russian army says Ukraine using civilians as human 'shield'","content":"<div style=\"text-align:center\">\n<figure class=\"image\" style=\"display:inline-block\"><img alt=\"\" height=\"300\" src=\"https:\/\/images.newindianexpress.com\/uploads\/user\/ckeditor_images\/article\/2022\/2\/28\/Russia_(4).jpg\" width=\"600\" \/>\n<figcaption><em>A Ukrainian woman reacts after arriving at the Medyka border crossing, in Poland. (Photo | AP)<\/em><\/figcaption>\n<\/figure>\n<\/div>\n","date":"2022-02-28 13:03:28","pin":"0","status":"1"},{"title":"All set in Belarus for Russia-Ukraine talks","content":"<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\">In Belarus, everything is ready to host Russia-Ukraine negotiations. Waiting for delegations to arrive: Ministry of Foreign Affairs of Belarus<br \/>\n<br \/>\n(Pic Source: Ministry of Foreign Affairs of Belarus&#39; Twitter account)<a href=\"https:\/\/twitter.com\/hashtag\/RussiaUkraineConflict?src=hash&amp;ref_src=twsrc%5Etfw\">#RussiaUkraineConflict<\/a> <a href=\"https:\/\/t.co\/01bWOxFxFz\">pic.twitter.com\/01bWOxFxFz<\/a><\/p>\n&mdash; ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1498199700251754496?ref_src=twsrc%5Etfw\">February 28, 2022<\/a><\/blockquote>\n<script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2022-02-28 13:08:46","pin":"0","status":"1"},{"title":"Russian army says Ukraine civilians can 'freely' leave Kyiv","content":"<ul>\n\t<li>\n\t<p>The Russian army said that Ukrainian civilians could &quot;freely&quot; leave the country&#39;s capital Kyiv and stressed it had air superiority over Ukraine as its invasion went into its fifth day.<\/p>\n\t<\/li>\n\t<li>\n\t<p>&quot;All civilians in the city can freely leave the Ukrainian capital along the Kyiv-Vasylkiv highway. This direction is open and safe,&quot; Russian defence ministry spokesman Igor Konashenkov said in televised remarks.<\/p>\n\t<\/li>\n\t<li>\n\t<p>&quot;Russian aviation has gained air superiority over the entire territory of Ukraine,&quot; he added, accusing Ukrainian troops of using civilians as human shields.<\/p>\n\t<\/li>\n<\/ul>\n","date":"2022-02-28 13:31:46","pin":"0","status":"1"},{"title":"UK says no 'significant change' in Russia's nuclear posture","content":"<p>The UK government has seen no major change to&nbsp;Russia&#39;s nuclear posture despite President Vladimir Putin placing his strategic forces on higher alert, Defence Secretary Ben Wallace said on Monday.<\/p>\n\n<p>&quot;We&#39;ve looked at their posture. There isn&#39;t a significant change,&quot; he said on LBC radio, accusing Putin of trying to &quot;flex muscles&quot; with his invasion of Ukraine bogged down.<\/p>\n","date":"2022-02-28 14:13:46","pin":"0","status":"1"},{"title":"Ukraine says world's largest plane damaged","content":"<p>Ukraine&rsquo;s defense industry conglomerate says the world&rsquo;s largest plane that was in regular operation was heavily damaged in fighting with Russian troops at the airport outside Kyiv where it was parked.<\/p>\n\n<div style=\"text-align:center\">\n<figure class=\"image\" style=\"display:inline-block\"><img alt=\"\" height=\"300\" src=\"https:\/\/images.newindianexpress.com\/uploads\/user\/ckeditor_images\/article\/2022\/2\/28\/plane.jpg\" width=\"600\" \/>\n<figcaption><em>The Ukrainian Antonov-225 Mriya (Dream), the world&#39;s heaviest and largest aircraft. (Photo | AP)<\/em><\/figcaption>\n<\/figure>\n<\/div>\n","date":"2022-02-28 14:16:46","pin":"0","status":"1"},{"title":"Russia says wants to reach agreement with Ukraine: Negotiator","content":"<ul>\n\t<li>\n\t<p>Russia wants to reach agreement with Ukraine to put an end to their conflict, a Kremlin negotiator said Monday, as Moscow&#39;s assault on the pro-Western country entered a fifth day.<\/p>\n\t<\/li>\n\t<li>\n\t<p>&quot;We definitely have an interest in reaching some agreements as soon as possible,&quot; Russian President Vladimir Putin&#39;s aide, Vladimir Medinsky who travelled to Belarus for the talks, said.<\/p>\n\t<\/li>\n\t<li>\n\t<p>&quot;We are waiting for the arrival of the Ukrainian delegation,&quot; he said, adding he expected the talks to start at noon local time.<\/p>\n\t<\/li>\n<\/ul>\n","date":"2022-02-28 14:19:30","pin":"0","status":"1"},{"title":"Save your lives and leave: Ukraine President tells Russian soldiers","content":"<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\">Ukraine&#39;s President Volodymyr Zelensky appeals to Russian soldiers in speech - &quot;Save your lives and leave&quot;: Reuters <a href=\"https:\/\/twitter.com\/hashtag\/RussiaUkraineConflict?src=hash&amp;ref_src=twsrc%5Etfw\">#RussiaUkraineConflict<\/a> <a href=\"https:\/\/t.co\/EYswZ2Mq6f\">pic.twitter.com\/EYswZ2Mq6f<\/a><\/p>\n&mdash; ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1498222503470440448?ref_src=twsrc%5Etfw\">February 28, 2022<\/a><\/blockquote>\n<script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2022-02-28 14:48:37","pin":"0","status":"1"},{"title":"Ruble crashes amid Western sanctions over Ukraine assault","content":"<p>The ruble collapsed against the dollar and the euro on the Moscow Stock Exchange on Monday as the West punished Moscow with new sanctions over the Kremlin&#39;s invasion of Ukraine. The ruble fell sharply at the start of trading, reaching 100.96 to the dollar, compared to 83.5 on Wednesday, the day before the invasion of Ukraine, and 113.52 to the euro, compared to 93.5 before the assault.&nbsp;<\/p>\n","date":"2022-02-28 14:50:24","pin":"0","status":"1"},{"title":"","content":"<p><strong>Ukrainian delegation arrives for talks with Russia on border of Belarus; unclear whether they&#39;ll lead to breakthrough:&nbsp;Reports <\/strong><\/p>\n","date":"2022-02-28 14:54:59","pin":"0","status":"1"},{"title":"India relaxes travel advisory for Indians coming from Ukraine","content":"<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\"><a href=\"https:\/\/twitter.com\/MoHFW_INDIA?ref_src=twsrc%5Etfw\">@MoHFW_INDIA<\/a> announces relaxation on travel advisory for Indian nationals, mostly students, coming from Ukraine. Mandatory pre-boarding negative RTPCR test and vaccination certificate exempted for them. <a href=\"https:\/\/twitter.com\/NewIndianXpress?ref_src=twsrc%5Etfw\">@NewIndianXpress<\/a> <a href=\"https:\/\/twitter.com\/mansukhmandviya?ref_src=twsrc%5Etfw\">@mansukhmandviya<\/a> <a href=\"https:\/\/t.co\/IJ3ALFvNxU\">pic.twitter.com\/IJ3ALFvNxU<\/a><\/p>\n&mdash; Kavita Bajeli-Datt (@KavitaDatt) <a href=\"https:\/\/twitter.com\/KavitaDatt\/status\/1498225956376686592?ref_src=twsrc%5Etfw\">February 28, 2022<\/a><\/blockquote>\n<script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2022-02-28 15:08:28","pin":"0","status":"1"},{"title":"Over 100 civilians killed in Ukraine war, including seven children","content":"<p>The UN human rights chief said Monday at least 102 civilians, including seven children, had been killed in Ukraine since Russia invaded five days ago, warning true numbers could be far higher.<\/p>\n\n<p>Speaking before the UN Human Rights Council, Michelle Bachelet said her office had recorded 406 civilian casualties in Ukraine, including 102 deaths, since Russia began its full-scale attack last Thursday.<\/p>\n","date":"2022-02-28 15:17:52","pin":"0","status":"1"},{"title":"","content":"<p>GENEVA: The World Health Organisation (WHO) has called for critical medical supplies to safely reach those who need them and is working with partners to establish safe transit for shipments through Poland.<\/p>\n\n<p>A statement issued by Dr Tedros Adhanom Ghebreyesus, WHO Director-General, and Dr Hans Henri P. Kluge, WHO Regional Director for Europe, Geneva\/Copenhagen stated that during the crisis in Ukraine, health must remain a priority pillar of the humanitarian response, with health systems and facilities remaining protected, functional, safe and accessible to all who need essential medical services, and health workers protected so they can continue to save lives.<\/p>\n\n<p><a href=\"https:\/\/www.newindianexpress.com\/world\/2022\/feb\/28\/dangerously-low-medical-oxygen-supplies-in-ukraine-due-to-crisis-warns-who-2424704.html\">(CLICK HERE FOR FULL STORY)<\/a><\/p>\n","date":"2022-02-28 16:59:43","pin":"0","status":"1"},{"title":"Defiant Russia says will ride out Western sanctions","content":"<p style=\"text-align:center\"><img alt=\"\" height=\"434\" src=\"https:\/\/images.newindianexpress.com\/uploads\/user\/ckeditor_images\/article\/2022\/2\/28\/AP22059389965805.jpg\" width=\"650\" \/><\/p>\n\n<p>A defiant Russia said Monday it could ride out Western sanctions over its invasion of neighbouring Ukraine as President Vladimir Putin huddled with officials to discuss the economic turmoil of the five-day-old war. &quot;The Western sanctions on Russia are hard, but our country has the necessary potential to compensate the damage,&quot; Kremlin spokesman Dmitry Peskov told journalists.&nbsp;<\/p>\n","date":"2022-02-28 17:45:11","pin":"0","status":"1"},{"title":"Russia, Ukraine begin first talks, Kyiv calls for 'immediate ceasefire'","content":"<div style=\"text-align:center\">\n<figure class=\"image\" style=\"display:inline-block\"><img alt=\"\" height=\"434\" src=\"https:\/\/images.newindianexpress.com\/uploads\/user\/ckeditor_images\/article\/2022\/2\/28\/AP22059425630509.jpg\" width=\"650\" \/>\n<figcaption>The Ukrainian delegation leaves a Belarusian military helicopter upon their landing in Gomel region, Belarus, Monday. (Photo | AFP)<\/figcaption>\n<\/figure>\n<\/div>\n\n<p>Russia and Ukraine met Monday for their first talks since the outbreak of war last week, with Kyiv demanding an &quot;immediate ceasefire&quot; as the number of refugees fleeing the country hit more than 500,000. As the delegations arrived for talks on the border between Belarus and Ukraine on day five of Moscow&#39;s invasion, the Ukrainian presidency demanded the ceasefire &quot;and the withdrawal of troops&quot; -- which Moscow is almost certain to reject.<\/p>\n","date":"2022-02-28 17:53:40","pin":"0","status":"1"},{"title":"'Don't panic, don't reach border directly': MEA sends message to stranded Indians","content":"<div style=\"text-align:center\">\n<figure class=\"image\" style=\"display:inline-block\"><img alt=\"\" height=\"488\" src=\"https:\/\/images.newindianexpress.com\/uploads\/user\/ckeditor_images\/article\/2022\/2\/28\/students_finall.jpg\" width=\"650\" \/>\n<figcaption>Indian students at a shelter in Poland. (Photo | Twitter\/@sidhant)<\/figcaption>\n<\/figure>\n<\/div>\n\n<p>&quot;We request Indians to go to West Ukraine but don&#39;t reach the border directly as there&#39;s rush there, it&#39;ll take time. Go to nearby cities, seek shelter there. We&#39;re making arrangements there, our teams will help you. Don&#39;t panic, we have enough flights,&quot; stated the MEA. The Indians should go to the border for crossing into neighbouring Poland, Hungary, Slovakia, Romania and Moldova only after coordinating with the authorities, the MEA added.<\/p>\n","date":"2022-02-28 18:13:00","pin":"0","status":"1"},{"title":"Arrangement was perfect, says a student as 6th evacuation flight lands in Delhi","content":"<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\">Delhi| The sixth evacuation flight from Hungary&rsquo;s capital Budapest carrying 240 Indian nationals who were stranded in Ukraine landed at the Delhi airport<br \/>\n<br \/>\nUnion Minister Mukhtar Abbas Naqvi welcomed the Indian nationals at the airport. <a href=\"https:\/\/twitter.com\/hashtag\/OperationGanga?src=hash&amp;ref_src=twsrc%5Etfw\">#OperationGanga<\/a> <a href=\"https:\/\/t.co\/CCC5GfCPxi\">pic.twitter.com\/CCC5GfCPxi<\/a><\/p>\n&mdash; ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1498272705074073608?ref_src=twsrc%5Etfw\">February 28, 2022<\/a><\/blockquote>\n<script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2022-02-28 18:37:20","pin":"0","status":"1"},{"title":"WATCH VIDEO | Ukraine gears up for long battle against Russia","content":"<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\">VIDEO: In a rush to join the fight, Ukrainian reservists are taught combat basics in a town south of Kyiv.<br \/>\n<br \/>\nFull story: <a href=\"https:\/\/t.co\/RiC0z4yC0t\">https:\/\/t.co\/RiC0z4yC0t<\/a> <a href=\"https:\/\/t.co\/1g9RtOOJg8\">pic.twitter.com\/1g9RtOOJg8<\/a><\/p>\n&mdash; The Associated Press (@AP) <a href=\"https:\/\/twitter.com\/AP\/status\/1498258666323066881?ref_src=twsrc%5Etfw\">February 28, 2022<\/a><\/blockquote>\n<script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2022-02-28 18:58:40","pin":"0","status":"1"},{"title":"Russian media sites face cyber hacking","content":"<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\"><a href=\"https:\/\/twitter.com\/hashtag\/BREAKING?src=hash&amp;ref_src=twsrc%5Etfw\">#BREAKING<\/a> Many Russian media sites are hacked. They include News agency TASS, Izvestia, Saint Peterburg local newspaper Fontanka, NGO website Takie Dela, business newspaper Kommersant, online newspaper Znak, Ekaterinburg&#39;s E1 <a href=\"https:\/\/twitter.com\/NewIndianXpress?ref_src=twsrc%5Etfw\">@NewIndianXpress<\/a><\/p>\n&mdash; Yeshi Seli (@YeshiSeli) <a href=\"https:\/\/twitter.com\/YeshiSeli\/status\/1498266671752298497?ref_src=twsrc%5Etfw\">February 28, 2022<\/a><\/blockquote>\n<script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2022-02-28 18:59:17","pin":"0","status":"1"},{"title":"Russia's 'Nuclear Triad' gears up amid tensions with the West","content":"<blockquote class=\"twitter-tweet\" data-conversation=\"none\">\n<p dir=\"ltr\" lang=\"en\"><a href=\"https:\/\/twitter.com\/hashtag\/Breaking?src=hash&amp;ref_src=twsrc%5Etfw\">#Breaking<\/a> Russian Defence Minister Shoigu reports to Putin that, in according with his order, the command of the Strategic Missile Forces, Northern and Pacific Fleets, as well as Long-Range Aviation command have bolstered operations<\/p>\n&mdash; Michael A. Horowitz (@michaelh992) <a href=\"https:\/\/twitter.com\/michaelh992\/status\/1498262989996269568?ref_src=twsrc%5Etfw\">February 28, 2022<\/a><\/blockquote>\n<script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2022-02-28 19:00:19","pin":"0","status":"1"},{"title":"","content":"<blockquote class=\"twitter-tweet\" data-conversation=\"none\">\n<p dir=\"ltr\" lang=\"en\"><a href=\"https:\/\/twitter.com\/hashtag\/BREAKING?src=hash&amp;ref_src=twsrc%5Etfw\">#BREAKING<\/a> Belarus nuclear status shift &#39;very dangerous&#39;: EU&#39;s Borrell <a href=\"https:\/\/t.co\/ArBrxskpFG\">pic.twitter.com\/ArBrxskpFG<\/a><\/p>\n&mdash; AFP News Agency (@AFP) <a href=\"https:\/\/twitter.com\/AFP\/status\/1498270881315012609?ref_src=twsrc%5Etfw\">February 28, 2022<\/a><\/blockquote>\n<script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2022-02-28 19:01:01","pin":"0","status":"1"},{"title":"US suspends diplomatic operations at Belarus","content":"<blockquote class=\"twitter-tweet\" data-conversation=\"none\">\n<p dir=\"ltr\" lang=\"en\"><a href=\"https:\/\/twitter.com\/hashtag\/UPDATE?src=hash&amp;ref_src=twsrc%5Etfw\">#UPDATE<\/a> The United States said Monday it is suspending operations at its embassy in Belarus and allowing the departure of non-emergency staff from the American embassy in Moscow <a href=\"https:\/\/t.co\/XFUpJmPye2\">pic.twitter.com\/XFUpJmPye2<\/a><\/p>\n&mdash; AFP News Agency (@AFP) <a href=\"https:\/\/twitter.com\/AFP\/status\/1498281572793044995?ref_src=twsrc%5Etfw\">February 28, 2022<\/a><\/blockquote>\n<script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2022-02-28 19:02:22","pin":"0","status":"1"},{"title":"Russia closes its airspace to 36 nations","content":"<ul>\n\t<li>Russia has closed its airspace to carriers from 36 nations, including European countries and Canada, responding in kind to their move to close their respective airspaces to all Russian aircraft.<\/li>\n\t<li>The move, announced Monday by the state aviation agency, follows a decision by the EU and Canada over the weekend to close their skies to the Russian planes in response to Moscow&rsquo;s invasion of Ukraine.<\/li>\n\t<li>It added that planes from those countries could only enter Russia&rsquo;s airspace with special permission.<\/li>\n<\/ul>\n","date":"2022-02-28 19:03:31","pin":"0","status":"1"},{"title":"Lavrov cancels Geneva trip","content":"<blockquote class=\"twitter-tweet\" data-conversation=\"none\">\n<p dir=\"ltr\" lang=\"en\"><a href=\"https:\/\/twitter.com\/hashtag\/BREAKING?src=hash&amp;ref_src=twsrc%5Etfw\">#BREAKING<\/a> Russian Foreign Minister Lavrov cancels trip to UN in Geneva due to EU airspace ban: Russian mission <a href=\"https:\/\/t.co\/OKHuIIADsN\">pic.twitter.com\/OKHuIIADsN<\/a><\/p>\n&mdash; AFP News Agency (@AFP) <a href=\"https:\/\/twitter.com\/AFP\/status\/1498289791707889667?ref_src=twsrc%5Etfw\">February 28, 2022<\/a><\/blockquote>\n<script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2022-02-28 19:05:33","pin":"0","status":"1"},{"title":"France preparing to seize Russian assets","content":"<ul>\n\t<li>French Finance Minister Bruno Le Maire says France is getting ready to seize all assets of Russian officials and business leaders who are being targeted by EU sanctions.<\/li>\n\t<li>Le Maire said France is in the process of listing property including financial assets, real estate, yachts and luxury cars.<\/li>\n\t<li>French authorities are also seeking to identify other Russian individuals who could be added into the EU list of people targeted by sanctions due to &ldquo;their proximity with the Russian leadership,&rdquo; he added.<\/li>\n\t<li>&ldquo;We will get legal means to seize all these assets,&rdquo; Le Maire said, speaking after a special defense meeting on Ukraine at the Elysee presidential palace.<\/li>\n\t<li>French Foreign Minister Jean-Yves Le Drian confirmed France will take part in the European effort to bring military equipment to Ukraine, to be sent via a hub in Poland.<\/li>\n\t<li>France will also provide more humanitarian aid to Ukraine in the coming days, he said.<\/li>\n<\/ul>\n","date":"2022-02-28 19:12:23","pin":"0","status":"1"},{"title":"500,000 plus and counting: Europe sees another massive migrant exodus as Russia attacks Ukraine","content":"<p>The mass exodus of refugees from Ukraine to the eastern edge of the European Union showed no signs of stopping Monday as they flee Russia&#39;s burgeoning war, with the U.N. estimating that more than 500,000 people have already escaped. <strong><a href=\"https:\/\/www.newindianexpress.com\/world\/2022\/feb\/28\/500000-plus-and-counting-europe-sees-another-massive-migrant-exodus-as-russia-attacks-ukraine-2424734.html\" target=\"_blank\">(READ FULL STORY HERE)<\/a><\/strong><\/p>\n","date":"2022-02-28 19:25:39","pin":"0","status":"1"},{"title":"With sanctions from US, West, Russian Sberbank faces 'failure' in Europe, Ruble plummets","content":"<p>The European Central Bank said on Monday that Vienna-based Sberbank Europe AG and its branches in Slovenia and Croatia are failing or likely to fail after they &quot;experienced significant deposit outflows&quot; because of the impact to their reputation from the conflict. <strong><a href=\"https:\/\/www.newindianexpress.com\/world\/2022\/feb\/28\/with-sanctions-from-us-west-russian-sberbank-faces-failurein-europeruble-plummets-2424738.html\" target=\"_blank\">(READ FULL STORY HERE)<\/a><\/strong><\/p>\n","date":"2022-02-28 19:41:24","pin":"0","status":"1"},{"title":"Russian mogul uses UK paper for anti-war plea","content":"<ul>\n\t<li>Russia-born media mogul Evgeny Lebedev has used the pages of a British newspaper he owns to implore Russian President Vladimir Putin to end the invasion of Ukraine.<\/li>\n\t<li>London&rsquo;s Evening Standard on Monday features a front-page statement by Lebedev headlined &ldquo;President Putin, please stop this war,&rdquo; alongside an Associated Press photo of medics battling to save a 6-year-old girl killed by shelling in the Ukrainian city of Mariupol. Lebedev wrote: &ldquo;As a Russian citizen I plead with you to stop Russians killing their Ukrainian brothers and sisters.<br \/>\n\tAs a British citizen I ask you to save Europe from war.&rdquo; Lebedev, whose oligarch father Alexander Lebedev once worked for the KGB, was made a member of the House of Lords in 2020.<\/li>\n\t<li>Oligarchs Oleg Deripaska, an ally of Putin, and Mikhail Fridman, who is on a U.S. sanctions list, have also urged an end to the violence.<\/li>\n\t<li>Meanwhile Roman Abramovich, the billionaire Russian owner of Chelsea Football Club, has offered to help broker peace.<\/li>\n\t<li>A spokesman said Abramovich &ldquo;was contacted by the Ukrainian side for support in achieving a peaceful resolution, and that he has been trying to help ever since.&rdquo; It was unclear what help he could provide.<\/li>\n<\/ul>\n","date":"2022-02-28 19:59:27","pin":"0","status":"1"},{"title":"EXPLAINER | Russia-Ukraine War: What to know as Ukraine resists advance","content":"<p>European Union defence ministers were also to meet, to discuss how to get weaponry they have pledged into Ukraine. Meanwhile, Western sanctions triggered by the invasion sent the ruble plummeting, leading Russians to line up at banks and ATMs. <strong><a href=\"https:\/\/www.newindianexpress.com\/world\/2022\/feb\/28\/explainer--russia-ukraine-war-what-to-know-as-ukraine-resists-advance-2424742.html\" target=\"_blank\">(READ THE FULL STORY HERE)<\/a><\/strong><\/p>\n","date":"2022-02-28 20:00:56","pin":"0","status":"1"},{"title":"Battleground Kyiv: Quiet night in Ukraine capital even as Russia tensions flare","content":"<p>President Vladimir Putin dramatically escalated East-West tensions by ordering Russian nuclear forces put on high alert, but the explosions and gunfire that have disrupted life since the start of the invasion appeared to subside around Ukraine&#39;s capital overnight as the Kremlin&#39;s military advances were slowed by an outgunned but determined resistance. <strong><a href=\"https:\/\/www.newindianexpress.com\/world\/2022\/feb\/28\/battleground-kyiv-quiet-night-in-ukraine-capital-even-as-russia-tensions-flare-2424745.html\" target=\"_blank\">(READ FULL STORY HERE)<\/a><\/strong><\/p>\n","date":"2022-02-28 20:02:38","pin":"0","status":"1"},{"title":"Battleground Kyiv: Quiet night in Ukraine capital even as Russia tensions flare","content":"<p>President Vladimir Putin dramatically escalated East-West tensions by ordering Russian nuclear forces put on high alert, but the explosions and gunfire that have disrupted life since the start of the invasion appeared to subside around Ukraine&#39;s capital overnight as the Kremlin&#39;s military advances were slowed by an outgunned but determined resistance. <strong><a href=\"https:\/\/www.newindianexpress.com\/world\/2022\/feb\/28\/battleground-kyiv-quiet-night-in-ukraine-capital-even-as-russia-tensions-flare-2424745.html\" target=\"_blank\">(READ FULL STORY HERE)<\/a><\/strong><\/p>\n","date":"2022-02-28 20:02:44","pin":"0","status":"1"},{"title":"US nationals asked to leave Russia immediately","content":"<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\"><a href=\"https:\/\/twitter.com\/hashtag\/BREAKING?src=hash&amp;ref_src=twsrc%5Etfw\">#BREAKING<\/a> US recommends Americans in Russia leave &#39;immediately&#39;: State Dept <a href=\"https:\/\/t.co\/ojrIhLSHPP\">pic.twitter.com\/ojrIhLSHPP<\/a><\/p>\n&mdash; AFP News Agency (@AFP) <a href=\"https:\/\/twitter.com\/AFP\/status\/1498303955415277582?ref_src=twsrc%5Etfw\">February 28, 2022<\/a><\/blockquote>\n<script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2022-02-28 20:06:52","pin":"0","status":"1"},{"title":"Russian forces face opposition at Ukraine","content":"<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\">Ukraine, Berdiansk.????????<br \/>\nUkrainians shout out &quot;Go home!&quot; to Russian forces, that occupied the town and stand near administrative building!<a href=\"https:\/\/twitter.com\/hashtag\/stoprussia?src=hash&amp;ref_src=twsrc%5Etfw\">#stoprussia<\/a> <a href=\"https:\/\/twitter.com\/hashtag\/warinukraine?src=hash&amp;ref_src=twsrc%5Etfw\">#warinukraine<\/a> <a href=\"https:\/\/t.co\/ymjk5l1rkJ\">pic.twitter.com\/ymjk5l1rkJ<\/a><\/p>\n&mdash; ??? (@ng_ukraine) <a href=\"https:\/\/twitter.com\/ng_ukraine\/status\/1498297757894942725?ref_src=twsrc%5Etfw\">February 28, 2022<\/a><\/blockquote>\n<script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2022-02-28 20:08:11","pin":"0","status":"1"},{"title":"Switzerland adopts EU sanctions against Russia","content":"<ul>\n\t<li>The Swiss president says Russia&rsquo;s attack on Ukraine is &ldquo;unacceptable&rdquo; and Switzerland will adopt European Union sanctions, including asset freezes, targeting Russians &ndash; all but depriving well-heeled Russians of access to one of their favorite havens to park their money.<\/li>\n\t<li>Ignazio Cassis told a news conference Monday that Russia&rsquo;s invasion was intolerable on moral and political grounds. Switzerland&rsquo;s government has been trying to balance its condemnation of Russia&rsquo;s actions with its history of neutrality and as an intermediary between opposing countries.<\/li>\n\t<li>Referring to the Swiss executive body, he added: &ldquo;The Federal Council has decided to take up fully the sanctions of the European Union, including the asset freezes.&rdquo;<\/li>\n\t<li>Switzerland is not a European Union member but is all but surrounded by four EU countries: Austria, France, Germany and Italy.<\/li>\n<\/ul>\n","date":"2022-02-28 20:09:10","pin":"0","status":"1"},{"title":"Switzerland adopts EU sanctions against Russia","content":"<ul>\n\t<li>The Swiss president says Russia&rsquo;s attack on Ukraine is &ldquo;unacceptable&rdquo; and Switzerland will adopt European Union sanctions, including asset freezes, targeting Russians &ndash; all but depriving well-heeled Russians of access to one of their favorite havens to park their money.<\/li>\n\t<li>Ignazio Cassis told a news conference Monday that Russia&rsquo;s invasion was intolerable on moral and political grounds. Switzerland&rsquo;s government has been trying to balance its condemnation of Russia&rsquo;s actions with its history of neutrality and as an intermediary between opposing countries.<\/li>\n\t<li>Referring to the Swiss executive body, he added: &ldquo;The Federal Council has decided to take up fully the sanctions of the European Union, including the asset freezes.&rdquo;<\/li>\n\t<li>Switzerland is not a European Union member but is all but surrounded by four EU countries: Austria, France, Germany and Italy.<\/li>\n<\/ul>\n","date":"2022-02-28 20:20:09","pin":"0","status":"1"},{"title":"","content":"<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\">Ukraine will pay 100,000 hryvnias a month to service members, said the Cabinet of Ministers of Ukraine.<br \/>\n<br \/>\nToday, the Cabinet of Ministers of Ukraine took the relevant decision to pursue presidential decrees ?? <a href=\"https:\/\/t.co\/MHxImORo2O\">https:\/\/t.co\/MHxImORo2O<\/a><\/p>\n&mdash; Defence of Ukraine (@DefenceU) <a href=\"https:\/\/twitter.com\/DefenceU\/status\/1498311779310575622?ref_src=twsrc%5Etfw\">February 28, 2022<\/a><\/blockquote>\n<script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2022-02-28 21:06:53","pin":"0","status":"1"},{"title":"Macron calls Putin","content":"<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\"><a href=\"https:\/\/twitter.com\/hashtag\/France?src=hash&amp;ref_src=twsrc%5Etfw\">#France<\/a>&#39;s President Macron held a phone call with Russian President Putin. The call was made following a request by <a href=\"https:\/\/twitter.com\/hashtag\/Ukraine?src=hash&amp;ref_src=twsrc%5Etfw\">#Ukraine<\/a>&#39;s President Zelensky and in light of the humanitarian situation. <a href=\"https:\/\/t.co\/563G2A42MA\">pic.twitter.com\/563G2A42MA<\/a><\/p>\n&mdash; Michael A. Horowitz (@michaelh992) <a href=\"https:\/\/twitter.com\/michaelh992\/status\/1498314771954872325?ref_src=twsrc%5Etfw\">February 28, 2022<\/a><\/blockquote>\n<script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2022-02-28 21:08:09","pin":"0","status":"1"},{"title":"","content":"<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\">Volodymyr Kravets served in Murmansk in Soviet missile forces in 1959-60 and used to love Russia. Now he&rsquo;s furious they&rsquo;re invading and came to pick up Molotov cocktails.<br \/>\n<br \/>\n&ldquo;I tried to buy a gun but they told me I was too old, I at least want one of these to throw at the fuckers&rdquo; <a href=\"https:\/\/t.co\/Aa83l0eB2u\">pic.twitter.com\/Aa83l0eB2u<\/a><\/p>\n&mdash; Shaun Walker (@shaunwalker7) <a href=\"https:\/\/twitter.com\/shaunwalker7\/status\/1498308464703123458?ref_src=twsrc%5Etfw\">February 28, 2022<\/a><\/blockquote>\n<script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2022-02-28 21:09:02","pin":"0","status":"1"},{"title":"Another setback for Putin","content":"<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\"><a href=\"https:\/\/twitter.com\/hashtag\/BREAKING?src=hash&amp;ref_src=twsrc%5Etfw\">#BREAKING<\/a> IOC withdraws Olympic Order from Vladimir Putin - statement <a href=\"https:\/\/twitter.com\/hashtag\/AFPSports?src=hash&amp;ref_src=twsrc%5Etfw\">#AFPSports<\/a> <a href=\"https:\/\/t.co\/GSP86c2CcH\">pic.twitter.com\/GSP86c2CcH<\/a><\/p>\n&mdash; AFP News Agency (@AFP) <a href=\"https:\/\/twitter.com\/AFP\/status\/1498308222293323777?ref_src=twsrc%5Etfw\">February 28, 2022<\/a><\/blockquote>\n<script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2022-02-28 21:09:57","pin":"0","status":"1"},{"title":"Arab League calls for diplomacy over Ukraine","content":"<ul>\n\t<li>The Arab League has voiced concerns about the war in Ukraine, but it refrained from demanding an end to the Russian invasion.<\/li>\n\t<li>The pan-Arab organization says in a communique Monday it supports all ongoing efforts to resolve the crisis &ldquo;through dialogue and diplomacy.&rdquo;<\/li>\n\t<li>The communique comes after a meeting of representatives of the 22-member Arab League in Cairo. The communique didn&rsquo;t mention Russia, which has close ties with regional powers like Egypt, the United Arab Emirates and Saudi Arabia.<\/li>\n\t<li>Most governments in the Arab regions have avoided criticizing Russia&rsquo;s invasion of Ukraine.<\/li>\n\t<li>The UAE, which holds a temporary seat at the U.N. Security Council, has joined China and India in abstaining during a vote on a U.S. resolution condemning the invasion.<\/li>\n<\/ul>\n","date":"2022-02-28 21:14:01","pin":"0","status":"1"},{"title":"44 injured in Kharkiv fighting","content":"<ul>\n\t<li>Ukrainian authorities say at least 44 people have been wounded in fighting in Ukraine&rsquo;s second-largest city of Kharkiv, and that seven of them died in hospitals.<\/li>\n\t<li>It wasn&#39;t clear if the casualties, which covered the past 24 hours, were all civilians. The state emergencies agency said the casualties could be higher because the damage from Monday&rsquo;s shelling of residential areas is still being assessed.<\/li>\n\t<li>Ukrainian social networks featured videos showing residential quarters hit by a series of powerful explosions amid fighting with Russian forces. The Russian military has consistently denied targeting residential areas despite abundant evidence of shelling of residential buildings, schools and hospitals.<\/li>\n<\/ul>\n","date":"2022-02-28 21:14:36","pin":"0","status":"1"},{"title":"Excerpts of Putin-Macron chat","content":"<blockquote class=\"twitter-tweet\" data-conversation=\"none\">\n<p dir=\"ltr\" lang=\"en\"><a href=\"https:\/\/twitter.com\/hashtag\/BREAKING?src=hash&amp;ref_src=twsrc%5Etfw\">#BREAKING<\/a> Putin tells Macron demilitarisation of Ukraine, Western recognition of Russian sovereignty over Crimea keys to ending fighting: Kremlin <a href=\"https:\/\/t.co\/vcPVYypemp\">pic.twitter.com\/vcPVYypemp<\/a><\/p>\n&mdash; AFP News Agency (@AFP) <a href=\"https:\/\/twitter.com\/AFP\/status\/1498327455970512898?ref_src=twsrc%5Etfw\">February 28, 2022<\/a><\/blockquote>\n<script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2022-02-28 21:34:13","pin":"0","status":"1"},{"title":"Space Agency: Mission with Russia \"unlikely\"","content":"<ul>\n\t<li>The European Space Agency says the planned launch of a joint mission with Russia to Mars this year is now &ldquo;very unlikely&rdquo; due to sanctions linked to the war in Ukraine.<\/li>\n\t<li>Following a meeting of officials from its 22 member states Monday, the agency said in a statement that it was assessing the consequences of sanctions for its cooperation with Russia&rsquo;s Roscosmos space agency.<\/li>\n\t<li>&ldquo;Regarding the ExoMars program continuation, the sanctions and the wider context make a launch in 2022 very unlikely,&rdquo; it said.<\/li>\n\t<li>The launch was already postponed from 2020 due to the coronavirus outbreak and technical problems.<\/li>\n\t<li>The mission&rsquo;s goal is to put a lander on the red planet to help determine whether there has ever been life on Mars.<\/li>\n\t<li>On Saturday, Roscosmos said it was pulling its personnel from the European space port in Kourou, French Guiana.<\/li>\n<\/ul>\n","date":"2022-02-28 21:55:48","pin":"0","status":"1"},{"title":"Ukraine launches process to enrol itself at EU","content":"<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\">The President of <a href=\"https:\/\/twitter.com\/hashtag\/Ukraine?src=hash&amp;ref_src=twsrc%5Etfw\">#Ukraine<\/a> <a href=\"https:\/\/twitter.com\/ZelenskyyUa?ref_src=twsrc%5Etfw\">@ZelenskyyUa<\/a> has just signed a statement on &quot;applying for Ukraine&#39;s membership in the EU.&quot;<a href=\"https:\/\/twitter.com\/hashtag\/UkraineInEUNow?src=hash&amp;ref_src=twsrc%5Etfw\">#UkraineInEUNow<\/a> <a href=\"https:\/\/t.co\/UFTxgWGsQn\">pic.twitter.com\/UFTxgWGsQn<\/a><\/p>\n&mdash; Inna Sovsun (@InnaSovsun) <a href=\"https:\/\/twitter.com\/InnaSovsun\/status\/1498326898149138434?ref_src=twsrc%5Etfw\">February 28, 2022<\/a><\/blockquote>\n<script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2022-02-28 21:58:40","pin":"0","status":"1"},{"title":"Finland to supply weapons to Ukraine","content":"<blockquote class=\"twitter-tweet\" data-conversation=\"none\">\n<p dir=\"ltr\" lang=\"en\"><a href=\"https:\/\/twitter.com\/hashtag\/BREAKING?src=hash&amp;ref_src=twsrc%5Etfw\">#BREAKING<\/a> Finland takes &#39;historic&#39; decision to supply arms to Ukraine: PM <a href=\"https:\/\/t.co\/CEUgSovQUI\">pic.twitter.com\/CEUgSovQUI<\/a><\/p>\n&mdash; AFP News Agency (@AFP) <a href=\"https:\/\/twitter.com\/AFP\/status\/1498338751466070025?ref_src=twsrc%5Etfw\">February 28, 2022<\/a><\/blockquote>\n<script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2022-02-28 22:36:28","pin":"0","status":"1"},{"title":"Ukraine applies to join European Union","content":"<ul>\n\t<li>Ukraine&rsquo;s President Volodymyr Zelenskyy says he has signed an application for Ukraine to join the European Union.<\/li>\n\t<li>The action comes five days after Russia invaded its smaller neighbor, touching off widespread international condemnation and offers of military assistance from the 27-member nation EU and elsewhere.<\/li>\n\t<li>Andrii Sybiha, head of Zelenskyy&rsquo;s office, said on his official Facebook page that the documents &ldquo;are on the way to Brussels.&rdquo;<\/li>\n\t<li>Photos of Zelenskyy were posted in Facebook. He was flanked by Prime Minister Denys Shmyhal and chairman of the parliament Ruslan Stefanchuk. &ldquo;The history is being created now,&quot; the post said.<\/li>\n<\/ul>\n","date":"2022-02-28 22:42:18","pin":"0","status":"1"},{"title":"WATCH | Kyiv faces heavy missile attacks from Russia","content":"<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\">&quot;Kyiv is under heavy missile strikes right now,&quot; <a href=\"https:\/\/twitter.com\/zaborona_media?ref_src=twsrc%5Etfw\">@zaborona_media<\/a> says <a href=\"https:\/\/t.co\/izG6uSaZKq\">pic.twitter.com\/izG6uSaZKq<\/a><\/p>\n&mdash; Alec Luhn (@ASLuhn) <a href=\"https:\/\/twitter.com\/ASLuhn\/status\/1498344212667846659?ref_src=twsrc%5Etfw\">February 28, 2022<\/a><\/blockquote>\n<script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2022-02-28 23:17:11","pin":"0","status":"1"},{"title":"India to help people from neighbouring countries stranded in Ukraine; Air India Express flight to bring back about 182 people on Tuesday","content":"<p>The prime minister made the remarks at a high-level meeting, his second of the day, that was held to review the ongoing efforts under &quot;Operation Ganga&quot; to bring back the Indians stranded in Ukraine, according to the Ministry of External Affairs (MEA). <strong><a href=\"https:\/\/www.newindianexpress.com\/nation\/2022\/feb\/28\/india-to-help-people-from-neighbouring-countries-stranded-in-ukraineair-india-express-flight-to-br-2424772.html\" target=\"_blank\">(READ FULL STORY HERE)<\/a><\/strong><\/p>\n","date":"2022-02-28 23:18:04","pin":"0","status":"1"},{"title":"Air raid sirens sounded at Kyiv","content":"<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"et\">???? Air raid sirens in Kyiv now.<\/p>\n&mdash; Alexander Khrebet\/????????? ?????? (@AlexKhrebet) <a href=\"https:\/\/twitter.com\/AlexKhrebet\/status\/1498351269471211521?ref_src=twsrc%5Etfw\">February 28, 2022<\/a><\/blockquote>\n<script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2022-02-28 23:19:10","pin":"0","status":"1"},{"title":"Russia expelled from football World Cup 2022","content":"<blockquote class=\"twitter-tweet\" data-conversation=\"none\">\n<p dir=\"ltr\" lang=\"en\"><a href=\"https:\/\/twitter.com\/hashtag\/BREAKING?src=hash&amp;ref_src=twsrc%5Etfw\">#BREAKING<\/a> Russia expelled from World Cup following Ukraine invasion - FIFA <a href=\"https:\/\/t.co\/CnJPo4UqGy\">pic.twitter.com\/CnJPo4UqGy<\/a><\/p>\n&mdash; AFP News Agency (@AFP) <a href=\"https:\/\/twitter.com\/AFP\/status\/1498351649529778180?ref_src=twsrc%5Etfw\">February 28, 2022<\/a><\/blockquote>\n<script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2022-02-28 23:20:23","pin":"0","status":"1"},{"title":"China cautions against another cold war","content":"<blockquote class=\"twitter-tweet\" data-conversation=\"none\">\n<p dir=\"ltr\" lang=\"en\"><a href=\"https:\/\/twitter.com\/hashtag\/BREAKING?src=hash&amp;ref_src=twsrc%5Etfw\">#BREAKING<\/a> China tells UN &#39;nothing can be gained&#39; from a new Cold War <a href=\"https:\/\/t.co\/XTqTkvIARx\">pic.twitter.com\/XTqTkvIARx<\/a><\/p>\n&mdash; AFP News Agency (@AFP) <a href=\"https:\/\/twitter.com\/AFP\/status\/1498351834179805189?ref_src=twsrc%5Etfw\">February 28, 2022<\/a><\/blockquote>\n<script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2022-02-28 23:21:17","pin":"0","status":"1"},{"title":"Russia-Ukraine talks to continue","content":"<ul>\n\t<li>The first round of Ukraine-Russia talks aimed at ending the fighting between Moscow and its smaller neighbor concluded with no immediate agreements.<\/li>\n\t<li>An aide to Russian President Vladimir Putin says talks with Ukrainian officials lasted nearly five hours. Vladimir Medinsky headed the Russian delegation in Belarus. He said the two sides &ldquo;found certain points on which common positions could be foreseen.&rdquo;<\/li>\n\t<li>Another round of talks was agreed to, Medinsky said. Mykhailo Podolyak, a top adviser to Ukrainian President Volodymyr Zelenskyy, gave few details except to say that the talks, held near the Ukraine-Belarus border, were focused on a possible cease-fire and that a second round could take place &ldquo;in the near future.&rdquo;<\/li>\n\t<li>&quot;The next meeting will take place in the coming days on the Polish-Belarusian border, there is an agreement to that effect,&rdquo; Medinsky said.<\/li>\n<\/ul>\n","date":"2022-02-28 23:26:44","pin":"0","status":"1"},{"title":"Shell pulls out of energy investments in Russia over war","content":"<ul>\n\t<li>Shell says it pulling out of Russia as President Vladimir Putin&#39;s invasion of Ukraine costs the country&#39;s all-important energy industry foreign investment and expertise.<\/li>\n\t<li>Shell announced its intention Monday to exit its joint ventures with Gazprom and related entities, including its 27. 5 per cent stake in the Sakhalin-II liquefied natural gas facility, its 50 per cent stake in the Salym Petroleum Development and the Gydan energy venture.<\/li>\n\t<li>Shell also intends to end its involvement in the Nord Stream 2 pipeline project.<\/li>\n\t<li>&quot;We are shocked by the loss of life in Ukraine, which we deplore, resulting from a senseless act of military aggression which threatens European security,&quot;&nbsp;said Shell&#39;s chief executive officer, Ben van Beurden.<\/li>\n<\/ul>\n","date":"2022-02-28 23:39:49","pin":"0","status":"1"},{"title":"Turkey moves to restrict entrance to Black Sea","content":"<ul>\n\t<li>Turkish President Recep Tayyip Erdogan insists his country &ldquo;won&rsquo;t give up&rdquo; on its relations with either Russia or Ukraine, but says it will implement an international convention that allows Turkey to shut down the straits at the entrance of the Black Sea to the warships of &ldquo;belligerent countries.&rdquo;<\/li>\n\t<li>The 1936 Montreux Convention gives Turkey the right to bar warships from using the Dardanelles and the Bosporus during wartime. Ukraine has asked Turkey to implement the treaty and bar access to Russian warships.<\/li>\n\t<li>Several Russian ships have already sailed through the straits to the Black Sea in the past weeks and it was not clear how much of an impact Turkey&rsquo;s decision to close down the straits would have on the conflict. The convention, also provides an exception for Black Sea vessels returning to port.<\/li>\n\t<li>Turkey has criticized Russia&rsquo;s military aggression in Ukraine, but has also been trying to balance its close ties to Ukraine with its interests in not upsetting its fragile economic relationship with Russia.<\/li>\n<\/ul>\n","date":"2022-02-28 23:57:16","pin":"0","status":"1"},{"title":"India to send supplies to Ukraine; diaspora in UK mobilises support for Operation Ganga","content":"<p>After a high-level meeting chaired by Prime Minister Narendra Modi that reviewed the efforts to bring back Indians from Ukraine, the Ministry of External Affairs (MEA) said the relief supplies will be sent on Tuesday. <strong><a href=\"https:\/\/www.newindianexpress.com\/nation\/2022\/mar\/01\/india-to-send-supplies-to-ukraine-diasporain-uk-mobilises-support-for-operation-ganga-2424803.html\" target=\"_blank\">(READ FULL STORY HERE)<\/a><\/strong><\/p>\n","date":"2022-03-01 00:16:44","pin":"0","status":"1"},{"title":"Waiting, fearing, singing: A night sheltering in war-hit Ukraine","content":"<p>When the children start crying, the adults start playing Ukrainian folk songs, or make up fairy tales to chase away the fear. Food and water are sometimes scarce. Everyone hopes for peace.<strong><a href=\"https:\/\/www.newindianexpress.com\/world\/2022\/mar\/01\/waiting-fearing-singing-a-night-sheltering-in-war-hit-ukraine-2424797.html\" target=\"_blank\"> (READ FULL STORY HERE)<\/a><\/strong><\/p>\n","date":"2022-03-01 00:18:11","pin":"0","status":"1"},{"title":"One Putin move and behold: West's unity tightens as Ukraine applies for EU membership","content":"<p>Ukraine President Volodymyr Zelenskyy posted photos of himself signing the EU application, a largely symbolic move that could take years to become reality and is unlikely to sit well with Russian President Vladimir Putin, who has long accused the West of trying to pull Ukraine into its orbit. <strong><a href=\"https:\/\/www.newindianexpress.com\/world\/2022\/feb\/28\/one-putin-move-and-behold-wests-unity-tightens-as-ukraine-applies-for-eu-membership-2424791.html\" target=\"_blank\">(READ FULL STORY HERE)<\/a><\/strong><\/p>\n","date":"2022-03-01 00:19:17","pin":"0","status":"1"},{"title":"France moves embassy out of Ukrainian capital","content":"<ul>\n\t<li>France has decided to move its embassy out of the Ukrainian capital, but the French ambassador will remain in the country. French Foreign Minister Jean-Yves Le Drian says the French Embassy, which had been holding out in Kyiv amid war, was being transferred to the western city of Lviv.<\/li>\n\t<li>Le Drian told French television station BFMTV on Monday that Ambassador Etienne de Poncins would remain in Ukraine.<\/li>\n\t<li>Russia invaded its smaller neighbor on Thursday, drawing international condemnation. Asked if the ambassador was under threat in the capital, Le Drian said that &ldquo;the risks and threats were sufficiently important&rdquo; to transfer the embassy&rsquo;s operations to Lviv, not far from the Polish border.<\/li>\n<\/ul>\n","date":"2022-03-01 01:05:42","pin":"0","status":"1"},{"title":"A free-for-all but no crippling cyberattacks in Ukraine war","content":"<p>Russia has some of the best hackers in the world, but in the early days of the war in Ukraine, its ability to create mayhem through malware hasn&rsquo;t had much of a noticeable impact, AP reported.<\/p>\n\n<p>Instead, it&#39;s Ukraine that&#39;s marshalled sympathetic volunteer hackers in an unprecedented collective global effort to make the Kremlin pay for making war on its neighbor.<\/p>\n\n<p>It&rsquo;s a kind of cyber free-for-all that experts say risks escalating a moment already fraught with extraordinary danger after Russian President Vladimir Putin put his nuclear forces on alert.<\/p>\n\n<p><a href=\"https:\/\/www.newindianexpress.com\/world\/2022\/mar\/01\/a-free-for-all-but-no-crippling-cyberattacks-in-ukraine-war-2425003.html\" target=\"_blank\"><strong>Read more<\/strong><\/a><\/p>\n","date":"2022-03-01 06:17:45","pin":"0","status":"1"},{"title":"","content":"<p><strong>Canada mulls new sanctions that prohibit all imports of Russian crude oil<\/strong><\/p>\n","date":"2022-03-01 06:21:18","pin":"0","status":"1"},{"title":"Elon Musk's satellite internet service, Starlink, lands in Ukraine","content":"<p>A shipment of terminals for Elon Musk&#39;s satellite internet service, Starlink, has arrived in Ukraine after one of its ministers personally appealed to the billionaire in the face of Russia&#39;s invasion, AFP reported.<\/p>\n\n<p>&quot;Starlink &ndash; here. Thanks @elonmusk,&quot;&nbsp;Ukraine&#39;s digital minister Mykhailo Fedorov tweeted Monday with a picture of a truck loaded with Starlink terminals.<\/p>\n\n<p><a href=\"https:\/\/www.newindianexpress.com\/world\/2022\/mar\/01\/youre-most-welcome-starlink-internet-gear-lands-in-ukraine-2425004.html\" target=\"_blank\"><strong>Read more<\/strong><\/a><\/p>\n\n<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\">Starlink &mdash; here. Thanks, <a href=\"https:\/\/twitter.com\/elonmusk?ref_src=twsrc%5Etfw\">@elonmusk<\/a> <a href=\"https:\/\/t.co\/dZbaYqWYCf\">pic.twitter.com\/dZbaYqWYCf<\/a><\/p>\n&mdash; Mykhailo Fedorov (@FedorovMykhailo) <a href=\"https:\/\/twitter.com\/FedorovMykhailo\/status\/1498392515262746630?ref_src=twsrc%5Etfw\">February 28, 2022<\/a><\/blockquote>\n<script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>\n\n<p><\/p>\n","date":"2022-03-01 06:32:05","pin":"0","status":"1"},{"title":"Satellite images of Russian troop columns outside Kyiv","content":"<div style=\"text-align:center\">\n<figure class=\"image\" style=\"display:inline-block\"><img alt=\"\" height=\"200\" src=\"https:\/\/images.newindianexpress.com\/uploads\/user\/ckeditor_images\/article\/2022\/3\/1\/Kyiv_AP(1).jpg\" width=\"400\" \/>\n<figcaption>This satellite image provided by Maxar Technologies shows the southern end of a Russian convoy, east of Antonov airport, which is to the northwest of Kyiv, Ukraine, Monday, Feb. 28, 2022.<br \/>\n(Photo | AP)<\/figcaption>\n<\/figure>\n<\/div>\n","date":"2022-03-01 06:44:56","pin":"0","status":"1"},{"title":"US expels a dozen Russian diplomats for 'espionage activities'","content":"<p>The United States said Monday that it was expelling 12 members of Russia&#39;s UN mission from America for being &quot;intelligence operatives,&quot; prompting a furious response from Moscow, which denounced what it called a &quot;hostile move.&quot;<\/p>\n\n<p>&quot;This is a hostile move against our country,&quot; Anatoly Antonov, Russia&#39;s ambassador to Washington, said on Facebook, adding that Moscow was &quot;deeply disappointed&quot; and &quot;totally rejected&quot; the US claims.<\/p>\n\n<p><a href=\"https:\/\/www.newindianexpress.com\/world\/2022\/mar\/01\/us-expels-12-russian-un-staff-for-espionage-activities-2425005.html\" target=\"_blank\"><strong>Read more<\/strong><\/a><\/p>\n","date":"2022-03-01 06:52:24","pin":"0","status":"1"}]}