{"details":[{"title":"Biden says US will release 30 mn oil barrels from strategic reserve","content":"<p>The United States will release 30 million barrels of oil from its Strategic Petroleum Reserve as part of an international effort to stabilize the market after Russia&#39;s invasion of Ukraine, President Joe Biden said Tuesday.<\/p>\n\n<p><img alt=\"\" src=\"https:\/\/images.newindianexpress.com\/uploads\/user\/imagelibrary\/2022\/2\/25\/original\/Joe_Biden_AP_Image.jpg\" \/><\/p>\n\n<p>&quot;I can announce the United States has worked with 30 other countries to release 60 million barrels of oil from reserves around the world. America will lead that effort, releasing 30 million barrels of oil,&quot; Biden told members of Congress in his first State of the Union address, adding that Washington stands &quot;ready to do more, if necessary.&quot;<\/p>\n","date":"2022-03-02 08:11:07","pin":"0","status":"1"},{"title":"NATO chief meets Polish president amid Ukraine crisis","content":"<p>NATO Secretary- General Jens Stoltenberg is meeting Polish President Andrzej Duda at the Lask Air Base in central Poland for talks on the eastern flank&#39;s security, as Russia wages war on Ukraine, just across Poland&#39;s eastern border.<\/p>\n\n<p>Stoltenberg and Duda shook hands early Tuesday at the 32rd Tactical Air Base in Lask, where Polish and NATO fighter jets are based, including F-16s.<\/p>\n\n<p>The United States recently reinforced the eastern flank of NATO&#39;s territory with some 5,000 additional troops.<\/p>\n","date":"2022-03-02 08:19:31","pin":"0","status":"1"},{"title":"1,377 more Indian nationals from Ukraine evacuated","content":"<p>Six flights have now departed for India in the last 24 hours, including the first flights from Poland. Carried back 1,377 more Indian nationals from Ukraine, EAM S Jaishankar said in a tweet.<\/p>\n","date":"2022-03-02 08:23:33","pin":"0","status":"1"},{"title":"We stand with Ukrainian people, says Biden","content":"<p>We, the United States of America, stand with the Ukrainian people, said&nbsp;US President Biden during the State of the Union address.<\/p>\n\n<p>&quot;The US and our allies will defend every inch of NATO territory with full force of our collective power. Ukrainians are fighting back with pure courage. Putin may gain makes gains on the battlefield but he&#39;ll have to continue to pay a high price over the long run,&quot; he said.<\/p>\n\n<p>Putin may circle Kyiv with tanks but he&#39;ll never gain the hearts and souls of the Ukrainian people, and he will never weaken the resolve of the free world, he added.&nbsp;<\/p>\n","date":"2022-03-02 08:36:23","pin":"0","status":"1"},{"title":"World Bank to provide USD 3 billion support package for Ukraine","content":"<p>Amid the deteriorating situation and humanitarian crisis in Ukraine, the World Bank is preparing a USD 3 billion support package for the country in the coming months and the International Monetary Fund (IMF) is soon considering requests for emergency financing.<\/p>\n\n<p>&quot;We are deeply shocked and saddened by the devastating human and economic toll brought by the war in Ukraine. People are being killed, injured, and forced to flee, and massive damage is caused to the country&#39;s physical infrastructure. We stand with the Ukrainian people through these horrifying developments,&quot; read the statement.<\/p>\n\n<p>The statement said that the IMF-World Bank Group are working together to support Ukraine on the financing and policy fronts and are urgently increasing that support.<\/p>\n","date":"2022-03-02 08:38:49","pin":"0","status":"1"},{"title":"Apple pauses all product sales in Russia, limits Apple Pay, other services","content":"<p>American tech giant Apple on Tuesday (local time) paused all product sales in Russia and has limited Apple Pay and other services in the country due to the military operation in Ukraine.<\/p>\n\n<p>&quot;We have paused all product sales in Russia,&quot; the Russian News Agency Sputnik reported citing Apple&#39;s statement.<\/p>\n\n<p>&quot;Last week, we stopped all exports into our sales channel in the country. Apple Pay and other services have been limited. RT News and Sputnik News are no longer available for download from the App Store outside Russia,&quot; read the statement.<\/p>\n\n<p>Earlier, Meta, Google, TikTok and YouTube have blocked Russian state-owned media outlets RT and Sputnik in Europe, Euronews reported.<\/p>\n","date":"2022-03-02 08:45:03","pin":"0","status":"1"},{"title":"Russian-led ISSF bans shooters from Russia, Belarus over Ukraine invasion","content":"<p>The International Shooting Sport Federation (ISSF) has banned shooters from Russia and Belarus from all its events owing to the invasion of Ukraine that has triggered global outrage.<\/p>\n\n<p>The decision came even as a World Cup takes place in Cairo, Egypt where Russian shooters were competing till Tuesday.<\/p>\n\n<p>The statement from ISSF now indicates that they may no longer be able to continue in the event.<\/p>\n\n<p>&quot;Following the respective decision of the International Olympic Committee (IOC) Executive Board and a meeting with the IOC President, the ISSF decided that athletes from the Russian Federation and Belarus will not be allowed to take part in ISSF Championships,&quot; the ISSF said.<\/p>\n\n<p>&quot;This decision entered into force at 16.00 CET (8.30pm IST) on March 1, 2022 and is valid until upon further notice,&quot; it added.<\/p>\n","date":"2022-03-02 09:15:48","pin":"0","status":"0"},{"title":"Russian-led ISSF bans shooters from Russia, Belarus over Ukraine invasion","content":"<p>The International Shooting Sport Federation (ISSF) has banned shooters from Russia and Belarus from all its events owing to the invasion of Ukraine that has triggered global outrage.<\/p>\n\n<p>The decision came even as a World Cup takes place in Cairo, Egypt where Russian shooters were competing till Tuesday.<\/p>\n\n<p>The statement from ISSF now indicates that they may no longer be able to continue in the event.<\/p>\n\n<p>&quot;Following the respective decision of the International Olympic Committee (IOC) Executive Board and a meeting with the IOC President, the ISSF decided that athletes from the Russian Federation and Belarus will not be allowed to take part in ISSF Championships,&quot; the ISSF said.<\/p>\n\n<p>&quot;This decision entered into force at 16.00 CET (8.30pm IST) on March 1, 2022 and is valid until upon further notice,&quot; it added.<\/p>\n","date":"2022-03-02 09:16:17","pin":"0","status":"0"},{"title":"Russian-led ISSF bans shooters from Russia, Belarus over Ukraine invasion","content":"<p>The International Shooting Sport Federation (ISSF) has banned shooters from Russia and Belarus from all its events owing to the invasion of Ukraine that has triggered global outrage.<\/p>\n\n<p>The decision came even as a World Cup takes place in Cairo, Egypt where Russian shooters were competing till Tuesday.<\/p>\n\n<p>The statement from ISSF now indicates that they may no longer be able to continue in the event.<\/p>\n\n<p>&quot;Following the respective decision of the International Olympic Committee (IOC) Executive Board and a meeting with the IOC President, the ISSF decided that athletes from the Russian Federation and Belarus will not be allowed to take part in ISSF Championships,&quot; the ISSF said.<\/p>\n\n<p>&quot;This decision entered into force at 16.00 CET (8.30pm IST) on March 1, 2022 and is valid until upon further notice,&quot; it added.<\/p>\n","date":"2022-03-02 09:16:34","pin":"0","status":"1"},{"title":"Russian-led ISSF bans shooters from Russia, Belarus over Ukraine invasion","content":"<p>The International Shooting Sport Federation (ISSF) has banned shooters from Russia and Belarus from all its events owing to the invasion of Ukraine that has triggered global outrage.<\/p>\n\n<p>The decision came even as a World Cup takes place in Cairo, Egypt where Russian shooters were competing till Tuesday.<\/p>\n\n<p>The statement from ISSF now indicates that they may no longer be able to continue in the event.<\/p>\n\n<p>&quot;Following the respective decision of the International Olympic Committee (IOC) Executive Board and a meeting with the IOC President, the ISSF decided that athletes from the Russian Federation and Belarus will not be allowed to take part in ISSF Championships,&quot; the ISSF said.<\/p>\n\n<p>&quot;This decision entered into force at 16.00 CET (8.30pm IST) on March 1, 2022 and is valid until upon further notice,&quot; it added.<\/p>\n","date":"2022-03-02 09:16:43","pin":"0","status":"0"},{"title":"Indians returning from war-torn Ukraine, at Delhi airport","content":"<p>About 220 students arrived via Istanbul.&nbsp;Union Minister Dr Jitendra Singh received the Indians who returned on a special flight today.<\/p>\n\n<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\"><a href=\"https:\/\/twitter.com\/hashtag\/WATCH?src=hash&amp;ref_src=twsrc%5Etfw\">#WATCH<\/a> &quot;Bharat Mata Ki Jai&quot; chants by Indians returning from war-torn Ukraine, at Delhi airport.<br \/>\n<br \/>\nUnion Minister Dr Jitendra Singh received the Indians who returned on a special flight today. <a href=\"https:\/\/t.co\/GfFPmDC6Kt\">pic.twitter.com\/GfFPmDC6Kt<\/a><\/p>\n&mdash; ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1498863742851088387?ref_src=twsrc%5Etfw\">March 2, 2022<\/a><\/blockquote>\n<script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2022-03-02 09:20:33","pin":"0","status":"1"},{"title":"Russian airborne troops land in Ukraine's second city Kharkiv: Army","content":"<p>Russian airborne troops landed in the eastern Ukrainian city of Kharkiv on Wednesday, the Ukrainian army said, adding that there were immediate clashes.<\/p>\n\n<p>&quot;Russian airborne troops landed in Kharkiv... and attacked a local hospital,&quot; the army said in a statement on messaging app Telegram. &quot;There is an ongoing fight between the invaders and the Ukrainians.&quot;<\/p>\n\n<p>Kharkiv, a largely Russian-speaking city near the Russian border, has a population of around 1.4 million.<\/p>\n\n<p>It has been a target for Russian forces since President Vladimir Putin launched an invasion of Ukraine last Thursday.&nbsp;<\/p>\n","date":"2022-03-02 09:23:43","pin":"0","status":"1"},{"title":"Smriti Irani welcomes Indians from war stuck Ukraine","content":"<p>The Indians evacuated from Ukraine were received by Union Minister Smriti Irani at Delhi airport. She welcomes Indians back home by speaking in regional languages on their return from war-torn Ukraine.&nbsp;<\/p>\n\n<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\"><a href=\"https:\/\/twitter.com\/hashtag\/WATCH?src=hash&amp;ref_src=twsrc%5Etfw\">#WATCH<\/a> | Welcome back home ! Your families are waiting with bated breath. You have shown exemplary courage...Let&#39;s thank the flight crew as well...: Union Minister Smriti Irani welcomes stranded students as they return from war-torn <a href=\"https:\/\/twitter.com\/hashtag\/Ukraine?src=hash&amp;ref_src=twsrc%5Etfw\">#Ukraine<\/a> <a href=\"https:\/\/t.co\/JCGLqT7QM7\">pic.twitter.com\/JCGLqT7QM7<\/a><\/p>\n&mdash; ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1498877616778268672?ref_src=twsrc%5Etfw\">March 2, 2022<\/a><\/blockquote>\n<script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2022-03-02 10:45:17","pin":"0","status":"1"},{"title":"IAF aircraft leaves for Romania to bring back stranded Indians","content":"<p><img alt=\"\" src=\"https:\/\/images.newindianexpress.com\/uploads\/user\/ckeditor_images\/article\/2022\/3\/2\/IAF.jpeg\" \/><\/p>\n","date":"2022-03-02 10:54:10","pin":"0","status":"1"},{"title":"IAF aircraft leaves for Romania carrying humanitarian aid","content":"<p>A C-17 Globemaster aircraft of the Indian Air Force left for Romania on Wednesday morning carrying humanitarian aid to Ukraine.<\/p>\n\n<p>The aircraft is expected to bring back Indians from Romania, who exited war-hit Ukraine through its border crossings. Officials said the aircraft left for Romania early morning.<\/p>\n\n<p>India on Tuesday sent the first tranche of humanitarian assistance comprising medicines and other relief materials to Ukraine via Poland.<\/p>\n\n<p>India had decided to send the relief supplies to Ukraine to help it deal with the humanitarian situation along its border areas with tens of thousands of people attempting to flee the Russian invasion.<\/p>\n\n<p>&quot;The prime minister noted that the first consignment of relief supplies to Ukraine to deal with the humanitarian situation on Ukraine&#39;s borders would be despatched tomorrow,&quot; the Ministry of External Affairs said on Monday.<\/p>\n","date":"2022-03-02 10:57:23","pin":"0","status":"1"},{"title":"China 'extremely concerned' over civilian casualties in Ukraine","content":"<p>China is deeply grieved to see the outbreak of conflict between Ukraine and Russia and &quot;extremely concerned&quot; over the damage done to civilians, Chinese Foreign Minister Wang Yi has told his Ukrainian counterpart Dmytro Kuleba and called on Kyiv and Moscow to resolve the raging crisis through negotiations.<\/p>\n\n<p>The two ministers spoke for the first time on the phone on Tuesday since violence broke out in Ukraine following an attack from Russia.<\/p>\n\n<p>Wang said that the situation in Ukraine has changed rapidly and that China laments the outbreak of the conflict between Ukraine and Russia and is &quot;extremely concerned&quot; with the harm to civilians, China&#39;s state-run Xinhua news agency reported.<\/p>\n","date":"2022-03-02 11:42:07","pin":"0","status":"1"},{"title":"Russia's largest lender Sberbank quits Europe","content":"<p>Russia&#39;s largest lender Sberbank said Wednesday it was quitting the European market after coming under pressure from Western sanctions levelled against the state bank in response to Moscow&#39;s invasion of Ukraine.<\/p>\n\n<p>&quot;In the current environment, Sberbank has decided to withdraw from the European market,&quot; the lender said in a statement carried by Russian news agencies. The bank&#39;s European subsidiaries were facing &quot;abnormal cash outflows and threats to the safety of employees and branches,&quot; the statement added.<\/p>\n","date":"2022-03-02 11:44:56","pin":"0","status":"1"},{"title":"UN court to hold war hearings","content":"<p>The UN&#39;s International Court of Justice says it will hold public hearings on March 7 and 8 over Ukraine&#39;s allegations of &quot;genocide&quot; by Russia.<\/p>\n","date":"2022-03-02 11:46:23","pin":"0","status":"1"},{"title":"'20,000 Indians were stuck in Ukraine'","content":"<p>Around 20,000 Indians were stuck in Ukraine. Of these, 4000 people returned by 24th Feb. Till yesterday, over 2000 more people have returned. We are trying to bring back the remaining Indians via Romania, Poland Hungary, Slovakia and Moldova, said&nbsp;MoS MEA V Muraleedharan.<\/p>\n\n<p><img alt=\"\" src=\"https:\/\/images.newindianexpress.com\/uploads\/user\/imagelibrary\/2022\/2\/24\/original\/Muraleedharan_EPS.jpg\" \/><\/p>\n","date":"2022-03-02 12:11:38","pin":"0","status":"1"},{"title":"Powerful explosions in Kharkiv","content":"<p>Accourding to The Kyiv Independent, sounds of powerful explosions in Kharkiv, Ukraine.<\/p>\n","date":"2022-03-02 12:13:00","pin":"0","status":"1"},{"title":"31 evacuation flights to bring back over 6,300 Indians in coming days","content":"<p>As many as 31 evacuation flights will be operated to neighbouring countries of crisis-hit Ukraine and will bring back more than 6,300 Indians stranded in the eastern European nation, according to official sources. Under &#39;Operation Ganga&#39;, the flights will be operated by Air India, Air India Express, IndiGo, SpiceJet and Indian Air Force.<\/p>\n\n<p>From March 2, 21 evacuation flights will be operated to bring back Indians from Bucharest in Romania, while 4 will be from Budapest in Hungary, the sources said. Further, 4 flights will be operated to bring back people from Rzeszow in Poland and 1 flight from Kocise in Slovakia.<\/p>\n\n<p>Indian Air Force will be bringing back Indians from Bucharest. <a href=\"https:\/\/www.newindianexpress.com\/nation\/2022\/mar\/02\/ukraine-crisis-31-evacuation-flights-to-bring-back-over-6300-indians-in-coming-days-2425410.html\"><strong>(Read more)<\/strong><\/a><\/p>\n\n<p><\/p>\n","date":"2022-03-02 12:41:31","pin":"0","status":"1"},{"title":"Our relations with Russia will continue, says IAF Vice Chief","content":"<p><\/p>\n\n<p>Three IAF aircraft have been sent since morning to evacuate Indians. The evacuation operation will run round the clock. Relief materials are also being sent. The operation is underway in coordination with MEA, said Vice Chief of Air Staff Air Marshal Sandeep Singh.<\/p>\n\n<p>&quot;Our relations with Russia will continue; we know geopolitical situation is currently difficult,&quot; he added.<\/p>\n\n<p><img alt=\"\" src=\"https:\/\/images.newindianexpress.com\/uploads\/user\/ckeditor_images\/article\/2022\/3\/2\/IAF_Vice_chief_Marshal_Sandeep_Singh.jpeg\" \/><\/p>\n","date":"2022-03-02 12:44:54","pin":"0","status":"1"},{"title":"Indians stranded in Ukraine leave for India, via Moldova","content":"<p>Indians stranded in Ukraine leave for India, via Moldova<\/p>\n\n<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\">Indians stranded in <a href=\"https:\/\/twitter.com\/hashtag\/Ukraine?src=hash&amp;ref_src=twsrc%5Etfw\">#Ukraine<\/a> leave for India, via Moldova. <a href=\"https:\/\/t.co\/Z1j90kcFWr\">pic.twitter.com\/Z1j90kcFWr<\/a><\/p>\n&mdash; ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1498917808977358850?ref_src=twsrc%5Etfw\">March 2, 2022<\/a><\/blockquote>\n<script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2022-03-02 12:50:57","pin":"0","status":"1"},{"title":"Google donates $15 mn in relief to Ukraine, blocks RT, Sputnik on YouTube","content":"<p>Tech giant Google has announced $15 million towards relief efforts in Ukraine, in the wake of recent military invasion into the country by Russia.<\/p>\n\n<p>The aid includes $5 million from employee matching campaigns and $5 million in direct grants. The remaining $5 million is raised from advertising credits.<\/p>\n\n<p>&quot;The Russian invasion of Ukraine is both a tragedy and a humanitarian disaster in the making,&quot; Kent Walker, President, Global Affairs at Google, wrote in a blogpost.<\/p>\n\n<p>Walker added that Google teams are working round the clock to support people in Ukraine through &quot;products, defending against cybersecurity threats, ensuring high-quality, reliable information&quot;.<\/p>\n\n<p>Further, the company has also launched an SOS alert on Search across Ukraine.<\/p>\n\n<p>&quot;When people search for refugee and evacuation information, they will see an alert pointing them to United Nations resources for refugees and asylum seekers,&quot; Walker said.<\/p>\n","date":"2022-03-02 12:52:03","pin":"0","status":"1"},{"title":"Russian military claims to have taken control of Ukraine's Kherson","content":"<p>The Russian army claimed on Wednesday it had taken control of the southern Ukrainian city of Kherson as Moscow&#39;s invasion of the pro-Western country went into its seventh day.<\/p>\n\n<p>&quot;The Russian divisions of the armed forces have taken the regional centre of Kherson under full control,&quot; defence ministry spokesman Igor Konashenkov said in televised remarks.&nbsp;<\/p>\n","date":"2022-03-02 12:59:08","pin":"0","status":"1"},{"title":"Union Minister Dr VK Singh posted in Poland to oversee evacuation operations for Indian: PM Modi","content":"<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\">Press Release on the phone call between Prime Minister Narendra Modi and H.E. Andrzej Duda, President of Poland<a href=\"https:\/\/twitter.com\/MEAIndia?ref_src=twsrc%5Etfw\">@MEAIndia<\/a> <a href=\"https:\/\/t.co\/H3e1mgRu7q\">pic.twitter.com\/H3e1mgRu7q<\/a><\/p>\n&mdash; India in Poland and Lithuania (@IndiainPoland) <a href=\"https:\/\/twitter.com\/IndiainPoland\/status\/1498925775566917634?ref_src=twsrc%5Etfw\">March 2, 2022<\/a><\/blockquote>\n<script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2022-03-02 14:45:49","pin":"0","status":"1"},{"title":"Ukraine crisis: Russian military claims to take control of Kherson city","content":"<p>The Russian army claimed on Wednesday it had taken control of the southern Ukrainian city of Kherson as Moscow&#39;s invasion of the pro-Western country entered its seventh day.<\/p>\n\n<p>(<strong><a href=\"https:\/\/www.newindianexpress.com\/world\/2022\/mar\/02\/ukraine-crisis-russian-military-claims-to-take-control-of-kherson-city-2425446.html\" target=\"_blank\">CLICK HERE FOR FULL REPORT<\/a><\/strong>)<\/p>\n","date":"2022-03-02 14:47:02","pin":"0","status":"1"},{"title":"WATCH| No Indian left in Kyiv, 31 evacuation flights to bring back over 6,300 Indians in coming days","content":"<p><iframe allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\" frameborder=\"0\" height=\"375\" src=\"https:\/\/www.youtube.com\/embed\/Nr3q718TKGg\" title=\"YouTube video player\" width=\"100%\"><\/iframe><\/p>\n","date":"2022-03-02 15:00:22","pin":"0","status":"1"},{"title":"Russia 'ready' to continue talks with Ukraine from Wednesday evening","content":"<p style=\"text-align: justify;\">The Kremlin said Wednesday that a Russian delegation was ready to continue peace talks with Ukraine as Moscow&#39;s invasion of the pro-Western country entered its seventh day.<\/p>\n\n<p style=\"text-align: justify;\">&quot;Our delegation will be ready to continue talks,&quot; Kremlin spokesman Dmitry Peskov said, adding that Moscow&#39;s delegation expected the talks to resume Wednesday evening.<\/p>\n","date":"2022-03-02 15:21:45","pin":"0","status":"1"},{"title":"Four killed, nine hurt in Ukraine's Kharkiv: Emergency services","content":"<p>Four people have been killed and another nine wounded during shelling in the eastern Ukrainian city of Kharkiv, the emergencies services said on Wednesday. &quot;Four dead, nine injured,&quot; the services said, citing preliminary information.<\/p>\n","date":"2022-03-02 15:53:01","pin":"0","status":"1"},{"title":"5840 Russian army personnel killed till date: Ukraine Foreign Ministry","content":"<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\">Information on Russian invasion<br \/>\n<br \/>\nLosses of the Russian occupying forces in Ukraine, March 2 <a href=\"https:\/\/t.co\/zx8hozwqS4\">pic.twitter.com\/zx8hozwqS4<\/a><\/p>\n&mdash; MFA of Ukraine ???????? (@MFA_Ukraine) <a href=\"https:\/\/twitter.com\/MFA_Ukraine\/status\/1498966373762048009?ref_src=twsrc%5Etfw\">March 2, 2022<\/a><\/blockquote>\n<script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2022-03-02 16:20:21","pin":"0","status":"1"},{"title":"This Indian restaurant in Ukraine offers shelter and free food to refugees amid rising tensions","content":"<p>While the residents of Ukraine grappled to find proper shelter or food since the day Russia invaded their country, this Indian man,&nbsp;who runs a&nbsp;restaurant in the capital city Kyiv,&nbsp;decided to extend a helping hand by converting his restaurant&nbsp;into a shelter home. He has also been providing free food too to those seeking shelter.<\/p>\n\n<p><strong>(<a href=\"https:\/\/www.newindianexpress.com\/world\/2022\/mar\/02\/this-indian-restaurant-in-ukraine-offers-shelter-and-free-food-to-refugees-amid-rising-tensions-2425457.html\" target=\"_blank\">CLICK HERE FOR FULL REPORT<\/a>)<\/strong><\/p>\n","date":"2022-03-02 16:28:24","pin":"0","status":"1"},{"title":"Nearly 836,000 refugees have fled conflict in Ukraine: United Nations","content":"<p>Nearly 836,000 refugees have now fled the conflict in Ukraine for safety in neighbouring countries, United Nations figures showed Wednesday.<\/p>\n","date":"2022-03-02 16:38:38","pin":"0","status":"1"},{"title":"","content":"<p>UK PM calls on UN members to demand Russia withdraw from Ukraine while EU has banned broadcasts of Russian state media RT, Sputnik and excluded 7 Russian banks from SWIFT under sanctions.<\/p>\n","date":"2022-03-02 17:41:24","pin":"0","status":"1"},{"title":"All Indian nationals must leave Kharkiv immediately: Embassy","content":"<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\">URGENT ADVISORY TO INDIAN STUDENTS IN KHARKIV.<a href=\"https:\/\/twitter.com\/MEAIndia?ref_src=twsrc%5Etfw\">@MEAIndia<\/a> <a href=\"https:\/\/twitter.com\/PIB_India?ref_src=twsrc%5Etfw\">@PIB_India<\/a> <a href=\"https:\/\/twitter.com\/DDNational?ref_src=twsrc%5Etfw\">@DDNational<\/a> <a href=\"https:\/\/twitter.com\/DDNewslive?ref_src=twsrc%5Etfw\">@DDNewslive<\/a> <a href=\"https:\/\/t.co\/2dykst5LDB\">pic.twitter.com\/2dykst5LDB<\/a><\/p>\n&mdash; India in Ukraine (@IndiainUkraine) <a href=\"https:\/\/twitter.com\/IndiainUkraine\/status\/1498986772558196740?ref_src=twsrc%5Etfw\">March 2, 2022<\/a><\/blockquote>\n<script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2022-03-02 17:42:45","pin":"0","status":"1"},{"title":"Navalny calls on Russians to take to the streets against invasion of Ukraine by an 'obviously insane czar'","content":"<p>Jailed Kremlin critic and Russian opposition leader Alexei Navalny has called on all Russians to take to the streets to fight for peace.<\/p>\n\n<p>&quot;I am from the USSR myself. I was born there. And the main phrase from there - from my childhood - was &#39;fight for peace.&#39; I call on everyone to take to the streets and fight for peace,&quot; Navalny said in a series of tweets.<\/p>\n\n<p>&quot;We - Russia - want to be a nation of peace. Alas, few people would call us that now. But let&#39;s at least not become a nation of frightened silent people. Of cowards who pretend not to notice the aggressive war against Ukraine unleashed by our obviously insane czar, &quot; Navalny reportedly tweeted via a spokesperson. (<a href=\"https:\/\/www.newindianexpress.com\/world\/2022\/mar\/02\/navalny-calls-on-russians-to-take-to-the-streets-against-invasion-of-ukraine-by-an-obviously-insane-2425495.html\" target=\"_blank\"><strong>Read More<\/strong><\/a>)<\/p>\n\n<p><\/p>\n","date":"2022-03-02 17:43:19","pin":"0","status":"1"},{"title":"","content":"<p>Government of India sources say evacuation of Indian nationals stranded in Odessa (Ukraine) is happening via Moldova to Romania. This is what we have learnt:<\/p>\n\n<p>&bull;&nbsp;&nbsp; &nbsp;Embassy of India in Romania in coordination with Moldovan authorities is organizing movement of Indian nationals stranded in Odessa (Ukraine) to Bucharest (Romania) via Moldova<br \/>\n&bull;&nbsp;&nbsp; &nbsp;Airspace in Moldova is closed so Indians are being sent to Bucharest<br \/>\n&bull;&nbsp;&nbsp; &nbsp;Embassy is organising two routes for buses - one set of buses for those crossing the Palanca border (Ukraine- Moldova) and being sent directly to Romania without stopping in Moldova.<br \/>\n&bull;&nbsp;&nbsp; &nbsp;Another route for those who are in the camps located in and around the capital Chisin?u.<br \/>\n&bull;&nbsp;&nbsp; &nbsp;The bus services are being provided free of cost<br \/>\n&bull;&nbsp;&nbsp; &nbsp;Since March 01, about 250 students have crossed over to Romania. They have all been sent by buses organised by Embassy directly to Romania (Bucharest) from the border.<br \/>\n&bull;&nbsp;&nbsp; &nbsp;About 80-100 nationals are still left in and around Chisin?u (Capital) and most will be leaving by a bus today (on March 02)<br \/>\n&bull;&nbsp;&nbsp; &nbsp;In Bucharest, Indian Embassy is helping the Indian nationals with flights under Operation Ganga.<br \/>\n&bull;&nbsp;&nbsp; &nbsp;Embassy in coordination with Romanian Authorities, has ensured that no visa is required to exit Romania via special flights.<\/p>\n","date":"2022-03-02 17:53:39","pin":"0","status":"1"},{"title":"WATCH| Bribes in colleges, casteism force bright pupils to go abroad: Slain Indian student's father","content":"<p><iframe allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\" frameborder=\"0\" height=\"375\" src=\"https:\/\/www.youtube.com\/embed\/tRclwzTr1vc\" title=\"YouTube video player\" width=\"100%\"><\/iframe><\/p>\n","date":"2022-03-02 18:26:27","pin":"0","status":"1"},{"title":"Indian Embassy in Ukraine issues second advisory for citizens to leave Kharkiv","content":"<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\">2nd Advisory to Indian Students in Kharkiv<br \/>\n2 March 2022.<a href=\"https:\/\/twitter.com\/MEAIndia?ref_src=twsrc%5Etfw\">@MEAIndia<\/a> <a href=\"https:\/\/twitter.com\/PIB_India?ref_src=twsrc%5Etfw\">@PIB_India<\/a> <a href=\"https:\/\/twitter.com\/DDNewslive?ref_src=twsrc%5Etfw\">@DDNewslive<\/a> <a href=\"https:\/\/twitter.com\/DDNational?ref_src=twsrc%5Etfw\">@DDNational<\/a> <a href=\"https:\/\/t.co\/yOgQ8m25xh\">pic.twitter.com\/yOgQ8m25xh<\/a><\/p>\n&mdash; India in Ukraine (@IndiainUkraine) <a href=\"https:\/\/twitter.com\/IndiainUkraine\/status\/1498999192999632900?ref_src=twsrc%5Etfw\">March 2, 2022<\/a><\/blockquote>\n<script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2022-03-02 18:43:27","pin":"0","status":"1"},{"title":"Mechanism for issuing emergency certificates has been started for those who have lost passports: MEA","content":"<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\">A mechanism for issuing emergency certificates to those who lost their Indian passports has been instituted. I think this will also help many Indian students: Arindam Bagchi, MEA Spokesperson <a href=\"https:\/\/twitter.com\/hashtag\/RussianUkrainianCrisis?src=hash&amp;ref_src=twsrc%5Etfw\">#RussianUkrainianCrisis<\/a> <a href=\"https:\/\/t.co\/LS0dabz6f8\">pic.twitter.com\/LS0dabz6f8<\/a><\/p>\n&mdash; ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1499013149105987592?ref_src=twsrc%5Etfw\">March 2, 2022<\/a><\/blockquote>\n<script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2022-03-02 18:57:44","pin":"0","status":"1"},{"title":"Indian boy lost his life due to natural causes in Ukraine: MEA spokesperson","content":"<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\"><a href=\"https:\/\/twitter.com\/hashtag\/Watch?src=hash&amp;ref_src=twsrc%5Etfw\">#Watch<\/a> | Chandan Jindal, an Indian national in Ukraine&#39;s Vinnytsia lost his life due to natural causes. His family members are also in Ukraine: Arindam Bagchi, MEA spokesperson <a href=\"https:\/\/t.co\/zeH0V9k124\">pic.twitter.com\/zeH0V9k124<\/a><\/p>\n&mdash; ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1499012863872372737?ref_src=twsrc%5Etfw\">March 2, 2022<\/a><\/blockquote>\n<script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2022-03-02 18:58:33","pin":"0","status":"1"},{"title":"Japan extends help as refugee crisis continues to grow; Israel seeks diplomacy to end war","content":"<p>UNHCR spokeswoman Shabia Mantoo said Wednesday that people are continuing to stream into Ukraine&#39;s neighbouring countries to the west, with more than 200,000 fleeing since Tuesday. <strong><a href=\"https:\/\/www.newindianexpress.com\/world\/2022\/mar\/02\/ukraine-crisis-japan-extends-help-as-ukraine-crisis-continues-to-grow-israel-seeks-diplomacy-to-en-2425524.html\" target=\"_blank\">(READ FULL STORY HERE)<\/a><\/strong><\/p>\n","date":"2022-03-02 19:29:49","pin":"0","status":"1"},{"title":"Malta halts 'golden passports' for Russians","content":"<ul>\n\t<li>European Union member Malta says it is suspending the processing of applications from Russian and Belarusian nationals for its so-called &ldquo;golden passport&rdquo; program in the wake of EU sanctions on Russia.<\/li>\n\t<li>The much-criticized program, which grants citizenship or official residence in Malta, was begun as a lucrative source of income for the tiny island nation in 2014.<\/li>\n\t<li>A government statement on Wednesday also noted that nobody who gained citizenship that way has been found to be on the list of sanctioned individuals.<\/li>\n\t<li>It said sanctions now make it impossible to perform due diligence on applicants from Russia and Belarus.<\/li>\n\t<li>Under the program, Maltese passports can be obtained with 600,000 euros ($660,000) and three years of residency or 750,000 euros and 12 months of residency, plus a 700,000-euro purchase of property.<\/li>\n\t<li>But investigative reporting in recent years found that the residency requirement wasn&rsquo;t always fully enforced.<\/li>\n<\/ul>\n","date":"2022-03-02 19:30:48","pin":"0","status":"1"},{"title":"Ukraine envoy receives standing ovation at House of Commons","content":"<ul>\n\t<li>Ukraine&rsquo;s ambassador to the United Kingdom has received a standing ovation from British lawmakers in the House of Commons.<\/li>\n\t<li>Legislators from all parties rose to applaud when Commons Speaker Lindsay Hoyle announced that Ambassador Vadym Prystaiko was in the public gallery for the weekly Prime Minister&rsquo;s questions session.<\/li>\n\t<li>Hoyle said applause was usually banned in the chamber, but &ldquo;the House quite rightly wants to demonstrate our respect and support for your country and its people in the most difficult of times.&rdquo;<\/li>\n\t<li>Prime Minister Boris Johnson said Russian President Vladimir Putin has &ldquo;underestimated the extraordinary fortitude of the Ukrainian people and the unity and resolve of the free world in standing up to his barbarism.&rdquo;<\/li>\n<\/ul>\n","date":"2022-03-02 19:32:07","pin":"0","status":"1"},{"title":"Now Airbus decides to stop maintaining Russian passenger aircraft fleet","content":"<ul>\n\t<li>European plane maker Airbus says it has stopped providing support services to Russian airlines and supplying spare parts to the country.<\/li>\n\t<li>The company said in a statement that the suspension was &ldquo;in line with international sanctions now in place.&rdquo;<\/li>\n\t<li>U.S. rival Boeing has also said it&rsquo;s putting its operations in Moscow on hold, temporarily shutting its Kyiv office and suspending parts, maintenance and technical support for Russian carriers.<\/li>\n\t<li>Airbus and Boeing jets account for the vast majority or Russia&rsquo;s passenger aircraft fleet.<\/li>\n<\/ul>\n","date":"2022-03-02 19:33:14","pin":"0","status":"1"},{"title":"Two Russian banks saved from sanctions","content":"<ul>\n\t<li>The European Union has banned seven Russian banks from the SWIFT global system that underpins cross-border payments. But it spared two financial institutions in Russia because they are key to transactions for EU energy imports.<\/li>\n\t<li><\/li>\n\t<li>The EU left out Gazprombank and Sberbank from its move Wednesday to disconnect parts of the Russian financial industry from the SWIFT secure messaging network.<\/li>\n\t<li>The exemption of those two banks underscores the bloc&rsquo;s reliance on Russian energy and the two financial institutions&rsquo; central role in managing payments for that business.<\/li>\n\t<li>The seven banks targeted by the latest EU sanctions against Russia over its invasion of Ukraine are: Bank Otkritie, Novikombank, Promsvyazbank, Rossiya Bank, Sovcombank, VEB and VTB.<\/li>\n\t<li>Gazprombank and Sberbank are, however, subject to other sets of EU financial sanctions against Russia that began in 2014 when the Kremlin annexed the Ukrainian region of Crimea.<\/li>\n<\/ul>\n","date":"2022-03-02 19:34:13","pin":"0","status":"1"},{"title":"IAEA concerned by Ukraine situation","content":"<ul>\n\t<li>The head of the U.N. nuclear watchdog is warning about the dangers of a war around nuclear power plants, as Russia invades Ukraine.<\/li>\n\t<li>Rafael Grossi told a special meeting of the International Atomic Energy Agency&rsquo;s board of governors on Wednesday that he is &ldquo;gravely concerned&rdquo; by the situation.<\/li>\n\t<li>He said it&rsquo;s &ldquo;the first time a military conflict is happening amid the facilities of a large, established nuclear power program.&rdquo;<\/li>\n\t<li>That includes the decommissioned Chernobyl plant, scene of the world&rsquo;s worst nuclear disaster in 1986.<\/li>\n\t<li>Grossi added, according to a text of his comments provided by the IAEA: &ldquo;It is also imperative to ensure that the brave people who operate, regulate, inspect and assess the nuclear facilities in Ukraine can continue to do their indispensable jobs safely, unimpeded and without undue pressure.&rdquo;<\/li>\n<\/ul>\n","date":"2022-03-02 19:35:15","pin":"0","status":"1"},{"title":"Second Indian student dies in war-torn Ukraine after suffering from brain stroke","content":"<p>Sources close to the family said that Chandan, 22, who was studying at Vinnytsia National Pyrogov Memorial Medical University at Vinnytsia in Ukraine suffered from a stroke on February 2 as he had a clot in the brain. He was admitted to a hospital there and operated upon on February 4 after consent from his family. <strong><a href=\"https:\/\/www.newindianexpress.com\/nation\/2022\/mar\/02\/second-indian-student-dies-in-war-torn-ukraine-after-suffering-from-brain-stroke-2425525.html\" target=\"_blank\">(READ FULL STORY HERE)<\/a><\/strong><\/p>\n","date":"2022-03-02 19:52:21","pin":"0","status":"1"},{"title":"WATCH VIDEO | Ukraine envoy's presser","content":"<blockquote class=\"twitter-tweet\" data-conversation=\"none\">\n<p dir=\"ltr\" lang=\"en\">Ukraine&#39;s Ambassador to India, Dr. Igor Polikha, speaks during a press conference at the Ukraine embassy in New Delhi.<br \/>\nExpress Video | <a href=\"https:\/\/twitter.com\/Shekharyadav02?ref_src=twsrc%5Etfw\">@Shekharyadav02<\/a> <a href=\"https:\/\/t.co\/5u78FzATEq\">pic.twitter.com\/5u78FzATEq<\/a><\/p>\n&mdash; The New Indian Express (@NewIndianXpress) <a href=\"https:\/\/twitter.com\/NewIndianXpress\/status\/1499023195373858818?ref_src=twsrc%5Etfw\">March 2, 2022<\/a><\/blockquote>\n<script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2022-03-02 19:53:38","pin":"0","status":"1"},{"title":"'Minister No': Lavrov embodies Moscow's steely posture at diplomatic front","content":"<p>While President Vladimir Putin single-handedly shapes the country&#39;s foreign policy, Lavrov delivers Moscow&#39;s message with a bluntness uncharacteristic of a diplomat. <strong><a href=\"https:\/\/www.newindianexpress.com\/world\/2022\/mar\/02\/minister-no-lavrov-embodies-moscows-steely-posture-at-diplomatic-front-2425528.html\" target=\"_blank\">(READ FULL STORY HERE)<\/a><\/strong><\/p>\n","date":"2022-03-02 20:01:44","pin":"0","status":"1"},{"title":"Chinese national injured at Ukraine violence","content":"<ul>\n\t<li>China said on Wednesday that one of its citizens was shot and wounded in Ukraine while 2,500 Chinese nationals have been relocated to safer places in the war-torn country.<\/li>\n\t<li>Foreign Ministry spokesperson Wang Wenbin told a media briefing here that one Chinese citizen was shot and wounded in Ukraine on March 1.<\/li>\n\t<li>The Chinese Embassy in Ukraine got in touch with him and he is out of danger, he said. So far 2,500 Chinese nationals have been relocated to safer places, he said, adding that the evacuation efforts were going on in an orderly manner. China has over 6,000 of its nationals stranded in Ukraine.<\/li>\n\t<li>Chinese officials have made efforts to shift them to neighbouring countries to airlift them home.<\/li>\n\t<li>Safe evacuation of Chinese nationals figured in Tuesday&#39;s talks between Foreign Minister Wang Yi and his Ukrainian counterpart Dmytro Kuleba.<\/li>\n\t<li>On China&#39;s position with regard to ensuring the safety of its nationals in Ukraine, Wang urged Ukraine to assume corresponding international responsibilities.<\/li>\n\t<li>The Chinese government attaches great importance to the safety of Chinese nationals in Ukraine and cares about their safety every moment, Wang noted, adding that all Chinese nationals in Ukraine are envoys of China-Ukraine friendship and friends of the Ukrainian people.<\/li>\n\t<li>The process of evacuating overseas Chinese and students from Ukraine is underway, he said, expressing gratitude to the Ukrainian side for support, cooperation and help from the Ukrainian government and society, according to a Chinese Foreign Ministry press release.<\/li>\n\t<li>China appreciates Ukraine&#39;s launch of special evacuation trains for foreign nationals, which is in line with the international humanitarian spirit, Wang said.<\/li>\n\t<li>Wang said he hopes the Ukrainian side will take all necessary measures to ensure the safety of Chinese nationals in Ukraine and continue to provide guarantee and facilitation for their evacuation.<\/li>\n\t<li>According to the release, Kuleba said that it is an important duty for Ukraine to ensure the safety of foreign nationals and that Ukraine pays great attention to China&#39;s concerns and is assisting Chinese students and nationals to evacuate smoothly.<\/li>\n\t<li>Ukraine will continue to ensure the safe evacuation of foreign nationals responsibly, Kuleba added.<\/li>\n<\/ul>\n","date":"2022-03-02 20:03:11","pin":"0","status":"1"},{"title":"India tells citizens to leave Ukraine's second biggest city Kharkiv","content":"<ul>\n\t<li>India is asking its nationals to leave Ukraine&rsquo;s second-largest city of Kharkiv by Wednesday evening, based on information that Indian authorities have received from Russia.<\/li>\n\t<li>External Affairs Ministry spokesman Arindam Bagchi said Indian nationals have been advised to move to three safe zones some 15 kilometers (9 miles) away.<\/li>\n\t<li>Bagchi declined to give details about what information New Delhi had received from Russia, which is invading Ukraine.<\/li>\n\t<li>Bagchi also said nearly 17,000 Indian nationals, mostly students, out of an estimated 20,000, have left Ukraine. India is trying to evacuate the rest to nearby countries.<\/li>\n<\/ul>\n","date":"2022-03-02 20:07:08","pin":"0","status":"1"},{"title":"Kharkiv resident shocked by bombing, damage","content":"<ul>\n\t<li>Videos circulated online of an apparent attack on the regional police and intelligence headquarters in Kharkiv, Ukraine&#39;s second-largest city.<\/li>\n\t<li>It shows a building with its roof blown off and its top floor on fire. Pieces of the five-story building are strewn across adjacent streets.<\/li>\n\t<li>The Ukrainian government&#39;s center for strategic communications released images Wednesday of strikes hitting Kharkiv, with balls of fire lighting up the city skyline over populated areas.<\/li>\n\t<li>Kharkiv resident Marina Boreiko described strikes hitting a neighbouring building Tuesday, and her shock at seeing bodies lying in the rubble.<\/li>\n\t<li>&quot;Today I survived a bombing,&quot;&nbsp;she told The Associated Press, repeatedly choking back tears.<\/li>\n\t<li>&quot;A Russian plane dropped a bomb on the house next door. My boyfriend and I were at home. We felt a strong whistle, and I realized it was flying toward us. We were in the corridor then, and we felt the explosion from there.&quot;<\/li>\n\t<li>As dust rose up, she said, &quot;the first thing I heard was children crying. Our neighbours have three children and the only thing I was thinking about in that moment was, God not them, please, only not them.&quot;<\/li>\n<\/ul>\n","date":"2022-03-02 20:14:31","pin":"0","status":"1"},{"title":"PM to chair high-level meeting on Ukraine issue tonight","content":"<ul>\n\t<li>Prime Minister Narendra Modi has called a high-level meeting on Wednesday night on the Ukraine crisis as India steps up its efforts to evacuate its citizens, mostly students, from the country under attack from Russia.<\/li>\n\t<li>Modi has held a series of meetings since Sunday to spearhead India&#39;s efforts to safely bring back its nationals, asserting that this is his government&#39;s top priority.<\/li>\n\t<li>Earlier in the day, the Indian embassy in Ukraine asked all Indian nationals to leave Kharkiv immediately to safe zones or further westwards.<\/li>\n\t<li>The external affairs ministry has assured that every Indian citizen will be brought back from Ukraine.<\/li>\n<\/ul>\n","date":"2022-03-02 20:30:23","pin":"0","status":"1"},{"title":"Four C-17 planes with 800 Indian evacuees from Ukraine to arrive on Thursday; 100 students enter Poland","content":"<p>India has been evacuating its citizens through special flights from Ukraine&#39;s western neighbours such as Romania, Hungary and Poland as the Ukrainian airspace has been shut since February 24 due to the Russian military offensive. <strong><a href=\"https:\/\/www.newindianexpress.com\/nation\/2022\/mar\/02\/four-c-17-planes-with-800-indian-evacuees-from-ukraine-to-arriveon-thursday-100-students-enter-pol-2425537.html\" target=\"_blank\">(READ FULL STORY HERE)<\/a><\/strong><\/p>\n","date":"2022-03-02 20:50:29","pin":"0","status":"1"},{"title":"'Felt a whistle, realized it was flying toward us': Kharkiv resident shocked by bombing","content":"<p>Videos circulated online of an apparent attack on the regional police and intelligence headquarters in Kharkiv, Ukraine&#39;s second-largest city. It shows a building with its roof blown off and its top floor on fire. <strong><a href=\"https:\/\/www.newindianexpress.com\/world\/2022\/mar\/02\/felt-a-whistle-realized-it-was-flying-toward-us-kharkiv-resident-shocked-by-bombing-2425535.html\" target=\"_blank\">(READ FULL STORY HERE)<\/a><\/strong><\/p>\n","date":"2022-03-02 20:51:37","pin":"0","status":"1"},{"title":"Tough days ahead? Oil prices surge to $110 a barrel as Russia batters Ukraine","content":"<p>The S&amp;P 500 was 0.9% higher in early trading, while Treasury yields jumped to recover a sliver of their steep losses from the past week. Gold receded, and a measure of nervousness among stock investors on Wall Street was holding relatively steady after swinging sharply in recent days. <strong><a href=\"https:\/\/www.newindianexpress.com\/world\/2022\/mar\/02\/tough-days-ahead-oil-prices-surge-to-110-a-barrel-as-russia-batters-ukraine-2425534.html\" target=\"_blank\">(READ FULL STORY HERE)<\/a><\/strong><\/p>\n","date":"2022-03-02 20:53:01","pin":"0","status":"1"},{"title":"Punjab: Parents feel relieved as two sons reach Hungary from Ukraine","content":"<p>Dr Harjinder Singh Jakhu and his doctor-wife Avneet Kaur Jakhu have two sons -- Azamvir Singh Jakhu and Armanvir Singh Jakhu -- who are pursuing medical studies at Kirovohrad in Ukraine. <strong><a href=\"https:\/\/www.newindianexpress.com\/nation\/2022\/mar\/02\/punjab-parents-feel-relieved-as-twosons-reach-hungary-from-ukraine-2425539.html\" target=\"_blank\">(READ FULL STORY HERE)<\/a><\/strong><\/p>\n","date":"2022-03-02 21:09:39","pin":"0","status":"1"},{"title":"Karnataka student's parent says many Indians stuck at Kharkiv Railway station","content":"<p>&quot;My son Amit along with his cousin Suman and others somehow managed to reach the Railway station but is stuck there,&quot; Venkatesh Vaishyar told PTI. <strong><a href=\"https:\/\/www.newindianexpress.com\/states\/karnataka\/2022\/mar\/02\/ukraine-war-karnataka-students-parent-says-many-indians-stuck-at-kharkiv-railway-station-2425540.html\" target=\"_blank\">(READ FULL STORY HERE)<\/a><\/strong><\/p>\n","date":"2022-03-02 21:10:45","pin":"0","status":"1"},{"title":"Aid workers call for humanitarian corridor","content":"<ul>\n\t<li>The World Health Organization says its first shipment of medical supplies for invasion-hit Ukraine will arrive in neighboring Poland on Thursday, calling for a humanitarian corridor to ease delivery in the face of a crisis with &ldquo;ordinary civilians being broken&rdquo; in the fighting.<\/li>\n\t<li>WHO Director-General Tedros Adhanom Ghebreyesus said the shipment includes 36 metric tons (40 U.S. tons) of supplies for trauma care and emergency surgery to help 1,000 patients as well as other supplies to meet the needs of 150,000 people.<\/li>\n\t<li>He said WHO&rsquo;s prepositioned supplies in the capital, Kyiv are currently unavailable. He did not elaborate, but the agency alluded to logistical problems amid the fighting after Russia&rsquo;s invasion on Feb. 24.<\/li>\n\t<li>&ldquo;There is an urgent need to establish a corridor to ensure humanitarian workers and supplies have safe and continuous access to reach people in need,&rdquo; Tedros said.<\/li>\n\t<li>Dr. Jarno Habicht, WHO&rsquo;s country representative in Ukraine, said it was &ldquo;difficult to find drivers&rdquo; to deploy supplies.<\/li>\n\t<li>The agency said some of the supplies include treatment for noncommunicable diseases, insulin, and hypertension medication, as well as things like tetanus antitoxin.<\/li>\n\t<li>The WHO emergencies chief, Dr. Michael Ryan, said other supplies included sutures, skin graft equipment, and &ldquo;equipment for doing amputations, for bone grafting, for bone wiring&hellip;&rdquo;<\/li>\n\t<li>&ldquo;I think this gives you the graphic nature of what&rsquo;s happening,&rdquo; Ryan said. &ldquo;These are ordinary civilians being broken and the health system is going to have to put them back together again.&rdquo;<\/li>\n<\/ul>\n","date":"2022-03-02 21:34:39","pin":"0","status":"1"},{"title":"'Craft Beer' to the rescue of Ukraine","content":"<ul>\n\t<li>Dozens of craft beer brewers in the Czech Republic are joining forces to help Ukraine. More than 40 such breweries will participate in the &ldquo;Drink for Ukraine&rdquo; beer festival at Prague&rsquo;s Congress Center on Saturday.<\/li>\n\t<li>All the brewers will contribute some 100 kinds of beer free of charge for the festival. They will also donate beer rarities that will be auctioned at the festival.<\/li>\n\t<li>All the money from the sales and auction will be sent to the People In Need humanitarian organization that is providing aid for people in Ukraine.<\/li>\n\t<li>The organizers said they were not able to watch the aggression against Ukraine without doing something to help.<\/li>\n\t<li>&ldquo;We help by doing what we know the best &mdash; good beer,&rdquo; festival co-organizer Karolina Chroustovska.<\/li>\n<\/ul>\n","date":"2022-03-02 21:35:51","pin":"0","status":"1"},{"title":"Update from Venice Biennale art exhibition","content":"<ul>\n\t<li>The Venice Biennale art exhibition, which has already seen members of the Russian pavilion quit to protest the invasion of Ukraine, says it&rsquo;s working to make sure the artist representing Ukraine can show his work.<\/li>\n\t<li>Pavlo Makov is due to represent Ukraine with &ldquo;The Fountain of Exhaustion. Acqua Alta&rdquo; at the Biennale, which runs April 23-Nov. 27.<\/li>\n\t<li>In a statement Wednesday, Biennale organizers said they were working to make sure Makov could come to Italy and present his work as planned, as a sign of its solidarity with the people of Ukraine.<\/li>\n\t<li>The festival said it would continue to welcome Russian artists who support freedom of expression and have opposed the invasion, but that official Russian delegations wouldn&rsquo;t be allowed.<\/li>\n\t<li>Last week, the curator and members of the official Russian pavilion quit to protest the war. The festival hailed the decision as a &ldquo;noble act of courage&rdquo; on the part of the Russian artists<\/li>\n<\/ul>\n","date":"2022-03-02 21:37:39","pin":"0","status":"1"},{"title":"Students in Ukraine, parents back home panic as India asks its citizens to leave Kharkiv immediately","content":"<p>The advisory by India asking its citizens to immediately leave war-torn Ukraine&#39;s Kharkiv city panicked the stranded Indian students while their parents back home got glued to the TV and surfed the Internet frantically for updates. <strong><a href=\"https:\/\/www.newindianexpress.com\/nation\/2022\/mar\/02\/students-in-ukraine-parents-back-home-panic-as-india-asks-its-citizens-to-leave-kharkiv-immediately-2425547.html\" target=\"_blank\">(READ FULL STORY HERE)<\/a><\/strong><\/p>\n","date":"2022-03-02 21:43:58","pin":"0","status":"1"},{"title":"US pledges to crack down on Russian oligarchs","content":"<ul>\n\t<li>The U.S. Justice Department says it will crack down on Russian oligarchs and anyone else who violates the sweeping sanctions imposed by the Biden administration in response to the war against Ukraine.<\/li>\n\t<li>Attorney General Merrick Garland on Wednesday announced the creation of Task Force KleptoCapture, a team of federal agents and prosecutors responsible for investigating and prosecuting any violations of new and future sanctions.<\/li>\n\t<li>That includes seizing the assets belonging to oligarchs and others who violate the sanctions, and thwarting any efforts to use cryptocurrency to get around sanctions.<\/li>\n\t<li>Garland said in a statement announcing the sanctions that the Justice Department &ldquo;will leave no stone unturned&rdquo; in investigating and prosecuting &ldquo;those whose criminal acts enable the Russian government to continue this unjust war.&rdquo;<\/li>\n<\/ul>\n","date":"2022-03-02 21:49:30","pin":"0","status":"1"},{"title":"Three boys injured in Russian attacking while playing soccer","content":"<ul>\n\t<li>Three boys wounded by apparent Russian shelling while they were playing soccer Wednesday were rushed into a hospital in the besieged port city of Mariupol.<\/li>\n\t<li>One of the boys had lost his legs, and died soon after arrival, according to an Associated Press reporter at the scene. The other two were rushed into surgery and then intensive care.<\/li>\n\t<li>The boys, all born in 2006, had been playing soccer and hanging out near School No. 29 in Mariupol when the shelling hit, family members told the AP.<\/li>\n\t<li>A woman with severe face injuries from the same strike was also brought to the hospital.<\/li>\n<\/ul>\n","date":"2022-03-02 21:50:21","pin":"0","status":"1"},{"title":"Ukraine war impacting export cargoes, diamond industry unaffected so far","content":"<p>Export cargoes to CIS (Commonwealth of Independent States) countries are impacted due to ongoing war between Russia and Ukraine as no shipping line is willing to take consignments there, exporters&#39; body FIEO said on Wednesday.<strong><a href=\"https:\/\/www.newindianexpress.com\/nation\/2022\/mar\/02\/ukraine-war-impacting-export-cargoes-diamond-industry-unaffected-so-far-2425554.html\" target=\"_blank\"> (READ FULL STORY HERE)<\/a><\/strong><\/p>\n","date":"2022-03-02 22:10:19","pin":"0","status":"1"},{"title":"Amid sanctions, Some Russian oligarchs speak out, cautiously, against Ukraine war","content":"<p>Russia&#39;s war on Ukraine has sent shockwaves through the global community of wealthy Russians, who face sanctions that threaten their London mansions, Mediterranean yachts and children&#39;s places at elite European private schools. Some have begun, albeit tentatively, to speak out, though it may be too little to end the war, or to protect their Western fortunes. <strong><a href=\"https:\/\/www.newindianexpress.com\/world\/2022\/mar\/02\/amid-sanctions-some-russian-oligarchs-speak-out-cautiously-against-ukraine-war-2425551.html\" target=\"_blank\">(READ FULL STORY HERE)<\/a><\/strong><\/p>\n","date":"2022-03-02 22:11:44","pin":"0","status":"1"},{"title":"Ukraine says 21 killed in attack on Kharkiv","content":"<ul>\n\t<li>A Ukrainian official says the advance of Russian troops in Kharkiv has been stopped, but that Russians have responded by shelling the city with heavy rocket launchers and air attacks.<\/li>\n\t<li>&ldquo;Kharkiv today is the Stalingrad of the 21st century,&rdquo; said Oleksiy Arestovich, an adviser to Ukraine President Volodymyr Zelenskyy. Oleg Sinehubov, head of the Kharkiv regional administration, said that over the past 24 hours 21 people were killed and at least 112 were injured by Russians.<\/li>\n\t<li>Explosions on Wednesday thundered on Constitution Square, near the buildings of the City Council and the Palace of Labor. A missile attack also destroyed the building of the regional police department in Kharkiv and the university building, which is located across the street.<\/li>\n\t<li>Arestovich said that several Russian planes were shot down over Kharkiv.<\/li>\n\t<li>The Russians used Iskander missile systems to bombard Ukrainian cities, including Kyiv, Zhytomyr, Kharkiv and Chernihiv.<\/li>\n\t<li>Arestovich said Iskander missile systems can deviate from their target, making them &ldquo;a danger to civilian objects.&quot;<\/li>\n<\/ul>\n","date":"2022-03-02 22:15:56","pin":"0","status":"1"},{"title":"UK PM accuses Putin of committing war crimes","content":"<ul>\n\t<li>British Prime Minister Boris Johnson has accused President Vladimir Putin of committing war crimes in Ukraine.<\/li>\n\t<li>Johnson told lawmakers on Wednesday: &ldquo;What we have seen already from Vladimir Putin&rsquo;s regime in the use of the munitions that they have already been dropping on innocent civilians, in my view, already fully qualifies as a war crime.&rdquo;<\/li>\n\t<li>When asked about Russian attacks on the Babi Yar holocaust memorial in Kyiv and targeting of apartment blocks, Johnson&rsquo;s spokesman said that &ldquo;no one can be in any doubt that what we&rsquo;re seeing daily, almost hourly now, are horrific acts that would certainly appear to be war crimes.&rdquo;<\/li>\n\t<li>The chief prosecutor of the International Criminal Court said Monday that he plans to open an investigation &ldquo;as rapidly as possible&rdquo; into possible war crimes and crimes against humanity in Ukraine.<\/li>\n<\/ul>\n","date":"2022-03-02 22:16:54","pin":"0","status":"1"},{"title":"22 more Belarus officials face sanctions","content":"<ul>\n\t<li>The European Union has slapped 22 more Belarus officials with sanctions and is slated to impose additional sanctions on Russia&rsquo;s ally for its involvement in the invasion of Ukraine.<\/li>\n\t<li>The EU already punished 20 Belarus officials last week when it imposed unprecedented sanctions on Russia itself. Now 22 more have been added.<\/li>\n\t<li>The EU is set to expand economic sanctions either later Wednesday or Thursday.<\/li>\n\t<li>The 27 nation bloc has sanctioned some 200 Belarus officials over the past years linked to what it saw were fraudulent elections to keep authoritarian President Alexander Lukashenko in office two years ago and added more sanctions last June when a passenger jet was diverted to arrest a dissident journalist.<\/li>\n<\/ul>\n","date":"2022-03-02 22:18:28","pin":"0","status":"1"},{"title":"Up to President Volodymyr Zelenskyy on whether he should leave Ukraine: Biden","content":"<ul>\n\t<li>Speaking outside the White House Wednesday, President Joe Biden said that it was up to President Volodymyr Zelenskyy on whether he should leave Ukraine, and said it was a decision for NATO whether to keep troops permanently stationed in Poland and other nearby countries.<\/li>\n\t<li>When asked whether he felt Russian President Vladimir Putin was committing war crimes he said: &ldquo;We are following very closely,&rdquo; but that the Russians were deliberately targeting civilian areas.<\/li>\n\t<li>A devout Catholic, Biden had ashes on his forehead to mark Ash Wednesday, the start of Lent. And he seconded Pope Francis&rsquo; calls for prays for Ukraine.<\/li>\n\t<li>&ldquo;I was with the Cardinal this morning &mdash; he came over to give me ashes and we both prayed for that, for the people of Ukraine,&rdquo; Biden said.<\/li>\n<\/ul>\n","date":"2022-03-02 22:20:27","pin":"0","status":"1"},{"title":"'At border, Ukrainian soldiers treated us like puppets', says Indian student","content":"<p>The woman, who was enrolled in the MBBS course at Ternopil National Medical University in Ukraine, said fifty or sixty of them hired a bus from Ternopil on February 26 to reach the Poland border as Russia launched a military offensive against Ukraine. <strong><a href=\"https:\/\/www.newindianexpress.com\/nation\/2022\/mar\/02\/at-border-ukrainian-soldiers-treated-uslike-puppets-says-indian-student-2425558.html\" target=\"_blank\">(READ FULL STORY HERE)<\/a><\/strong><\/p>\n","date":"2022-03-02 22:31:55","pin":"0","status":"1"},{"title":"Ukraine diplomat praised at UN","content":"<ul>\n\t<li>A top Ukrainian diplomat received a standing ovation from diplomats after a heartfelt speech Wednesday to the U.N.&rsquo;s top human rights body, calling on the Human Rights Council to help hold Russia&rsquo;s government accountable by creating a panel of experts to scrutinize the invasion of Ukraine.<\/li>\n\t<li>Speaking by video from Kyiv, Emine Dzhaparova, Ukraine&rsquo;s first deputy minister of foreign affairs, described being awoken by the sound of an explosion on Feb. 24 as the invasion began. She said her government was &ldquo;fully operational&rdquo; and lashed out at &ldquo;false claims&rdquo; by Russian President Vladimir Putin that Ukraine was committing &ldquo;genocide.&rdquo;<\/li>\n\t<li>&ldquo;Do you know how Russia treats and deals with genocide in Ukraine? By airstrikes using cruise and operational tactical missiles, tanks and artillery, reconnaissance groups and sabotage groups,&rdquo; she said.<\/li>\n\t<li>&ldquo;Ukrainian babies are born in the bomb shelters in bunkers &hellip; As we speak here today, Russian armed forces keep attacking maternity wards, kindergartens, orphanages, hospitals.&rdquo;<\/li>\n\t<li>Dzhaparova noted an &ldquo;urgent debate&rdquo; at the council about the situation in Ukraine, calling for countries in the 47-member-state body&rsquo;s to set up a Commission of Inquiry &ndash; the council&rsquo;s most powerful tool to scrutinize human rights violations and abuses.<\/li>\n<\/ul>\n","date":"2022-03-02 22:45:38","pin":"0","status":"1"},{"title":"Ukraine fields reserve troops","content":"<ul>\n\t<li>Amid the sounds of shelling, Ukrainian reservists &mdash; some wearing civilian clothes and carrying rifles &mdash; have set up checkpoints in the road to stop vehicles.<\/li>\n\t<li>Andrey Goncharuk, 68, is a pensioner who said there might be good people among those invading Ukraine but that doesn&rsquo;t matter to him because they weren&rsquo;t invited.<\/li>\n\t<li>&ldquo;They have come to kill my people,&rdquo; he said. He said he was prepared to take weapons from enemies killed in combat.<\/li>\n\t<li>&ldquo;In my old age, I had to take up arms. I have this rifle. We will try to get (more) weapons even if they don&rsquo;t bring them to us. We&rsquo;ll do it ourselves. We&rsquo;ll kill (the) enemy and take their weapons,&rdquo; he said.<\/li>\n<\/ul>\n","date":"2022-03-02 22:46:19","pin":"0","status":"1"},{"title":"India abstains on UNGA resolution that deplores Russia's aggression against Ukraine","content":"<p>India abstained in the 193-member UN General Assembly on a resolution that strongly deplored Russia&#39;s aggression against Ukraine, the third abstention in less than a week by the country in the world body on resolutions on the escalating crisis between Moscow and Kyiv. <strong><a href=\"https:\/\/www.newindianexpress.com\/nation\/2022\/mar\/02\/india-abstains-on-unga-resolution-that-deplores-russias-aggression-against-ukraine-2425561.html\" target=\"_blank\">(READ FULL STORY HERE)<\/a><\/strong><\/p>\n","date":"2022-03-02 22:54:45","pin":"1","status":"1"},{"title":"Close to 500 Russian troopers killed: Moscow","content":"<ul>\n\t<li>The spokesman of the Russian Defense Ministry says 498 Russian troops have been killed in Ukraine and 1,597 more sustained wounds.<\/li>\n\t<li>Maj. Gen. Igor Konashenkov on Wednesday rejected reports about &ldquo;incalculable losses&rdquo; of the Russians as &ldquo;disinformation&rdquo; and revealed Russia&rsquo;s military casualties in Ukraine for the first time since the start of the invasion last Thursday.<\/li>\n\t<li>He assured that families of those killed are receiving all necessary assistance. Konashenkov also said that neither conscripts, nor cadets have been involved in the operation in Ukraine, dismissing media reports alleging otherwise.<\/li>\n\t<li>Konashenkov also said more than 2,870 Ukrainian troops have been killed and some 3,700 more sustained injuries, while 572 others have been captured by the Russians.<\/li>\n\t<li>Ukrainian officials have not yet commented on the claim and it could not be immediately verified.<\/li>\n<\/ul>\n","date":"2022-03-02 23:05:15","pin":"0","status":"1"},{"title":"France to cut science ties with Russia","content":"<ul>\n\t<li>France&rsquo;s National Center for Scientific Research, a huge state-run network of scientists across the country, is suspending all new collaboration with Russian counterparts.<\/li>\n\t<li>In its announcement Wednesday, the CNRS, as it is known, strongly condemned Russia&rsquo;s invasion of Ukraine.<\/li>\n\t<li>&ldquo;It is unacceptable that in the 21st century such a conflict could see the light of day within Europe,&rdquo; a statement said.<\/li>\n\t<li>It acknowledged that its own move was exceptional because &ldquo;science has no borders,&rdquo; but added that shared scientific values &ldquo;cannot tolerate this war.&rdquo;<\/li>\n\t<li>The CNRS praised the courage of &ldquo;several hundred&rdquo; Russian scientists who have spoken out against their country&rsquo;s aggression.<\/li>\n\t<li>It assured that Russian scientists currently working in its labs can continue their activities.<\/li>\n\t<li>The CNRS said it is ready to take in Ukrainian researchers under the Pause program which provides emergency funds from the Ministry of Higher Education to help Ukrainian scientists in danger.<\/li>\n<\/ul>\n","date":"2022-03-02 23:06:11","pin":"0","status":"1"},{"title":"Bulgaria to expel Russian diplomats","content":"<ul>\n\t<li>Bulgaria&rsquo;s foreign ministry says two Russian diplomats accused of spying by Bulgarian prosecutors will be expelled from the country.<\/li>\n\t<li>An official note in which Bulgaria declares the two diplomats &ldquo;persona non grata&rdquo; was handed to the Russian Embassy.<\/li>\n\t<li>They have been given 48 hours to leave the country. Earlier on Wednesday, the prosecution announced that a pre-trial investigation established that they allegedly had carried out &ldquo;unregulated intelligence activities, incompatible with their diplomatic status.&rdquo;<\/li>\n\t<li>It added that the suspects could not be charged with espionage because of their diplomatic immunity.<\/li>\n\t<li>The prosecution said also a Bulgarian army retired general has been taken into custody and faces charges of espionage.<\/li>\n\t<li>He is accused that as a Defense Ministry employee he had passed NATO-related classified information to Russian diplomats.<\/li>\n\t<li>Bulgaria, Moscow&rsquo;s closest ally during the Cold War, has expelled nine Russian diplomats for suspected spying over the last couple of years.<\/li>\n<\/ul>\n","date":"2022-03-02 23:07:07","pin":"0","status":"1"},{"title":"Modi speaks to Putin, discusses safe evacuation of Indians from conflict zones","content":"<p>Prime Minister Narendra Modi spoke to Russian President Vladimir Putin on Wednesday and discussed the safe evacuation of the Indian nationals from the conflict areas in Ukraine. An official statement said the two leaders reviewed the situation in Ukraine, especially in Kharkiv city where many Indian students are stuck. <strong><a href=\"https:\/\/www.newindianexpress.com\/nation\/2022\/mar\/02\/ukraine-war-modi-speaks-to-putindiscusses-safe-evacuation-of-indians-from-conflict-zones-2425562.html\" target=\"_blank\">(READ FULL STORY HERE)<\/a><\/strong><\/p>\n","date":"2022-03-02 23:17:55","pin":"0","status":"1"},{"title":"Ukraine, Russia to hold talks on Thursday","content":"<ul>\n\t<li>A top aide for Russian President Vladimir Putin says Ukrainians are on their way to Belarus for talks that have been scheduled for Thursday.<\/li>\n\t<li>&ldquo;As far as I know, the Ukrainian delegation has already departed from Kyiv, is en route ... We&rsquo;re expecting them tomorrow,&rdquo; Vladimir Medinsky, the head of the Russian delegation, told reporters Wednesday evening According to Medinsky, the two sides agreed on the Brest region of Belarus, which borders Poland, as the site of the talks.<\/li>\n\t<li>Ukraine President Volodymyr Zelenskyy&#39;s office confirmed to The Associated Press that the delegation is on its way, but gave no details on the time of the arrival.<\/li>\n<\/ul>\n","date":"2022-03-02 23:34:37","pin":"0","status":"1"},{"title":"Albania to give shelter to Ukraine footballers' families","content":"<ul>\n\t<li>The Albanian Football Federation has denounced Russia&rsquo;s invasion of Ukraine and will offer shelter to Ukrainian players&rsquo; families.<\/li>\n\t<li>The federation passed a resolution at its assembly on Wednesday in support of the Ukrainian people.<\/li>\n\t<li>&ldquo;Stop to military violence and occupation! Stop to the war that brings only destruction and victims! Respect to Ukraine&rsquo;s sovereignty!&rdquo; said that resolution.<\/li>\n\t<li>The federation is in contact with its Ukraine&rsquo;s counterpart to offer shelter to some players&rsquo; families &ldquo;in a sign of human support and solidarity.&rdquo;<\/li>\n\t<li>A few days earlier Albania&rsquo;s government joined the wave of European opposition to playing any sports games against Russia following the invasion of Ukraine.<\/li>\n\t<li>Albania is among the few national teams in men&rsquo;s soccer with games scheduled against Russia in official competitions.<\/li>\n\t<li>Albania was due to host Russia in Tirana on June 2 in the group stage of the UEFA Nations League competition.<\/li>\n<\/ul>\n","date":"2022-03-02 23:35:52","pin":"0","status":"1"},{"title":"4,800 Indian students to be evacuated from Romania in 24 flights by Friday: Scindia","content":"<p>The minister, who is in Bucharest to facilitate the evacuation of Indian students, said he will be going to Siret, the border check point with Ukraine, on Thursday and remain there for around 48 hours. <strong><a href=\"https:\/\/www.newindianexpress.com\/nation\/2022\/mar\/02\/4800-indian-students-to-be-evacuated-from-romania-in-24-flights-by-friday-scindia-2425576.html\" target=\"_blank\">(READ FULL STORY HERE)<\/a><\/strong><\/p>\n","date":"2022-03-02 23:44:02","pin":"0","status":"1"},{"title":"US hits Russia, Belarus with new sanctions","content":"<ul>\n\t<li>The White House has announced additional sanctions against Russia and its ally Belarus, including extending export controls that target Russian oil refining and entities supporting the Russian and Belarusian military.<\/li>\n\t<li>Among Wednesday&#39;s new measures are sanctions targeting 22 Russia defense entities that make combat aircraft, infantry fighting vehicles, electronic warfare systems, missiles, and unmanned aerial vehicles for Russia&rsquo;s military.<\/li>\n\t<li>The U.S. Commerce Department also announced additional export controls on oil and gas extraction equipment that would hurt Russia&rsquo;s refining capacity over the long term.<\/li>\n\t<li>The Biden administration, and Western allies, have largely stayed away from hitting the Russian energy sector to avoid causing tremors to the global supply of energy.<\/li>\n\t<li>The White House, however, said in a statement that U.S. and allies &ldquo;share a strong interest in degrading Russia&rsquo;s status as a leading energy supplier over time.&rdquo;<\/li>\n\t<li>The latest sanctions imposed on Wednesday include the U.S. closing off its air space to all Russian flights. President Joe Biden previewed that he would making the move in his State of the Union address on Tuesday evening.<\/li>\n<\/ul>\n","date":"2022-03-03 00:37:42","pin":"0","status":"1"},{"title":"Israel PM speaks with Putin","content":"<ul>\n\t<li>Israel&rsquo;s prime minister spoke by phone with Russian President Vladimir Putin, shortly after a call with Ukrainian President Volodymyr Zelenskyy, Israeil officials said.<\/li>\n\t<li>Prime Minister Naftali Bennett&rsquo;s office confirmed that the calls with the Russian and Ukrainian leaders took place but provided no further details. Israel has close relations with both countries and has acted as an intermediary between the two countries.<\/li>\n\t<li>Israeli media reported that that Zelenskyy repeated Ukraine&rsquo;s request for Israeli military equipment, but that Bennett said Israel wouldn&rsquo;t give Ukraine anything that could potentially be used by the military. Bennett&rsquo;s office did not respond to requests for comment.<\/li>\n\t<li>Earlier in the day, Zelenskyy&rsquo;s official Facebook page posted a Hebrew translation of his remarks, in which he called on &ldquo;all Jews of the world&rdquo; not to remain silent about Russia&rsquo;s invasion.<\/li>\n\t<li>Israel has largely refrained from taking actions to anger Moscow, in part because it relies on Russia for security coordination in neighboring Syria, where Russia maintains a military presence supporting President Bashar Assad, and where Israel frequently carries out airstrikes targeting Iranian forces and their Lebanese proxies.<\/li>\n\t<li>Israel has denounced Russia&rsquo;s invasion of Ukraine, but has also offered to act as broker for cease-fire talks.<\/li>\n\t<li>In addition, Israel&rsquo;s Foreign Ministry says it is weighing sending additional humanitarian aid to Ukraine, after having dispatched 100 tons of supplies this week.<\/li>\n\t<li>It says it is also evaluating the possibility of setting up a field hospital in Ukraine.<\/li>\n<\/ul>\n","date":"2022-03-03 00:38:52","pin":"0","status":"1"},{"title":"International Criminal Court to probe Russia over Ukraine invasion","content":"<ul>\n\t<li>A pretrial panel of International Criminal Court judges has been assigned to evaluate an upcoming request to open an investigation into alleged war crimes and crimes against humanity in Ukraine.<\/li>\n\t<li>The court took the procedural step Wednesday to be ready when Prosecutor Karim Khan files the request. He announced his intention on Monday to launch an investigation dating back to 2013 but also including &ldquo;any new alleged crimes falling within the jurisdiction of my office that are committed by any party to the conflict&rdquo; that erupted following Russia&rsquo;s invasion of Ukraine.<\/li>\n\t<li>There have been widespread reports of Russian military strikes killing civilians in Ukraine.<\/li>\n\t<li>The court says in a statement that the pretrial chamber &ldquo;will have to consider whether there is a reasonable basis to proceed with an investigation, upon examination of the Prosecutor&rsquo;s request and the supporting material.&rdquo;<\/li>\n\t<li>Canada and Lithuania have both said they plan to ask him to investigate alleged crimes in Ukraine. If they do, Khan can open an investigation without first seeking approval from judges.<\/li>\n<\/ul>\n","date":"2022-03-03 00:40:02","pin":"0","status":"1"},{"title":"US says Russian convoy is stalled outside Kyiv","content":"<ul>\n\t<li>A senior U.S. defense official says the Russian convoy still appears to be stalled outside the city center of Kyiv, and has made no real progress in the last couple days.<\/li>\n\t<li>The official on Wednesday said the convoy is still plagued with fuel and food shortages and logistical problems, as well as facing continued fierce resistance from Ukrainians.<\/li>\n\t<li>He said there has been an increase in the number of missiles and artillery targeting the city, suggesting the Russians are trying to make a more aggressive move to try and take the city.<\/li>\n\t<li>The official, who spoke on condition of anonymity to discuss military assessments, said Russians have not been able to achieve air superiority and Ukrainian air defenses remain operable and their aircraft continue to fly.<\/li>\n\t<li>The official said that about 82% of the Russian troops that had been arrayed around Ukraine are now inside the country &mdash; just a slight uptick over the last 24 hours, and that Russia has launched more than 450 missiles at various targets in the country.<\/li>\n\t<li>In other areas of the country, the U.S. official said that the U.S. is seeing preliminary indications that Russian forces are going to try to move south towards Mariupol from Donetsk, in what appears to be an effort to encircle the city.<\/li>\n<\/ul>\n","date":"2022-03-03 01:04:26","pin":"0","status":"1"},{"title":"European Union finance ministers meet again","content":"<ul>\n\t<li>European Union finance ministers on Wednesday convened for the second time in less than a week to weigh the likely impact on Europe of the full-scale Russian military assault on Ukraine, a country that borders the bloc&rsquo;s eastern flank.<\/li>\n\t<li>Policymakers are scrambling to recalculate economic projections made less than a month ago, when the European Commission &mdash; the EU&rsquo;s executive arm &mdash; predicted the bloc&rsquo;s economic growth would slow from 5.3% last year to 4% this year and 2.8% in 2023.<\/li>\n\t<li>Top European commissioners said on Wednesday those figures are too optimistic because the conflict in Ukraine will probably stoke rises in energy prices, financial-market turbulence, supply-chain bottlenecks and a weakening of consumer confidence.<\/li>\n\t<li>&ldquo;We don&rsquo;t expect the recovery to be derailed completely but to be weakened,&rdquo; said European Commissioner for Economy Paolo Gentiloni.<\/li>\n\t<li>The gloomier outlook has also raised the prospect of a prolonged period of unrestrained spending by member countries to support their economies.<\/li>\n<\/ul>\n","date":"2022-03-03 01:05:18","pin":"0","status":"1"},{"title":"Ukraine crisis: IAF's first evacuation flight with 200 Indians lands in Delhi","content":"<p>The Indian Air Force&#39;s first evacuation flight with 200 Indians from Romanian capital Bucharest landed at the Hindon air base here in the early hours of Thursday, sources said. The first flight -- which was conducted using C-17 military transport aircraft -- landed in Delhi at 1.30 am. <strong><a href=\"https:\/\/www.newindianexpress.com\/nation\/2022\/mar\/03\/ukraine-crisis-iafs-first-evacuation-flight-with-200-indians-lands-in-delhi-2425644.html\" target=\"_blank\">(READ FULL STORY HERE)<\/a><\/strong><\/p>\n","date":"2022-03-03 01:45:40","pin":"0","status":"1"},{"title":"Powerful explosion outside Kyiv","content":"<p>Ukrainian officials have reported a powerful explosion in Kyiv, between the Southern Railway station and the Ibis hotel, an area near Ukraine&#39;s Defense Ministry.<\/p>\n\n<p>Ukraine President Volodymyr Zelenskyy&#39;s office told The Associated Press on Wednesday night that it was a missile strike.<\/p>\n\n<p>Officials said it wasn&#39;t immediately clear how damaging the strike was, whether there were any casualties or where exactly the missile hit.<\/p>\n","date":"2022-03-03 02:50:15","pin":"0","status":"1"},{"title":"US Secretary of State Antony Blinken to visit Baltic states this week amid Ukraine war","content":"<ul>\n\t<li>US Secretary of State Antony Blinken this week will visit six European countries, including the Baltic states and Moldova, which are on particular edge as Russia intensifies its war in Ukraine.<\/li>\n\t<li>The State Department says Blinken will travel Thursday to Belgium for a meeting of NATO foreign ministers before heading to the Polish border with Ukraine to meet refugees, and then Moldova, Lithuania, Latvia and Estonia.<\/li>\n\t<li>Poland and the three Baltics are members of NATO and fall under its Article 5 defense provisions, which means the allies are bound to defend them if they are attacked.<\/li>\n\t<li>Given their location immediately adjacent to Russia, they are believed to be at special risk should the Ukraine conflict spread.<\/li>\n\t<li>Western-leaning Moldova is not a NATO member but has relations with the alliance and has long objected to the presence of Russian troops in the disputed territory of Transnistria.<\/li>\n\t<li>As the Russian invasion of Ukraine has picked up steam, most NATO members, including the Baltics, have steadily increased military and financial assistance to Kyiv even as Russian President Vladimir Putin has warned of reprisals for any nation that interferes in what he calls a ?special military operation.<\/li>\n\t<li>Ukraine&#39;s President Volodymyr Zelenskyy has decried Russia&#39;s escalation of attacks on crowded cities as a blatant terror campaign.<\/li>\n<\/ul>\n","date":"2022-03-03 02:51:02","pin":"0","status":"1"}]}