{"details":[{"title":"Kyiv column 'stalled'","content":"<p>A senior US defence official says the massive column of Russian military vehicles amassed north of Kyiv has &quot;stalled&quot; due to fuel and food shortages, and Ukrainian resistance.<\/p>\n","date":"2022-03-03 08:28:13","pin":"0","status":"1"},{"title":"Third IAF aircraft carrying 208 Indians reaches Delhi","content":"<p>Third Indian Air Force&#39;s C-17 aircraft carrying 208 Indian citizens from Ukraine, lands at Hindan airbase near Delhi from Rzeszow in Poland.&nbsp;<\/p>\n\n<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\"><a href=\"https:\/\/twitter.com\/hashtag\/WATCH?src=hash&amp;ref_src=twsrc%5Etfw\">#WATCH<\/a> MoS Defence Ajay Bhatt interacts with the Indian nationals repatriated to the country from Ukraine with the help of the Indian Air Force <a href=\"https:\/\/t.co\/DHDHc3bgT7\">pic.twitter.com\/DHDHc3bgT7<\/a><\/p>\n&mdash; ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1499206253364785159?ref_src=twsrc%5Etfw\">March 3, 2022<\/a><\/blockquote>\n<script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2022-03-03 08:50:24","pin":"0","status":"1"},{"title":"Flight from Bucharest carrying 183 Indians stranded in Ukraine lands in Mumbai","content":"<p>A flight from Budapest carrying 183 Indians stranded in Ukraine landed in Mumbai Thursday, an official said. An infant was among the passengers, the official said.<\/p>\n\n<p>Union minister Raosaheb Danve welcomed passengers of the third evacuation flight from Budapest to Mumbai, as soon as the Air India Express Flight IX 1202 landed here around 5.30 am.<\/p>\n\n<p>&quot;I have been asked by Prime Minister Narendra Modi to welcome you. There were around 17,000 Indians, including students, stranded there (in Ukraine) and the PM started Operation Ganga to evacuate them,&quot; Danve said, interacting with passengers, many of them students, inside the aircraft.<\/p>\n","date":"2022-03-03 08:54:21","pin":"0","status":"1"},{"title":"In continuous touch with Indian nationals in Ukraine: MEA","content":"<p>Our Embassy in Ukraine is in continuous touch with Indian nationals in Ukraine. We note that with the cooperation of the Ukrainian authorities, many students have left Kharkiv yesterday. We have not received any reports of any hostage situation regarding any student, MEA said in a statement, while addressing&nbsp;queries regarding media reports of any hostage situation regarding any student.<\/p>\n\n<p>It also added that, a large number of Indians have been evacuated in the last few days. &quot;We have been effectively coordinating with the countries in the region including Poland, Russia, Hungary, Romania, Moldova and Slovakia.&nbsp;&nbsp;<\/p>\n","date":"2022-03-03 09:10:54","pin":"0","status":"1"},{"title":"OSCE member dies during Kharkiv shelling","content":"<p>The Organisation for Security and Co-operation in Europe says one of its members died during shelling in the Ukrainian city of Kharkiv.<\/p>\n\n<p>Maryna Fenina was killed while getting supplies for her family, the group said in a news release Wednesday. Fenina worked with the organization&#39;s monitoring mission in Ukraine.<\/p>\n","date":"2022-03-03 11:09:34","pin":"0","status":"1"},{"title":"Three more IAF flights to operate today","content":"<p>Today, IAF is operating three more flights to various locations in the neighborhood of Ukraine to evacuate Indian citizens, says&nbsp;Indian Air Force spokesperson.<\/p>\n","date":"2022-03-03 11:11:01","pin":"0","status":"1"},{"title":"3,726 Indians will be brought back home","content":"<p><\/p>\n\n<p>Under Operation Ganga, 3,726 Indians will be brought back home today on eight flights from Bucharest.&nbsp;Two flights from Suceava, one flight from Kosice, five flights from Budapest and three flights from Rzeszow, says Union Civil Aviation Minister Jyotiraditya M. Scindia.<\/p>\n\n<p>Meanwhile,&nbsp;Union Ministers Mukhtar Abbas Naqvi and Virendra Kumar welcome Indians on their return from war-torn Ukraine via Budapest.<\/p>\n\n<p>&lt;blockquote class=&quot;twitter-tweet&quot;&gt;&lt;p lang=&quot;en&quot; dir=&quot;ltr&quot;&gt;Union Ministers Mukhtar Abbas Naqvi &amp;amp; Virendra Kumar welcome Indians on their return from war-torn &lt;a href=&quot;https:\/\/twitter.com\/hashtag\/Ukraine?src=hash&amp;amp;ref_src=twsrc%5Etfw&quot;&gt;#Ukraine&lt;\/a&gt; via Budapest (Hungary) &lt;a href=&quot;https:\/\/t.co\/NeT9pGG0ys&quot;&gt;pic.twitter.com\/NeT9pGG0ys&lt;\/a&gt;&lt;\/p&gt;&amp;mdash; ANI (@ANI) &lt;a href=&quot;https:\/\/twitter.com\/ANI\/status\/1499251189476904960?ref_src=twsrc%5Etfw&quot;&gt;March 3, 2022&lt;\/a&gt;&lt;\/blockquote&gt; &lt;script async src=&quot;https:\/\/platform.twitter.com\/widgets.js&quot; charset=&quot;utf-8&quot;&gt;&lt;\/script&gt;<\/p>\n","date":"2022-03-03 11:13:38","pin":"0","status":"0"},{"title":"India denies Moscow claims Ukraine holding students as 'human shield'","content":"<p>India denied on Thursday Russian claims that Ukraine was holding Indian students hostage in Kharkiv, instead thanking Ukraine for its help in evacuations from the embattled city.<\/p>\n\n<p>&quot;We note that with the cooperation of the Ukrainian authorities, many students have left Kharkiv yesterday,&quot; said Indian foreign ministry spokesman Arindam Bagchi.<\/p>\n\n<p>&quot;We have not received any reports of any hostage situation regarding any student,&quot; he added in a statement.<\/p>\n\n<p>India&#39;s declaration came after Moscow said Indian students in Kharkiv were being used as a &quot;human shield&quot; by Ukrainian security forces.<\/p>\n","date":"2022-03-03 11:23:29","pin":"0","status":"1"},{"title":"3,726 Indians will be brought back home","content":"<p>Under Operation Ganga, 3,726 Indians will be brought back home today on eight flights from Bucharest.&nbsp;Two flights from Suceava, one flight from Kosice, five flights from Budapest and three flights from Rzeszow, says Union Civil Aviation Minister Jyotiraditya M. Scindia.<\/p>\n\n<p>Meanwhile,&nbsp;Union Ministers Mukhtar Abbas Naqvi and Virendra Kumar welcome Indians on their return from war-torn Ukraine via Budapest.<\/p>\n\n<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\">Union Ministers Mukhtar Abbas Naqvi &amp; Virendra Kumar welcome Indians on their return from war-torn <a href=\"https:\/\/twitter.com\/hashtag\/Ukraine?src=hash&amp;ref_src=twsrc%5Etfw\">#Ukraine<\/a> via Budapest (Hungary) <a href=\"https:\/\/t.co\/NeT9pGG0ys\">pic.twitter.com\/NeT9pGG0ys<\/a><\/p>\n&mdash; ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1499251189476904960?ref_src=twsrc%5Etfw\">March 3, 2022<\/a><\/blockquote>\n<script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2022-03-03 11:40:52","pin":"0","status":"1"},{"title":"1 million flee Ukraine in under a week: UN refugee agency","content":"<p>The UN refugee agency said 1 million people have now fled Ukraine since Russia&#39;s invasion less than a week ago, an exodus without precedent in this century for its speed. The tally from the UN High Commissioner for Refugees amounts to more than 2% of Ukraine&#39;s population,&nbsp;which the World Bank counted at 44 million at the end of 2020,&nbsp;on the move across borders in just seven days.<\/p>\n","date":"2022-03-03 12:10:08","pin":"0","status":"1"},{"title":"Japan's Toyota suspends operations at Russia plant","content":"<p>Toyota said it would suspend operations at its only factory in Russia and stop shipping vehicles to the country, citing &quot;supply chain disruptions&quot; linked to Moscow&#39;s assault on Ukraine.<\/p>\n","date":"2022-03-03 12:16:29","pin":"0","status":"1"},{"title":"US experts: Militarily, the Russian invasion is a disaster so far","content":"<p>The Russian military&#39;s initial invasion of Ukraine has been a surprising strategic and tactical blunder marked by food and fuel shortages, abandoned armored vehicles, aircraft losses and troop deaths, US experts say.<\/p>\n\n<p>But the failures of the first days, including vastly underestimating the Ukrainians&#39; willingness to fight back, could lead to a frustrated Moscow deciding to unleash all its power and indiscriminately destroying large swathes of Ukraine, they said.<\/p>\n\n<p>US specialists who study the Russian military say they have been astonished by the mismanagement of the campaign, which has seen invading columns stalled, apparently hundreds of Russian armored vehicles lost, and the Ukrainians preventing the Kremlin&#39;s air force from controlling the skies.<\/p>\n\n<p>&quot;If you were going to screw it up two or three weeks in, I might understand it,&quot; said Scott Boston, a senior defense analyst at the Rand Corp. think tank.&nbsp;&quot;But if you, like, tripped over the doorframe on the way into the house, you have another issue,&quot; he said.<\/p>\n","date":"2022-03-03 12:30:45","pin":"0","status":"1"},{"title":"Worst ahead of us in Russia's war on Ukraine: France","content":"<p>Amid the rising tensions in Russia&#39;s war on Ukraine,&nbsp;France says,&nbsp;&quot;Possibly the worst ahead of us.&quot;<\/p>\n","date":"2022-03-03 12:44:42","pin":"0","status":"1"},{"title":"Russian forces seize control of Kherson city","content":"<p>Amid the escalating Ukraine-Russia crisis, Russian forces have seized control of the key southern Ukrainian city of Kherson, its mayor said.<\/p>\n\n<p>&quot;Russian forces seize the southern Ukrainian city of Kherson after taking control of the local council building, Kherson&#39;s mayor, Igor Kolykhaiev, said in a Facebook post on March 2,&quot; tweeted The Kyiv Independent.<\/p>\n\n<p>Indicating that the city is now under Russia&#39;s control, Kolykhaiev, in a social media post, said that the Ukrainian military is no longer in the city and that its inhabitants must now carry out instructions of &quot;armed people who came to the city&#39;s administration&quot;, CNN reported.<\/p>\n","date":"2022-03-03 12:58:02","pin":"0","status":"1"},{"title":"Russia's radio station Ekho Moskvy closes","content":"<p>Russia&#39;s liberal radio station Ekho Moskvy closes after ban over Ukraine.<\/p>\n","date":"2022-03-03 13:10:52","pin":"0","status":"1"},{"title":"Germany to deliver 2,700 further anti-aircraft missiles to Ukraine: Govt source","content":"<p>Germany will increase its weapons deliveries to Ukraine following the Russian invasion by sending an 2,700 anti-aircraft missiles to the conflict zone, a government source told AFP on Thursday.<\/p>\n\n<p>The government &quot;approved further support for Ukraine&quot;, involving the delivery of STRELA-type anti-aircraft missiles of Soviet manufacture, which were previously used by the army of communist East Germany, the source said.<\/p>\n","date":"2022-03-03 13:11:24","pin":"0","status":"1"},{"title":"Shashi Tharoor welcomes EAM S Jaishankar 's meeting of Consultative Committee on External Affairs","content":"<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\">Excellent meeting of Consultative Committee on External Affairs this morning on Ukraine. My thanks to Dr S Jaishankar&amp;his colleagues for a comprehensive briefing&amp;candid responses to our questions &amp; concerns. This is the spirit in which foreign policy should be run: Shashi Tharoor <a href=\"https:\/\/t.co\/SOdoU97hq4\">pic.twitter.com\/SOdoU97hq4<\/a><\/p>\n&mdash; ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1499295591909957632?ref_src=twsrc%5Etfw\">March 3, 2022<\/a><\/blockquote>\n<script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2022-03-03 14:00:13","pin":"0","status":"1"},{"title":"EAM consultative committee meeting: Rahul Gandhi raised issue of China, Pakistan getting closer to Russia","content":"<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\">EAM clarified &amp; said that students had doubts about their academic position &amp; Ukrainian Govt was giving assurance on the situation. EAM gave a presentation about evacuation &amp; current situation. Congress leaders supported the Govt&#39;s stand of abstaining from voting in UNSC: Sources<\/p>\n&mdash; ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1499300496389341184?ref_src=twsrc%5Etfw\">March 3, 2022<\/a><\/blockquote>\n<script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2022-03-03 14:01:35","pin":"0","status":"1"},{"title":"Russian businessman offers USD 1 million bounty for arrest of Putin","content":"<p>Russian businessman&nbsp;Alex Konanykhin has put a USD 1 million bounty on the head of President Vladimir Putin&nbsp;and urged the country&rsquo;s military officers to bring him to justice for allegedly committing &ldquo;war crimes&rdquo; in his invasion of Ukraine.<\/p>\n\n<p>(<a href=\"https:\/\/www.newindianexpress.com\/world\/2022\/mar\/03\/wanted-dead-or-alive-russian-businessman-offers-usd-1-million-bounty-for-arrest-of-putin-2425831.html\" target=\"_blank\"><strong>CLICK HERE FOR FULL REPORT<\/strong><\/a>)<\/p>\n","date":"2022-03-03 14:08:46","pin":"0","status":"1"},{"title":"9000 Russian troops killed till date: Ukraine Defence Ministry","content":"<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\">The total combat losses of the enemy from 24.02 to 03.03<a href=\"https:\/\/twitter.com\/hashtag\/stoprussia?src=hash&amp;ref_src=twsrc%5Etfw\">#stoprussia<\/a> <a href=\"https:\/\/t.co\/Jjc0OB90LR\">pic.twitter.com\/Jjc0OB90LR<\/a><\/p>\n&mdash; Defence of Ukraine (@DefenceU) <a href=\"https:\/\/twitter.com\/DefenceU\/status\/1499302571172941826?ref_src=twsrc%5Etfw\">March 3, 2022<\/a><\/blockquote>\n<script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2022-03-03 14:10:06","pin":"0","status":"1"},{"title":"Union minister Kiren Rijiju sees off Indian students in Slovakia","content":"<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\">Union minister Kiren Rijiju sees off a group of Indian students evacuated from Ukraine before their departure to India from Kosice, Slovakia<a href=\"https:\/\/twitter.com\/hashtag\/OperationGanga?src=hash&amp;ref_src=twsrc%5Etfw\">#OperationGanga<\/a> <a href=\"https:\/\/t.co\/ONHRSHo3Zu\">pic.twitter.com\/ONHRSHo3Zu<\/a><\/p>\n&mdash; ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1499303915170725890?ref_src=twsrc%5Etfw\">March 3, 2022<\/a><\/blockquote>\n<script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2022-03-03 14:14:49","pin":"0","status":"1"},{"title":"'Welcome to Berlin': Ukrainian refugees pour into Germany","content":"<p>The loudspeaker announcement is nearly drowned out by the hubbub of passengers spilling out of the train from Warsaw, but it&#39;s a message many of them have been longing to hear: &quot;Dear passengers from Ukraine, welcome to Berlin!&quot;<\/p>\n","date":"2022-03-03 14:34:43","pin":"0","status":"1"},{"title":"Russian, Belarusian athletes banned from Winter Paralympics","content":"<p>Russian and Belarusian athletes were on Thursday banned from the Beijing Winter Paralympics over the war in Ukraine, with organisers bowing to international pressure and threats of a boycott.<\/p>\n","date":"2022-03-03 14:43:27","pin":"0","status":"1"},{"title":"WATCH| C-17 aircraft belonging to IAF takes off from Budapest","content":"<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\">Three more <a href=\"https:\/\/twitter.com\/hashtag\/IAF?src=hash&amp;ref_src=twsrc%5Etfw\">#IAF<\/a> C-17 have taken off for Romania, Hungary and Poland today. Video of a C-17 taking off from Budapest, Hungary: Indian Air Force (IAF)<br \/>\n<br \/>\n(Video: IAF)<a href=\"https:\/\/twitter.com\/hashtag\/RussiaUkraineConflict?src=hash&amp;ref_src=twsrc%5Etfw\">#RussiaUkraineConflict<\/a> <a href=\"https:\/\/t.co\/cuYxAii3gW\">pic.twitter.com\/cuYxAii3gW<\/a><\/p>\n&mdash; ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1499320478456229893?ref_src=twsrc%5Etfw\">March 3, 2022<\/a><\/blockquote>\n<script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2022-03-03 15:27:39","pin":"0","status":"1"},{"title":"Russian Foreign Minister accuses West of considering 'nuclear war'","content":"<p>Russia&#39;s Foreign Minister Sergei Lavrov on Thursday accused Western politicians of considering nuclear war, one week after Moscow launched its invasion of Ukraine.<\/p>\n\n<p>&quot;I would like to point out that it&#39;s in the heads of Western politicians that the idea of a nuclear war is spinning constantly, and not in the heads of Russians,&quot; Lavrov said in an interview with Russian and foreign media.<\/p>\n\n<p>(<a href=\"https:\/\/www.newindianexpress.com\/world\/2022\/mar\/03\/russian-foreign-ministersergei-lavrov-accuses-west-of-fixating-on-nuclear-war-2425916.html\" target=\"_blank\"><strong>CLICK HERE FOR FULL REPORT<\/strong><\/a>)<\/p>\n","date":"2022-03-03 15:44:49","pin":"0","status":"1"},{"title":"'Russia will pay': President Volodymyr Zelensky vows to rebuild Ukraine","content":"<p>KYIV: Ukraine President Volodymyr Zelensky on Thursday promised Ukrainians that damage to infrastructure inflicted by invading Russian forces would be repaired and that Moscow would foot the bill.<\/p>\n\n<p>&quot;We will restore every house, every street, every city and we say to Russia: learn the word of reparations and contributions. You will reimburse us for everything you did against our state, against every Ukrainian in full,&quot; Zelensky said in a video statement.<\/p>\n","date":"2022-03-03 15:55:14","pin":"0","status":"1"},{"title":"WATCH| Russia removes US, UK, Japan flags from rocket, but keeps India's Tricolour","content":"<p><iframe allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\" frameborder=\"0\" height=\"375\" src=\"https:\/\/www.youtube.com\/embed\/WIvMkpwAGyQ\" title=\"YouTube video player\" width=\"100%\"><\/iframe><\/p>\n","date":"2022-03-03 16:16:47","pin":"0","status":"1"},{"title":"TN government to send team to Ukraine's neighbouring countries to bring home Tamil students","content":"<p>Expediting the arrangements for bringing back Tamil students stranded in Ukraine and those who have taken shelter in the neighbouring countries of Ukraine, the State government on Thursday formed a special team of MPs and IAS officers.<\/p>\n\n<p>(<a href=\"https:\/\/www.newindianexpress.com\/nation\/2022\/mar\/03\/tn-to-send-team-to-ukraines-neighbouring-countries-to-bring-home-tamil-students-2425893.html\" target=\"_blank\"><strong>CLICK FOR FULL REPORT<\/strong><\/a>)<\/p>\n","date":"2022-03-03 16:40:09","pin":"0","status":"1"},{"title":"No doubt that solution to Ukraine crisis will be found, says Russian Foreign Minister","content":"<p>Russia&#39;s Foreign Minister Sergei Lavrov told Russia&rsquo;s state television that he had no doubt that a solution to the Ukraine crisis will be found. &quot;Solution to Ukraine will be found but Russia&rsquo;s dialogue with the West needs to be based on mutual respect,&quot; Lavrov said.<\/p>\n\n<p>(<a href=\"https:\/\/www.newindianexpress.com\/nation\/2022\/mar\/03\/tn-to-send-team-to-ukraines-neighbouring-countries-to-bring-home-tamil-students-2425893.html\" target=\"_blank\"><strong>CLICK HERE FOR FULL REPORT<\/strong><\/a>)<\/p>\n","date":"2022-03-03 16:50:25","pin":"0","status":"1"},{"title":"Ikea suspends operations in Russia and Belarus; 15,000 staff affected","content":"<p>Swedish furniture giant Ikea said on Thursday it would suspend its activities in Russia and Belarus, affecting nearly 15,000 employees, 17 stores and three production sites, in response to the war in Ukraine.<\/p>\n\n<p>(<a href=\"https:\/\/www.newindianexpress.com\/world\/2022\/mar\/03\/ukraine-effect-ikea-suspends-operations-in-russia-and-belarus15000-staff-affected-2425907.html\" target=\"_blank\"><strong>READ FULL REPORT<\/strong><\/a>)<\/p>\n","date":"2022-03-03 17:06:37","pin":"0","status":"1"},{"title":"F1 terminates contract with Russia, no more Russian Grand Prix in future","content":"<p>Formula One has removed Russia as a Grand Prix host for good due to the invasion of Ukraine, by terminating their contract, the championship promoters announced on Thursday.<\/p>\n","date":"2022-03-03 17:09:57","pin":"0","status":"1"},{"title":"Headed to conflict talks with Russia: Ukraine Presidential Advisor","content":"<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\">On our way to negotiations with the Russian Federation. Already in helicopters&hellip; <a href=\"https:\/\/t.co\/CMflDZ3NDk\">pic.twitter.com\/CMflDZ3NDk<\/a><\/p>\n&mdash; ??????? ??????? (@Podolyak_M) <a href=\"https:\/\/twitter.com\/Podolyak_M\/status\/1499352617083969541?ref_src=twsrc%5Etfw\">March 3, 2022<\/a><\/blockquote>\n<script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2022-03-03 18:05:56","pin":"0","status":"1"},{"title":"Ukraine urges citizens to use guerilla tactics","content":"<ul>\n\t<li>As Russian forces advance on strategic points in southern Ukraine, Ukrainian authorities on Thursday called on compatriots to launch a guerrilla war against Russian forces.<\/li>\n\t<li>In a video message posted online, Ukrainian presidential aide Oleksiy Arestovich urged men to cut down trees and destroy rear columns of Russian troops.<\/li>\n\t<li>&ldquo;We urge people to begin providing total popular resistance to the enemy in the occupied territories,&rdquo; Arestovich said.<\/li>\n\t<li>&ldquo;The weak side of the Russian army is the rear - if we burn them now and block the rear, the war will stop in a matter of days,&rdquo; he said.<\/li>\n\t<li>Arestovich said that such tactics are already being used in Konotop in northeast Ukraine and Melitopol near the Azov Sea, which were captured by Russian troops.<\/li>\n\t<li>He called on the civilian population to build barricades in cities, hold rallies with Ukrainian flags, and create online networking groups.<\/li>\n\t<li>&ldquo;Total resistance ... this is our Ukrainian trump card and this is what we can do best in the world,&rdquo; Arestovich said, recalling guerrilla actions in Nazi-occupied Ukraine during World War II.<\/li>\n<\/ul>\n","date":"2022-03-03 19:35:23","pin":"0","status":"1"},{"title":"Mishap near Ukrainian port","content":"<ul>\n\t<li>A Panama-flagged cargo vessel belonging to an Estonian shipping company has reportedly driven into a mine and sank off the Ukrainian port city of Odessa.<\/li>\n\t<li>The m\/v Helt was built in 1985 and is owned by the VISTA Shipping Agency AS, Estonian media outlets reported Thursday, adding that two crew members have been rescued, while four others are missing.<\/li>\n\t<li>Ukrainian authorities said earlier this week that Russian sailors had captured the ship.<\/li>\n\t<li>Estonian Foreign Minister Eva-Maria Liimets said Estonian officials are currently dealing with the issue and the ministry would give details on the incident as soon as possible.<\/li>\n<\/ul>\n","date":"2022-03-03 19:36:03","pin":"0","status":"1"},{"title":"Update from Swedish Academy","content":"<ul>\n\t<li>The organization that awards the Nobel Prize in literature broke a long-standing practice of not making political statements by condemning &ldquo;in the strongest possible terms the Russian regime&rsquo;s illegal invasion of Ukraine.&rdquo;<\/li>\n\t<li>The Swedish Academy said Thursday that its history and mission &ldquo;are deeply rooted in the traditions of freedom of expression, freedom of belief and freedom of inquiry,&rdquo;<\/li>\n\t<li>&ldquo;We therefore join the legion of our fellow academies, literary and cultural institutions, places of higher learning, defenders of a free press, human rights organizations and nation states in expressing our abhorrence of the Russian government&rsquo;s unjustified attack on Ukraine and its people,&rdquo; the academy said in a statement.<\/li>\n<\/ul>\n","date":"2022-03-03 19:36:58","pin":"0","status":"1"},{"title":"Russia gains more inside Ukraine's territory","content":"<ul>\n\t<li>Russian forces have taken a strategic Ukrainian seaport and set siege to another as Moscow tries to cut its neighbor off from the Black Sea.<\/li>\n\t<li>The Russian military said Thursday it had control of Kherson, which has a population of 280,000 people, making it the first major city to fall since a Russian invasion began last week.<\/li>\n\t<li>Russian armored vehicles were seen in the otherwise empty streets of Kherson, in videos shared with The Associated Press by a resident<\/li>\n\t<li>Meanwhile, heavy fighting continued in Mariupol, in the outskirts of the strategic the Azov Sea port city.<\/li>\n\t<li>Electricity and phone connections are mostly not working in Mariupol, which faces food and water shortages.<\/li>\n\t<li>The Russians are pressing their offensive on a variety of fronts, even as the Kremlin says it is ready for talks to end the fighting that has triggered more than 1 million refugees.<\/li>\n<\/ul>\n","date":"2022-03-03 19:38:00","pin":"0","status":"1"},{"title":"British government faces heat for going slow on sanctions on Russian oligarchs","content":"<ul>\n\t<li>The British government is defending its sanctions against rich Russians amid criticism it is lagging compared to its American and European allies.<\/li>\n\t<li>The U.K. has slapped sanctions on only a handful of wealthy Russians accused of links to the Kremlin who have assets in Britain. That is fewer than the European Union or the U.S.<\/li>\n\t<li>The Conservative government is under pressure to add more names, including Chelsea Football Club owner Roman Abramovich, who has announced plans to sell the team.<\/li>\n\t<li>The government says more individuals will be sanctioned but it has not said when. It denies the delay is giving oligarchs time to move assets out of the U.K., long a favored haven for Russian wealth.<\/li>\n\t<li>Opposition lawmakers are also urging the government to seize oligarchs&rsquo; properties in Britain.<\/li>\n\t<li>Prime Minister Boris Johnson&rsquo;s spokesman, Max Blain, denied the government was dragging its feet.<\/li>\n\t<li>He said penalizing individuals was only part of the picture and it was sanctions on large banks and companies that would put the most pressure on the Russian government.<\/li>\n<\/ul>\n","date":"2022-03-03 19:43:28","pin":"0","status":"1"},{"title":"Russia continues to be isolated at the international space front","content":"<ul>\n\t<li>The British satellite company OneWeb says it is cancelling all launches from the Baikonur Cosmodrome in Kazakhstan, which is run by the Russian Aerospace Forces and Russia&rsquo;s space agency, Roscosmos.<\/li>\n\t<li>The firm said in a one-line statement that &ldquo;the Board of OneWeb has voted to suspend all launches from Baikonur.&rdquo;<\/li>\n\t<li>OneWeb had been due to launch a batch of its internet satellites Friday on Russian rockets from the base. The launch was put in doubt after Russia demanded the British government sell its stake in OneWeb, which it partly owns.<\/li>\n\t<li>It also wanted a guarantee from the company that none of its satellites would have military uses.<\/li>\n\t<li>Russia&rsquo;s invasion of Ukraine has thrown international space cooperation into turmoil and put a planned Europe-Russian mission to Mars this year on hold.<\/li>\n<\/ul>\n","date":"2022-03-03 19:46:13","pin":"0","status":"1"},{"title":"Japan to go hard against Russian oligarchs","content":"<ul>\n\t<li>Japanese Prime Minister Fumio Kishida says his country will freeze the assets of Russian oligarchs close to President Vlaimir Putin as Tokyo steps up sanctions over Russia&rsquo;s invasion of Ukraine.<\/li>\n\t<li>Kishida said Thursday that Japan is adding oligarchs to the list of sanctions as part of a collective effort by the United States and European countries.<\/li>\n\t<li>The step adds to Japan&rsquo;s freezing of the assets of Putin and top officials in his government.<\/li>\n\t<li>Kishida also said that Japan has taken steps to disconnect seven Russian banks from the SWIFT international financial messaging systems.<\/li>\n\t<li>Japan, which wants to regain control over some Russian-held islands in a dispute that still prevents the two countries from signing a peace treaty formally ending their World War II hostilities, used to be reluctant to impose strict sanctions on Russia.<\/li>\n<\/ul>\n","date":"2022-03-03 19:47:12","pin":"0","status":"1"},{"title":"More heat on Russia","content":"<ul>\n\t<li>Spain&rsquo;s prime minister says the 27 European Union countries will be strict about applying sanctions against Russian President Vladimir Putin and his circle, aiming to asphyxiate the Russian economy over the invasion of Ukraine.<\/li>\n\t<li>&ldquo;Putin has to know that we are not going to stop applying the sanctions against him and the oligarchy that has prospered within his regime, to isolate it and choke it economically to end an unjustified and unfair invasion,&rdquo; Prime Minister Pedro S&aacute;nchez said Thursday.<\/li>\n\t<li>Spain&rsquo;s defense ministry announced that two planes loaded with Spanish offensive military material will depart for Ukraine on Friday.<\/li>\n\t<li>The cargo includes 1,370 anti-tank grenade launchers and 700,000 rounds of ammunition for rifles and machine guns, as well as an unspecified number of light machine guns.<\/li>\n<\/ul>\n","date":"2022-03-03 19:47:47","pin":"0","status":"1"},{"title":"UN body holds immediate meeting","content":"<ul>\n\t<li>The U.N.&rsquo;s top human rights body is holding an urgent debate on the situation in Ukraine and the possibility of creating a panel to investigate any abuses during Russia&rsquo;s war with its neighbor.<\/li>\n\t<li>The Human Rights Council meeting is set to culminate in a vote Friday on whether to set up a three-person expert panel, following Russia&rsquo;s invasion last week.<\/li>\n\t<li>The vote by the 47-member-state body, which counts Ukraine and Russia as members, offers a bellwether of international sentiment about the Kremlin&#39;s invasion.<\/li>\n\t<li>It comes a day after the U.N. General Assembly in New York voted 141-5, with 35 abstentions, to demand an immediate halt to Moscow&rsquo;s attack on Ukraine.<\/li>\n\t<li>The panel would seek to collect and analyze evidence that could be used by a court, such as the International Criminal Court, which has already launched its own investigation over Russia&rsquo;s invasion.<\/li>\n<\/ul>\n","date":"2022-03-03 19:49:26","pin":"0","status":"1"},{"title":"President Biden will decide on imposing CAATSA on India: US official on Russian S-400","content":"<p>The US administration is required under a domestic law, Countering America&#39;s Adversaries through Sanctions Act (CAATSA) to impose sanctions on any country that has significant transactions with Iran, North Korea or Russia. <strong><a href=\"https:\/\/www.newindianexpress.com\/world\/2022\/mar\/03\/president-biden-will-decide-on-imposing-caatsa-on-indiaus-official-on-russian-s-400-2425945.html\" target=\"_blank\">(READ FULL STORY HERE)<\/a><\/strong><\/p>\n","date":"2022-03-03 19:50:25","pin":"0","status":"1"},{"title":"Our 130 buses ready to evacuate Indian students, foreigners from Ukraine: Russian defence official","content":"<p>The remarks by Russian National Defence Control Center head Colonel-General Mikhail Mizintsev comes a day after Prime Minister Narendra Modi spoke to Russian President Vladimir Putin and discussed the safe evacuation of Indians from the conflict areas in Ukraine. <strong><a href=\"https:\/\/www.newindianexpress.com\/world\/2022\/mar\/03\/our-130-buses-ready-to-evacuate-indian-students-foreigners-from-ukraine-russian-defence-official-2425923.html\" target=\"_blank\">(READ FULL STORY HERE)<\/a><\/strong><\/p>\n","date":"2022-03-03 19:51:17","pin":"0","status":"1"},{"title":"Biden seeks USD 10 Billion for aid to Ukraine","content":"<ul>\n\t<li>The Biden administration is seeking another USD 10 billion to help protect Ukraine against the Russian invasion and an additional USD 22. 5 billion to cover coronavirus pandemic-related expenses, two major additions to budget talks already underway.<\/li>\n\t<li>The acting director of the White House Office of Management and Budget, Shalanda Young, laid out the need for the supplemental funding in a Thursday blog post.<\/li>\n\t<li>The requests would be additions to a planned budget agreement that Congress is trying to finish before a March 11 deadline. Young said in the blog post that the money was urgently needed.<\/li>\n\t<li>The USD 10 billion to Ukraine would be a rapid escalation of the USD 1. 4 billion provided by the United States since 2021, a reflection of the crisis caused by the Russian offensive that began last month.<\/li>\n\t<li>Young said the money would cover &quot;additional humanitarian, security, and economic assistance in Ukraine and the neighbouring region in the coming days and weeks.&quot;<\/li>\n\t<li>The USD 22. 5 billion tied to the coronavirus would pay for testing, treatments and vaccines as well as investments in research and efforts to increase vaccinations worldwide.<\/li>\n\t<li>The federal government spent USD 6. 8 trillion last fiscal year, a reflection of the emergency measures tied to the coronavirus that included President Joe Biden&#39;s USD 1. 9 trillion relief package. Before the COVID-19 pandemic, the federal budget was about USD 4. 4 trillion, according to the Congressional Budget Office.<\/li>\n<\/ul>\n","date":"2022-03-03 20:13:49","pin":"0","status":"1"},{"title":"Germany opposes ban on Russian energy imports","content":"<ul>\n\t<li>Germany&rsquo;s economy minister has spoken out against an embargo on Russian energy imports, saying it could endanger social cohesion in the country.<\/li>\n\t<li>Germany gets about half of its coal and gas from Russia, and a third of its oil. Economy Minister Robert Habeck, who is also Germany&rsquo;s vice chancellor, said Thursday that his country needs to &ldquo;free itself from imports of Russian energy&rdquo; but acknowledged that doing so will take time.<\/li>\n\t<li>Habeck told reporters in Berlin that the government is working on a series of measures to quickly increase energy independence, including securing new suppliers and ramping up the use of renewables.<\/li>\n\t<li>He played down the suggestion that Germany should extend the lifetime of its three remaining nuclear power plants, which are scheduled to be shut down this year. But he left open the possibility that this might be considered, &ldquo;if it helps.&rdquo;<\/li>\n\t<li>Habeck said the government would also work on energy efficiency measures to reduce demand and encouraged Germans to do their bit, too. &ldquo;If you want to hurt Putin a bit, then save energy,&rdquo; he said.<\/li>\n<\/ul>\n","date":"2022-03-03 20:27:38","pin":"0","status":"1"},{"title":"Russia faces more isolation at cultural front","content":"<ul>\n\t<li>An Amsterdam museum says it has cut its close links to the Hermitage in St. Petersburg over Russia&rsquo;s invasion of Ukraine.<\/li>\n\t<li>The Hermitage Amsterdam said Thursday that it has long distanced itself from politics in Russia under President Vladimir Putin as it built close ties with the Hermitage in St. Petersburg, giving the Amsterdam museum &ldquo;access to one of the world&rsquo;s most famous art collections, which we could draw from&rdquo; for exhibitions.<\/li>\n\t<li>&ldquo;Russia&rsquo;s recent attack on Ukraine makes keeping this distance no longer tenable,&rdquo; the museum said in a statement.<\/li>\n\t<li>The Amsterdam museum says that, &ldquo;Like everyone else, we hope for peace.<\/li>\n\t<li>Also for changes in the future of Russia that will allow us to restore ties with the Hermitage Saint Petersburg.&rdquo;<\/li>\n<\/ul>\n","date":"2022-03-03 20:29:40","pin":"0","status":"1"},{"title":"Russia won't participate in NATO drill","content":"<ul>\n\t<li>Russia has declined to attend as an observer a NATO drill in Norway with about 30,00 troops from 27 nations later this month.<\/li>\n\t<li>Norway is scheduled to host the Cold Response exercise from March 13. The drill, which has been planned for months, is aimed at training in cold-weather conditions in case of attack.<\/li>\n\t<li>Russia had been invited to observe it.<\/li>\n\t<li>The Norwegian Armed Forces said in a statement to The Associated Press that they want &ldquo;to be open and transparent about this exercise, so that there will be no misunderstandings,&rdquo; and stressed that the drill was &ldquo;of a defensive nature, where we practice and train with our allies and partner countries.&rdquo;<\/li>\n\t<li>&ldquo;With the tension that is in Europe, it is important that we practice and train to be able to defend ourselves,&rdquo; the statement said, adding that the Norwegians &ldquo;would have preferred Russia to send observers, but at the same time we respect their decision.&rdquo;<\/li>\n\t<li>The Scandinavian country shares a nearly 200-kilometer (124-mile) land border with Russia.<\/li>\n<\/ul>\n","date":"2022-03-03 20:31:08","pin":"0","status":"1"},{"title":"UN's cultural agency keeping an eye over the Ukraine situation","content":"<ul>\n\t<li>The United Nations&rsquo; cultural agency says it is assessing the damage to Ukraine&rsquo;s educational and cultural institutions and its heritage sites amid Russia&rsquo;s invasion.<\/li>\n\t<li>UNESCO&rsquo;s director general Audrey Azoulay is calling on the Russian forces and the international community to protect Ukraine&rsquo;s cultural heritage.<\/li>\n\t<li>She said in a statement Thursday that the UN agency is coordinating efforts with Ukrainian authorities to mark as quickly as possible key historic monuments and sites across Ukraine with an internationally recognized sign for the protection of cultural heritage in the event of armed conflict.<\/li>\n\t<li>UNESCO will also organize a meeting with the country&rsquo;s museum directors to help them safeguard collections and cultural property as the war rages.<\/li>\n\t<li>Ukraine has seven World Heritage sites, located in the western city of Lviv; in the capital, Kyiv; in the Black Sea port city of Odesa; and in the second largest city of Kharkiv.<\/li>\n\t<li>All four cities have been subjected to artillery attacks and air bombardment by the invading Russian forces.<\/li>\n\t<li>At least seven educational institutions have been damaged in attacks over the past week, including the Karazin National University in Kharkiv on Wednesday, the UNESCO statement said.<\/li>\n\t<li>The nationwide closure of schools and education facilities since the assault on Ukraine began has affected the entire school-aged population: 6 million students between ages of 3 and 17, and more than 1.5 million enrolled in higher education institutions, according to the statement.<\/li>\n<\/ul>\n","date":"2022-03-03 20:32:40","pin":"0","status":"1"},{"title":"Canada to impose 35% tariff on any imports from Russia or Belarus","content":"<ul>\n\t<li>Canada is announcing a 35% tariff on any imports from Russia or Belarus.<\/li>\n\t<li>Deputy Prime Minister Chrystia Freeland says Canada is removing those countries&rsquo; &ldquo;most favored nation&rdquo; status as a trading partner, which is normally extended to fellow World Trade Organization member countries.<\/li>\n\t<li>Freeland said Thursday that Canada is encouraging its allies to take the same step. Russia and Belarus join North Korea in being downgraded for trade.<\/li>\n<\/ul>\n","date":"2022-03-03 20:33:54","pin":"0","status":"1"},{"title":"Second round of talks begin between Ukraine and Russia","content":"<ul>\n\t<li>Ukrainian President Volodymyr Zelenskyy&rsquo;s office says a second round of talks with Russia about the war in Ukraine has begun in neighboring Belarus.<\/li>\n\t<li>A video released by Zelenskyy&rsquo;s office Thursday showed the informally dressed Ukrainian delegation walking into the meeting room where they shook hands with Russian delegates in suits and ties.<\/li>\n\t<li>The talks are aimed at stopping the fighting that has sent more than 1 million people fleeing over Ukraine&rsquo;s borders, but the two sides appeared to have little common ground.<\/li>\n\t<li>Russian President Vladimir Putin has warned Ukraine that it must quickly accept the Kremlin&rsquo;s demand for its &ldquo;demilitarization&rdquo; and declare itself neutral, formally renouncing its bid to join NATO.<\/li>\n\t<li>Putin has long contended that Ukraine&rsquo;s turn toward the West is a threat to Moscow, an argument he used to justify last week&#39;s invasion.<\/li>\n\t<li>The talks came as the Russian military made significant gains in the south of Ukraine as part of an effort to sever the country&rsquo;s connection to the Black and Azov seas.<\/li>\n<\/ul>\n","date":"2022-03-03 20:56:56","pin":"0","status":"1"},{"title":"Macron talks to Putin again","content":"<ul>\n\t<li>A French official says French President Emmanuel Macron has spoken for 90 minutes by phone with Russian President Vladimir Putin, who told Macron that military operations in Ukraine are &ldquo;going according to plan.&rdquo;<\/li>\n\t<li>The official at the French Elysee presidential palace said Putin told Macron the conflict would continue &ldquo;until the end&rdquo; unless negotiations meet his terms.<\/li>\n\t<li>Putin said negotiations must center on the &ldquo;neutralization and disarmament of Ukraine,&rdquo; according to the French official.<\/li>\n\t<li>Putin reportedly said he would attain that goal by military means, if not by political and diplomatic means.<\/li>\n\t<li>The official said the two leaders spoke at Putin&rsquo;s request. The French official could not be named in keeping with Elysee practice.<\/li>\n<\/ul>\n","date":"2022-03-03 20:57:38","pin":"0","status":"1"},{"title":"Ukraine effect? Poland to increase its defence budget","content":"<ul>\n\t<li>Poland&rsquo;s most powerful politician says his country will raise its defense spending to 3% of GDP starting next year, amid the new security threat following Russia&rsquo;s invasion of Ukraine.<\/li>\n\t<li>Jaroslaw Kaczynski, who is deputy prime minister for security and the leader of the ruling Law and Justice party, told parliament that Poland needs a strong army.<\/li>\n\t<li>&ldquo;The army should have deterrent power. We want peace, we do not want war,&rdquo; Kaczynski said.<\/li>\n\t<li>Poland is already one of the handful of NATO countries whose defense spending exceeds the alliance&rsquo;s target of 2% of GDP, now at 2.2%.<\/li>\n\t<li>The country had already planned to increase spending to 2.5% in 2030 but now plans to increase spending to 3% in 2023, Kaczynski said.<\/li>\n<\/ul>\n","date":"2022-03-03 20:58:33","pin":"0","status":"1"},{"title":"Centre says over 7,400 Indians expected to be brought back in next two days; Indian nationals in Kharkiv asked to fill up online form","content":"<p>India has been evacuating its citizens through special flights from Ukraine&#39;s western neighbours such as Romania, Hungary and Poland as the Ukrainian airspace has been shut since February 24 due to the Russian military offensive.<strong><a href=\"https:\/\/www.newindianexpress.com\/nation\/2022\/mar\/03\/ukraine-crisis-centre-says-over-7400-indians-expected-to-be-brought-back-in-next-two-daysindian-2425961.html\" target=\"_blank\"> (READ FULL STORY HERE)<\/a><\/strong><\/p>\n","date":"2022-03-03 21:01:53","pin":"0","status":"1"},{"title":"EU grants temporary protection to refugees","content":"<ul>\n\t<li>With close to a million of refugees fleeing Ukraine already in the eastern nations of the European Union, the EU member states decided Thursday to grant them temporary protection and residency permits.<\/li>\n\t<li>EU Commissioner Ylva Johansson said Thursday that millions more were expected to move into the 27-nation bloc to seek shelter, employment and education for the young.<\/li>\n\t<li>Johansson called the quick adoption of the protection rules a &ldquo;historic result&rdquo; and said &ldquo;the EU stands united to save lives.&rdquo;<\/li>\n\t<li>The EU Commission has already promised at least 500 million euros ($560 million) in humanitarian aid for the refugees.<\/li>\n\t<li>Johansson pointed to nations like Poland, where the population has gone out of its way to be welcoming to the refugees, as an example for others to follow.<\/li>\n\t<li>&ldquo;They need financial support now because they&rsquo;re going to have to find accommodation for people to have to find schools for the children,&rdquo; she said.<\/li>\n<\/ul>\n","date":"2022-03-03 21:49:16","pin":"0","status":"1"},{"title":"249 civilians killed and 553 injured in Ukraine so far","content":"<ul>\n\t<li>The U.N. human rights office says its latest count of casualties in Ukraine since Russia&rsquo;s invasion last week has risen to 249 civilians killed and 553 injured.<\/li>\n\t<li>That was only a small increase from its previous tally a day earlier, when it counted 227 civilian deaths and 525 people injured, likely a testament to the difficulty it has had in confirming deaths amid the continued fighting and bloodshed.<\/li>\n\t<li>Seventeen of those killed were children, and 27 were women, the latest count found. The rights office admits that its figures so far are a vast undercount. It uses a strict methodology and counts only confirmed casualties.<\/li>\n\t<li>The latest count is as of midnight local time from Tuesday to Wednesday. Ukrainian officials have presented far higher numbers.<\/li>\n\t<li>The U.N. office acknowledged that many reports are pending corroboration, such as in the town of Volnovakha in the government-controlled part of eastern Ukraine, &ldquo;where mass civilian casualties have been alleged.&rdquo;<\/li>\n<\/ul>\n","date":"2022-03-03 21:50:08","pin":"0","status":"1"},{"title":"Arctic Council won't visit Russia","content":"<ul>\n\t<li>The eight-nation Arctic Council said its representatives will not travel to Russia for the body&rsquo;s meetings and are temporarily &ldquo;pausing participation in all meetings.&rdquo;<\/li>\n\t<li>In a statement, the members of the council, which include Canada, Denmark, Finland, Iceland, Norway, Russia, Sweden, and the United States, said they &ldquo;condemn Russia&rsquo;s unprovoked invasion of Ukraine and note the grave impediments to international cooperation, including in the Arctic, that Russia&rsquo;s actions have caused.&rdquo; Russia currently holds the chairmanship of the intergovernmental forum that was created in 1996.<\/li>\n\t<li>Its aim is to promote cooperation, coordination and interaction, Indigenous peoples and other Arctic inhabitants on common Arctic issues, in particular on issues of sustainable development and environmental protection in the Arctic.<\/li>\n\t<li>The Arctic regions are home to more than 4 million people.<\/li>\n<\/ul>\n","date":"2022-03-03 21:50:59","pin":"0","status":"1"},{"title":"Skirmish outside Europe’s largest nuclear plant","content":"<ul>\n\t<li>The mayor of Enerhodar, site of Europe&rsquo;s largest nuclear plant, says Ukrainian forces are battling Russian troops on the edges of the city.<\/li>\n\t<li>Enerhodar is a major energy hub on the left bank of the Dnieper River and the Khakhovka Reservoir that accounts for about one quarter of the country&rsquo;s power generation due to the Zaporizhzhia nuclear plant, which is Europe&rsquo;s largest.<\/li>\n\t<li>Dmytro Orlov, the mayor of Enerhodar, said Thursday that a big Russian convoy was approaching the city and urged residents not to leave homes.<\/li>\n<\/ul>\n","date":"2022-03-03 21:51:51","pin":"0","status":"1"},{"title":"22 civilians have been killed in a Russian strike","content":"<ul>\n\t<li>Ukraine&rsquo;s state emergencies agency says that at least 22 civilians have been killed in a Russian strike on a residential area in the city of Chernihiv, a city of 280,000 in Ukraine&rsquo;s north.<\/li>\n\t<li>It said the casualties could be higher as rescuers are continuing to look through debris for more bodies.<\/li>\n<\/ul>\n","date":"2022-03-03 21:52:27","pin":"0","status":"1"},{"title":"UN expresses concern over Russia's use of cluster bombs","content":"<ul>\n\t<li>The U.N. human rights chief says military operations in Ukraine are &ldquo;escalating further as we speak&rdquo; and warned of &ldquo;concerning reports&rdquo; of the use of cluster bombs.<\/li>\n\t<li>Michelle Bachelet said the Ukrainian town of Volnovakha in the eastern Donetsk region, where pro-Russian separatists seized territory in 2014, leading to a drawn-out military conflict, &ldquo;has been almost completely destroyed by shelling,&rdquo; with residents hiding in basements.<\/li>\n\t<li>She spoke Thursday during an &ldquo;urgent debate&rdquo; at the Human Rights Council, where country after country spoke out against Russia&rsquo;s invasion. Many Western envoys sported blue or yellow ties, scarves, jackets or ribbons on their lapels &ndash; colors of the Ukrainian flag.<\/li>\n\t<li>Delegates will vote Friday on a resolution that would create a three-person panel of experts to monitor human rights and report on rights abuses and violations in Ukraine.<\/li>\n\t<li>U.S. Ambassador Sheba Crocker said her country was &ldquo;deeply alarmed&rdquo; by reports of &ldquo;Russia&rsquo;s deployment of weapons such as cluster munitions and thermobarics against cities where innocent people are sheltering.&rdquo; She urged countries to vote for the resolution.<\/li>\n\t<li>Chen Xu, China&rsquo;s ambassador, hailed diplomatic talks between Russia and Ukraine but said his country opposed efforts to &ldquo;politicize&rdquo; human rights. He said China would vote against the resolution.<\/li>\n<\/ul>\n","date":"2022-03-03 21:53:34","pin":"0","status":"1"},{"title":"Russian billionaire Alisher Usmanov's superyacht hasn't been seized, says Germany","content":"<ul>\n\t<li>German officials have denied that a superyacht allegedly owned by Russian billionaire Alisher Usmanov has been seized in the port city of Hamburg.<\/li>\n\t<li>Business magazine Forbes reported Thursday that German authorities had impounded the &ldquo;Dilbar,&rdquo; citing unnamed sources.<\/li>\n\t<li>But a spokesperson for Hamburg state&rsquo;s economy ministry said no such decision had yet been taken because it was unclear who the luxury yacht belonged to.<\/li>\n\t<li>Susanne Meinecke told The Associated Press that the ship is registered to a holding company in Malta.<\/li>\n\t<li>Still, the yacht is currently being serviced at a Hamburg shipyard and could not be moved even if the owner wanted it to, a German official said, speaking on condition of anonymity.<\/li>\n\t<li>Germany&rsquo;s Economy Ministry said it was in the process of &ldquo;swiftly and effectively implementing the Russia sanctions&rdquo; but declined to say publicly which assets had been seized, if any.<\/li>\n<\/ul>\n","date":"2022-03-03 21:54:55","pin":"0","status":"1"},{"title":"German President praises Russians for protesting against Putin","content":"<ul>\n\t<li>Germany&rsquo;s president has praised Russians who are speaking out against their country&rsquo;s attack on Ukraine, saying they deserve respect and support.<\/li>\n\t<li>Frank-Walter Steinmeier, whose position is largely ceremonial, said Thursday that &ldquo;many Russians in science, business and culture know what the Russian army is doing in Ukraine and condemn the war.&rdquo;<\/li>\n\t<li>&ldquo;They are demanding an end to fighting and peace,&rdquo; Steinmeier said.<\/li>\n\t<li>&ldquo;We admire their bravery, they too deserve our respect and our support.&rdquo;<\/li>\n\t<li>Speaking during a visit to German troops in Lithuania, Steinmeier said he expected the sanctions against Russia to prompt businesspeople in the country to consider &ldquo;when this war can have any advantages for Russia in the long-term.&rdquo;<\/li>\n\t<li>Lithuania&rsquo;s President Gitanas Nauseda said the war would have &ldquo;painful consequences&rdquo; for Russia&rdquo; and called for European Union members to support Ukraine joining the bloc.<\/li>\n<\/ul>\n","date":"2022-03-03 21:56:32","pin":"0","status":"1"},{"title":"At UNHRC, India calls for immediate cessation of violence and end to hostilities in Ukraine","content":"<p>&quot;We are greatly concerned over the steadily worsening humanitarian situation in Ukraine,&quot; India said at the Urgent Debate Thursday regarding the human rights situation in Ukraine at the 49th Human Rights Council Session in Geneva. <strong><a href=\"https:\/\/www.newindianexpress.com\/nation\/2022\/mar\/03\/at-unhrc-india-calls-for-immediate-cessation-of-violence-and-end-to-hostilities-in-ukraine-2425972.html\" target=\"_blank\">(READ FULL STORY HERE)<\/a><\/strong><\/p>\n","date":"2022-03-03 22:05:39","pin":"0","status":"1"},{"title":"Zelenskyy asks Putin to meet -- 'I don't bite'","content":"<ul>\n\t<li>Ukrainian President Volodymyr Zelenskyy has called for Russian President Vladimir Putin to meet him, salting the proposal with sarcasm.<\/li>\n\t<li>&ldquo;Sit down with me to negotiate, just not at 30 meters,&quot; he said Thursday, apparently referring to recent photos of Putin sitting at one end of an extremely long table when he met with French President Emmanuel Macron.<\/li>\n\t<li>&ldquo;I don&rsquo;t bite. What are you afraid of?&rdquo; Zelenskyy said at a Thursday news conference.<\/li>\n\t<li>Zelenskyy said it was sensible to have talks: &ldquo;Any words are more important than shots.&rdquo;<\/li>\n<\/ul>\n","date":"2022-03-03 22:17:13","pin":"0","status":"1"},{"title":"Top Russian general killed in Ukraine","content":"<ul>\n\t<li>Maj. Gen. Andrei Sukhovetsky, the commanding general of the Russian 7th Airborne Division, was killed in fighting in Ukraine earlier this week.<\/li>\n\t<li>His death was confirmed by a local officers&rsquo; organization in the Krasnodar region in southern Russia.<\/li>\n\t<li>The circumstances of his death were not immediately clear.<\/li>\n\t<li>Sukhovetsky, who was 47, began his military service as a platoon commander after graduating from a military academy and steadily rose through the ranks to take a series of leadership positions.<\/li>\n\t<li>He took part in Russia&rsquo;s military campaign in Syria.<\/li>\n\t<li>He was also a deputy commander of the 41st Combined Arms Army.<\/li>\n\t<li>A funeral ceremony will be held in Novorossiisk, but further details weren&#39;t immediately announced.<\/li>\n<\/ul>\n","date":"2022-03-03 22:55:58","pin":"0","status":"1"},{"title":"Zelenskyy asks West for more military aid","content":"<ul>\n\t<li>Ukraine&rsquo;s President Volodymyr Zelenskyy has challenged Russian President Vladimir Putin to sit down for talks while urging the West to offer a stronger military assistance to Ukraine to fight the Russian invasion.<\/li>\n\t<li>In a sarcastic reference to a long table Putin used for his recent meetings with foreign leaders and Russian officials, Zelenskyy said: &ldquo;Sit down with me to negotiate, just not at 30 meters,&rdquo; adding, &ldquo;I don&rsquo;t bite. What are you afraid of?&rdquo;<\/li>\n\t<li>During Thursday&#39;s news conference, Zelenskyy said that prospects for another round of talks between Russian and Ukrainian negotiations don&rsquo;t seem promising, but emphasized the need to negotiate, adding that &ldquo;any words are more important than shots.&rdquo;<\/li>\n\t<li>He said the world was too slow to offer support for Ukraine and prodded Western leaders to enforce a no-fly zone over Ukraine to deny access to the Russian warplanes.<\/li>\n\t<li>The U.S. and NATO allies have ruled out the move that would directly pit Russian and Western militaries.<\/li>\n\t<li>Zelenskyy charged that if the West remains reluctant to declare a no-fly zone over Ukraine, it should at least provide Kyiv with warplanes.<\/li>\n<\/ul>\n","date":"2022-03-03 23:10:13","pin":"0","status":"1"},{"title":"Putin claims Russia is offering safe corridors","content":"<ul>\n\t<li>Russian President Vladimir Putin says the Russian military has offered safe corridors to civilians to allow them to leave areas of fighting in Ukraine.<\/li>\n\t<li>Putin, speaking in a video call with members of his Security Council, has charged that Ukrainian nationalist groups are preventing civilians from leaving.<\/li>\n\t<li>The Russian leader said the groups were also using civilians as shields, taking up firing positions to provoke the Russian retaliatory fire.<\/li>\n\t<li>Putin&rsquo;s claim couldn&rsquo;t be independently verified.<\/li>\n\t<li>The Russian military says it has only struck military facilities and haven&rsquo;t targeted residential areas, a claim that has been contradicted by the abundant evidence of massive casualties and damage to residential areas of Kyiv, Kharkiv, Chernihiv and other cities in Ukraine documented by The Associated Press.<\/li>\n\t<li>Putin reaffirmed his claim that the Russian military was fighting &ldquo;neo-Nazis,&rdquo; adding that some Ukrainians were also &ldquo;fooled by nationalist propaganda.&rdquo;<\/li>\n\t<li>He hailed the Russian military as heroes and ordered additional payments to families of the soldiers who were killed and servicemen who were wounded in action.<\/li>\n<\/ul>\n","date":"2022-03-03 23:17:23","pin":"0","status":"1"},{"title":"Chief rabbi of Kyiv lashes out at Russia","content":"<ul>\n\t<li>The chief rabbi of Kyiv, Ukraine, says the Russian invasion has produced &ldquo;a catastrophe,&rdquo; and that most Jews have fled.<\/li>\n\t<li>Jonathan Markovitch spoke as he arrived at Ben-Gurion International Airport Thursday. He said the scene on the ground in Ukraine is &ldquo;a catastrophe. Planes are bombing places right next to residential buildings,&rdquo; as well as a train station &ldquo;maybe 100 meters from where my son lives and 50 meters from the synagogue.&rdquo;<\/li>\n\t<li>Most Jews, he said, have left the country.<\/li>\n\t<li>As he spoke, a group of about 150 young men and women held banners and sang as part of a welcome ceremony for new immigrants arriving from Ukraine.<\/li>\n<\/ul>\n","date":"2022-03-03 23:18:22","pin":"0","status":"1"},{"title":"Canada asks for suspension of Russia's INTERPOL membership","content":"<ul>\n\t<li>Canada is calling for Russian INTERPOL membership to be suspended.<\/li>\n\t<li>Canadian Prime Minister Justin Trudeau says international law enforcement cooperation depends on mutual respect among members.<\/li>\n\t<li>Britain is also seeking to suspend Russia from the international policing body.<\/li>\n\t<li>Defense Minister Anita Anand also says Canada is sending more weapons to Ukraine. Anand says Canada is sending 4,500 rocket launchers and 7,500 grenades.<\/li>\n<\/ul>\n","date":"2022-03-03 23:19:11","pin":"0","status":"1"},{"title":"At Quad meet, PM Modi calls for return to path of diplomacy on Ukraine crisis","content":"<p>&quot;Developments in Ukraine were discussed in the meeting, including its humanitarian implications. The Prime Minister emphasised the need to return to a path of dialogue and diplomacy,&quot; an official statement said. <strong><a href=\"https:\/\/www.newindianexpress.com\/nation\/2022\/mar\/03\/at-quad-meet-pm-modi-calls-for-return-to-path-of-diplomacy-on-ukraine-crisis-2425988.html\" target=\"_blank\">(READ FULL STORY HERE)<\/a><\/strong><\/p>\n","date":"2022-03-03 23:48:59","pin":"0","status":"1"},{"title":"Ukraine, Russia agree to create safe corridors","content":"<ul>\n\t<li>A member of Ukraine&rsquo;s delegation in talks with Russia says the parties have reached a tentative agreement to organize safe corridors for civilians to evacuate and for humanitarian supplies to be delivered.<\/li>\n\t<li>Mykhailo Podolyak, an adviser to Ukraine&rsquo;s President Volodymyr Zelenskyy who took part in Thursday&rsquo;s talks in Belarus near the Polish border, said that Russia and Ukraine reached a preliminary understanding that cease-fires will be observed in areas where the safe corridors are established.<\/li>\n<\/ul>\n","date":"2022-03-03 23:50:02","pin":"0","status":"1"},{"title":"Russia says new round of talks expected soon","content":"<ul>\n\t<li>Russian negotiators in talks with Ukraine say another round of talks will likely be held shortly.<\/li>\n\t<li>Vladimir Medinsky, Russian President Vladimir Putin&rsquo;s adviser who led the Russian delegation in the talks Thursday in Belarus near the Polish border, said the parties&rsquo; &ldquo;positions are absolutely clear, they are written down point by point,&rdquo; including issues related to a political settlement of the conflict.<\/li>\n\t<li>He added without elaboration that &ldquo;mutual understanding was found on part of them.&rdquo;<\/li>\n\t<li>He confirmed that Russia and Ukraine reached a tentative agreement to create safe corridors for civilians to exit besieged cities and observe local cease-fires in areas where they will be created.<\/li>\n\t<li>Leonid Slutsky, a senior Russian lawmaker who was part of the Russian delegation in talks, said that the details of safe corridors will need to be worked out quickly.<\/li>\n\t<li>He said that the next round of talks could lead to agreements, some of which would need to be ratified by Russian and Ukrainian parliaments.<\/li>\n<\/ul>\n","date":"2022-03-04 00:10:22","pin":"0","status":"1"},{"title":"US says Russia has fired 480 missiles so far","content":"<ul>\n\t<li>U.S. officials say Russia has fired 480 missiles at Ukraine as Russian troops make more progress in the south, but are largely stalled in the north.<\/li>\n\t<li>The official says about 90% of the Russian combat power that had been arrayed around Ukraine is now in the country.<\/li>\n\t<li>Specifically, the official said that the majority of the Russian missile launches since the war began &ndash; or more than 230 of them &ndash; are coming from mobile systems within Ukraine.<\/li>\n\t<li>More than 150 missiles have been fired from within Russia, more than 70 from Belarus and only a very small number from ships in the Black Sea.<\/li>\n\t<li>Ukrainian air defenses are still intact and have been effective against the missiles, the official said.<\/li>\n\t<li>The official, who spoke on condition of anonymity to discuss military assessments, said Russian progress in the south has been aided by the country&rsquo;s eight-year presence in Crimea, where Russia has built infrastructure and systems to sustain troops.<\/li>\n\t<li>As a result, the supply lines to troops in the south are much shorter and more effective.<\/li>\n\t<li>The official said the U.S. has not seen any Russian naval activity or other appreciable moves by Russia to move on Odesa.<\/li>\n\t<li>He said he is not challenging Ukrainian reports of activity there, but that the U.S. can&rsquo;t independently confirm them.<\/li>\n\t<li>He added, however, that the U.S. believes that Russia&rsquo;s goal may be to move past Kherson to Mykolayiv in order to set up a base of operations there that they can then use in a move to encircle and take Odesa.<\/li>\n\t<li>The U.S. also assesses that Russian forces are just outside the city of Kharkiv, close to the ring road, the official said.<\/li>\n<\/ul>\n","date":"2022-03-04 00:32:58","pin":"0","status":"0"},{"title":"US says Russia has fired 480 missiles so far","content":"<ul>\n\t<li>U.S. officials say Russia has fired 480 missiles at Ukraine as Russian troops make more progress in the south, but are largely stalled in the north.<\/li>\n\t<li>The official says about 90% of the Russian combat power that had been arrayed around Ukraine is now in the country.<\/li>\n\t<li>Specifically, the official said that the majority of the Russian missile launches since the war began &ndash; or more than 230 of them &ndash; are coming from mobile systems within Ukraine.<\/li>\n\t<li>More than 150 missiles have been fired from within Russia, more than 70 from Belarus and only a very small number from ships in the Black Sea.<\/li>\n\t<li>Ukrainian air defenses are still intact and have been effective against the missiles, the official said.<\/li>\n\t<li>The official, who spoke on condition of anonymity to discuss military assessments, said Russian progress in the south has been aided by the country&rsquo;s eight-year presence in Crimea, where Russia has built infrastructure and systems to sustain troops.<\/li>\n\t<li>As a result, the supply lines to troops in the south are much shorter and more effective.<\/li>\n\t<li>The official said the U.S. has not seen any Russian naval activity or other appreciable moves by Russia to move on Odesa.<\/li>\n\t<li>He said he is not challenging Ukrainian reports of activity there, but that the U.S. can&rsquo;t independently confirm them.<\/li>\n\t<li>He added, however, that the U.S. believes that Russia&rsquo;s goal may be to move past Kherson to Mykolayiv in order to set up a base of operations there that they can then use in a move to encircle and take Odesa.<\/li>\n\t<li>The U.S. also assesses that Russian forces are just outside the city of Kharkiv, close to the ring road, the official said.<\/li>\n<\/ul>\n","date":"2022-03-04 00:33:19","pin":"0","status":"1"},{"title":"CEO of a top cryptocurrency transaction-tracking firm on latest sanctions","content":"<ul>\n\t<li>The CEO of a top cryptocurrency transaction-tracking firm said Thursday that it was not yet seeing any large-scale evasion of Western sanctions on Russian businesses and individuals using the virtual currencies.<\/li>\n\t<li>U.S. officials have said they are looking at the sector for possible bans as punishment for Russia&rsquo;s invasion of Ukraine.<\/li>\n\t<li>&ldquo;The size of the crypto economy is still relatively small to be a viable substitute for access to the global financial system and to the U.S. dollar,&rdquo; said Esteban Casta&ntilde;o, CEO of San Francisco-based TRM Labs.<\/li>\n\t<li>He said that in monitoring crypto flows his firm has seen some but not very significant spikes in crypto trading on &ldquo;certain exchanges&rdquo; he did not name.<\/li>\n\t<li>Casta&ntilde;o said he could not comment on whether any of them would be sanctioned or when sanctions might occur.<\/li>\n\t<li>TRM Labs monitors more than 300 Russia-based crypto exchanges and brokers, some of which could be targets of sanctions.<\/li>\n\t<li>In September, the U.S. Treasury department banned transactions with the Russian virtual currency broker SUEX OTC over its handling of transactions of ransomware and other cybercriminals.<\/li>\n\t<li>SUEX was what is known as a &ldquo;parasite exchange.&rdquo;<\/li>\n\t<li>Such brokerages are difficult to detect by legitimate exchanges, where they open accounts with fraudulent credentials to meet know-thy-customers requirements.<\/li>\n<\/ul>\n","date":"2022-03-04 00:35:29","pin":"0","status":"1"},{"title":"Macron says Putin 'refuses' to halt attacks","content":"<ul>\n\t<li>French President Emmanuel Macron said Thursday that he has again asked his Russian counterpart Vladimir Putin to halt attacks on Ukraine, but that Putin won&#39;t do it.<\/li>\n\t<li>&ldquo;At this point, he refuses,&rdquo; Macron wrote in Twitter post.<\/li>\n\t<li>He confirmed that he had spoken to Putin on the phone earlier on Thursday and said he will continue the dialogue to prevent &ldquo;more human tragedy.&rdquo;<\/li>\n\t<li>&ldquo;We must prevent the worst from happening,&rdquo; Macron also said in his post. Dialogue has to continue to &ldquo;protect the (civilian) population, to obtain good will gestures ... to put an end to this war,&rdquo; Macron said.<\/li>\n<\/ul>\n","date":"2022-03-04 00:58:55","pin":"0","status":"1"},{"title":"Macron says Putin 'refuses' to halt attacks","content":"<ul>\n\t<li>French President Emmanuel Macron said Thursday that he has again asked his Russian counterpart Vladimir Putin to halt attacks on Ukraine, but that Putin won&#39;t do it.<\/li>\n\t<li>&ldquo;At this point, he refuses,&rdquo; Macron wrote in Twitter post.<\/li>\n\t<li>He confirmed that he had spoken to Putin on the phone earlier on Thursday and said he will continue the dialogue to prevent &ldquo;more human tragedy.&rdquo;<\/li>\n\t<li>&ldquo;We must prevent the worst from happening,&rdquo; Macron also said in his post. Dialogue has to continue to &ldquo;protect the (civilian) population, to obtain good will gestures ... to put an end to this war,&rdquo; Macron said.<\/li>\n<\/ul>\n","date":"2022-03-04 00:59:07","pin":"0","status":"0"},{"title":"Ukraine officials on the latest round of talks with Russia","content":"<ul>\n\t<li>A Ukrainian official who attended talks with Russians on Thursday said that &ldquo;regrettably, we haven&rsquo;t reached results we were hoping for,&rdquo; but emphasized the importance of humanitarian corridors, saying that many cities have been besieged by the Russian troops and are experiencing a dramatic shortage of food and medicines.<\/li>\n\t<li>The establishment of safe corridors was the Ukrainians&rsquo; main demand heading into their second round of negotiations in Belarus, in the Brest region that borders Poland.<\/li>\n\t<li>Ukraine&rsquo;s presidential adviser Mykhialo Podolyak said that Russia and Ukraine will quickly set the necessary channels of communications and logistics to organize those safe corridors.<\/li>\n\t<li>Podolyak added that a third round of talks will be held shortly.<\/li>\n<\/ul>\n","date":"2022-03-04 01:00:26","pin":"0","status":"1"},{"title":"33 killed so far in Chernihiv attack","content":"<ul>\n\t<li>Ukraine&rsquo;s state emergencies agency now says at least 33 civilians have been killed and another 18 wounded in a Russian strike on a residential area in the city of Chernihiv, a city of 280,000 in Ukraine&rsquo;s north.<\/li>\n\t<li>The agency said Thursday night that it was forced to suspend the search for more casualties in the rubble because of new shelling.<\/li>\n\t<li>Earlier Thursday, the agency had said at least 22 civilians had been killed, and had warned that the death toll could rise.<\/li>\n<\/ul>\n","date":"2022-03-04 01:01:14","pin":"0","status":"1"},{"title":"US, UK impose more sanctions on high-profile Russians","content":"<ul>\n\t<li>The Biden administration on Thursday announced new sanctions against Russian oligarchs and others in President Vladimir Putin&#39;s inner circle as Russian forces continue to pummel Ukraine.<\/li>\n\t<li>Those targeted by the new sanctions include Putin&#39;s press secretary, Dmitry Peskov, and Alisher Burhanovich Usmanov, one of Russia&#39;s wealthiest individuals and a close ally of Putin.<\/li>\n\t<li>The US State Department also announced it was imposing visa bans on 19 Russian oligarchs and dozens of their family members and close associates.<\/li>\n\t<li>&quot;These individuals and their family members will be cut off from the US financial system; their assets in the United States will be frozen and their property will be blocked from use,&quot;&nbsp;the White House said in a statement announcing the new penalties.<\/li>\n\t<li>Britain has slapped sanctions on two more Russians it says are linked to the Kremlin, cutting them off from properties and interests in the U.K.<\/li>\n\t<li>The government says Alisher Usmanov and Igor Shuvalov face immediate asset freezes and travel bans.<\/li>\n\t<li>The U.K. says the two men are worth a combined $19 billion. Mining and telecoms tycoon Usmanov, who has held major stakes in Premier League soccer teams Arsenal and Everton, owns two English mansions and other assets.<\/li>\n\t<li>Britain called Shuvalov, a former Russian government chief of staff who headed up Russia&rsquo;s bid for the 2018 Football World Cup, a core member of Russian President Vladimir Putin&rsquo;s inner circle.<\/li>\n\t<li>The announcement comes as the government is under pressure to hit the assets of more Russians in the U.K., which has long been a favored haven for Russian wealth.<\/li>\n\t<li>The U.K. has imposed sanctions on fewer wealthy Russians than the European Union or the U.S.<\/li>\n<\/ul>\n","date":"2022-03-04 01:03:32","pin":"1","status":"1"}]}