{"details":[{"title":"Biden says Americans should not worry about nuclear war after Russian actions","content":"<p>US President Joe Biden said on Monday said Americans should not worry about a nuclear war after Moscow put its nuclear deterrent on high alert amid a barrage of Western reprisals over Russia&#39;s invasion of Ukraine.<\/p>\n\n<p>In response to a question about whether US citizens should be concerned about a nuclear war breaking out, Biden said &quot;no&quot;.<\/p>\n\n<p>White House officials said earlier in the day the United States sees no reason to change its nuclear alert levels at this time, White House Press Secretary Jen Psaki said.<\/p>\n\n<p>&quot;But it&#39;s also important to remember that, even over the course of the last several months and years, when we have had significant disagreements with Russia over a range of issues, Russia and the United States have long agreed that nuclear use would have devastating consequences and have stated many times, including earlier this year, that a nuclear war cannot be won and must never be fought,&quot; she said in response to a question.<\/p>\n\n<p>Throughout the crisis, Russia and President Putin have falsely alleged that it is under threat, including from Ukraine, including from NATO, she noted.<\/p>\n","date":"2022-03-01 08:32:31","pin":"0","status":"1"},{"title":"India calls for immediate cessation of violence","content":"<p>India has said that it was deeply concerned over the deteriorating situation in Ukraine and reiterated its call for immediate cessation of violence and end to hostilities, saying all differences can only be bridged through honest, sincere and sustained dialogue.<\/p>\n\n<p>India&#39;s Permanent Representative to the UN Ambassador T S Tirumurti told a rare emergency special session of the UN General Assembly on Ukraine convened on Monday that New Delhi is doing whatever it can to undertake immediate and urgent evacuation efforts of Indian nationals still stranded in Ukraine.<\/p>\n\n<p>&quot;My government firmly believes that there is no other choice but to return to the path of diplomacy,&quot; he said.<\/p>\n","date":"2022-03-01 08:36:17","pin":"0","status":"1"},{"title":"Half a million people have fled Ukraine","content":"<p>More than half a million people have fled Ukraine in the last five days, the UN&#39;s refugee agency says, with tens of thousands more displaced inside the country.<\/p>\n\n<p><img alt=\"\" src=\"https:\/\/images.newindianexpress.com\/uploads\/user\/ckeditor_images\/article\/2022\/3\/1\/AP22059469618652.jpg\" \/><\/p>\n","date":"2022-03-01 08:43:18","pin":"0","status":"1"},{"title":"Temporary camp for Indian students at the Siret border","content":"<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\">Indian students at the temporary camps set up at the Siret border in Romania <a href=\"https:\/\/t.co\/yuNiq8AVPy\">pic.twitter.com\/yuNiq8AVPy<\/a><\/p>\n&mdash; ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1498495368501534721?ref_src=twsrc%5Etfw\">March 1, 2022<\/a><\/blockquote>\n<script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2022-03-01 08:46:42","pin":"0","status":"1"},{"title":"Ambassador to US says Ukraine needs weapons","content":"<p>Ukraine&#39;s ambassador to the US is telling senators her country needs more military weapons as it fights the Russian invasion.<\/p>\n\n<p>Senators emerged from a Monday evening meeting with Ambassador Oksana Markarova at the Capitol as Congress is preparing supplemental funding to help Ukraine during the crisis.<\/p>\n\n<p>The White House is seeking at least $6.4 billion in military and humanitarian aid. &quot;They need more arms,&quot; said Sen. Mark Warner, D-Va., the chairman of the Intelligence Committee. &quot;It&#39;s David versus Goliath,&quot; said Sen. Jim Risch of Idaho, the top Republican on the Foreign Relations Committee.<\/p>\n\n<p>&quot;I think that any human being reading the reports coming out of there realise that this is dire.&quot;<\/p>\n\n<p>Senators in the US are working to provide ammunition such as anti-tank and anti-aircraft systems to Ukraine -- what Risch called an &quot;all of the above&quot; effort.<\/p>\n","date":"2022-03-01 08:49:55","pin":"0","status":"1"},{"title":"Ninth flight carrying 218 stranded Indians departs from Bucharest","content":"<p>The ninth flight carrying 218 stranded Indian nationals has departed from the Romanian capital Bucharest for New Delhi under Operation Ganga, informed External Affairs Minister S Jaishankar on Tuesday.&nbsp;<\/p>\n\n<p>Earlier late on Monday night, another flight from Bucharest with 182 Indian nationals departed for Mumbai.<\/p>\n\n<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\">We will not rest till our fellow Indians are safe.<br \/>\n<br \/>\nNinth <a href=\"https:\/\/twitter.com\/hashtag\/OperationGanga?src=hash&amp;ref_src=twsrc%5Etfw\">#OperationGanga<\/a> flight departs Bucharest for New Delhi with 218 Indian nationals. <a href=\"https:\/\/t.co\/uQzlBMlxi9\">https:\/\/t.co\/uQzlBMlxi9<\/a><\/p>\n&mdash; Dr. S. Jaishankar (@DrSJaishankar) <a href=\"https:\/\/twitter.com\/DrSJaishankar\/status\/1498447083313184768?ref_src=twsrc%5Etfw\">February 28, 2022<\/a><\/blockquote>\n<script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2022-03-01 08:59:01","pin":"0","status":"1"},{"title":"Artillery kills 70 Ukraine soldiers","content":"<p>More than 70 Ukrainian soldiers were killed after Russian artillery hit a military base in Okhtyrka, a city between Kharkiv and Kyiv, the head of the region wrote on Telegram. Dmytro Zhyvytskyy posted photographs of the charred shell of a four-story building and rescuers searching rubble.<\/p>\n\n<p>In a later Facebook post, he said many Russian soldiers and some local residents also were killed during the fighting on Sunday. The report could not immediately be confirmed.<\/p>\n","date":"2022-03-01 10:00:18","pin":"0","status":"1"},{"title":"Ukrainian tennis player won't play Russian unless tours act","content":"<p>Top-seeded Elina Svitolina, a 27-year-old professional tennis player from Ukraine, says she will withdraw from the Monterrey Open rather than face a Russian opponent at the Mexican tournament unless tennis&#39;s governing bodies follow the International Olympic Committee&#39;s lead and insist that players from Russia and Belarus are only identified as &quot;neutral athletes&quot;.&nbsp;<\/p>\n\n<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"und\">????????????? <a href=\"https:\/\/twitter.com\/hashtag\/Ukraine?src=hash&amp;ref_src=twsrc%5Etfw\">#Ukraine<\/a> <a href=\"https:\/\/twitter.com\/hashtag\/%D0%A3%D0%BA%D1%80%D0%B0%D1%97%D0%BD%D0%B0?src=hash&amp;ref_src=twsrc%5Etfw\">#???????<\/a> <a href=\"https:\/\/twitter.com\/hashtag\/StandWithUkriane?src=hash&amp;ref_src=twsrc%5Etfw\">#StandWithUkriane<\/a> <a href=\"https:\/\/t.co\/1LT4WjrYI9\">pic.twitter.com\/1LT4WjrYI9<\/a><\/p>\n&mdash; Elina Monfils (@ElinaSvitolina) <a href=\"https:\/\/twitter.com\/ElinaSvitolina\/status\/1498351682668965891?ref_src=twsrc%5Etfw\">February 28, 2022<\/a><\/blockquote>\n<script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>\n\n<p>Svitolina wrote Monday on Twitter that she did not want to play her opening-round contest against Anastasia Potapova &quot;nor any other match against Russian or Belarussian tennis players until&quot; the WTA women&#39;s tour, ATP men&#39;s tour and International Tennis Federation &quot;follow the recommendations of the IOC&quot; and bar those countries&#39; competitors from using any national symbols, colors, flags or anthems.<\/p>\n","date":"2022-03-01 10:02:45","pin":"0","status":"1"},{"title":"Putin's claim to rid Ukraine of Nazis is especially absurd given its history","content":"<p>Russian President Vladimir Putin justifies his war on Ukraine as a peacekeeping mission, a &quot;denazification&quot; of the country.<\/p>\n\n<p>In his address to the Russian people on Feb.24, 2022, Putin said the purpose was to &quot;protect people&quot; who had been &quot;subjected to bullying and genocide&quot;&nbsp;for the last eight years.<\/p>\n\n<p><img alt=\"\" src=\"https:\/\/images.newindianexpress.com\/uploads\/user\/imagelibrary\/2022\/2\/28\/original\/Putin_AP.jpg\" \/><\/p>\n\n<p>And for this we will strive for the demilitarization and denazification of Ukraine.<\/p>\n\n<p>The victims of the genocide claimed by Putin are Russian speakers; the Nazis he referenced are the elected representatives of the Ukrainian people.<\/p>\n\n<p>While Ukraine&#39;s new language laws have upset some minorities, independent news media have uncovered no evidence of genocide against Russian speakers.<\/p>\n","date":"2022-03-01 10:39:08","pin":"0","status":"1"},{"title":"Russia invasion convoy masses near Ukraine capital","content":"<p>A huge Russian military convoy was massing on the outskirts of Ukraine&#39;s capital Tuesday as fears grew the invading forces were set to launch devastating assaults aimed at taking control of Kyiv and other major cities.<\/p>\n\n<p><img alt=\"\" src=\"https:\/\/images.newindianexpress.com\/uploads\/user\/ckeditor_images\/article\/2022\/3\/1\/AP22059703320544.jpg\" \/><\/p>\n\n<p>Initial ceasefire talks between Moscow and Kyiv on Monday failed to secure a breakthrough, with Russia shelling residential areas in Ukraine&#39;s second city Kharkiv and other areas of the country after the negotiations. <a href=\"https:\/\/www.newindianexpress.com\/world\/2022\/mar\/01\/40-mile-russian-convoy-threatens-kyiv-shelling-intensifies-2425025.html\"><strong>(Read more)<\/strong><\/a><\/p>\n","date":"2022-03-01 11:09:01","pin":"0","status":"1"},{"title":"PM Modi briefs President Kovind on Ukraine crisis","content":"<p>Prime Minister Narendra Modi met President Ram Nath Kovind on Tuesday and briefed him on various issues, including the Ukraine crisis, official sources said. The government has launched &quot;Operation Ganga&quot; to evacuate Indian citizens, mostly students, from Ukraine, which has been attacked by Russia.<\/p>\n","date":"2022-03-01 11:42:48","pin":"0","status":"1"},{"title":"Australia commits USD 50 million in support for Ukraine","content":"<p>Australia will provide Ukraine with USD 50 million in missiles, ammunition and other military hardware to fight Russian invaders.&nbsp;Australian Prime Minister Scott Morrison on Tuesday elaborated on his country&#39;s plans after revealing a day earlier that his government would provide Ukraine President Volodymyr Zelenskyy with lethal military equipment.<\/p>\n","date":"2022-03-01 11:57:38","pin":"0","status":"1"},{"title":"6,400 anti-war protesters detained by Russia","content":"<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\">Around 6,400 anti-war protesters have been detained by Russia (across 103 cities) since the war began on Thursday, according to OVD-Info Monitor. <a href=\"https:\/\/twitter.com\/mea?ref_src=twsrc%5Etfw\">@MEA<\/a> <a href=\"https:\/\/twitter.com\/NewIndianXpress?ref_src=twsrc%5Etfw\">@NewIndianXpress<\/a><\/p>\n&mdash; Yeshi Seli (@YeshiSeli) <a href=\"https:\/\/twitter.com\/YeshiSeli\/status\/1498547680628588545?ref_src=twsrc%5Etfw\">March 1, 2022<\/a><\/blockquote>\n<script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2022-03-01 12:08:37","pin":"0","status":"1"},{"title":"PM Modi asks Air Force to evacuate stranded Indians","content":"<p>Prime Minister Narendra Modi has asked the Indian Air Force (IAF) to evacuate Indians stranded in Ukraine due to the Russian military offensive against that country, sources said on Tuesday.<\/p>\n\n<p>The IAF is likely to deploy several C-17 aircraft as part of Operation Ganga from Tuesday, they said.<\/p>\n\n<p><img alt=\"\" src=\"https:\/\/images.newindianexpress.com\/uploads\/user\/imagelibrary\/2022\/2\/28\/original\/PM_Modi_SCO.jpg\" \/><\/p>\n\n<p>Till now, only private Indian carriers were evacuating Indians from Romania and Hungary, countries with land borders with Ukraine on the western side, as the Ukrainian airspace had been shut since February 24.<\/p>\n\n<p>In order to scale up the ongoing evacuation efforts under Operational Ganga, PM Modi has called for the IAF to join the exercise, the sources said.<\/p>\n","date":"2022-03-01 12:27:03","pin":"0","status":"1"},{"title":"Taiwan sends medical supplies to help Ukraine","content":"<p>Taiwan says it sent 27 tons worth of medical supplies to Ukraine via a flight to Germany late Monday.<\/p>\n\n<p>Foreign affairs ministry spokesperson Joanne Ou told reporters Tuesday that Taiwan was happy to assist as &quot;a responsible member of the international community, and a member of the democratic camp&quot;.<\/p>\n\n<p>Taiwan has strongly condemned Russia&#39;s invasion of Ukraine and had said it would impose economic sanctions against Russia.<\/p>\n\n<p>It has yet to reveal what those sanctions were, but the island is a dominant manufacturer of semiconductor chips, which are crucial to tech products ranging from smartphones to cars.<\/p>\n","date":"2022-03-01 12:28:09","pin":"0","status":"1"},{"title":"Russian forces have increased their use of artillery north of Kyiv","content":"<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\">Russian forces have increased their use of artillery north of Kyiv &amp; in the vicinities of Kharkiv &amp; Chernihiv. The use of heavy artillery in densely populated urban areas greatly increases the risk of civilian casualties: UK Ministry of Defence <a href=\"https:\/\/t.co\/9hvKBGthqI\">pic.twitter.com\/9hvKBGthqI<\/a><\/p>\n&mdash; ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1498553518156021760?ref_src=twsrc%5Etfw\">March 1, 2022<\/a><\/blockquote>\n<script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2022-03-01 12:35:22","pin":"0","status":"1"},{"title":"Leave Kyiv urgently today, India advises","content":"<p>Embassy of India in Ukraine has issued an advisory to Indians stuck in Kyiv, Ukraine.&nbsp;<\/p>\n\n<p>All Indian nationals living in Ukraine including students&nbsp;are advised to leave Kyiv urgently today. Preferably by trains or through any other available means, it said.&nbsp;<\/p>\n","date":"2022-03-01 12:40:23","pin":"0","status":"1"},{"title":"SpiceJet to operate evacuation flight to Kosice, Slovakia","content":"<p>SpiceJet will operate a special evacuation flight to Kosice, Slovakia today to bring back Indian nationals stranded in Ukraine. Union Law Minister Kiren Rijiju is travelling to Kosice as a Special Envoy of the Indian Government to oversee the evacuation.<\/p>\n","date":"2022-03-01 12:49:29","pin":"0","status":"1"},{"title":"Chechnya leader says his fighters killed in Ukraine","content":"<p>The strongman leader of Chechnya, Ramzan Kadyrov, said Tuesday that Chechens have been killed in Moscow&#39;s invasion of Ukraine.&nbsp;<\/p>\n\n<p>Kadyrov, a former rebel-turned-Kremlin-ally, has given his backing for President Vladimir Putin&#39;s attack on Ukraine, sending his notorious fighters to the country.<\/p>\n","date":"2022-03-01 13:10:28","pin":"0","status":"1"},{"title":"PM Modi asks Air Force to evacuate stranded Indians","content":"<p>Prime Minister Narendra Modi has asked the Indian Air Force to evacuate Indians stranded in Ukraine due to the Russian military offensive against that country, sources said on Tuesday. The IAF is likely to deploy several C-17 aircraft as part of Operation Ganga from Tuesday, they said.<\/p>\n","date":"2022-03-01 13:36:16","pin":"0","status":"1"},{"title":"Israel sends humanitarian aid to help Ukraine","content":"<p>Israel has begun sending 100 tons of humanitarian aid to assist people caught up in the fighting in Ukraine. An El Al plane was loaded with dozens of cardboard boxes at the country&#39;s main international airport. Israel&#39;s Foreign Ministry says it is sending medical equipment and medicine, water purification systems, thousands of tents, blankets, sleeping bags and coats.<\/p>\n","date":"2022-03-01 13:42:04","pin":"0","status":"1"},{"title":"Ukraine's second largest city shelled","content":"<p>The central square of Ukraine&#39;s second city, Kharkiv, was shelled by advancing Russian forces Tuesday -- hitting the building of the local administration -- regional governor Oleg Sinegubov said.&nbsp;<\/p>\n\n<p>&quot;This morning the central square of our city and the headquarters of the Kharkiv administration was criminally attacked,&quot; Sinegubov said in a video on Telegram.<\/p>\n","date":"2022-03-01 14:03:20","pin":"0","status":"1"},{"title":"YouTube blocks Russian channels RT, Sputnik in Europe","content":"<p>YouTube has blocked&nbsp;Russian state media channels RT and&nbsp;Sputnik in Europe<\/p>\n","date":"2022-03-01 14:08:57","pin":"0","status":"1"},{"title":"Refugees continue to flee from Ukraine","content":"<p>Estimated number of Ukrainian refugees and the countries which they&rsquo;ve fled to since Russia began its invasion of the country on February 24 <!-- start AP embed --><\/p>\n\n<p><iframe aria-label=\"Table\" height=\"406\" id=\"ap-chart-73WdW\" min-width=\"100%\" scrolling=\"no\" src=\"https:\/\/interactives.ap.org\/embeds\/73WdW\/3\/\" style=\"border:none\" title=\"Refugees fleeing Ukraine\"><\/iframe><script type=\"text\/javascript\">!function(){\"use strict\";window.addEventListener(\"message\",(function(e){if(void 0!==e.data[\"datawrapper-height\"]){var t=document.querySelectorAll(\"iframe\");for(var a in e.data[\"datawrapper-height\"])for(var r=0;r<t.length;r++){if(t[r].contentWindow===e.source)t[r].style.height=e.data[\"datawrapper-height\"][a]+\"px\"}}}))}();<\/script><!-- end AP embed --><\/p>\n","date":"2022-03-01 14:16:35","pin":"0","status":"1"},{"title":"","content":"<p><strong>East Ukraine city Mariupol loses electricity after Russian attacks<\/strong><\/p>\n","date":"2022-03-01 14:21:12","pin":"0","status":"1"},{"title":"France says sanctions will cause 'collapse' of Russian economy","content":"<p>France said on Tuesday that Western sanctions against Moscow over its invasion of Ukraine will cause the Russian economy to collapse. &quot;We will bring about the collapse of the Russian economy,&quot; Finance Minister Bruno Le Maire told the Franceinfo broadcaster a day after France, the EU and others said they would impose a new round of sanctions on Russia.<\/p>\n","date":"2022-03-01 14:25:26","pin":"0","status":"1"},{"title":"UK sanctions Russia's largest lender Sberbank","content":"<p>Britain said it was adding top lender Sberbank to its list of Russian entities sanctioned over the invasion of Ukraine, and warned that the costs would only increase for the Kremlin.<\/p>\n","date":"2022-03-01 14:45:18","pin":"0","status":"1"},{"title":"Shipping giant Maersk to stop deliveries to Russian ports","content":"<div style=\"text-align:center\">\n<figure class=\"image\" style=\"display:inline-block\"><img alt=\"\" height=\"300\" src=\"https:\/\/images.newindianexpress.com\/uploads\/user\/ckeditor_images\/article\/2022\/3\/1\/Ship.jpg\" width=\"600\" \/>\n<figcaption><em>Maersk Line ship. (Photo | AFP)<\/em><\/figcaption>\n<\/figure>\n<\/div>\n","date":"2022-03-01 14:55:22","pin":"0","status":"1"},{"title":"Ukraine President Zelensky to address European Parliament","content":"<div style=\"text-align:center\">\n<figure class=\"image\" style=\"display:inline-block\"><img alt=\"\" height=\"300\" src=\"https:\/\/images.newindianexpress.com\/uploads\/user\/imagelibrary\/2022\/2\/26\/original\/Volodymyr_Zelenskyy_AP_Image.jpg\" width=\"600\" \/>\n<figcaption><em>Ukraine President Volodymyr Zelenskyy (Photo | AP)<\/em><\/figcaption>\n<\/figure>\n<\/div>\n","date":"2022-03-01 15:00:03","pin":"0","status":"1"},{"title":"Indian student killed in shelling at Ukraine's second largest city Kharkiv","content":"<blockquote class=\"twitter-tweet\">&mdash; Arindam Bagchi (@MEAIndia) <a href=\"https:\/\/twitter.com\/MEAIndia\/status\/1498591114294554625?ref_src=twsrc%5Etfw\">March 1, 2022<\/a><\/blockquote>\n<script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>\n\n<p><\/p>\n","date":"2022-03-01 15:29:31","pin":"0","status":"1"},{"title":"Karnataka student Naveen killed in shelling","content":"<p>Karnataka student from Haveri district died in an attack by Russian force at Kharkiv city of Ukraine on Tuesday morning.&nbsp;It is said Naveen, who stepped out from Arkhitektora Beketova Metro station bunker to bring groceries, died in a shell attack on the street of Kharkiv.&nbsp;The incident took place around 7 am of local Ukraine time. <a href=\"https:\/\/www.newindianexpress.com\/nation\/2022\/mar\/01\/indian-student-from-haveri-district-in-karnataka-killed-in-shelling-in-ukraines-kharkiv-2425083.html\" target=\"_blank\"><strong>(READ MORE)<\/strong><\/a><\/p>\n","date":"2022-03-01 15:45:11","pin":"1","status":"1"},{"title":"UK's PM says West ready to sanction Russia for 'as long as it takes'","content":"<p>British Prime Minister Boris Johnson said on a visit to Poland that the West would keep up sanctions pressure on Russian President Vladimir Putin&#39;s regime indefinitely after it invaded Ukraine.<\/p>\n","date":"2022-03-01 16:14:47","pin":"0","status":"1"},{"title":"Over 660,000 refugees flee Ukraine: UN","content":"<ul>\n\t<li>\n\t<p>More than 660,000 refugees have fled the conflict in Ukraine to seek shelter in neighbouring countries, the UN Refugee Agency said.<\/p>\n\t<\/li>\n\t<li>\n\t<p>&quot;We have now over 660,000 refugees who have fled Ukraine to neighbouring countries in the past six days alone,&quot; spokeswoman Shabia Mantoo told reporters in Geneva.<\/p>\n\t<\/li>\n\t<li>\n\t<p>&quot;The numbers are exponentially increasing... At this rate, the situation looks set to become Europe&#39;s largest refugee crisis this century.&quot;<\/p>\n\t<\/li>\n<\/ul>\n","date":"2022-03-01 16:22:25","pin":"0","status":"1"},{"title":"Putin has 'shattered peace' in Europe: NATO chief","content":"<p>NATO chief Jens Stoltenberg said Russian President Vladimir Putin had &quot;shattered peace in Europe&quot; by invading Ukraine, adding that the Western defence alliance would defend &quot;every inch of our territory&quot;.&nbsp;<\/p>\n","date":"2022-03-01 16:28:10","pin":"0","status":"1"},{"title":"Russian shelling of Kharkiv 'violates laws of war': EU's Josep Borrell Fontelles","content":"<p>Russia&#39;s bombardment of civilian targets in&nbsp;Kharkiv broke international rules of conflict, the EU&#39;s foreign policy chief said.&nbsp;&quot;The shelling against civilian infrastructure&nbsp;violates the laws of war. The EU stands unwavering at the side of Ukraine in these dramatic moments,&quot; Josep Borrell said after a call with Ukraine&#39;s foreign minister.<\/p>\n","date":"2022-03-01 16:36:27","pin":"0","status":"1"},{"title":"Zelensky says Russian shelling of Kharkiv a 'war crime'","content":"<p>Ukrainian President Volodymyr Zelensky described Russian shelling of his country&#39;s second city as a war crime and said defending the capital from Moscow&#39;s army was a top priority.<\/p>\n","date":"2022-03-01 16:46:37","pin":"0","status":"1"},{"title":"Iran's leader says Ukraine is 'victim' of US policy","content":"<p>Iran&#39;s supreme leader said US policies are to blame for Russia&#39;s invasion of Ukraine, calling for an end to the war that broke out last week. &quot;The root cause of the Ukraine crisis is the US and the West&#39;s policies,&quot; Ayatollah Ali Khamenei said in a televised speech marking a Muslim religious anniversary.<\/p>\n","date":"2022-03-01 16:51:17","pin":"0","status":"1"},{"title":"Seventh evacuation flight carries 182 Indians home from war-torn Ukraine","content":"<p>182 Indian citizens from Ukraine have been brought back to India, by the seventh evacuation flight as part of Centre&#39;s&nbsp;Operation Ganga.<strong> <a href=\"https:\/\/www.newindianexpress.com\/nation\/2022\/mar\/01\/seventh-evacuation-flight-carries-182-indians-home-from-war-torn-ukraine-2425098.html\" target=\"_blank\">(READ MORE)<\/a><\/strong><\/p>\n","date":"2022-03-01 17:08:44","pin":"0","status":"1"},{"title":"Kremlin says 'too soon to assess' Ukraine talks","content":"<p>The Kremlin said it was too early to draw conclusions from a first round of talks held with Ukraine on ending the war following Moscow&#39;s invasion last week. Kremlin spokesman Dmitry Peskov said President Vladimir Putin had been informed about the talks and that &quot;it is too soon to assess&quot; their outcome.<\/p>\n","date":"2022-03-01 17:17:27","pin":"0","status":"1"},{"title":"Russian currency ruble plummets as sanctions bite","content":"<p>This digital chart shows the Ruble-to-dollar exchange rate over time <!-- start AP embed --><\/p>\n\n<p><iframe aria-label=\"Interactive line chart\" height=\"400\" id=\"ap-chart-k5tZl\" min-width=\"100%\" scrolling=\"no\" src=\"https:\/\/interactives.ap.org\/embeds\/k5tZl\/11\/\" style=\"border:none\" title=\"Russian ruble tanking against dollar\"><\/iframe><script type=\"text\/javascript\">!function(){\"use strict\";window.addEventListener(\"message\",(function(e){if(void 0!==e.data[\"datawrapper-height\"]){var t=document.querySelectorAll(\"iframe\");for(var a in e.data[\"datawrapper-height\"])for(var r=0;r<t.length;r++){if(t[r].contentWindow===e.source)t[r].style.height=e.data[\"datawrapper-height\"][a]+\"px\"}}}))}();<\/script><!-- end AP embed --><\/p>\n","date":"2022-03-01 17:22:29","pin":"0","status":"1"},{"title":"","content":"<p><iframe allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\" frameborder=\"0\" height=\"315\" src=\"https:\/\/www.youtube.com\/embed\/IDx78gB3vh4\" title=\"YouTube video player\" width=\"100%\"><\/iframe><\/p>\n","date":"2022-03-01 17:47:17","pin":"0","status":"1"},{"title":"Russian shelling kills 10 in Kharkiv: Ukrainians","content":"<p>Russian shelling on Ukraine&#39;s second-largest city Kharkiv killed at least 10 people and left many more injured, emergency services said, in an attack that targeted the central square and the main administration building.<\/p>\n","date":"2022-03-01 17:48:07","pin":"0","status":"1"},{"title":"UK says evicting Russia from UN Security Council among 'all options' on table","content":"<div style=\"text-align:center\">\n<figure class=\"image\" style=\"display:inline-block\"><img alt=\"\" height=\"300\" src=\"https:\/\/images.newindianexpress.com\/uploads\/user\/imagelibrary\/2022\/1\/25\/original\/Vladimir_Putin_AP.jpg\" width=\"600\" \/>\n<figcaption><em>Russia President Vladimir Putin (Photo | AP)<\/em><\/figcaption>\n<\/figure>\n<\/div>\n","date":"2022-03-01 17:53:17","pin":"0","status":"1"},{"title":"Russia committing 'geopolitical terrorism' in Ukraine: EU chief","content":"<p>Russia is guilty of &quot;geopolitical terrorism&quot; by violating international law in its invasion of Ukraine, EU chief Charles Michel said. &quot;The rules-based international order, democracy, human dignity are also under attack. This is geopolitical terrorism, pure and simple,&quot; Michel, the president of the European Council, told the European Parliament.<\/p>\n","date":"2022-03-01 18:01:31","pin":"0","status":"1"},{"title":"UN seeks USD 1.7 billion urgent aid for handling Ukraine crisis","content":"<p>The United Nations launched an emergency appeal Tuesday for USD 1.7 billion to provide urgent humanitarian aid to people caught up in the Russian invasion of Ukraine and refugees fleeing the fighting.<\/p>\n\n<p>The UN estimates that 12 million people inside Ukraine will need relief and protection, while it projected that more than four million Ukrainian refugees may need help in neighbouring countries in the coming months.<\/p>\n","date":"2022-03-01 18:38:06","pin":"0","status":"1"},{"title":"Operation Ganga: Special flight carrying Indians departs Romania's Bucharest","content":"<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\">The special flight of <a href=\"https:\/\/twitter.com\/hashtag\/OperationGanga?src=hash&amp;ref_src=twsrc%5Etfw\">#OperationGanga<\/a> carrying Indian nationals has departed from Romanian capital Bucharest to Delhi <a href=\"https:\/\/t.co\/7J8K5OeIyc\">pic.twitter.com\/7J8K5OeIyc<\/a><\/p>\n&mdash; ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1498637439250071552?ref_src=twsrc%5Etfw\">March 1, 2022<\/a><\/blockquote>\n<script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2022-03-01 18:38:58","pin":"0","status":"1"},{"title":"'Nobody is going to break us': Ukraine President Volodymyr Zelenskyy receives ovation at European Parliament","content":"<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\">Ukraine President Volodymyr Zelenskyy received a standing ovation after his address at European Parliament, said, &quot;We&#39;re fighting for our land &amp; our freedom despite the fact that all our cities are now blocked. Nobody is going to break us, we&#39;re strong, we&#39;re Ukrainians.&quot; he said <a href=\"https:\/\/t.co\/7JEU2Da9xd\">pic.twitter.com\/7JEU2Da9xd<\/a><\/p>\n&mdash; ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1498630372644765701?ref_src=twsrc%5Etfw\">March 1, 2022<\/a><\/blockquote>\n<script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2022-03-01 18:44:49","pin":"0","status":"1"},{"title":"WATCH| PM Narendra Modi chairs  high-level meeting on Ukraine issue","content":"<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\"><a href=\"https:\/\/twitter.com\/hashtag\/WATCH?src=hash&amp;ref_src=twsrc%5Etfw\">#WATCH<\/a> | Prime Minister Narendra Modi chairs a high-level meeting on <a href=\"https:\/\/twitter.com\/hashtag\/UkraineRussiaCrisis?src=hash&amp;ref_src=twsrc%5Etfw\">#UkraineRussiaCrisis<\/a> <a href=\"https:\/\/t.co\/K1kP3YhjFs\">pic.twitter.com\/K1kP3YhjFs<\/a><\/p>\n&mdash; ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1498648329261322240?ref_src=twsrc%5Etfw\">March 1, 2022<\/a><\/blockquote>\n<script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2022-03-01 18:52:04","pin":"0","status":"1"},{"title":"Evicting Russia from UN Security Council among 'all options': UK PM's spokesperson","content":"<p>The UK government is open to removing Russia as one of the five permanent members of the UN Security Council following the invasion of Ukraine, Prime Minister Boris Johnson&#39;s spokesman said on Tuesday.<\/p>\n\n<p><strong>(<\/strong><a href=\"https:\/\/www.newindianexpress.com\/world\/2022\/mar\/01\/uk-says-evicting-russia-from-un-security-council-among-all-options-2425126.html\" target=\"_blank\"><strong>CLICK HERE TO READ MORE<\/strong><\/a><strong>)<\/strong><\/p>\n","date":"2022-03-01 19:25:00","pin":"0","status":"1"},{"title":"Russia slow to win Ukraine's airspace, limiting war gains amid increasing sanctions","content":"<p>Russia&#39;s failure to do so in Ukraine, despite its vast military strength, has been a surprise and may help explain how Ukraine has so far prevented a rout. <strong><a href=\"https:\/\/www.newindianexpress.com\/world\/2022\/mar\/01\/russia-slow-to-win-ukraines-airspace-limiting-war-gains-amid-increasing-sanctions-2425129.html\" target=\"_blank\">(READ FULL STORY HERE)<\/a><\/strong><\/p>\n","date":"2022-03-01 20:00:00","pin":"0","status":"1"},{"title":"Russia slow to win Ukraine's airspace, limiting war gains amid increasing sanctions","content":"<p>Russia&#39;s failure to do so in Ukraine, despite its vast military strength, has been a surprise and may help explain how Ukraine has so far prevented a rout. <strong><a href=\"https:\/\/www.newindianexpress.com\/world\/2022\/mar\/01\/russia-slow-to-win-ukraines-airspace-limiting-war-gains-amid-increasing-sanctions-2425129.html\" target=\"_blank\">(READ FULL STORY HERE)<\/a><\/strong><\/p>\n","date":"2022-03-01 20:00:04","pin":"0","status":"0"},{"title":"NATO sees no need to change nuclear alert level even as Russia continues to pummel Ukraine","content":"<p>The Kremlin has raised the spectre of nuclear war, reporting on Monday that its land, air and sea nuclear forces were on high alert following President Vladimir Putin&#39;s weekend order. <strong><a href=\"https:\/\/www.newindianexpress.com\/world\/2022\/mar\/01\/nato-sees-no-need-to-change-nuclear-alert-level-even-as-russia-continues-to-pummel-ukraine-2425131.html\" target=\"_blank\">(READ FULL STORY HERE)<\/a><\/strong><\/p>\n","date":"2022-03-01 20:01:49","pin":"0","status":"1"},{"title":"WATCH | Russia-Ukraine War: Karnataka student killed in shelling, confirms MEA","content":"<p><iframe allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\" frameborder=\"0\" height=\"450\" src=\"https:\/\/www.youtube.com\/embed\/yJuDhvMdRug\" title=\"YouTube video player\" width=\"100%\"><\/iframe><\/p>\n","date":"2022-03-01 20:05:34","pin":"0","status":"1"},{"title":"A massive attack coming very soon for Kyiv?","content":"<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\"><a href=\"https:\/\/twitter.com\/hashtag\/BREAKING?src=hash&amp;ref_src=twsrc%5Etfw\">#BREAKING<\/a> Russia has told citizens in Kyiv living near military infrastructure to evacuate immediately <a href=\"https:\/\/twitter.com\/mea?ref_src=twsrc%5Etfw\">@mea<\/a> <a href=\"https:\/\/twitter.com\/NewIndianXpress?ref_src=twsrc%5Etfw\">@NewIndianXpress<\/a><\/p>\n&mdash; Yeshi Seli (@YeshiSeli) <a href=\"https:\/\/twitter.com\/YeshiSeli\/status\/1498669934318084103?ref_src=twsrc%5Etfw\">March 1, 2022<\/a><\/blockquote>\n<script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2022-03-01 20:15:02","pin":"0","status":"1"},{"title":"Shelling knocks out water lines in Ukraine","content":"<ul>\n\t<li>The U.N.&lsquo;s refugees chief is warning that many more vulnerable people will begin fleeing their homes in Ukraine if Russia&rsquo;s military offensive continues and further urban areas are hit.<\/li>\n\t<li>Filippo Grandi told reporters in Geneva on Tuesday that his agency has so far recorded 677,000 people fleeing from Ukraine to neighboring countries, with about half of those currently in Poland.<\/li>\n\t<li>Queues along the border are now tens of kilometers (miles) long and some people are having to wait days to cross.<\/li>\n\t<li>&ldquo;It is likely that if the military offensive continues and urban centers are hit one after the other, that we will see more and more people with less resources, with less connections, more vulnerable in every respect,&rdquo; he said. Grandi criticized instances where non-Ukrainians fleeing the country had reportedly suffered discrimination, but said this did not appear to be the result of government policies.<\/li>\n\t<li>He spoke at the launch of the U.N.&rsquo;s humanitarian appeal for Ukraine for $1.1 billion to help six million people in Ukraine over the next three months.<\/li>\n\t<li>U.N. humanitarian coordinator Martin Griffiths said shelling and bombing have already damaged water pipes, electricity lines, basic services.<\/li>\n\t<li>&quot;Hundreds of thousands of families are without drinking water,&rdquo; he said.<\/li>\n<\/ul>\n","date":"2022-03-01 20:17:29","pin":"0","status":"1"},{"title":"Ukraine gets fresh cache of weapons from Netherlands","content":"<ul>\n\t<li>The commander of the Dutch defense forces says that a shipment of anti-aircraft and anti-tank weapons has been handed to Ukrainian forces so they can be used to defend the country against the Russian invasion.<\/li>\n\t<li>Gen. Onno Eichelsheim told Dutch radio station NPO 1 on Tuesday that the 50 anti-tank systems and 200 Stinger anti-aircraft rockets &ldquo;have been moved toward Ukraine and are at this moment being handed over to the Ukrainian armed forces.&rdquo;<\/li>\n\t<li>He did not elaborate on where the weapons were given to the Ukrainians but said he expected they would be immediately deployed.<\/li>\n<\/ul>\n","date":"2022-03-01 20:18:39","pin":"0","status":"1"},{"title":"Italian embassy moves operations out of Kyiv","content":"<ul>\n\t<li>Weeks after many other embassies did so, the Italian Embassy in Kyiv, Ukraine, is transferring its operations to Lviv. , in the west of the country, which has largely escaped Russian shelling.<\/li>\n\t<li>The Italian Foreign Ministry&#39;s announced on Tuesday cited deteriorating security conditions in the Ukrainian capital and the resulting &ldquo;impossibility to guarantee full functionality.&rdquo;<\/li>\n\t<li>Earlier on Tuesday, Premier Mario Draghi told Parliament that the Italian ambassador was sheltering 87 Italians, including children and newborns, at his home in Kyiv.<\/li>\n\t<li>He added that most of those civilians were expected to head to Lviv later in the day. There are some 2,300 Italians in Ukraine, more than half of them residents of the country.<\/li>\n<\/ul>\n","date":"2022-03-01 20:19:29","pin":"0","status":"1"},{"title":"Lavrov faces protests at UN meeting","content":"<ul>\n\t<li>Scores of diplomats have walked out of two meetings at the United Nations in Geneva in which Russian Foreign Minister Sergey Lavrov was beamed in for a video statement, as a protest against Russia&rsquo;s invasion of Ukraine.<\/li>\n\t<li>Lavrov spoke by video to the Conference on Disarmament and the Human Rights Council, which he had planned to attend before closure of airspace to Russian planes by several European countries prevented his travel to the Swiss city.<\/li>\n\t<li>&ldquo;What you have seen is strong support for Ukraine,&rdquo; said Bonnie Jenkins, U.S. Undersecretary of State for arms control and international Security, after the walkout from the disarmament meeting.<\/li>\n\t<li>Shortly afterward, in a conference room two floors higher, scores of diplomats &mdash; including Ukraine&rsquo;s ambassador in Geneva and the foreign ministers of Canada and Denmark &mdash;poured out of the Human Rights Council chamber.<\/li>\n\t<li>A spokesman for the council said about 100 people left the room.<\/li>\n<\/ul>\n","date":"2022-03-01 20:20:29","pin":"0","status":"1"},{"title":"Oil prices soar amid the Ukraine War","content":"<ul>\n\t<li>Oil prices soared and investors shifted more money into ultra-safe US government bonds as Russia stepped up its war on Ukraine.<\/li>\n\t<li>The price of oil surged back above $100 a barrel after Russia, a major energy producer, faced further isolation and economic damage because of its invasion of Ukraine.<\/li>\n\t<li>The rush into bonds pushed the yield on the 10-year Treasury back down to 1. 77%, where it was in early February. Stock prices were mixed in the early going on Wall Street.<\/li>\n\t<li>The S&amp;P 500 was bobbing between small gains and losses in the first few minutes of trading. European markets were lower.<\/li>\n<\/ul>\n","date":"2022-03-01 20:37:44","pin":"0","status":"1"},{"title":"Turkey urges Russia to enact a ceasefire","content":"<ul>\n\t<li>Turkey&rsquo;s defense minister has called for a ceasefire in the conflict in Ukraine during a telephone discussion with his Russian counterpart, Sergei Shoigu, according to the Turkish defense ministry.<\/li>\n\t<li>During their conversation, Hulusi Akar &ldquo;emphasized the urgent need for a ceasefire&rdquo; to improve the humanitarian situation and to allow the evacuation of people caught up in Russia&rsquo;s military attacks on Ukraine, according to a ministry statement.<\/li>\n\t<li>The Turkish minister also told Shoigu that Turkey would continue to work to restore peace in<\/li>\n<\/ul>\n","date":"2022-03-01 21:08:29","pin":"0","status":"1"},{"title":"French Foreign Minister apologises. Here is why","content":"<ul>\n\t<li>French Finance Minister Bruno Le Maire said the word &ldquo;war&rdquo; he used earlier Tuesday to describe economic and financial sanctions against Russia was &ldquo;inappropriate.&rdquo;<\/li>\n\t<li>Le Maire said in a written statement &ldquo;we are determined to impose massive and efficient sanctions on Russia but we are not in a conflict against the Russian people.&rdquo;<\/li>\n\t<li>He added the word &ldquo;war&rdquo; is not in line with France&rsquo;s &ldquo;strategy of de-escalation.&rdquo; Le Maire&rsquo;s statement comes after his initial comments prompted a stark warning from a senior Russian official.<\/li>\n\t<li>Dmitry Medvedev, a deputy head of Russia&rsquo;s Security Council, said on Twitter : &ldquo;Watch your tongue, gentlemen! And don&rsquo;t forget that in human history, economic wars quite often turned into real ones.&rdquo;<\/li>\n\t<li>Tuesday morning on France Info radio, Le Maire had vowed to &ldquo;to deliver a total economic and financial war against Russia,&rdquo; adding the sanctions are &ldquo;going to cause the Russian economy to collapse.&rdquo;<\/li>\n<\/ul>\n","date":"2022-03-01 21:10:05","pin":"0","status":"1"},{"title":"Putin faces more heat for his 'genocide' remark","content":"<ul>\n\t<li>The leadership of Ukraine&rsquo;s main Holocaust memorial has asked the International Criminal Court to speak out against Vladimir Putin&rsquo;s false claims of a genocide in separatist regions in eastern Ukraine.<\/li>\n\t<li>In a letter to ICC prosecutor Karim Khan, the Babi Yar Holocaust Memorial&rsquo;s academic council said Putin&rsquo;s claims that Ukraine committed genocide &ldquo;is a lie.&rdquo;<\/li>\n\t<li>Putin has sought to justify his invasion of Ukraine by claiming he is protecting residents in the Donbas region, where separatists have fought Ukrainian forces.<\/li>\n\t<li>The letter asks Khan to make a &ldquo;legal statement about this so-called genocide.&rdquo; &ldquo;If President Putin wants to denounce genocide, he should reach out to those in the system of international justice, not begin a war against the people of Ukraine under false pretenses,&rdquo; it says.<\/li>\n\t<li>Babi Yar, a ravine in the Ukrainian capital, Kyiv, is where nearly 34,000 Jews were killed within 48 hours in 1941 when the city was under Nazi occupation.<\/li>\n\t<li>The killing was carried out by SS troops along with local collaborators. The memorial was inaugurated at a ceremony last October attended by the leaders of Ukraine, Israel and Germany.<\/li>\n\t<li>One of the leading donors to the project is Mikhail Fridman, a Ukrainian-born Russian oligarch. Fridman has spoken out against the invasion of Ukraine.<\/li>\n<\/ul>\n","date":"2022-03-01 21:11:54","pin":"0","status":"1"},{"title":"Kosovo wants to complete its NATO membership process soon","content":"<ul>\n\t<li>Fearing Russia&rsquo;s intervention through its regional ally Serbia, Kosovo leaders on Tuesday called on NATO to accelerate Kosovo&rsquo;s membership into the alliance.<\/li>\n\t<li>Kosovo has joined the United States, European Union and other global powers in slapping ever-tougher sanctions on Russia, a move which has not been done by neighboring Serbia.<\/li>\n\t<li>Kosovo president tweeted that &ldquo;Serbia is not neutral. Serbia stands with Russia. Democracies, including Kosovo stand with Ukraine. Kosovo in NATO.&rdquo; A day earlier she said that Kosovo&rsquo;s membership in NATO and the EU &ldquo;is more indispensable than ever.&rdquo;<\/li>\n\t<li>Defense Minister Armend Mehaj said that after Russia&rsquo;s invasion of Ukraine, &ldquo;Kosovo&rsquo;s accelerated membership to NATO is an immediate need to guarantee security and stability in the region and beyond,&rdquo; adding that, &ldquo;we should not wait for the worst to take decisions.&rdquo;<\/li>\n\t<li>Kosovo relations with Serbia are still tense despite an 11-year long EU-facilitated dialogue. Kosovo declared independence in 2008 after a bloody conflict with Serbia years earlier left more than 10,000 people dead and triggered a NATO intervention.<\/li>\n\t<li>Pristina&rsquo;s government is recognized by the United States and most EU nations, but Belgrade has refused to recognize its independence and relies on support from Russia and China in its bid to retain claims on the territory.<\/li>\n<\/ul>\n","date":"2022-03-01 21:13:40","pin":"0","status":"1"},{"title":"India needs to look after its interest, abstention from UNSC vote is right decision: Expert","content":"<p>On 24 February, Russia launched a large-scale invasion of Ukraine, which has killed over 350 civilians including an Indian student so far. While several nations have decided to send military support to Ukraine, India again abstained from voting at a UNSC meeting. Is India&rsquo;s stand just? <strong><a href=\"https:\/\/www.newindianexpress.com\/nation\/2022\/mar\/01\/india-needs-to-look-after-its-interestabstention-from-unsc-vote-is-right-decision-expert-2425139.html\" target=\"_blank\">(READ FULL INTERVIEW HERE)<\/a><\/strong><\/p>\n","date":"2022-03-01 21:23:48","pin":"0","status":"1"},{"title":"Guess how much Ukraine government pays its soldiers to fight Russia?","content":"<p>&quot;The Cabinet of Ministers has implemented the decision. And I want to repeat the President&#39;s words: this is not done to be thanked. It is being done so that our defenders and protectors know that the country is grateful to them. The state should pay for this vital work with dignity. In addition, we continue to do all we can to strengthen our defence capability internationally! Thank you for your support to all partner countries! Glory to Ukraine!&quot; said Minister of Defence of Ukraine Oleksii Reznikov. <strong><a href=\"https:\/\/www.newindianexpress.com\/world\/2022\/mar\/01\/guess-how-much-ukraine-government-pays-its-soldiers-to-fight-russia-2425040.html\" target=\"_blank\">(READ FULL STORY HERE)<\/a><\/strong><\/p>\n","date":"2022-03-01 21:25:32","pin":"0","status":"1"},{"title":"5,000 Russian soldiers dead or captured","content":"<ul>\n\t<li>A senior Western intelligence official briefed by multiple intelligence agencies estimated Tuesday that more than 5,000 Russian soldiers have been captured or killed so far, and that Ukrainian forces have eliminated significant numbers of Russian aircraft and tanks and some air defense systems.<\/li>\n\t<li>The official said that Russian forces have increased use of artillery north of Kyiv and around the eastern city of Kharkiv and northern city of Chernihiv, and have been using heavier weapons over the last 48 hours.<\/li>\n\t<li>The official also said that Russian forces are bogging down in the Donbas region in the east, where most Ukrainian forces are concentrated after eight years fighting Russian-backed separatists there.<\/li>\n\t<li>The official spoke on condition of anonymity to discuss the intelligence assessment.<\/li>\n<\/ul>\n","date":"2022-03-01 21:49:00","pin":"0","status":"1"},{"title":"Britain to go after Russian Oligarchs","content":"<ul>\n\t<li>Britain is vowing to end London&rsquo;s status as a haven for oligarchs and their ill-gotten gains with a law intended to prevent the real owners of businesses and properties being hidden from view.<\/li>\n\t<li>The government said the Economic Crime Bill will force anonymous foreign owners of U.K. property to reveal their real identities &rdquo;to ensure criminals cannot hide behind secretive chains of shell companies.&rdquo;<\/li>\n\t<li>Those who don&rsquo;t comply face being unable to sell their property or a five-year prison sentence.<\/li>\n\t<li>Prime Minister Boris Johnson said the measure, which has to be approved by Parliament, would help &ldquo;tear back the facade that those supporting (Russian President Vladimir) Putin&rsquo;s campaign of destruction have been hiding behind for so long.&rdquo;<\/li>\n\t<li>Successive British governments have promised for years to end London&rsquo;s status as a safe haven for dirty money, with little effect.<\/li>\n\t<li>The anti-corruption group Transparency International says Russians linked to the Kremlin or accused of corruption own 1.5 billion pounds&rsquo; ($2 billion) worth of London property, and 90,000 properties in Britain are owned by shell companies.<\/li>\n<\/ul>\n","date":"2022-03-01 21:50:52","pin":"0","status":"1"},{"title":"Montenegro imposes sanctions on Russia","content":"<ul>\n\t<li>Montenegro, a former ally that turned its back on Russia to enter NATO in 2017, has joined Western sanctions imposed against Moscow because of the war in Ukraine.<\/li>\n\t<li>Montenegro&rsquo;s foreign ministry on Tuesday said that by joining the sanctions Montenegro continues with full harmonization of its policies with those of the European Union. Additionally, &ldquo;we are showing solidarity with Ukraine and determination to help &hellip; re-establish peace in Europe,&rdquo; said the statement.<\/li>\n\t<li>Montenegro is seen as the next in line in the Western Balkans to join the EU.<\/li>\n\t<li>The country is divided among those favoring pro-Western policies and the pro-Serbian and pro-Russian camps.<\/li>\n\t<li>A pro-Serbian government recently fell in a parliamentary no-confidence vote with talks underway for the formation of a pro-Western one soon.<\/li>\n<\/ul>\n","date":"2022-03-01 21:52:11","pin":"0","status":"1"},{"title":"Kyiv TV tower hit now","content":"<ul>\n\t<li>The TV tower in Ukraine&#39;s capital has been hit, according to the country&#39;s parliament, which posted a photo of clouds of smoke around it.<\/li>\n\t<li>Local media reported that there were several explosions and that Ukrainian TV channels stopped broadcasting shortly afterward.<\/li>\n<\/ul>\n","date":"2022-03-01 21:54:03","pin":"0","status":"1"},{"title":"'Russia must stop bombings': Ukraine condoles death of Indian student in Kharkiv","content":"<p>Ukrainian envoy Igor Polikha also thanked India for extending humanitarian aid to his country, adding that the first plane carrying the relief materials is expected to land in Poland tonight. <strong><a href=\"https:\/\/www.newindianexpress.com\/world\/2022\/mar\/01\/russia-must-stop-bombings-ukraine-condoles-death-of-indian-student-in-kharkiv-2425146.html\" target=\"_blank\">(READ FULL STORY HERE)<\/a><\/strong><\/p>\n","date":"2022-03-01 22:31:18","pin":"0","status":"1"},{"title":"Russia kills five in attack on Kyiv TV tower","content":"<ul>\n\t<li>Russian forces fired at the Kyiv TV tower and Ukraine&#39;s main Holocaust memorial, among other civilian sites targeted Tuesday, Ukrainian officials said. Ukraine&rsquo;s State Service for Emergency Situations said the strikes on the TV tower killed five people and left five more wounded.<\/li>\n\t<li>Ukrainian parliament, the Verkhovna Rada, posted a photo of clouds of smoke around the TV tower, which is a couple miles from central Kyiv and a short walk from numerous apartment buildings.<\/li>\n\t<li>Kyiv Mayor Vitali Klitschko said an electrical substation powering the tower and a control room on the tower were damaged from the hit.<\/li>\n\t<li>The head of Ukrainian President Volodymyr Zelenskyy&#39;s office, Andriy Yermak, said on Facebook that a &ldquo;powerful missile attack on the territory where the (Babi) Yar memorial complex is located&rdquo; is underway.<\/li>\n\t<li>Babi Yar, a ravine in Kyiv, is where nearly 34,000 Jews were killed within 48 hours in 1941 when the city was under Nazi occupation. The killing was carried out by SS troops along with local collaborators.<\/li>\n<\/ul>\n","date":"2022-03-01 22:55:19","pin":"0","status":"1"},{"title":"Blinken meets senior UN official","content":"<ul>\n\t<li>U.S. Secretary of State Antony Blinken called on the U.N.&rsquo;s top human rights body to hold Russia accountable for its invasion of Ukraine.<\/li>\n\t<li>The top U.S. diplomat also singled out Russia in recorded remarks delivered to the Human Rights Council for repression within the country, citing reports that thousands of protesters in Russia who were opposed to the invasion had been detained.<\/li>\n\t<li>Blinken urged the council Tuesday to send a message that Russian President Vladimir Putin should unconditionally stop the &ldquo;unprovoked attack&rdquo; and withdraw its forces from Ukraine.<\/li>\n\t<li>&ldquo;We must condemn firmly and unequivocally Russia&rsquo;s attempt to topple a democratically elected government and its gross human rights abuses and violations of international humanitarian law, and we must take steps to hold the perpetrators accountable,&rdquo; he said.<\/li>\n\t<li>The comments came as the United States returned to its seat at the council, which had been abandoned under President Donald Trump, who alleged that the 47-member-state body was too accepting of autocratic governments and too biased against Israel.<\/li>\n<\/ul>\n","date":"2022-03-01 22:56:22","pin":"0","status":"1"},{"title":"Russia holds drills with nuclear subs, land-based missiles; Lavrov asks West not to set up military facilities on former USSR states","content":"<p>Russian nuclear submarines sailed off for drills in the Barents Sea and mobile missile launchers roamed snow forests on Tuesday in Siberia after President Vladimir Putin ordered his nation&#39;s nuclear forces put on high alert over tensions with the West over the invasion of Ukraine.<strong><a href=\"https:\/\/www.newindianexpress.com\/world\/2022\/mar\/01\/russia-holds-drills-with-nuclear-subs-land-based-missiles-lavrov-asks-west-not-to-set-upmilitary-2425158.html\" target=\"_blank\"> (READ FULL STORY HERE)<\/a><\/strong><\/p>\n","date":"2022-03-01 23:03:01","pin":"0","status":"1"},{"title":"Russia trying to prevent foreign divestment","content":"<ul>\n\t<li>Russia&rsquo;s Prime Minister Mikhail Mishustin said Tuesday the government has readied measures to temporarily restrict foreign investors from divesting Russian assets, saying the step would help them make &ldquo;a considered decision&rdquo; rather than succumb to political pressure of sanctions.<\/li>\n\t<li>Mishustin said a presidential decree had been prepared imposing &ldquo;temporary restrictions on exiting from Russian assets.&quot; He did not provide details or say if the restrictions would apply to some forms of investment or to all.<\/li>\n\t<li>Major Western corporations have come under pressure to divest stakes in Russian companies. Oil company BP said Sunday it would seek to dispose of its stake in Russian oil producer Rosneft and Shell said Monday it would exit all its Russian businesses.<\/li>\n\t<li>Other companies with major stakes include France&rsquo;s TotalEnergies, which holds 19.4% of natural gas company Novatek.<\/li>\n\t<li>Russian officials have taken steps to cushion the impact of massive economic sanctions, with the central bank raising interest rates to defend the ruble&rsquo;s exchange rate, requiring companies to sell foreign exchange earnings, and making unlimited short term credit available to banks.<\/li>\n<\/ul>\n","date":"2022-03-01 23:32:27","pin":"0","status":"1"},{"title":"Ukraine-born U.S. congresswoman delivers an emotional plea for Biden","content":"<ul>\n\t<li>A Ukraine-born U.S. congresswoman delivered an emotional plea for President Joe Biden to step up to save her country from Russia&rsquo;s invasion. Republican Rep. Victoria Spartz of Indiana spoke Tuesday alongside other GOP lawmakers ahead of Biden&rsquo;s first State of the Union address.<\/li>\n\t<li>&ldquo;This is not a war, this is a genocide of the Ukrainian people by a crazy man,&rdquo; Spartz said, without naming Russian President Vladimir Putin.<\/li>\n\t<li>The congresswoman wore the blue and yellow colors of Ukraine and said she still has family in the region, including her 95-year-old grandmother.<\/li>\n\t<li>She said Ukrainians &ldquo;want to be with the United States of America. They want to be free people.&rdquo; Biden &ldquo;must act decisively, fast, or this blood of many millions of Ukrainians will be on his hands, too,&rdquo; she said.<\/li>\n<\/ul>\n","date":"2022-03-01 23:33:22","pin":"0","status":"1"},{"title":"Turkey's Erdogan urges cease-fire in Ukraine","content":"<ul>\n\t<li>Turkish President Recep Tayyip Erdogan has called for an immediate cease-fire between the Russian and Ukrainian forces.<\/li>\n\t<li>&ldquo;Our call to both Russia and Ukraine is: let the firing stop as soon as possible, let Russia and Ukraine make a beautiful contribution to peace,&rdquo; Erdogan said Tuesday during a joint news conference with Kosovar President Vjosa Osmani-Sadriu, on Tuesday.<\/li>\n\t<li>The Turkish leader said Turkey welcomes overtures by European Union officials toward Ukraine after Ukrainian President Volodymyr Zelenskyy signed an application to join the bloc. He however, urged the EU to &ldquo;show the same sensitivity&rdquo; toward Turkey.<\/li>\n\t<li>The country is a candidate to join the EU but its accession talks have been stalled over a number of issues, including the country&rsquo;s democratic backtracking.<\/li>\n\t<li>&ldquo;Are you going to bring Turkey&rsquo;s (application) on the agenda when someone declares war on it and attacks?&rdquo; Erdogan said.<\/li>\n\t<li>Erdogan reiterated that Turkey, which has the second largest army within the alliance, supports NATO&rsquo;s expansion.<\/li>\n<\/ul>\n","date":"2022-03-01 23:49:16","pin":"0","status":"1"},{"title":"","content":"<ul>\n\t<li>Local authorities in Switzerland are indicating that the company that ran Nord Stream 2 AG, the pipeline that was built to bring Russian gas to Germany and was halted last week, is close to bankruptcy.<\/li>\n\t<li>Switzerland&rsquo;s economy minister said on Monday that Nord Stream 2 had dismissed all the employees at its Zug, Switzerland, headquarters.<\/li>\n\t<li>On Monday, the head of the Zug regional government&rsquo;s economy department, Silvia Thalmann-Gut, told Swiss outlet Blick TV that &ldquo;this isn&rsquo;t a mass dismissal &mdash; it&rsquo;s a mass dismissal if a company would continue to exist. But in this case, it&rsquo;s a bankruptcy.&rdquo;<\/li>\n\t<li>She said she was informed that 100-110 employees were affected, rather than the 140 that the economy minister cited. The Zug economy department later told German news agency dpa that Nord Stream 2 has &ldquo;massive payment difficulties&rdquo; because of sanctions but that no bankruptcy has yet been registered.<\/li>\n\t<li>The company could not immediately be reached for comment.<\/li>\n\t<li>The pipeline is owned by Russian-controlled gas giant Gazprom with investment from several European companies.<\/li>\n\t<li>The German government moved to halt the pipeline&rsquo;s certification on Feb. 22, after Russia recognized the independence of two separatist regions in eastern Ukraine.<\/li>\n\t<li>U.S. President Joe Biden President then directed his administration to impose sanctions on the operating company.<\/li>\n<\/ul>\n","date":"2022-03-02 00:04:41","pin":"0","status":"1"},{"title":"In talks with European leaders, Modi expresses anguish over Ukraine situation; Indian student injured in Kharkiv firing","content":"<p>Modi spoke to French President Emmanuel Macron, Polish President Andrzej Duda and European Council President Charles Michel amid a worsening situation in Ukraine as the Russian forces moved deeper into the country.<strong><a href=\"https:\/\/www.newindianexpress.com\/nation\/2022\/mar\/02\/in-talks-with-european-leaders-modi-expresses-anguish-over-ukraine-situation-indian-student-injure-2425187.html\" target=\"_blank\"> (READ FULL STORY HERE)<\/a><\/strong><\/p>\n","date":"2022-03-02 00:05:51","pin":"0","status":"1"},{"title":"Radio station critical of Kremlin goes silent","content":"<ul>\n\t<li>A top radio station critical of the Kremlin was taken off the airwaves on Tuesday, its chief editor said and the Associated Press confirmed, after the authorities threatened to shut it down over the coverage of Russia&rsquo;s invasion of Ukraine.<\/li>\n\t<li>The move against Echo Moskvy, one of Russia&rsquo;s oldest radio stations that critical of the authorities, comes amid growing pressure on Russia&rsquo;s independent media to cover the attack on Ukraine in accordance to the official line. Officials on Tuesday have also threatened to block Dozhd, Russia&rsquo;s top independent TV channel.<\/li>\n\t<li>The Prosecutor General&rsquo;s office claimed the two outlets spread content inciting extremist activities, as well as &ldquo;false information regarding the actions of Russian military personnel as part of a special operation&rdquo; in Ukraine.<\/li>\n<\/ul>\n","date":"2022-03-02 00:15:04","pin":"0","status":"1"},{"title":"Oklahoma Governor wants US to stop importation of Russian oil and natural gas","content":"<ul>\n\t<li>Oklahoma Gov. Kevin Stitt wrote to President Joe Biden on Tuesday, urging Biden&rsquo;s administration to halt the importation of Russian oil and natural gas and embrace domestic production.<\/li>\n\t<li>In his letter, the Republican also urged Biden&rsquo;s administration to support the construction of more domestic oil and gas infrastructure, including pipelines to transport natural gas to the East Coast. &ldquo;The recent events in Ukraine are yet another example of why we should be selling energy to our friends and not buying it from our enemies,&rdquo; Stitt wrote.<\/li>\n\t<li>The oil and natural gas industry is a huge driver of Oklahoma&rsquo;s economy, supporting nearly 390,000 jobs and providing more than $32.7 billion in annual wages in 2019, according to a report from the American Petroleum Institute.<\/li>\n\t<li>&ldquo;It is unfathomable and inexcusable that some Americans are forced to depend on Vladimir Putin for their energy needs as he wages war against Ukraine instead of their own country,&rdquo; Stitt wrote.<\/li>\n<\/ul>\n","date":"2022-03-02 00:16:17","pin":"0","status":"1"},{"title":"Nearly 12,000 Indians have left Ukraine, efforts are on to evacuate remaining 8,000 who are mostly in Kharkhiv","content":"<p>&quot;Prime Minister Narendra Modi chaired a meeting on Ukraine. He expressed his anguish and regret on the fourth year Medical Student, Naveen&rsquo;s, death. He said that we are concerned about Kharkhiv and Kyiv as it is in the conflict zone and he has emphasised on need to protect our students in conflict zone,&quot; said Foreign Secretary, Harsh Vardhan Shringla. <strong><a href=\"https:\/\/www.newindianexpress.com\/nation\/2022\/mar\/01\/nearly-12000-indians-have-left-ukraine-efforts-are-on-to-evacuateremaining-8000-who-are-mostly-in-kharkhiv-2425153.html\" target=\"_blank\">(READ FULL STORY HERE)<\/a><\/strong><\/p>\n","date":"2022-03-02 00:17:14","pin":"0","status":"1"},{"title":"We won't leave our pets here, say Malayali students fleeing Ukraine","content":"<p>Arya and Zaira&#39;s is a tale of endearing love. It was a few months ago that Arya Aldrin, a medical student studying in Ukraine, brought home a Husky and named her Zaira. <strong><a href=\"https:\/\/www.newindianexpress.com\/states\/kerala\/2022\/mar\/01\/we-wont-leave-our-pets-here-saymalayali-students-fleeing-ukraine-2425175.html\" target=\"_blank\">(READ FULL STORY HERE)<\/a><\/strong><\/p>\n","date":"2022-03-02 00:18:25","pin":"0","status":"1"},{"title":"Maharashtra: Osmanabad woman waiting for message from her daughter in Kyiv","content":"<ul>\n\t<li>Kalinda Thite, a resident of Maharashtra&#39;s Osmanabad district, has lost contact with her daughter Nikita who is stranded in Ukraine&#39;s capital Kyiv, she told PTI on Tuesday night.<\/li>\n\t<li>She last received a message from Nikita two days ago, said Kalinda, a teacher by profession. Nikita is a fourth-year MBBS student at Lugansk State Medical College, 830 km away from Kyiv, she said.<\/li>\n\t<li>&quot;Nikita had to attend online classes so she stayed in Kyiv with her friends in a rented apartment. She was shifted to a bunker when Russian attacks started. I received her last message a couple of days back that she was safe and the Embassy is going to evacuate her from the bunker where she is staying with her friends. She shared her location on WhatsApp. Now I am unable to contact her friends too,&quot; Thite added.<\/li>\n<\/ul>\n","date":"2022-03-02 00:24:02","pin":"0","status":"1"},{"title":"'Will be based on our interests': Shringla on India's position on Ukraine crisis as New Delhi sends first tranche of humanitarian aid","content":"<p>While at least two resolutions on the crisis are set to be brought before the UN Security Council, another is coming up at the UN General Assembly. <strong><a href=\"https:\/\/www.newindianexpress.com\/nation\/2022\/mar\/02\/will-be-based-on-our-interests-shringlaon-indias-position-on-ukraine-crisis-as-new-delhisends-2425199.html\" target=\"_blank\">(READ FULL STORY HERE)<\/a><\/strong><\/p>\n","date":"2022-03-02 00:29:44","pin":"0","status":"1"},{"title":"US to expel Russian 'operative' working for UN","content":"<ul>\n\t<li>The United States says it is expelling a Russian &ldquo;intelligence operative&rdquo; working for the United Nations, in addition to the 12 members of the Russian Mission to the United Nations whose expulsions were ordered Monday for engaging in espionage.<\/li>\n\t<li>U.N. spokesperson Stephane Dujarric confirmed Tuesday that the U.N. was informed Monday that the U.S. was taking action to expel a staff member working for the U.N. Secretariat.<\/li>\n\t<li>&ldquo;We regret that we find ourselves in this situation but are engaging with the host country,&rdquo; he said. Dujarric refused to comment further on grounds of privacy and the sensitivity of the issue but did say &ldquo;what makes this decision a little difficult to understand is that the staff member was scheduled to end his assignment on March 14.&rdquo;<\/li>\n\t<li>The U.S. Mission to the United Nations said in a statement Monday that the 12 Russian diplomats had &ldquo;abused their privileges of residency in the United States by engaging in espionage activities that are adverse to our national security.&rdquo;<\/li>\n\t<li>A spokesperson for the U.S. Mission said Tuesday: &ldquo;On Feb. 28, the United States also initiated the process to require the departure of one Russian intelligence operative working at the United Nations who has abused their privileges of residence in the United States.&rdquo;<\/li>\n\t<li>The spokesperson was not authorized to speak publicly and commented on condition of anonymity.<\/li>\n<\/ul>\n","date":"2022-03-02 00:54:49","pin":"0","status":"1"},{"title":"US to expel Russian 'operative' working for UN","content":"<ul>\n\t<li>The United States says it is expelling a Russian &ldquo;intelligence operative&rdquo; working for the United Nations, in addition to the 12 members of the Russian Mission to the United Nations whose expulsions were ordered Monday for engaging in espionage.<\/li>\n\t<li>U.N. spokesperson Stephane Dujarric confirmed Tuesday that the U.N. was informed Monday that the U.S. was taking action to expel a staff member working for the U.N. Secretariat.<\/li>\n\t<li>&ldquo;We regret that we find ourselves in this situation but are engaging with the host country,&rdquo; he said. Dujarric refused to comment further on grounds of privacy and the sensitivity of the issue but did say &ldquo;what makes this decision a little difficult to understand is that the staff member was scheduled to end his assignment on March 14.&rdquo;<\/li>\n\t<li>The U.S. Mission to the United Nations said in a statement Monday that the 12 Russian diplomats had &ldquo;abused their privileges of residency in the United States by engaging in espionage activities that are adverse to our national security.&rdquo;<\/li>\n\t<li>A spokesperson for the U.S. Mission said Tuesday: &ldquo;On Feb. 28, the United States also initiated the process to require the departure of one Russian intelligence operative working at the United Nations who has abused their privileges of residence in the United States.&rdquo;<\/li>\n\t<li>The spokesperson was not authorized to speak publicly and commented on condition of anonymity.<\/li>\n<\/ul>\n","date":"2022-03-02 00:55:12","pin":"0","status":"0"},{"title":"Canada to drag Russia to International Criminal Court","content":"<ul>\n\t<li>Canada&rsquo;s top diplomat said Tuesday her country will refer Russia to the International Criminal Court for crimes against humanity and war crimes over its invasion of Ukraine, a move that will speed up an investigation by the court&rsquo;s top prosecutor.<\/li>\n\t<li>Foreign Minister Melanie Joly made the comments after helping lead a walkout of scores of diplomats from the Human Rights Council just as her Russian counterpart, Sergey Lavrov, addressed the U.N. human rights body in recorded video remarks.<\/li>\n\t<li>&ldquo;Minister Lavrov was being broadcasted and giving his version, which is false about what is happening in Ukraine. And so that&rsquo;s why we wanted to show a very strong stance together today,&rdquo; said Joly, flanked by Ukraine&rsquo;s ambassador and standing behind that country&rsquo;s blue-and-yellow flag.<\/li>\n\t<li>On Monday, the ICC&rsquo;s chief prosecutor, Karim Khan, announced that he plans to open an investigation &ldquo;as rapidly as possible&rdquo; into war crimes and crimes against humanity in Ukraine.<\/li>\n\t<li>Khan told his team to explore how to preserve evidence of crimes and said the next step is to seek authorization from the court&rsquo;s judges to open an investigation.<\/li>\n\t<li>However, he added that the process would be speeded up if a member nation of the court were to ask for an investigation in what is known as a referral. Canada&rsquo;s announcement will set that acceleration in motion.<\/li>\n<\/ul>\n","date":"2022-03-02 00:57:12","pin":"0","status":"1"},{"title":"Biden mulling Russian plane ban from US airspace","content":"<p>President Joe Biden plans two announce that the U.S. is banning Russian planes from its airspace in retaliation for the Ukraine invasion, according to two people familiar with the matter, AP reported.<\/p>\n\n<p>The announcement follows similar actions by Canada and the European Union and is set to come during his State of the Union address Tuesday evening.<\/p>\n","date":"2022-03-02 06:57:12","pin":"0","status":"1"}]}