{"details":[{"title":"Russia-Ukraine War Highlights","content":"<p>Check out the previous day&#39;s&nbsp;Highlights of the&nbsp;Russia-Ukraine War <strong>(<a href=\"https:\/\/www.newindianexpress.com\/live\/2022\/mar\/03\/russia-ukraine-war-live-updates-18000-indians-left-ukraine-since-first-travel-advisory-mea-2425801.html\" target=\"_blank\">READ HERE<\/a>)<\/strong><\/p>\n","date":"2022-03-04 08:10:24","pin":"0","status":"1"},{"title":"Ukraine, Russia agree to create safe corridors","content":"<p>A member of Ukraine&rsquo;s delegation in talks with Russia says the parties have reached a tentative agreement to organize safe corridors for civilians to evacuate and for humanitarian supplies to be delivered.<\/p>\n","date":"2022-03-04 08:10:54","pin":"0","status":"1"},{"title":"Russia says new round of talks expected soon","content":"<p>U.S. officials say Russia has fired 480 missiles at Ukraine as Russian troops make more progress in the south, but are largely stalled in the north. The official says about 90% of the Russian combat power that had been arrayed around Ukraine is now in the country.<\/p>\n","date":"2022-03-04 08:11:32","pin":"0","status":"1"},{"title":"CEO of a top cryptocurrency transaction-tracking firm on latest sanctions","content":"<p>The CEO of a top cryptocurrency transaction-tracking firm said Thursday that it was not yet seeing any large-scale evasion of Western sanctions on Russian businesses and individuals using the virtual currencies.<\/p>\n","date":"2022-03-04 08:12:03","pin":"0","status":"1"},{"title":"Macron says Putin 'refuses' to halt attacks","content":"<p>French President Emmanuel Macron said Thursday that he has again asked his Russian counterpart Vladimir Putin to halt attacks on Ukraine, but that Putin won&#39;t do it.<\/p>\n","date":"2022-03-04 08:13:14","pin":"0","status":"1"},{"title":"Ukraine officials on the latest round of talks with Russia","content":"<p>A Ukrainian official who attended talks with Russians on Thursday said that &ldquo;regrettably, we haven&rsquo;t reached results we were hoping for,&rdquo; but emphasized the importance of humanitarian corridors, saying that many cities have been besieged by the Russian troops and are experiencing a dramatic shortage of food and medicines.<\/p>\n","date":"2022-03-04 08:15:23","pin":"0","status":"1"},{"title":"33 killed so far in Chernihiv attack","content":"<p>Ukraine&rsquo;s state emergencies agency now says at least 33 civilians have been killed and another 18 wounded in a Russian strike on a residential area in the city of Chernihiv, a city of 280,000 in Ukraine&rsquo;s north.<\/p>\n","date":"2022-03-04 08:20:49","pin":"0","status":"1"},{"title":"How Are Negotiations Going?","content":"<ul>\n\t<li>\n\t<p>A member of Ukraine&#39;s delegation sent to speak with the Russians said both sides have agreed to establish corridors for civilians to safely leave combat zones. The corridors will include cease-fires along the path, said Mykhailo Podolyak, an adviser to Zelenskyy.<\/p>\n\t<\/li>\n\t<li>\n\t<p>Humanitarian supplies could be delivered though the corridors, which were the Ukrainians&#39; main demand heading into their second round of negotiations Thursday in Belarus, in the Brest region that borders Poland.<\/p>\n\t<\/li>\n<\/ul>\n","date":"2022-03-04 08:22:12","pin":"0","status":"1"},{"title":"How Many Refugees?","content":"<ul>\n\t<li>\n\t<p>The United Nations announced 1 million people have fled Ukraine since the assault started. This amounts to more than 2% of Ukraine&rsquo;s population, though some of those fleeing Ukraine are citizens of other countries.<\/p>\n\t<\/li>\n\t<li>\n\t<p>The U.N. refugee agency has predicted up to 4 million people could eventually leave Ukraine, a country with a population of 44 million.<\/p>\n\t<\/li>\n\t<li>\n\t<p>The EU Commission says it will give temporary residence permits to refugees fleeing the violence and allow them to study and work in the 27-nation bloc.<\/p>\n\t<\/li>\n<\/ul>\n","date":"2022-03-04 08:28:30","pin":"0","status":"1"},{"title":"War's Death Toll","content":"<ul>\n\t<li>\n\t<p>Russia has acknowledged nearly 500 Russian troops have been killed so far and around 1,600 have been wounded.&nbsp;<\/p>\n\t<\/li>\n\t<li>\n\t<p>Ukraine has not released similar casualty figures for its armed forces.<\/p>\n\t<\/li>\n\t<li>\n\t<p>The U.N. human rights office says at least 227 civilians have been killed and 525 wounded in Ukraine since the start of the invasion on Feb. 24.&nbsp;<\/p>\n\t<\/li>\n\t<li>\n\t<p>Ukraine&rsquo;s State Emergency Service has said more than 2,000 civilians have died, though it&#39;s impossible to verify the claim.<\/p>\n\t<\/li>\n<\/ul>\n","date":"2022-03-04 08:31:04","pin":"0","status":"1"},{"title":"Russians shell Europe's largest nuclear power station in Enerhodar","content":"<p>Tuz told Ukrainian television that shells were falling directly on the Zaporizhzhia plant and had set fire to one of the facility&#39;s six reactors.<\/p>\n","date":"2022-03-04 08:35:19","pin":"0","status":"1"},{"title":"Russian General Killed","content":"<p>Maj. Gen. Andrei Sukhovetsky, the commanding general of the Russian 7th Airborne Division, was killed in fighting in Ukraine earlier this week. His death was confirmed by a local officers&rsquo; organization in the Krasnodar region in southern Russia. The circumstances of his death were not immediately clear. Sukhovetsky, who was 47, took part in Russia&rsquo;s military campaign in Syria. A funeral ceremony will be held in Novorossiisk.<\/p>\n","date":"2022-03-04 08:42:35","pin":"0","status":"1"},{"title":"Could Finland, Sweden Join NATO?","content":"<ul>\n\t<li>\n\t<p>Support for joining NATO has surged to record levels in Nordic neutrals Finland and Sweden.<\/p>\n\t<\/li>\n\t<li>\n\t<p>A poll commissioned by Finnish broadcaster YLE this week showed for the first time more than 50% of Finns support joining the Western military alliance. In neighboring Sweden, a similar poll showed those in favor of NATO membership outnumber those against.<\/p>\n\t<\/li>\n\t<li>\n\t<p>Moscow has warned it would be forced to take retaliatory measures if Finland and Sweden joined the alliance.<\/p>\n\t<\/li>\n<\/ul>\n","date":"2022-03-04 09:04:10","pin":"0","status":"1"},{"title":"What About The Russian People?","content":"<p>Ordinary Russians are also feeling the impact of the sanctions, from payment systems that won&rsquo;t operate and problems withdrawing cash to not being able to purchase certain items. Russian and Belarusian athletes are now banned from the Paralympics Games for their countries&rsquo; roles in the war in Ukraine when the Games open Friday.<\/p>\n","date":"2022-03-04 09:08:35","pin":"0","status":"1"},{"title":"Russian troops preventing us from extinguishing fire at a nuclear power plant: Ukrainian Emergency Services","content":"<blockquote class=\"twitter-tweet\" data-conversation=\"none\">\n<p dir=\"ltr\" lang=\"en\"><a href=\"https:\/\/twitter.com\/hashtag\/UPDATE?src=hash&amp;ref_src=twsrc%5Etfw\">#UPDATE<\/a> Ukrainian emergency services say Russian troops are preventing them from extinguishing a fire that broke out at a nuclear power plant after it was struck by shelling.<br \/>\n<br \/>\n&quot;The invaders are not authorising Ukrainian public rescue units to begin extinguishing the fire&quot; <a href=\"https:\/\/t.co\/DEQ4FeD6CQ\">pic.twitter.com\/DEQ4FeD6CQ<\/a><\/p>\n&mdash; AFP News Agency (@AFP) <a href=\"https:\/\/twitter.com\/AFP\/status\/1499583940633690118?ref_src=twsrc%5Etfw\">March 4, 2022<\/a><\/blockquote>\n<script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2022-03-04 09:15:51","pin":"0","status":"1"},{"title":"Is stuck convoy in Ukraine a setback for Russia?","content":"<p>For days, a massive Russian military convoy has sat, largely stalled about 15 miles outside Kyiv, the Ukrainian capital, which is believed to be the central target of Moscow&#39;s war. Eight days into the war, the expanse of Russian supply trucks, troops and weapons has been plagued with fuel and food shortages and logistical challenges, including weather and mud.<\/p>\n","date":"2022-03-04 09:22:14","pin":"0","status":"1"},{"title":"Top US Senator urges Ukrainian government to end racial discrimination at its border","content":"<p>A top American Senator has urged the Ukrainian government to end racial discrimination at its border, a prickly issue that has been pointed out by numerous students who have been frantically trying to flee the war-ravaged country.<\/p>\n","date":"2022-03-04 09:30:11","pin":"0","status":"1"},{"title":"Top US Senator urges Ukrainian government to end racial discrimination at its border","content":"<p>A top American Senator has urged the Ukrainian government to end racial discrimination at its border, a prickly issue that has been pointed out by numerous students who have been frantically trying to flee the war-ravaged country.<\/p>\n","date":"2022-03-04 09:30:37","pin":"0","status":"1"},{"title":"US President Joe Biden speaks with Volodymyr Zelensky on fire at Ukrainian nuclear power plant","content":"<p>US President Joe Biden spoke with his Ukrainian counterpart Volodymyr Zelensky to receive an update on the fire at the Zaporizhzhia Nuclear Power Plant and urged Russia to cease its military activities in the affected area and allow access to emergency responders, the White House has said.<\/p>\n","date":"2022-03-04 09:40:22","pin":"0","status":"1"},{"title":"British PM Johnson accuses Putin of endangering all of Europe","content":"<blockquote class=\"twitter-tweet\" data-conversation=\"none\">\n<p dir=\"ltr\" lang=\"en\"><a href=\"https:\/\/twitter.com\/hashtag\/UPDATE?src=hash&amp;ref_src=twsrc%5Etfw\">#UPDATE<\/a> British PM Johnson accuses Putin of endangering all of Europe, after invading Russian forces attack Ukrainian nuclear power plant.<br \/>\n<br \/>\n&quot;The Prime Minister said the reckless actions of President Putin could now directly threaten the safety of all of Europe&quot;: Downing Street <a href=\"https:\/\/t.co\/faxuPu3A1s\">pic.twitter.com\/faxuPu3A1s<\/a><\/p>\n&mdash; AFP News Agency (@AFP) <a href=\"https:\/\/twitter.com\/AFP\/status\/1499585826015301632?ref_src=twsrc%5Etfw\">March 4, 2022<\/a><\/blockquote>\n<script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2022-03-04 09:50:02","pin":"0","status":"1"},{"title":"Atomic watchdog: No radiation change at plant","content":"<p>The International Atomic Energy Agency said on Twitter that it&#39;s been informed by Ukraine&#39;s nuclear regulator that there has been no change reported in radiation levels&nbsp;at a nuclear power station shelled by Russian troops. The agency said its Director General Mariano Grossi was in touch with Ukraine&#39;s Prime Minister Denys Schmygal and the Ukrainian regulator and operator about the situation at the Zaporizhzhia plant.<\/p>\n","date":"2022-03-04 10:08:02","pin":"0","status":"1"},{"title":"Google and Tripadvisor block war news","content":"<blockquote class=\"twitter-tweet\" data-conversation=\"none\">\n<p dir=\"ltr\" lang=\"en\">Google and Tripadvisor block war news in reviews of maps, restaurants, hotels in Belarus, Russia and Ukraine.<br \/>\n<br \/>\nBoth services were being used to supply news of the war to Russians who only have access to information from the government<a href=\"https:\/\/t.co\/GTObpvsFx3\">https:\/\/t.co\/GTObpvsFx3<\/a> <a href=\"https:\/\/t.co\/O57VnRAMQT\">pic.twitter.com\/O57VnRAMQT<\/a><\/p>\n&mdash; AFP News Agency (@AFP) <a href=\"https:\/\/twitter.com\/AFP\/status\/1499591665711222785?ref_src=twsrc%5Etfw\">March 4, 2022<\/a><\/blockquote>\n<script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2022-03-04 10:16:54","pin":"0","status":"1"},{"title":"WATCH | Kyiv on the night before the invasion","content":"<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\">Russia invaded Ukraine a week ago. I took this video of Khreschatyk, central Kyiv, on the night before the invasion, and sent to friends who asked what life was like in the capital, whether people were panicking, readying for war amid the warnings etc. It&rsquo;s hard to watch it now. <a href=\"https:\/\/t.co\/Ifrl3qrwF3\">pic.twitter.com\/Ifrl3qrwF3<\/a><\/p>\n&mdash; Francesca Ebel (@FrancescaEbel) <a href=\"https:\/\/twitter.com\/FrancescaEbel\/status\/1499531172908609543?ref_src=twsrc%5Etfw\">March 3, 2022<\/a><\/blockquote>\n<script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2022-03-04 10:23:08","pin":"0","status":"1"},{"title":"Fire at Zaporizhzhya Nuclear Power Plant extinguished","content":"<p>Ukraine&#39;s emergency service says that as of 06:20, the fire at Zaporizhzhya Nuclear Power Plant has been extinguished.<\/p>\n","date":"2022-03-04 10:33:06","pin":"0","status":"1"},{"title":"IAF aircraft took off for Romania at 4:05 am from Hindon Airbase","content":"<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\">Indian Air Force aircraft took off for Romania at 4:05 am from Hindon Airbase, with approximately 6 tons of humanitarian assistance for Ukraine. <a href=\"https:\/\/twitter.com\/hashtag\/RussiaUkraine?src=hash&amp;ref_src=twsrc%5Etfw\">#RussiaUkraine<\/a> <a href=\"https:\/\/t.co\/upIZwutfv4\">pic.twitter.com\/upIZwutfv4<\/a><\/p>\n&mdash; ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1499597703906742274?ref_src=twsrc%5Etfw\">March 4, 2022<\/a><\/blockquote>\n<script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2022-03-04 10:45:04","pin":"0","status":"1"},{"title":"Putin's approval has stayed strong over the years ? war in Ukraine could change that","content":"<p>Since his ascension to power in 2000, Russia&#39;s president, Vladimir Putin, has maintained levels of approval among the Russian public that would be the envy of most world leaders. Prior to the recent invasion of Ukraine, Putin&#39;s approval rating stood at 71%, according to an independent pollster. Contrary to widespread belief, research has found that this support is not a fiction or an artifact of massaged polling numbers.<\/p>\n","date":"2022-03-04 10:54:25","pin":"0","status":"1"},{"title":"Russia's invasion of Ukraine has Kremlin battling for hearts and minds at home","content":"<p>Russian President Vladimir Putin is locked in a vicious struggle not only to subjugate Ukraine, but also to keep his own citizens united in support of Kremlin policy. But as Ukrainian fighters capture the admiration of the world in Twitter posts and TikTok videos, even the illusion of Russian unity is beginning to crumble.<\/p>\n","date":"2022-03-04 11:07:34","pin":"0","status":"1"},{"title":"Russia seizes TV broadcasting tower in Kherson","content":"<p>Amid intense fighting between Russia and Ukraine, the Russian military on Friday seized a TV broadcasting tower in the southern city of Kherson.<\/p>\n","date":"2022-03-04 11:23:28","pin":"0","status":"1"},{"title":"US Senator Lindsay Graham calls for Russia President Vladimir Putin's assassination","content":"<p>Calling for the assassination of Russian President Vladimir Putin, US Republican Senator Lindsey Graham asked whether there is a Brutus or a &quot;more successful&quot; Colonel Stauffenberg in the Russian military.<\/p>\n","date":"2022-03-04 11:33:12","pin":"0","status":"1"},{"title":"7 flights with 200 Indian citizens each sent back to India over 3 days: Union Minister VK Singh","content":"<p>Union Minister VK Singh said that seven flights with 200 Indian citizens on each flight have been sent to India in the last three days. The Minister of State for Civil Aviation further informed that some students who reached Warsaw and have their relatives and friends have decided to stay with them and they are safe in Poland.<\/p>\n","date":"2022-03-04 11:45:15","pin":"0","status":"1"},{"title":"Moscow Stock Exchange remained closed for the fourth day in a row","content":"<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\">The Moscow Stock Exchange remained closed for the fourth day in a row on Friday as the Russian authorities rolled out additional measures to limit the economic impact from the severe sanctions imposed by the West <a href=\"https:\/\/twitter.com\/NewIndianXpress?ref_src=twsrc%5Etfw\">@NewIndianXpress<\/a><\/p>\n&mdash; Yeshi Seli (@YeshiSeli) <a href=\"https:\/\/twitter.com\/YeshiSeli\/status\/1499623531033726977?ref_src=twsrc%5Etfw\">March 4, 2022<\/a><\/blockquote>\n<script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2022-03-04 11:52:30","pin":"0","status":"1"},{"title":"US invokes OSCE Moscow Mechanism to report human rights abuses by Russia in Ukraine","content":"<p>The US on Thursday (local time) invoked the Organization for Security and Co-operation in Europe (OSCE) Moscow Mechanism to establish an expert mission to examine reported human rights abuses &amp; violations of humanitarian law by Russia in Ukraine.<\/p>\n","date":"2022-03-04 12:02:31","pin":"0","status":"1"},{"title":"UNICEF says gathering over USD 440 million to provide aid for Ukrainian people","content":"<p>The UN Children&#39;s Fund (UNICEF) has announced the start of a fundraising campaign to provide aid to the Ukrainian people, assessing the urgent needs at the level of 400 million euros (over $441 million), Deputy Regional Director UNICEF Regional Office for Europe and Central Asia Philippe Cori said.<\/p>\n","date":"2022-03-04 12:13:03","pin":"0","status":"1"},{"title":"3,000 Indians evacuated in 15 flights in last 24 hours","content":"<p>Around 3,000 Indians have returned to the country in 15 flights under Operation Ganga from countries neighbouring Ukraine in the last 24 hours. It is estimated that around 18,000 Indian nationals have left Ukraine since the initial advisories were issued. This includes some Indians who had not registered with the Embassy of India in Kyiv previously.<\/p>\n","date":"2022-03-04 12:25:21","pin":"0","status":"1"},{"title":"17,000 stranded Indians have been evacuated: Attorney General","content":"<p>17,000 stranded Indians have already been evacuated from conflict zone in Ukraine: Attorney General KK Venugopal to SC<\/p>\n","date":"2022-03-04 12:37:13","pin":"0","status":"1"},{"title":"SC appreciates effort in evacuating Indians from Ukraine, says concerned about anxiety of people","content":"<p>The Supreme Court on Friday took note of the Centre&#39;s submission that it has evacuated 17,000 stranded Indians from the conflict zone in Ukraine, saying it appreciated the efforts but was concerned about the anxiety of people.<\/p>\n","date":"2022-03-04 12:51:53","pin":"0","status":"1"},{"title":"BREAKING NEWS: Russian forces enter territory of Ukraine nuclear power station","content":"<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\"><a href=\"https:\/\/twitter.com\/hashtag\/BREAKING?src=hash&amp;ref_src=twsrc%5Etfw\">#BREAKING<\/a> Russian forces enter territory of Ukraine nuclear power station: Kyiv <a href=\"https:\/\/t.co\/Swyx5ypsgf\">pic.twitter.com\/Swyx5ypsgf<\/a><\/p>\n&mdash; AFP News Agency (@AFP) <a href=\"https:\/\/twitter.com\/AFP\/status\/1499641739287855107?ref_src=twsrc%5Etfw\">March 4, 2022<\/a><\/blockquote>\n<script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2022-03-04 12:57:16","pin":"0","status":"1"},{"title":"BREAKING NEW: No leaks of radiation detected at Zaporozhye nuclear power plant","content":"<p>Ukrainian nuclear regulator says no leaks of radiation have been detected at the Zaporozhye nuclear power plant.<\/p>\n","date":"2022-03-04 13:05:52","pin":"0","status":"1"},{"title":"Supreme Court appreciates Centre's effort in evacuating Indians from Ukraine","content":"<p>Supreme Court on Friday took note of the Centre&#39;s submission that it has evacuated 17,000 stranded Indians from the conflict zone in Ukraine, saying it appreciated the efforts but was concerned about the anxiety of people.<\/p>\n","date":"2022-03-04 13:25:44","pin":"0","status":"1"},{"title":"Australia freezes USD 33 million in Russian funds","content":"<p>Australia&#39;s foreign minister says 45 million Australian dollars have been frozen in an Australian financial institution under new sanctions in response to the Russian invasion of Ukraine. Foreign Minister Marise Payne on Friday declined to identify the institution or who owned the money. Australia has imposed sanctions against more than 350 Russian individuals including President Vladimir Putin.<\/p>\n","date":"2022-03-04 13:40:50","pin":"0","status":"1"},{"title":"","content":"<blockquote class=\"twitter-tweet\" data-conversation=\"none\">\n<p dir=\"ltr\" lang=\"en\">About 400 have already gone on two flights. Then we have two more flights to go today and one more flight tomorrow: India&rsquo;s Ambassador to Slovakia, Vanlalhuma in Ko&scaron;ice on the number of Indian students who have left from Slovakia for India so far<a href=\"https:\/\/twitter.com\/hashtag\/OperationGanga?src=hash&amp;ref_src=twsrc%5Etfw\">#OperationGanga<\/a> <a href=\"https:\/\/t.co\/MDy9CP9eR0\">pic.twitter.com\/MDy9CP9eR0<\/a><\/p>\n&mdash; ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1499657931788529664?ref_src=twsrc%5Etfw\">March 4, 2022<\/a><\/blockquote>\n<script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2022-03-04 13:58:36","pin":"0","status":"1"},{"title":"","content":"<p><iframe allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\" frameborder=\"0\" height=\"315\" src=\"https:\/\/www.youtube.com\/embed\/h3rkDqp7F5w\" title=\"YouTube video player\" width=\"100%\"><\/iframe><\/p>\n","date":"2022-03-04 14:08:23","pin":"0","status":"1"},{"title":"How dangerous was Russia's nuclear plant strike?","content":"<p>Europe&#39;s largest nuclear power plant was hit by Russian shelling early Friday,&nbsp;sparking a fire at one of its six reactors&nbsp;and raising fears of a disaster that could affect all of central Europe for decades, like the 1986 Chernobyl meltdown.<\/p>\n\n<p>Concerns faded after Ukrainian authorities announced that the fire had been extinguished, and while there was damage to the reactor compartment, the safety of the unit was not affected. <a href=\"https:\/\/www.newindianexpress.com\/world\/2022\/mar\/04\/explainer-how-dangerous-was-russias-nuclear-plant-strike-2426296.html\" target=\"_blank\"><strong>(READ MORE)<\/strong><\/a><\/p>\n","date":"2022-03-04 14:22:08","pin":"0","status":"1"},{"title":"","content":"<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\">Information on Russian invasion<br \/>\n<br \/>\nLosses of the Russian occupying forces in Ukraine, March 4 <a href=\"https:\/\/t.co\/laF5J9xrEC\">pic.twitter.com\/laF5J9xrEC<\/a><\/p>\n&mdash; MFA of Ukraine ???????? (@MFA_Ukraine) <a href=\"https:\/\/twitter.com\/MFA_Ukraine\/status\/1499673468794773507?ref_src=twsrc%5Etfw\">March 4, 2022<\/a><\/blockquote>\n<script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2022-03-04 14:46:06","pin":"0","status":"1"},{"title":"NATO chief slams Russia 'recklessness' in Ukraine nuclear plant shelling","content":"<p>NATO chief Jens Stoltenberg on Friday decried Russia&#39;s &quot;recklessness&quot; over the shelling of a nuclear power plant in Ukraine and demanded Moscow stop the war against its neighbour.&nbsp;<\/p>\n","date":"2022-03-04 14:49:36","pin":"0","status":"1"},{"title":"If there is an explosion at nuclear power plant, it is the end of Europe: Ukraine President Zelensky","content":"<ul>\n\t<li>\n\t<p>Ukrainian President Volodymyr Zelensky say he has informed the leaders of the U.S., Britain, the European Union and the International Atomic Energy Agency about the dire threat of nuclear disaster after Russian troops shelled a nuclear power plant.<\/p>\n\t<\/li>\n\t<li>\n\t<p>&ldquo;If there is an explosion that&rsquo;s the end for everyone. The end for Europe. The evacuation of Europe,&rdquo;&nbsp;<\/p>\n\t<\/li>\n\t<li>\n\t<p>&ldquo;Only urgent action by Europe can stop the Russian troops. Do not allow the death of Europe from a catastrophe at a nuclear power station,&rdquo; he said<\/p>\n\t<\/li>\n\t<li>\n\t<p>He&rsquo;s calling on politicians and citizens to pressure Russian leadership to stop Russian troops.<\/p>\n\t<\/li>\n<\/ul>\n","date":"2022-03-04 15:11:22","pin":"0","status":"1"},{"title":"Western leaders Friday strongly condemned a Russian attack on Europe's largest nuclear plant","content":"<ul>\n\t<li>\n\t<p><strong>UK<\/strong> - &quot;The reckless actions of President Putin could now directly threaten the safety of all of Europe,&quot; Prime Minister Boris Johnson said in a statement.&nbsp;<\/p>\n\t<\/li>\n\t<li>\n\t<p><strong>NATO<\/strong> - &quot;This just demonstrates the recklessness of this war and the importance of ending it and the importance of Russia withdrawing all its troops and engaging good faith in diplomatic efforts,&quot; Jens Stoltenberg, the head of military alliance, said.<\/p>\n\t<\/li>\n\t<li>\n\t<p><strong>ITALY<\/strong> - &quot;Italian Prime Minister Mario Draghi condemns the heinous attack by Russia on the Zaporizhzhia nuclear power plant, an attack on everyone&rsquo;s security,&quot; a statement said.<\/p>\n\t<\/li>\n\t<li>\n\t<p>&quot;The European Union should continue to react with unity and with the utmost determination, together with its allies, to support Ukraine and protect European citizens.&quot;<\/p>\n\t<\/li>\n\t<li>\n\t<p><strong>NORWAY<\/strong> - &quot;This kind of attack is madness,&quot; Prime Minister Jonas Gahr Store said, expressing &quot;strong condemnation.&quot;<\/p>\n\t<\/li>\n<\/ul>\n","date":"2022-03-04 15:22:03","pin":"0","status":"1"},{"title":"Ukraine demands tougher Russia sanctions after nuclear plant attack","content":"<div style=\"text-align:center\">\n<figure class=\"image\" style=\"display:inline-block\"><img alt=\"\" height=\"300\" src=\"https:\/\/images.newindianexpress.com\/uploads\/user\/imagelibrary\/2022\/2\/26\/original\/Volodymyr_Zelenskyy_AP.jpg\" width=\"600\" \/>\n<figcaption><em>Ukraine President Volodymyr Zelensky (Photo | AP)<\/em><\/figcaption>\n<\/figure>\n<\/div>\n","date":"2022-03-04 15:41:53","pin":"0","status":"1"},{"title":"No radiation release at nuclear plant, says UN atomic agency","content":"<p>The head of the United Nations&rsquo; atomic agency said that a Russian &ldquo;projectile&rdquo; hit a training center at the plant. Ukraine&rsquo;s state nuclear regulator earlier said that no changes in radiation levels have been recorded so far after the Zaporizhzhia plant came under attack. International Atomic Energy Agency Director-General Rafael Mariano Grossi later said no radioactive material was released, but that two people were injured in the fire that broke out at the plant.<\/p>\n","date":"2022-03-04 15:57:01","pin":"0","status":"1"},{"title":"Indians refuse to leave behind their pets amid conflict","content":"<p><iframe allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\" frameborder=\"0\" height=\"315\" src=\"https:\/\/www.youtube.com\/embed\/GRVLia7HJEw\" title=\"YouTube video player\" width=\"100%\"><\/iframe><\/p>\n","date":"2022-03-04 16:38:07","pin":"0","status":"1"},{"title":"3 Ukrainian troops killed, 2 wounded in Russian attack on nuclear plant","content":"<p>The Ukrainian state nuclear company said that three Ukrainian troops were killed and two wounded in the Russian attack at the Zaporizhzhia plant. International Atomic Energy Agency Director-General Rafael Mariano Grossi said two people were injured in the blaze that broke out.<\/p>\n\n<p>Ukrainian firefighters extinguished a blaze at Europe&#39;s biggest nuclear plant that was ignited by a Russian attack and no radiation was released, U.N. and Ukrainian officials said, as Russian forces pressed their campaign to cripple the country despite global condemnation.<\/p>\n","date":"2022-03-04 16:51:46","pin":"0","status":"1"},{"title":"Zelensky invokes Judaism to rally support for Ukrainian cause","content":"<p>With online posts in Hebrew and appeals to Jews to &quot;cry out&quot; in response to Russia&#39;s invasion, Ukrainian President Volodymyr&nbsp;Zelensky&nbsp;has invoked his faith to rally support for his embattled country.&nbsp;The 44-year-old comedian-turned-president told the Times of Israel in 2020 that he had an &quot;ordinary... Jewish upbringing&quot;, explaining &quot;most Jewish families in the Soviet Union were not religious.&quot;<\/p>\n","date":"2022-03-04 16:51:47","pin":"0","status":"1"},{"title":"India abstains in UNHRC vote","content":"<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\">India abstains in UN Human Rights Council vote on establishing independent commission of inquiry on Russia-Ukraine crisis<\/p>\n&mdash; Press Trust of India (@PTI_News) <a href=\"https:\/\/twitter.com\/PTI_News\/status\/1499706036650864641?ref_src=twsrc%5Etfw\">March 4, 2022<\/a><\/blockquote>\n<script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2022-03-04 17:20:32","pin":"0","status":"1"},{"title":"'Whole World is Against You': Ukraine Ambassador tells Putin","content":"<p>&#39;Whole world is against you&#39;&nbsp;Ukraine ambassador tells Russian President Vladimir Putin after UN vote.<\/p>\n","date":"2022-03-04 17:28:11","pin":"0","status":"1"},{"title":"President Zelenskyy's addresses the world","content":"<p><iframe allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\" frameborder=\"0\" height=\"315\" src=\"https:\/\/www.youtube.com\/embed\/fiIcUpbK22I\" title=\"YouTube video player\" width=\"100%\"><\/iframe><\/p>\n","date":"2022-03-04 17:37:36","pin":"0","status":"1"},{"title":"India abstains from UNHRC vote","content":"<p>India on Friday abstained in a vote in the UN Human Rights Council that has decided to urgently establish an independent international commission of inquiry as a result of Russia&#39;s aggression against Ukraine.<\/p>\n\n<p>The 47-member Council voted on a draft resolution on the situation of human rights in Ukraine. The resolution was adopted with 32 votes in favour, two against (Russia and Eritrea) and 13 abstentions, including India, China, Pakistan, Sudan and Venezuela. <a href=\"https:\/\/www.newindianexpress.com\/world\/2022\/mar\/04\/india-abstains-in-unhrc-vote-on-establishing-independent-commission-of-inquiry-on-russia-ukraine-cri-2426353.html\" target=\"_blank\"><strong>(READ MORE)<\/strong><\/a><\/p>\n","date":"2022-03-04 17:50:44","pin":"0","status":"1"},{"title":"Attacking nuclear power plant is a war crime: U.S. Embassy in Kyiv","content":"<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\">It is a war crime to attack a nuclear power plant. Putin&#39;s shelling of Europe&#39;s largest nuclear plant takes his reign of terror one step further. <a href=\"https:\/\/twitter.com\/hashtag\/TheHague?src=hash&amp;ref_src=twsrc%5Etfw\">#TheHague<\/a> <a href=\"https:\/\/twitter.com\/hashtag\/Zaporizhzhia?src=hash&amp;ref_src=twsrc%5Etfw\">#Zaporizhzhia<\/a> <a href=\"https:\/\/twitter.com\/hashtag\/StandwithUkraine?src=hash&amp;ref_src=twsrc%5Etfw\">#StandwithUkraine<\/a><\/p>\n&mdash; U.S. Embassy Kyiv (@USEmbassyKyiv) <a href=\"https:\/\/twitter.com\/USEmbassyKyiv\/status\/1499708231903547394?ref_src=twsrc%5Etfw\">March 4, 2022<\/a><\/blockquote>\n<script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2022-03-04 18:18:27","pin":"0","status":"1"},{"title":"BRICS bank put on hold all new transactions in Russia due to Ukraine crisis","content":"<p>The New Development Bank&nbsp;of the BRICS bloc has put all new transactions in Russia on hold citing the &quot;unfolding uncertainties and restrictions&quot;, amidst the Ukraine crisis. The NDB&#39;s move came a day after the Asian Infrastructure Investment Bank&nbsp;put on hold all its projects in Russia and its ally Belarus.<\/p>\n","date":"2022-03-04 18:30:56","pin":"0","status":"1"},{"title":"Turkey wants Russia and Ukraine’s top diplomats together for talks","content":"<ul>\n\t<li>Turkey&rsquo;s foreign minister says Ankara wants to bring Russia and Ukraine&rsquo;s top diplomats together for talks during an international diplomacy forum in the country next week.<\/li>\n\t<li>Speaking Friday to reporters in Brussels where he attended a NATO meeting, Mevlut Cavusoglu said Russian Foreign Minister Seygey Lavrov has confirmed his attendance at the Antalya Diplomacy Forum to be held in the Mediterranean coastal city between March 11-13.<\/li>\n\t<li>Cavusoglu said a meeting between Lavrov and Ukraine&rsquo;s Dmytro Kuleba could be possible, but added that he was not certain Ukrainian officials would be able to attend.<\/li>\n\t<li>Turkey, which has close ties to both Ukraine and Russia, has been trying to balance its relations with both. It has repeatedly offered to mediate between the two.<\/li>\n<\/ul>\n","date":"2022-03-04 19:25:56","pin":"0","status":"1"},{"title":"Netherlands starts housing refugees","content":"<ul>\n\t<li>The Dutch military says it has begun housing refugees who fled Russia&rsquo;s invasion of Ukraine.<\/li>\n\t<li>The Defense Ministry said Friday that the first 120 refugees arrived a day earlier at a military base in Harskamp, a village in the central Veluwe region.<\/li>\n\t<li>The Harskamp base can house 950 refugees. It also is home to a sprawling firing range where Dutch troops regularly practice live fire exercises.<\/li>\n\t<li>Another group of 50 Ukrainian refugees arrived Friday in the western town of Waddinxveen, where they are being housed in a local sports hall.<\/li>\n\t<li>The town&rsquo;s mayor, Evert Jan Nieuwenhuis, greeted the new arrivals and told local broadcaster Omroep West it was &ldquo;heartbreaking. It brings tears to your eyes.&rdquo;<\/li>\n\t<li>He said he was glad the town could do something to help the refugees fleeing the conflict in Ukraine &ldquo;even if it is just a drop in the ocean.&rdquo;<\/li>\n<\/ul>\n","date":"2022-03-04 19:26:44","pin":"0","status":"1"},{"title":"Former UK PM Gordon Brown are pushing for a special criminal tribunal to prosecute Russian President Vladimir Putin and his allies","content":"<ul>\n\t<li>The Ukrainian government and a former British prime minister are pushing for a special criminal tribunal to prosecute Russian President Vladimir Putin and his allies over the invasion of Ukraine.<\/li>\n\t<li>Former Prime Minister Gordon Brown said the call for a body to investigate the &ldquo;crime of aggression&rdquo; was based on the tribunals that prosecuted senior Nazis after World War II.<\/li>\n\t<li>The Netherlands-based International Criminal Court is already investigating allegations that Russia has committed war crimes in Ukraine. But while it can investigate genocide, crimes against humanity and war crimes, Russia has not signed up to a separate ICC statute under which nations pledge not to commit &ldquo;crimes of aggression.&rdquo;<\/li>\n\t<li>Brown said that &ldquo;this act of aggression by Russia &hellip; cannot go uninvestigated, unprosecuted and unpunished.&rdquo;<\/li>\n\t<li>&ldquo;Putin must not be able to escape justice,&rdquo; he said. Ukrainian Foreign Minister Dmytro Kuleba welcomed the call for a tribunal, which is backed by legal experts and academics from around the world.<\/li>\n\t<li>&ldquo;We are fighting against an enemy who is much stronger than us. But international law is on our side,&rdquo; Kuleba told a meeting in London by video link from Ukraine.<\/li>\n<\/ul>\n","date":"2022-03-04 19:28:04","pin":"0","status":"1"},{"title":"NATO rejects no-fly zone over Ukraine","content":"<ul>\n\t<li>NATO Secretary-General Jens Stoltenberg says the military organization will not police a no-fly zone over Ukraine and is warning that such a move could end in a wide-spread war in Europe.<\/li>\n\t<li>Speaking Friday after chairing a meeting of NATO foreign ministers, Stoltenberg said &ldquo;we are not going to move into Ukraine, neither on the ground, nor in the Ukrainian airspace.&rdquo;<\/li>\n\t<li>Russian President Vladimir Putin&rsquo;s forces have ramped up their attacks in Ukraine, launching hundreds of missiles and artillery strikes on cities and making significant gains in the south.<\/li>\n\t<li>Ukrainian President Volodymyr Zelenskyy has appealed to the West to enforce a no-fly zone over his country, most recently after a fire overnight at one of Ukraine&rsquo;s nuclear plants, the largest in Europe.<\/li>\n\t<li>&ldquo;The only way to implement a no-fly zone is to send NATO fighter planes into Ukrainian airspace, and then impose that no-fly zone by shooting down Russian planes,&rdquo; Stoltenberg said.<\/li>\n\t<li>&ldquo;We understand the desperation, but we also believe that if we did that, we would end up with something that could end in a full-fledged war in Europe.&rdquo;<\/li>\n\t<li>&ldquo;We have a responsibility as NATO allies to prevent this war from escalating beyond Ukraine,&rdquo; he said.<\/li>\n<\/ul>\n","date":"2022-03-04 19:56:07","pin":"0","status":"1"},{"title":"UN Security Council to meet on nuclear plant","content":"<ul>\n\t<li>The U.N. Security Council has scheduled an emergency open meeting on the attack on Ukraine&rsquo;s largest nuclear power plant. The meeting, to be held at 1630GMT Friday, was requested by the United States, United Kingdom, France, Ireland, Norway and Albania.<\/li>\n\t<li>Council diplomats said the International Atomic Energy Agency will brief council members.<\/li>\n\t<li>Russia&rsquo;s shelling of Europe&rsquo;s biggest nuclear plant in Ukraine received widespread international condemnation on Friday.<\/li>\n\t<li>The shelling at the Zaporizhzhia plant in Enerhodar had touched off a fire that was extinguished. Russian forces have taken control of the site.<\/li>\n<\/ul>\n","date":"2022-03-04 20:31:31","pin":"0","status":"1"},{"title":"Japan PM condemns Russia","content":"<ul>\n\t<li>Japan&#39;s Prime Minister Fumio Kishida has condemned Russia&rsquo;s attack on Europe&rsquo;s largest nuclear power plant in Ukraine, calling it &ldquo;unforgivable reckless act.&rdquo;<\/li>\n\t<li>Kishida said he talked on the phone with Ukrainian President Volodymyr Zelenskyy and told him that &ldquo;Russian attack on the nuclear plant was an unforgivable reckless act.&rdquo;<\/li>\n\t<li>Russian forces shelled Europe&rsquo;s largest nuclear power plant Thursday, causing a fire there that was extinguished overnight but sparking global fear of radiation leaks.<\/li>\n\t<li>The International Atomic Energy Agency, the United Nation&rsquo;s nuclear watchdog, says there was no sign on Friday of radiation leaks.<\/li>\n\t<li>A massive earthquake and tsunami in March, 2011 destroyed power and cooling systems at the Fukushima Daiichi nuclear power plant, causing its triple meltdowns, spewing large amounts of radioactive materials in its surroundings and keeping part of the region still uninhabitable.<\/li>\n<\/ul>\n","date":"2022-03-04 20:32:18","pin":"0","status":"1"},{"title":"Head of the Polish bishops’ conference writes to the head of the Russian Orthodox Church","content":"<ul>\n\t<li>The head of the Polish bishops&rsquo; conference has written directly to the head of the Russian Orthodox Church urging him to appeal to President Vladimir Putin to stop the war and to urge Russian soldiers to disobey orders on moral grounds and stand down.<\/li>\n\t<li>&ldquo;The time will come to settle these crimes, including before the international courts,&rdquo;<\/li>\n\t<li>In his Mar. 2 letter to Patriarch Kirill, Archbishop Stanis?aw G?decki warned that &ldquo;the time will come to settle these crimes, including before the international courts.&quot;<\/li>\n\t<li>He added that even if someone avoids human justice, &ldquo;there is a tribunal that cannot be avoided.&rdquo;<\/li>\n\t<li>G?decki&rsquo;s tone was significant, given its sharp contrast to the comparatively neutral tone used by the Vatican and Pope Francis.<\/li>\n\t<li>The Holy See to date has called for peace and a return to negotiations, and even offered itself as a mediator, but has not condemned Russia by name or its invasion.<\/li>\n\t<li>The Vatican has a tradition of such diplomacy, believing that it can facilitate dialogue better if it doesn&rsquo;t take sides or call out an aggressor.<\/li>\n\t<li>In the case of Ukraine, however, Francis has been criticized for selling out Ukrainian Catholics at the expense of his longer-term goal of improving relations with the Russian Orthodox Church.<\/li>\n\t<li>As recently as December, Francis had expressed hope that a second meeting with Kirill could soon be organized, after their historic encounter in 2016, the first between a pope and Russian patriarch.<\/li>\n<\/ul>\n","date":"2022-03-04 20:33:29","pin":"0","status":"1"},{"title":"Jewish organization hits out at Russia","content":"<ul>\n\t<li>The Jewish Shalom organization in Bulgaria rejected as &ldquo;absolutely unjustifiable and inappropriate&rdquo; Russian propaganda claims that Ukraine is a Nazi state that has to be de-Nazified.<\/li>\n\t<li>Shalom said in a statement Friday that Ukraine is one of the few countries in the world to pass a law criminalizing antisemitism.<\/li>\n\t<li>The organization said it strongly condemns Russia&rsquo;s invasion in Ukraine, which President Vladimir Putin is trying to justify, claiming that the goal of his military aggression was &ldquo;the demilitarization and de-Nazification&rdquo; of Ukraine.<\/li>\n\t<li>Shalom said its members mourn together with those who died in the first days of the conflict and expressed sympathies to &ldquo;the hundreds thousands of Ukrainians who lost their homes, who were separated from their loved ones, and forced to flee the borders of their homeland, including thousands of Jewish families.&rdquo;<\/li>\n<\/ul>\n","date":"2022-03-04 20:34:40","pin":"0","status":"1"},{"title":"Primary focus on evacuating Indians from conflict zones in eastern Ukraine: MEA","content":"<p>At a media briefing, MEA spokesperson Arindam Bagchi said a local ceasefire would help in the evacuation of the Indians and that New Delhi is urging both the Russian and Ukrainian sides to find ways for their safe passage from the conflict zones. <strong><a href=\"https:\/\/www.newindianexpress.com\/nation\/2022\/mar\/04\/primary-focus-on-evacuating-indians-from-conflict-zones-in-eastern-ukraine-mea-2426388.html\" target=\"_blank\">(READ FULL STORY HERE)<\/a><\/strong><\/p>\n","date":"2022-03-04 20:52:41","pin":"0","status":"1"},{"title":"UN says 1.2 million people have fled Ukraine","content":"<ul>\n\t<li>The U.N. refugee agency reported Friday that more than 1.2 million people have left Ukraine since the fighting began.<\/li>\n\t<li>More than 165,000 people left the country on Thursday &mdash; down slightly from Wednesday&rsquo;s count and well under the nearly 200,000 on Tuesday, which amounted to the peak one-day outflow of people from Ukraine since the conflict began, according to the United Nations High Commissioner for Refugees.<\/li>\n\t<li>Its data portal on Ukraine showed that the majority &mdash; about 650,000 &mdash; had gone to neighboring Poland, and roughly 145,000 had fled to Hungary.<\/li>\n\t<li>Another 103,000 were in Moldova and more than 90,000 in Slovakia.<\/li>\n\t<li>UNHCR spokesperson Shabia Mantoo said &ldquo;we know that the majority are women, children and the elderly,&rdquo; but she was unable to provide a more specific breakdown by age or gender.<\/li>\n<\/ul>\n","date":"2022-03-04 20:58:32","pin":"0","status":"1"},{"title":"331 people killed and 675 people injured war began: U.N. human rights office","content":"<ul>\n\t<li>The U.N. human rights office, in its latest count of casualties released Friday afternoon, said it had confirmed 331 people killed and 675 people injured since the beginning of the Russian invasion.<\/li>\n\t<li>The rights office uses strict methodology and only reports casualties it has confirmed. It believes the real figures are much higher. Ukrainian officials have presented far higher numbers.<\/li>\n<\/ul>\n","date":"2022-03-04 20:59:10","pin":"0","status":"1"},{"title":"Protests at UK port","content":"<ul>\n\t<li>A union says dockers at a British port have refused to unload gas tankers from Russia, and called for tighter sanctions to prevent Russian cargoes arriving in the U.K.<\/li>\n\t<li>The Unison union says two tankers, Boris Vilkitsky and Fedor Litke, were diverted from Europe&rsquo;s largest liquefied natural gas terminal on the Isle of Grain in southeast England.<\/li>\n\t<li>The union said the British government must close a loophole that meant the cargo could return if it was loaded onto non-Russian vessels.<\/li>\n\t<li>Britain has banned Russia-linked ships from its ports, but the union&rsquo;s head of energy, Matt Lay, said the rules &ldquo;only cover the ownership and operators of vessels, not the cargo.&rdquo;<\/li>\n\t<li>He said &ldquo;companies are free to get around the rules by hiring ships from other countries to import Russian goods.&rdquo;<\/li>\n\t<li>British Prime Minister Boris Johnson has called for Western countries to stop buying Russian oil and gas, but it is still being bought by many countries, including the U.K.<\/li>\n<\/ul>\n","date":"2022-03-04 21:00:02","pin":"0","status":"1"},{"title":"EU to decide on more sanctions against Russia","content":"<ul>\n\t<li>Irish Foreign Minister Simon Coveney says the European Union may agree &ldquo;early&rdquo; next week on another set of sanctions against Russia over its invasion of Ukraine. Coveney said Friday that &ldquo;we in the European Union and other partners are really disgusted and outraged by what we continue to see day after day in Ukraine and Russia&rsquo;s actions, which clearly are a breach of international law.&rdquo;<\/li>\n\t<li>Speaking to reporters before a meeting with his EU counterparts and U.S. Secretary of State Antony Blinken, Coveney said: &ldquo;I don&rsquo;t think there&rsquo;s any credible argument now that war crimes aren&rsquo;t being committed on a daily basis.&rdquo;<\/li>\n\t<li>He says the West must brace for no letup in the fighting in Ukraine. &ldquo;Unfortunately it looks like we are going to see more of this in the coming days and weeks,&rdquo; Coveney said.<\/li>\n\t<li>&ldquo;The picture looks very bleak, very dark, in terms of Russia&rsquo;s intentions. And there doesn&rsquo;t seem to be any willingness to discuss a cease-fire, to discuss a pulling back out of residential areas.&rdquo;<\/li>\n<\/ul>\n","date":"2022-03-04 21:00:58","pin":"0","status":"1"},{"title":"News from Latvia","content":"<ul>\n\t<li>Latvia joined Lithuania in changing the name of the street where the Russian Embassy is located in Riga to &ldquo;Ukrainian Independence Street.&rdquo;<\/li>\n\t<li>The decision has been made Friday by the Riga City Council to voice support to Ukraine&rsquo;s sovereignty, territorial integrity and Ukraine&rsquo;s fight against the Russian invasion, the Baltic News Service reported Friday.<\/li>\n\t<li>On Thursday, the mayor of the Lithuanian capital Vilnius said that the city will change the name of a street where the Russian diplomatic mission sits.<\/li>\n\t<li>Mayor Remigijus Simasius said a quiet alley in downtown Vilnius where the Russian embassy is located will change its name to &ldquo;Heroes of Ukraine street.&rdquo;<\/li>\n<\/ul>\n","date":"2022-03-04 21:01:47","pin":"0","status":"1"},{"title":"Danish brewer Carlsberg halts Russia operations","content":"<ul>\n\t<li>Danish brewer Carlsberg said Friday that it was immediately stopping new investments and exports to Russia. The group&rsquo;s CEO Cees &lsquo;t Hart said the stop also includes exports from other Carlsberg Group companies to Baltika Breweries in Russia.<\/li>\n\t<li>&ldquo;We will respect all applicable sanctions being put in place and continue to assess the situation in relation to our business in Russia,&rdquo; he said in a statement to The Associated Press.<\/li>\n\t<li>Carlsberg has 8,400 employees across Russia. The group was &ldquo;deeply shocked by the terrible events unfolding in Ukraine&rdquo; and &ldquo;strongly condemn the acts of violence and aggression,&rdquo; he said, adding the brewer had taken several actions to ensure the safety and well-being of its 1,300 staff in Ukraine.<\/li>\n\t<li>On top of that, Carlsberg will donate 75 million kroner ($11.2 million) to the relief efforts in Ukraine.<\/li>\n<\/ul>\n","date":"2022-03-04 21:03:04","pin":"0","status":"1"},{"title":"Putin says Ukraine must meet Russian demands","content":"<ul>\n\t<li>President Vladimir Putin says Russia is ready for talks with Ukraine but insisted that it must meet Moscow&rsquo;s demands.<\/li>\n\t<li>Putin told German Chancellor Olaf Scholz that Ukraine must agree to demilitarize, accept Moscow&rsquo;s sovereignty over Crimea and surrender territory to Russia-backed rebels in the east, the Kremlin said in its readout of Friday&rsquo;s call.<\/li>\n\t<li>Russia annexed Ukraine&rsquo;s Crimean Peninsula in 2014 following the ouster of the country&rsquo;s former Moscow-friendly leaders and cast its support behind the rebels in eastern Ukraine.<\/li>\n\t<li>Putin recognized the separatist &ldquo;people&rsquo;s republics&rdquo; as independent states just before he launched an invasion of Ukraine on Feb. 24, citing their plea for military assistance.<\/li>\n\t<li>Russian and Ukrainian negotiators on Thursday held the second of two rounds of talks, reaching a tentative agreement on setting up safe corridors to allow civilians to leave besieged Ukrainian cities and the delivery of humanitarian supplies.<\/li>\n\t<li>They also agreed to keep talking on ways to negotiate a settlement, but Putin&rsquo;s tough demands make prospects for a compromise look dim.<\/li>\n\t<li>Ukrainian negotiators said the parties may conduct another round of talks over the weekend.<\/li>\n<\/ul>\n","date":"2022-03-04 22:04:29","pin":"0","status":"1"},{"title":"Ukraine to launch cyber attack against Russia","content":"<ul>\n\t<li>A top Ukrainian cybersecurity official says a volunteer army of hundreds of hackers enlisted to fight Russia in cyberspace is only attacking what it deems military targets, prioritizing government services including the financial sector, Kremlin-controlled media and railways.<\/li>\n\t<li>Victor Zhora, deputy chair of the state special communications service, also said Friday that there had been about 10 hostile hijackings of local government websites in Ukraine to spread false text propaganda saying his government had capitulated.<\/li>\n\t<li>He said most of Ukraine&rsquo;s telecommunications and internet were fully operational. Zhora told reporters in a teleconference that presumed Russian hackers continued to try to spread destructive malware in targeted email attacks on Ukrainian officials and &ndash; in what he considers a new tactic &ndash; trying to infect the devices of individual citizens.<\/li>\n\t<li>Zhora said one job of civilian volunteer hackers is to try to obtain intelligence that can be used to attack Russian military systems.<\/li>\n\t<li>He said volunteers from Ukraine&rsquo;s IT sector are also addressing the Russian people directly with phone calls, emails and text messages.<\/li>\n\t<li>That includes sending videos and pictures of dead Russians soldiers.<\/li>\n<\/ul>\n","date":"2022-03-04 22:06:21","pin":"0","status":"1"},{"title":"Russian artists face boycott in Spain","content":"<ul>\n\t<li>Spain&rsquo;s Teatro Real, one of Europe&rsquo;s major opera houses, is canceling a set of upcoming performances by Russia&rsquo;s famed Bolshoi Ballet because of the war the country is waging on Ukraine.<\/li>\n\t<li>In a statement on Friday, the management of the Madrid-based opera house said that the Russian state-funded company&rsquo;s mid-May performances of Ludwig Minkus&rsquo; La Bayadere won&rsquo;t go ahead &ldquo;due to the war unleashed by Russia in Ukraine, which is causing a serious global crisis and a painful humanitarian emergency.&rdquo;<\/li>\n\t<li>The theatre also stated that Bolshoi Ballet Director Vladimir Urin was among a group of Russian artists who signed a petition against the war.<\/li>\n\t<li>On Feb. 27, during the final performance at Teatro Real of &ldquo;Twilight of the Gods,&rdquo; artists on stage wrapped the corpse of the protagonist, Siegried, in the Ukrainian flag.<\/li>\n\t<li>The action, as part of an opera that &ldquo;places man in front of his own path to self-destruction,&rdquo; was meant to be &ldquo;a symbolic act of homage to the victims of the war,&rdquo; Teatro Real said at the time.<\/li>\n<\/ul>\n","date":"2022-03-04 22:07:25","pin":"0","status":"1"},{"title":"BBC suspends operations inside Russia","content":"<ul>\n\t<li>The BBC says it is temporarily suspending the work of all its journalists in Russia after the country&rsquo;s lawmakers approved legislation criminalizing reporting of the war in Ukraine that differs from the government line.<\/li>\n\t<li>Tim Davie, director-general of the British broadcaster, said the legislation &ldquo;appears to criminalize the process of independent journalism.&rdquo;<\/li>\n\t<li>He said the corporation was halting newsgathering work by its journalists and support staff in Russia &ldquo;while we assess the full implications of this unwelcome development.&rdquo;<\/li>\n\t<li>&ldquo;The safety of our staff is paramount and we are not prepared to expose them to the risk of criminal prosecution simply for doing their jobs,&rdquo; he said.<\/li>\n\t<li>Davie said the BBC&rsquo;s Russian-language news service would continue to operate from outside Russia.<\/li>\n\t<li>The Russian parliament voted unanimously Friday to approve a draft law criminalizing the intentional spreading of what Russia deems to be &ldquo;fake&rdquo; reports.<\/li>\n\t<li>It could be signed by President Vladimir Putin and take effect as soon as Saturday.<\/li>\n<\/ul>\n","date":"2022-03-04 22:32:00","pin":"0","status":"1"},{"title":"Russian lawmaker gives a grim picture of troops in Ukraine","content":"<ul>\n\t<li>A Russian lawmaker has spoken out about what she says are heavy losses being suffered by some military units fighting in Ukraine.<\/li>\n\t<li>Lyudmila Narusova, a member of Russia&rsquo;s upper house of parliament, the Federation Council, said during Friday&#39;s livestreamed proceedings that she knew of one company which was meant to be 100 strong but &ldquo;only four were left alive&rdquo; when the unit was withdrawn.<\/li>\n\t<li>Narusova, the widow of President Vladimir Putin&rsquo;s former political mentor Anatoly Sobchak, did not present evidence for her claims and said the Defense Ministry had refused her request to confirm the reported casualties.<\/li>\n\t<li>Russia said Wednesday 498 of its troops had been killed in Ukraine and has not updated that number since. Ukraine claims that the true number of Russian casualties is far higher<\/li>\n<\/ul>\n","date":"2022-03-04 22:33:01","pin":"0","status":"1"},{"title":"Russian troops still stuck outside Kyiv","content":"<ul>\n\t<li>A Western official says a huge Russian military convoy advancing on Kyiv has made little progress for several days.<\/li>\n\t<li>The official said the convoy, which has been estimated at up to 40 miles (64 kilometers) long, had become a huge traffic jam that included damaged or destroyed vehicles.<\/li>\n\t<li>The official, who spoke on condition of anonymity to discuss intelligence, said the convoy had been attacked from the air by the Ukrainians, but that Ukraine&rsquo;s ability to do so was limited.<\/li>\n\t<li>The official assessed that Ukrainian forces remain in control of much of the country&rsquo;s territory but that Russia holds the cities of Kherson, Melitopol and Berdiansk in the south.<\/li>\n\t<li>Multiple Western officials have said Russia&rsquo;s invasion of Ukraine has advanced more slowly than planned, with Russian forces meeting stiff Ukrainian resistance and encountering myriad logistical problems.<\/li>\n\t<li>Russian President Vladmir Putin said Thursday that what he calls a &ldquo;special military operation&rdquo; was on course to meet its goals.<\/li>\n<\/ul>\n","date":"2022-03-04 22:33:53","pin":"0","status":"1"},{"title":"Additional EU troops reach Bosnia","content":"<ul>\n\t<li>Additional troops from four European Union nations started arriving in Bosnia Friday to reinforce the EU-led peacekeeping force in the Balkan country which has never fully recovered from its brutal 1992-95 war.<\/li>\n\t<li>All four companies of the reserve forces from Austria, Bulgaria, Romania and Slovakia will arrive at the European Union Force (EUFOR) base outside Sarajevo to reinforce its 600-strong contingent already stationed in the country.<\/li>\n\t<li>The new deployments will total 500 troops. EUFOR announced the deployment of additional forces a day after Russian president Vladimir Putin launched his invasion of Ukraine on Feb. 24.<\/li>\n\t<li>The force described the step as a precautionary measure to prevent the deterioration of the security situation internationally from spreading to Bosnia.<\/li>\n\t<li>A staunchly pro-Russian Bosnian Serb leader, Milorad Dodik, has for years advocated the separation of the semi-autonomous Bosnian Serb mini-state from the rest of the multi-ethnic country.<\/li>\n\t<li>Last winter, with tacit support from Moscow, Dodik intensified his secessionist campaign, pledging to form an exclusively Serb army, judiciary and tax system.<\/li>\n\t<li>The European Union pledged earlier in February to limit financial assistance and possibly impose sanctions in Bosnia to prevent unravelling of the US-brokered peace agreement that ended the Balkan country&rsquo;s brutal interethnic war in the 1990s.<\/li>\n<\/ul>\n","date":"2022-03-04 22:34:55","pin":"0","status":"1"},{"title":"Brazil to issue temporary visas for Ukrainians","content":"<ul>\n\t<li>Brazil&rsquo;s government said on Friday it will issue temporary humanitarian visas and residency permits for Ukrainian nationals and other individuals who have been affected or displaced by the conflict with Russia.<\/li>\n\t<li>The visas will be valid for 180 days and arriving Ukrainians can apply for residency permits lasting two years, according to the text published in the nation&rsquo;s official gazette.<\/li>\n\t<li>Brazil will require, among other documents, a certificate attesting to the person&rsquo;s clean criminal record. Brazilian media have reported that the country has Latin America&rsquo;s biggest population of Ukrainians and their descendants, ranging between 500,000 and 600,000, according to an estimate from Ukraine&rsquo;s embassy.<\/li>\n\t<li>The administration of President Jair Bolsonaro has been ambivalent about the conflict.<\/li>\n\t<li>Bolsonaro himself expressed solidarity with his Russian counterpart Vladimir Putin on a recent visit, and has said Brazil will retain a neutral stance in the conflict.<\/li>\n\t<li>At the same time, Brazil voted to condemn the invasion in the meeting of the United Nations&rsquo; Security Council.<\/li>\n<\/ul>\n","date":"2022-03-04 23:16:44","pin":"0","status":"1"},{"title":"News from UK","content":"<ul>\n\t<li>London&rsquo;s Metropolitan Police force says its War Crimes Team is helping gather evidence for an International Criminal Court investigation into the Ukraine invasion.<\/li>\n\t<li>Britain&rsquo;s biggest police force appealed for people in Britain to come forward if they had &ldquo;direct evidence of war crimes in Ukraine&rdquo; between Nov. 21, 2013 and the present.<\/li>\n\t<li>The 2013 date marks the start of protests against Ukraine&rsquo;s Russia-leaning government and for closer ties with Europe.<\/li>\n\t<li>The following year, Russia annexed Crimea and intervened to support separatists in eastern Ukraine. Last week, Russian troops invaded the country en masse.<\/li>\n\t<li>Commander Richard Smith, head of Metropolitan Police Counterterrorism Command, which includes the War Crimes Team, said evidence might include &ldquo;direct messages, images or videos that friends or relatives here in the U.K. have been sent by those in Ukraine. Or it could be somebody who was previously in Ukraine and who may have witnessed or even been a victim of a war crime and has since travelled to the U.K.&rdquo;<\/li>\n\t<li>The force said evidence could be shared with the Hague-based court, which is investigating possible war crimes and crimes against humanity in Ukraine.<\/li>\n<\/ul>\n","date":"2022-03-04 23:18:02","pin":"0","status":"1"},{"title":"Migrant exodus continues","content":"<ul>\n\t<li>In the first of what is likely to be its daily counts, the U.N.-affiliated International Organization for Migration said 1.25 million people had left Ukraine between the start of the invasion and 09:30 a.m. on Friday.<\/li>\n\t<li>It cited government ministries for its information.<\/li>\n\t<li>Those figures were slightly higher than a count from UNHCR, the U.N. refugee agency, which has so far estimated that 1.2 million people have left the country since the Russian invasion began on Feb. 24.<\/li>\n\t<li>A spokesman from IOM said its figures were slightly more up-to-date. IOM, which focuses on all types of migrants &mdash; not just refugees &mdash; also provided new details about where the people fleeing were from: It reported that 78,800 &ldquo;third-country nationals&rdquo; &mdash; not Ukrainians &mdash; from 138 countries had left the country.<\/li>\n\t<li>IOM said: &ldquo;We have credible and verified information from partners and humanitarians present on borders with neighboring countries have documented discrimination against several third country nationals arriving in neighboring countries. They have also documented act of xenophobia based on people&rsquo;s race, ethnicity and nationality.&rdquo;<\/li>\n\t<li>&ldquo;Third country nationals reported having faced discrimination on their journey. States need to investigate and act immediately to ensure that everyone fleeing the conflict is treated humanely, and provided access to territory and protection,&rdquo; IOM said.<\/li>\n<\/ul>\n","date":"2022-03-04 23:18:58","pin":"0","status":"1"},{"title":"G7 says war criminals will be held accountable","content":"<ul>\n\t<li>Foreign ministers from the Group of Seven major world powers say that those responsible for Russian military attacks on civilians in Ukraine must be held accountable for their crimes, amid reports of the use of cluster bombs and other banned munitions.<\/li>\n\t<li>In a statement after talks in Brussels on Friday, the G7 ministers said they are &ldquo;deeply concerned with the catastrophic humanitarian toll taken by Russia&rsquo;s continuing strikes against the civilian population of Ukraine&rsquo;s cities.&rdquo;<\/li>\n\t<li>They underlined that &ldquo;indiscriminate attacks are prohibited by international humanitarian law,&rdquo; and that they &ldquo;will hold accountable those responsible for war crimes, including indiscriminate use of weapons against civilians.&rdquo;<\/li>\n\t<li>The ministers also welcomed the investigations and evidence-gathering being done to establish what war crimes might have been committed in Ukraine.<\/li>\n\t<li>The International Criminal Court prosecutor has launched an investigation that could target senior officials believed responsible for war crimes, crimes against humanity or genocide amid a rising civilian death toll and widespread destruction of property.<\/li>\n<\/ul>\n","date":"2022-03-04 23:57:10","pin":"0","status":"1"},{"title":"IAEA chief on Ukraine nuclear plant situation","content":"<ul>\n\t<li>The head of the U.N. nuclear agency says a &ldquo;projectile&rdquo; hit a building adjacent to a block of six reactors at Ukraine&rsquo;s largest nuclear power plant, sparking a fire that didn&rsquo;t affect its operation, although he stressed there is nothing normal when military forces are in charge of the site.<\/li>\n\t<li>International Atomic Energy Agency Director-General Rafael Mariano Grossi told an emergency meeting of the U.N. Security Council that the IAEA was informed by Russia a few days ago that its military forces were moving to take control of the Zaporizhzhia plant in the southeastern city of Enerhodar, similar to troops&#39; seizure last week of Chernobyl, the site of the world&rsquo;s worst nuclear disaster.<\/li>\n\t<li>Grossi said the advance of Russian troops toward the perimeter of the nuclear power plant &ldquo;was met with opposition and some group of civilians attacking the access to the plant.&rdquo;<\/li>\n\t<li>In the early hours Friday, he said, the IAEA &ldquo;got information that a projectile had impact (sic) a building adjacent to the block of reactors, six of them.&rdquo;<\/li>\n\t<li>He did not say who fired the projectile. Grossi said Ukraine&rsquo;s nuclear installations and facilities are important -- four big sites and 15 reactors and associated facilities, plus the site at Chernobyl, which has a giant metal dome covering the destroyed reactor.<\/li>\n\t<li>The IAEA chief reiterated his readiness to travel to Chernobyl &ldquo;as soon as practicable&rdquo; to consult Ukrainian nuclear authorities and, ,when necessary, the Russian authorities in charge to ensure that basic principles of safety and security are maintained &ldquo;starting with the physical integrity of the facilities.&rdquo;<\/li>\n<\/ul>\n","date":"2022-03-04 23:58:57","pin":"0","status":"1"},{"title":"Won't occupy Ukraine: Russia","content":"<ul>\n\t<li>A top Russian diplomat insisted Friday that his country will not occupy Ukraine.<\/li>\n\t<li>&ldquo;The goal is very clear: Denazification and demilitarization,&rdquo; Gennady Gatilov, Russia&rsquo;s ambassador in Geneva, said of the invasion &mdash; which he called a &ldquo;special military operation.&rdquo;<\/li>\n\t<li>&ldquo;We are not going to stay in Ukraine militarily. We are not going to occupy this country,&rdquo; he told the U.N. Geneva press association ACANU.<\/li>\n\t<li>&ldquo;I don&rsquo;t now all the details of the military plan, but the political goal is as I described it.&rdquo;<\/li>\n\t<li>He said the definition of &ldquo;demilitarization&rdquo; was being discussed in diplomatic talks between Ukrainian and Russian envoys.<\/li>\n\t<li>&ldquo;We want to secure &mdash; or to have guarantees &mdash; that the threat is not coming from Ukraine against the Russian Federation.&rdquo;<\/li>\n\t<li>Russian President Vladimir Putin has sought to legitimize Russia&rsquo;s moves in Ukraine by claiming a desire to &ldquo;denazify&quot; Ukraine, a country with a Jewish president who lost relatives in the Holocaust and who heads a Western-backed, democratically elected government.<\/li>\n\t<li>Historians see Putin&#39;s invocation of World War II as disinformation and a cynical ploy to further the Russian leader&rsquo;s aims.<\/li>\n<\/ul>\n","date":"2022-03-04 23:59:51","pin":"1","status":"1"},{"title":"Turkey holds discussions with Ukraine, UK","content":"<ul>\n\t<li>Turkish President Recep Tayyip Erdogan has held separate calls with Ukrainian President Volodymyr Zelenskyy and British Prime Minister Boris Johnson to discuss the situation in Ukraine.<\/li>\n\t<li>Erdogan told Johnson that Turkey would continue to strive for an immediate cease-fire as well an an immediate end to Russia&rsquo;s actions on Ukraine, according to a brief statement released from his office.<\/li>\n\t<li>Erdogan and Zelenskyy discussed &ldquo;Russia&rsquo;s attacks and the latest developments&rdquo; in Ukraine, his office said in a separate statement, but did not elaborate.<\/li>\n\t<li>Turkey, which has close relations with both Ukraine and Russia, has been calling for a cease-fire to end the fighting.<\/li>\n<\/ul>\n","date":"2022-03-05 00:00:51","pin":"0","status":"1"},{"title":"Moscow blocks Facebook within Russian territories","content":"<ul>\n\t<li>Russia&rsquo;s state communications watchdog has ordered to completely block access to Facebook in Russia amid the tensions over the war in Ukraine.<\/li>\n\t<li>The agency, Roskomnadzor, said Friday it decided to cut access to Facebook over its alleged &ldquo;discrimination&rdquo; of the Russian media and state information resources.<\/li>\n\t<li>It said the restrictions introduced by Facebook owner Meta on the RT and other state-controlled media violate the Russian law.<\/li>\n\t<li>A week ago, the watchdog announced &ldquo;partial restrictions&rdquo; on access to Facebook that sharply slowed it down, citing the platform&rsquo;s moves to limit the accounts of several state-controlled Russian media.<\/li>\n\t<li>Facebook and Twitter have played a major role in amplifying dissent in Russia in recent years.<\/li>\n\t<li>The move against Facebook follows the blocks imposed Friday on the BBC, the U.S. government-funded Voice of America and Radio Free Europe\/Radio Liberty, German broadcaster Deutsche Welle and Latvia-based website Meduza as the government seeks to uproot independent sources of information about the invasion of Ukraine.<\/li>\n<\/ul>\n","date":"2022-03-05 00:27:53","pin":"0","status":"1"},{"title":"Justin Trudeau to reach out to European nations against Moscow","content":"<ul>\n\t<li>Canadian Prime Minister Justin Trudeau is heading to several European capitals next week where he will he discuss Russia&rsquo;s invasion of Ukraine and disinformation coming from the Kremlin.<\/li>\n\t<li>Trudeau says he will have meetings in London, Berlin, Riga, Latvia and Warsaw, Poland. He says he is joining partners to stand against Moscow&rsquo;s attack on Ukraine.<\/li>\n\t<li>Trudeau says Russia is reeling from strong and aligned sanctions that democracies around the world have employed.<\/li>\n<\/ul>\n","date":"2022-03-05 00:28:45","pin":"0","status":"1"},{"title":"US remains resistant to banning Russian oil","content":"<p>The Biden administration remains resistant to banning oil imports from Russia despite the destruction that Russia&#39;s war is causing in Ukraine.<\/p>\n\n<p>White House Press Secretary Jen Psaki reiterated this position on March 4, AP reported.<\/p>\n\n<p>Psaki added that the administration was &ldquo;looking at options we could take right now to cut U.S. consumption of Russian energy.&rdquo;<\/p>\n","date":"2022-03-05 02:23:19","pin":"0","status":"1"}]}