{"details":[{"title":"An attack on security of Europe, global peace: Biden","content":"<p>Russia&#39;s invasion of Ukraine is an attack on not only this country, but also on the security of Europe, US President Joe Biden has said.<\/p>\n\n<p>Earlier in the day, Biden spoke with President Andrzej Duda of Poland to discuss their countries&#39; response, and those of allies, to Russia&#39;s invasion of Ukraine, including ongoing efforts to impose severe consequences on Russia.&nbsp;<\/p>\n\n<p>&quot;And we agreed it&#39;s not only an attack on Ukraine, it&#39;s an attack on the security of Europe and on global peace and stability,&quot; Biden said in the Oval Office of the White House.<\/p>\n","date":"2022-03-05 08:56:12","pin":"0","status":"1"},{"title":"Tough new sanctions on Russia","content":"<p>G7 countries promised Friday to impose &quot;tough new sanctions&quot; on Russia, and the US Secretary of State Antony Blinken pledged to &quot; increase the extraordinary pressure we&#39;re already exerting.&quot;&nbsp;<\/p>\n\n<p>But there is not much room for maneuver. The US had promised before the invasion to &quot;start at the top&nbsp;of the escalation&nbsp;ladder&nbsp;and stay there,&quot; and have kept their word.&nbsp;<\/p>\n\n<p>Together with their European allies, they have decreed unprecedented sanctions against the Russian financial system and the oligarchs close to the Kremlin, banned exports of crucial technologies and imposed an air blockade.&nbsp;<\/p>\n","date":"2022-03-05 08:57:55","pin":"0","status":"1"},{"title":"Ukraine Prez pleads NATO for no-fly zone","content":"<p>To limit Russian air strikes on Kiev and other cities, Ukrainian President Volodymyr Zelensky has begged NATO to establish a no-fly zone over his country. But for now, that is a red line for the transatlantic alliance, of which Ukraine is not a member.<\/p>\n\n<p>&quot;The only way to implement a no-fly zone is to send NATO fighter planes into Ukraine&#39;s airspace, and then impose that no fly zone by shooting down Russian planes,&quot; the alliance&#39;s secretary-general Jens Stoltenberg said.<\/p>\n\n<p>&quot;If we did that, we&#39;ll end up with something that could end in a full-fledged war in Europe, involving many more countries and causing much more human suffering. So that&#39;s the reason why we make this painful decision.&quot;<\/p>\n","date":"2022-03-05 09:05:09","pin":"0","status":"1"},{"title":"Ukraine digital army brews cyberattacks, intel and infowar","content":"<p>Formed in a fury to counter Russia&#39;s blitzkrieg attack, Ukraine&#39;s hundreds-strong volunteer &quot;hacker&quot; corps is much more than a paramilitary cyberattack force in Europe&#39;s first major war of the internet age.<\/p>\n\n<p>It is crucial to information combat and to crowdsourcing intelligence. &quot;We are really a swarm. A self-organizing swarm,&quot; said Roman Zakharov, a 37-year-old IT executive at the center of Ukraine&#39;s bootstrap digital army.<\/p>\n\n<p>His group&#39;s inventions run from software that lets anyone on the planet with a smartphone or computer participate in distributed denial-of-service attacks on official Russian websites to bots on the Telegram messaging platform that block disinformation, let people report Russian troop locations and offer instructions on assembling Molotov cocktails and basic first aid.<\/p>\n","date":"2022-03-05 09:09:36","pin":"0","status":"1"},{"title":"500 missiles in the week since invasion","content":"<p>Russia has fired more than 500 missiles in the week since its full-scale invasion of Ukraine began. Russia is launching all different types of missiles at a rate of about two dozen per day, a Pentagon official said.<\/p>\n","date":"2022-03-05 09:11:53","pin":"0","status":"1"},{"title":"500 missiles in the week since invasion","content":"<p>Russia has fired more than 500 missiles in the week since its full-scale invasion of Ukraine began. Russia is launching all different types of missiles at a rate of about two dozen per day, a Pentagon official said.<\/p>\n","date":"2022-03-05 09:12:06","pin":"0","status":"0"},{"title":"NMC allows foreign medical grads to complete internships in India","content":"<p>Amid the ongoing evacuation of Indian medical students from Ukraine, National Medical Commission (NMC) allows Foreign Medical Graduates with incomplete internships due to compelling situations like the Covid-19 and war, to apply to complete internships in India if they clear FMGE.&nbsp;<\/p>\n\n<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\">Amid the ongoing evacuation of Indian medical students from <a href=\"https:\/\/twitter.com\/hashtag\/Ukraine?src=hash&amp;ref_src=twsrc%5Etfw\">#Ukraine<\/a>, National Medical Commission (NMC) allows Foreign Medical Graduates with incomplete internships due to compelling situations like the Covid19 &amp; war...to apply to complete internships in India if they clear FMGE <a href=\"https:\/\/t.co\/tqxeCNPdYy\">pic.twitter.com\/tqxeCNPdYy<\/a><\/p>\n&mdash; ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1499962208557871105?ref_src=twsrc%5Etfw\">March 5, 2022<\/a><\/blockquote>\n<script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2022-03-05 10:00:57","pin":"0","status":"1"},{"title":"Air raid alert in Kyiv","content":"<p>Air raid alert in Kyiv. Residents should go to the nearest shelter: Ukraine&#39;s The Kyiv Independent<\/p>\n","date":"2022-03-05 10:55:54","pin":"0","status":"1"},{"title":"Russia ready to evacuate Indian students, other foreign nationals from Ukraine","content":"<p>Russia has informed the UN Security Council that Russian buses are ready at crossing points to go to the eastern Ukrainian cities of Kharkiv and Sumy to evacuate Indian students and other foreign nationals who are stranded there, amidst the raging conflict in the East European country.<\/p>\n\n<p>The 15-nation Council held an emergency session on Friday, called by Albania, France, Ireland, Norway, the United Kingdom and the United States, following Russia&#39;s attack on Ukraine&#39;s Zaporizhzhya nuclear power plant, the biggest in Europe.<\/p>\n\n<p>During the meeting, Russia&#39;s Permanent Representative to the UN Ambassador Vassily Nebenzia said that the Russian military is doing everything to ensure the peaceful evacuation of foreign nationals stranded in Ukraine.<\/p>\n\n<p>He alleged that Ukraine nationalists were keeping over 3,700 Indian citizens &quot;by force&quot; in Kharkiv and Sumy cities of eastern Ukraine.<\/p>\n\n<p>The Russian envoy said that the checkpoints are equipped to provide temporary accommodation, space for rest, and hot food. There are also mobile medical stations with a stock of medications.<\/p>\n","date":"2022-03-05 11:09:39","pin":"0","status":"1"},{"title":"Efforts to bring back Naveen Shekharappa's body is in progress","content":"<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\">Efforts to bring back Naveen Shekharappa&#39;s (an MBBS student who died in shelling in Ukraine) body is in progress. We&#39;re in touch with the Indian embassy, also spoke to External Affairs Minister, S Jaishankar on the matter: Karnataka CM Basavaraj Bommai <a href=\"https:\/\/t.co\/zpxNzd383h\">pic.twitter.com\/zpxNzd383h<\/a><\/p>\n&mdash; ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1499980614636019713?ref_src=twsrc%5Etfw\">March 5, 2022<\/a><\/blockquote>\n<script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2022-03-05 11:10:36","pin":"0","status":"1"},{"title":"Ukraine conflict fuels supply chain concerns","content":"<p>At a logistics expo in London this week, Russia&#39;s invasion of Ukraine dominated discussions, rather than interest in the latest package-tracking devices or how to kick-start the sector after the coronavirus pandemic.<\/p>\n\n<p>A week of fighting has forced many companies to suspend operations out of Ukraine as well as Russia, as world governments began imposing tough financial sanctions.<\/p>\n\n<p>Now there are fears the conflict could cause more disruption to the sector and hinder recovery from the pandemic, which battered world supply chains.<\/p>\n","date":"2022-03-05 12:07:27","pin":"0","status":"1"},{"title":"Russia declares ceasefire in Ukraine","content":"<p>Russia declares ceasefire in Ukraine from 06:00 GMT to open humanitarian corridors for civilians, reports Russia&#39;s media outlet Sputnik<\/p>\n","date":"2022-03-05 12:38:09","pin":"0","status":"1"},{"title":"AirAsia India flight carrying 170 Indian evacuees from Ukraine lands at Delhi","content":"<p>An AirAsia India evacuation flight from Suceava in Romania carrying 170 Indian evacuees from Ukraine landed at Delhi early morning on Saturday, an airline official said.<\/p>\n\n<p>This was the first such flight operated by the Bengaluru-based budget carrier under &#39;Operation Ganga,&#39; a central government initiative to bring back Indian citizens from war-torn Ukraine.<\/p>\n\n<p>An AirAsia India flight from Sauceva in Romania via Dubai landed at Delhi Airport at 4 am Saturday morning with 170 Indian evacuees from Ukraine, the official said.<\/p>\n\n<p>The passengers were received by the Minister of State for External Affairs V Muraleedharan on their arrival in India, said the official.<\/p>\n","date":"2022-03-05 13:05:03","pin":"0","status":"1"},{"title":"Samsung stops shipping products to Russia","content":"<p>South Korean tech giant Samsung is suspending shipments of all of its products to Russia, media reports say.<\/p>\n\n<p>&quot;Due to the current geopolitical developments, shipments to Russia have been suspended,&quot; reads a statement from an unnamed Samsung representative, via Samsung&#39;s generic PR email address. &quot;We continue to actively monitor this complex situation to determine our next steps.&quot;<\/p>\n\n<p>According to The Verge, Samsung is also making donations to humanitarian efforts.<\/p>\n","date":"2022-03-05 13:08:46","pin":"0","status":"1"},{"title":"Russia-Ukraine Conflict: Air raid alerts in Chernihiv, Sumy","content":"<p>Amid the ongoing conflict between Russia and Ukraine, air raid alerts were issued on Saturday morning in Chernihiv and Sumy.<\/p>\n","date":"2022-03-05 13:35:44","pin":"0","status":"1"},{"title":"Ukrainian port city Mariupol under 'blockade' by Russian forces","content":"<p>After days of &quot;ruthless&quot; attack, Mariupol is under a &quot;blockade&quot; by Russian forces, said Mariupol Mayor Vadym Boychenko on Saturday, according to a media report. Ukraine&#39;s port city of Mariupol, with a population of 450,000 people, is of strategic importance to Russian forces, as by taking Mariupol, they can complete a land corridor that would link Crimea with southern Russia.<\/p>\n","date":"2022-03-05 13:43:11","pin":"0","status":"1"},{"title":"Paris says will put forward measures to safeguard 5 Ukrainian nuclear facilities","content":"<p>France will propose to its partners specific steps to safeguard five main Ukrainian nuclear facilities based on the criteria by the International Atomic Energy Agency (IAEA), the Elysee Palace said on Friday.<\/p>\n","date":"2022-03-05 13:51:25","pin":"0","status":"1"},{"title":"Russia ready to evacuate Indian students, other foreign nationals from Ukraine: Envoy tells UNSC","content":"<p>Russia&#39;s Permanent Representative to the UN Ambassador Vassily Nebenzia said that the Russian military is doing everything to ensure the peaceful evacuation of foreign nationals stranded in Ukraine. <strong>(<a href=\"https:\/\/www.newindianexpress.com\/world\/2022\/mar\/05\/russia-ready-to-evacuate-indian-students-other-foreign-nationals-from-ukraine-envoy-tells-unsc-2426674.html\" target=\"_blank\">READ MORE<\/a>)<\/strong><\/p>\n","date":"2022-03-05 14:04:00","pin":"0","status":"1"},{"title":"Zelenskyy slams NATO's decision not to implement no-fly zone over Ukraine","content":"<p>Ukrainian President Volodymyr Zelenskyy has slammed NATO&#39;s decision not to implement a no-fly zone over Ukraine amid the ongoing conflict with Russia.<\/p>\n","date":"2022-03-05 14:11:38","pin":"0","status":"1"},{"title":"Six killed in air strike on village near Ukraine's Kyiv","content":"<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\">?? A <a href=\"https:\/\/twitter.com\/hashtag\/Russian?src=hash&amp;ref_src=twsrc%5Etfw\">#Russian<\/a> airstrike on the village of <a href=\"https:\/\/twitter.com\/hashtag\/Markhalevka?src=hash&amp;ref_src=twsrc%5Etfw\">#Markhalevka<\/a> near <a href=\"https:\/\/twitter.com\/hashtag\/Kyiv?src=hash&amp;ref_src=twsrc%5Etfw\">#Kyiv<\/a> killed six people, including a child. <a href=\"https:\/\/t.co\/Eu97ZaMsab\">pic.twitter.com\/Eu97ZaMsab<\/a><\/p>\n&mdash; NEXTA (@nexta_tv) <a href=\"https:\/\/twitter.com\/nexta_tv\/status\/1500003307758264322?ref_src=twsrc%5Etfw\">March 5, 2022<\/a><\/blockquote>\n<script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2022-03-05 14:13:09","pin":"0","status":"1"},{"title":"Ceasefire to let Mariupol residents evacuate: Russian Defense Ministry","content":"<p>Mariupol&#39;s mayor Vadim Boychenko said Saturday that the city was under &quot;blockade&quot; by Russian forces after days of &quot;ruthless&quot; attacks. <strong>(<a href=\"https:\/\/www.newindianexpress.com\/world\/2022\/mar\/05\/ceasefire-to-let-mariupol-residents-evacuate-russian-defence-ministry-2426687.html\" target=\"_blank\">READ MORE<\/a>)<\/strong><\/p>\n","date":"2022-03-05 14:23:02","pin":"0","status":"1"},{"title":"AirAsia India flight carrying 170 Indian evacuees from Ukraine lands at Delhi","content":"<p>An AirAsia India evacuation flight from Suceava in Romania carrying 170 Indian evacuees from Ukraine landed at Delhi early morning on Saturday, an airline official said. This was the first such flight operated by the Bengaluru-based budget carrier under &#39;Operation Ganga,&#39; a central government initiative to bring back Indian citizens from war-torn Ukraine.<\/p>\n","date":"2022-03-05 14:30:09","pin":"0","status":"1"},{"title":"WATCH | Russian forces bomb military hospital in town of Irpin","content":"<blockquote class=\"twitter-tweet\" data-conversation=\"none\">\n<p dir=\"ltr\" lang=\"en\">Russian forces bomb military hospital in town of Irpin, just outside capital Kiev as shelling intensifies in region <a href=\"https:\/\/t.co\/3h8b6DsP3V\">pic.twitter.com\/3h8b6DsP3V<\/a><\/p>\n&mdash; TRT World Now (@TRTWorldNow) <a href=\"https:\/\/twitter.com\/TRTWorldNow\/status\/1499975090355716096?ref_src=twsrc%5Etfw\">March 5, 2022<\/a><\/blockquote>\n<script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2022-03-05 14:36:21","pin":"0","status":"1"},{"title":"All efforts on to evacuate people stranded in Kharkiv and Kyiv: Karnataka CM Basavaraj Bommai","content":"<p>Karnataka CM Basavaraj Bommai on Saturday said all efforts are on to evacuate people from the state, who are stranded in besieged cities like Kharkiv and Kyiv in Ukraine, and that his administration is in constant touch with Ministry of External Affairs and Indian Embassy there.<\/p>\n","date":"2022-03-05 14:47:27","pin":"0","status":"1"},{"title":"China's leaders walking tightrope on Russia-Ukraine conflict","content":"<p>Following the imposition of harsh economic sanctions from the west, Russia would be looking towards Chinese commitment for assistance in resolving its fast-approaching economic hardship. Analysts say Ukraine&#39;s conflict will show the world whether confessions of both leaders are legitimate, or these relations are rather transactional.<\/p>\n","date":"2022-03-05 15:00:13","pin":"0","status":"1"},{"title":"Birthday of an Indian student celebrated at a camp on Romanian border","content":"<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\">Birthday of an Indian student, Kartik was celebrated at a camp on Romanian border yesterday. <a href=\"https:\/\/t.co\/wGWAEC6tx1\">pic.twitter.com\/wGWAEC6tx1<\/a><\/p>\n&mdash; ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1499995857630142465?ref_src=twsrc%5Etfw\">March 5, 2022<\/a><\/blockquote>\n<script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2022-03-05 15:15:21","pin":"0","status":"1"},{"title":"Union Minister Kiren Rijiju meets Slovakia PM, conveys gratitude for evacuation of Indians from Ukraine","content":"<p>Union Minister Kiren Rijiju, who is currently in Slovakia as a part of Operation Ganga, on Friday called on the prime minister of the Slovak Republic and conveyed Prime Minister Narendra Modi&#39;s message of gratitude for the help extended in evacuating of Indian nationals from Ukraine.<\/p>\n","date":"2022-03-05 15:27:25","pin":"0","status":"1"},{"title":"Putin critic who left Russia flees Kyiv as double refugee'","content":"<p>Olena and five colleagues left Kyiv after three nights in a bomb shelter, the thuds of explosions reverberating.&nbsp;They arrived in Hungary on Thursday after a harrowing, three-day flight. <strong>(<a href=\"https:\/\/www.newindianexpress.com\/world\/2022\/mar\/05\/putin-critic-who-left-russia-flees-kyiv-as-double-refugee-2426703.html\" target=\"_blank\">READ MORE<\/a>)<\/strong><\/p>\n","date":"2022-03-05 15:33:24","pin":"0","status":"1"},{"title":"PayPal shuts down its services in Russia citing Ukraine aggression","content":"<p>Payments company PayPal Holdings Inc&nbsp;shut down its services early on Saturday in Russia, citing &quot;the current circumstances,&quot; joining many financial and tech companies in suspending operations there after the invasion of Ukraine.<\/p>\n","date":"2022-03-05 15:38:12","pin":"0","status":"1"},{"title":"WATCH | At night there was a powerful explosion near Chernihiv","content":"<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\">At night there was a powerful explosion near <a href=\"https:\/\/twitter.com\/hashtag\/Chernihiv?src=hash&amp;ref_src=twsrc%5Etfw\">#Chernihiv<\/a>. <a href=\"https:\/\/t.co\/6bcRVJoQFz\">pic.twitter.com\/6bcRVJoQFz<\/a><\/p>\n&mdash; NEXTA (@nexta_tv) <a href=\"https:\/\/twitter.com\/nexta_tv\/status\/1500020715612946432?ref_src=twsrc%5Etfw\">March 5, 2022<\/a><\/blockquote>\n<script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2022-03-05 15:45:57","pin":"0","status":"1"},{"title":"309 hailing from Himachal evacuated from Ukraine so far, 149 still stuck: CM Jai Ram Thakur","content":"<p>Chief Minister Jai Ram Thakur on Saturday told the Himachal Pradesh assembly that 309 people from the state have been evacuated from war-torn Ukraine so far. Speaking during the budget session, the chief minister said 149 students from the state are still stuck there.<\/p>\n","date":"2022-03-05 15:53:57","pin":"0","status":"1"},{"title":"Putin signs laws on sanctioning foreign individuals, criminalizing fakes about military","content":"<p>Russian President Vladimir Putin has signed a federal law broadening sanctions for violating the rights of Russian citizens to all foreigners and stateless persons, the Kremlin said.<\/p>\n","date":"2022-03-05 16:06:43","pin":"0","status":"1"},{"title":"Ukraine's Ministry of Foreign Affairs said efforts on to evacuate foreign students from Sumy city","content":"<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\">????????We are doing everything we can to evacuate hundreds of foreign students from the Sumy city. <a href=\"https:\/\/twitter.com\/hashtag\/Sumy?src=hash&amp;ref_src=twsrc%5Etfw\">#Sumy<\/a> is now on the verge of a humanitarian catastrophe due to indiscriminate Russian shelling. Ukraine is doing its best to save and secure people.<a href=\"https:\/\/twitter.com\/hashtag\/StopRussianAggression?src=hash&amp;ref_src=twsrc%5Etfw\">#StopRussianAggression<\/a><\/p>\n&mdash; MFA of Ukraine ???????? (@MFA_Ukraine) <a href=\"https:\/\/twitter.com\/MFA_Ukraine\/status\/1500041331930017794?ref_src=twsrc%5Etfw\">March 5, 2022<\/a><\/blockquote>\n<script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2022-03-05 16:14:12","pin":"0","status":"1"},{"title":"Deeply engaged in evacuation of Indians from Kharkiv, says embassy","content":"<p>The Indian embassy in Ukraine on Friday said that it was deeply engaged in ensuring the safe evacuation of Indian citizens from the city conflict-ridden Kharkiv.<\/p>\n","date":"2022-03-05 16:25:26","pin":"0","status":"1"},{"title":"MEA advises Indian students in Ukraine to take safety precautions & avoid unnecessary risks","content":"<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\">We are deeply concerned about Indian students in Sumy, Ukraine. Have strongly pressed Russian and Ukrainian governments through multiple channels for an immediate ceasefire to create a safe corridor for our students.<\/p>\n&mdash; Arindam Bagchi (@MEAIndia) <a href=\"https:\/\/twitter.com\/MEAIndia\/status\/1500045912416010242?ref_src=twsrc%5Etfw\">March 5, 2022<\/a><\/blockquote>\n<script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2022-03-05 16:26:06","pin":"0","status":"1"},{"title":"Flight from Budapest carrying 183 Indians stranded in Ukraine lands in Mumbai","content":"<p>An Air India Express flight from the Hungarian capital Budapest carrying 183 Indian nationals stranded in war-torn Ukraine landed in Mumbai on Saturday morning, the airline said. Air India flight IX 1604 with 182 passengers and one infant landed at Mumbai&#39;s Chhatrapati Shivaji International Airport at 11 am.<\/p>\n","date":"2022-03-05 16:44:26","pin":"0","status":"1"},{"title":"Ceasefire will help us reach border: Indian students stuck in Ukraine","content":"<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\"><a href=\"https:\/\/twitter.com\/hashtag\/UkraineCrisis?src=hash&amp;ref_src=twsrc%5Etfw\">#UkraineCrisis<\/a> | Several students are still stuck in Kharkiv. We left Ukraine on March 1st amid bombing &amp; shelling. After crossing the Poland border Indian govt provided us help, says Pratyush Chaurasia who escaped from Kharkiv and reached Rzeszow in Poland <a href=\"https:\/\/t.co\/O0GY3QzJvM\">pic.twitter.com\/O0GY3QzJvM<\/a><\/p>\n&mdash; ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1500026146704211970?ref_src=twsrc%5Etfw\">March 5, 2022<\/a><\/blockquote>\n<script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2022-03-05 16:57:26","pin":"0","status":"1"},{"title":"European Union suspends Russia and Belarus from Council of Baltic Sea States","content":"<p>The European Union said it had joined members of the Council of the Baltic Sea States (CBSS) in suspending Russia and Belarus from the Council&#39;s activities.<\/p>\n","date":"2022-03-05 17:00:35","pin":"0","status":"1"},{"title":"Deeply concerned about Indian students in Ukraine's Sumy: India","content":"<p>India on Saturday said it is &quot;deeply concerned&quot; about the Indian students stuck in the eastern Ukranian city of Sumy and strongly asked both Russia and Ukraine through multiple channels for an immediate ceasefire for their safe exit from the conflict zone.<\/p>\n","date":"2022-03-05 17:12:32","pin":"0","status":"1"},{"title":"Russia cracks down on dissenting media, blocks Facebook","content":"<p>Russian President Vladimir Putin on Friday intensified a crackdown on media outlets and individuals who fail to hew to the Kremlin line on Russia&#39;s war in Ukraine, blocking Facebook and Twitter and signing into law a bill that criminalizes the intentional spreading of what Moscow deems to be &ldquo;fake&rdquo; reports. <strong>(<a href=\"https:\/\/www.newindianexpress.com\/world\/2022\/mar\/05\/russia-cracks-down-on-dissenting-media-blocks-facebook-2426735.html\" target=\"_blank\">READ MORE<\/a>)<\/strong><\/p>\n","date":"2022-03-05 17:31:55","pin":"0","status":"1"},{"title":"Soon we will be able to tell our people to come back: Ukraine President Volodymyr Zelenskyy","content":"<p>&quot;I am sure that soon we will be able to tell our people: come back! Come back from Poland, Romania, Slovakia and all other countries. Come back because there is no threat anymore,&quot; Ukraine&#39;s president Volodymyr Zelenskyy said in a Facebook post.<\/p>\n","date":"2022-03-05 17:49:48","pin":"0","status":"1"},{"title":"WATCH | Defence Ministry of Ukraine claims that air defense specialists shot down enemy aircraft","content":"<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"uk\">UPD?<br \/>\n????? ?? ???????? ????????? ??????? ??? ????? ?? ???? ??????? ?????????! <a href=\"https:\/\/t.co\/D3yiff8uyr\">pic.twitter.com\/D3yiff8uyr<\/a><\/p>\n&mdash; Defence of Ukraine (@DefenceU) <a href=\"https:\/\/twitter.com\/DefenceU\/status\/1500052710544093187?ref_src=twsrc%5Etfw\">March 5, 2022<\/a><\/blockquote>\n<script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2022-03-05 17:58:55","pin":"0","status":"1"},{"title":"Evacuations halted as Russia violates ceasefire","content":"<p>Kyrylo Tymoshenko, the deputy head of President Volodymyr Zelenskyy&rsquo;s office, said the evacuation effort was stopped because the city of Mariupol remained under fire on Saturday. <strong>(<a href=\"https:\/\/www.newindianexpress.com\/world\/2022\/mar\/05\/evacuations-halted-as-russia-violates-ceasefire-2426750.html\" target=\"_blank\">READ MORE<\/a>)<\/strong><\/p>\n","date":"2022-03-05 18:15:32","pin":"0","status":"1"},{"title":"11 flights with 2,200 Indian evacuees from Ukraine to land tomorrow: Government","content":"<p>Union Civil Aviation Ministry says 11 evacuation flights with 2,200 Indians will arrive on Sunday.<\/p>\n","date":"2022-03-05 18:22:42","pin":"0","status":"1"},{"title":"Another 137 students return to Gujarat from Ukraine, number rises to 752","content":"<p>A group of 137 Indian students stranded in Ukraine reached Gujarat, their home state, on Saturday, officials said here. It took the tally of those who have returned to the state from the war-hit country to 752.<\/p>\n","date":"2022-03-05 18:34:35","pin":"0","status":"1"},{"title":"92 students returned to Jharkhand so far from war-torn Ukraine: Official","content":"<p>Nine-two students from Jharkhand have returned home so far from war-torn Ukraine, an official at the State Migrant Control Room said on Saturday. Chief Minister Hemant Soren met some of the returnee students and enquired about their well-being.<\/p>\n","date":"2022-03-05 18:49:21","pin":"0","status":"1"},{"title":"16,000 foreign fighters expected in Ukraine, says Russian Embassy, citing Zelensky","content":"<p>As per Ukrainian President Zelensky, around 16,000 foreign fighters are expected in Ukraine. About 200 of mercenaries from Croatia have already entered the country through Poland and joined uncontrollable nationalist units in the South East of Ukraine, says Russian Embassy.<\/p>\n","date":"2022-03-05 19:00:18","pin":"0","status":"1"},{"title":"Russia's Aeroflot airlines to halt all flights abroad from March 8","content":"<p>Aeroflot, Russia&rsquo;s flagship carrier, has announced that it will halt all international flights except to Belarus starting March 8.<\/p>\n","date":"2022-03-05 19:05:35","pin":"0","status":"1"},{"title":"Ukraine effect: Aeroflot to halt international flights; UK goes after Russian oligarchs with Putin links","content":"<p>The move by Russia&#39;s biggest state-owned airline comes after the country&#39;s aviation agency, Rosaviatsiya, recommended that all Russian airlines with foreign-leased planes halt both passenger and cargo flights abroad. <strong><a href=\"https:\/\/www.newindianexpress.com\/world\/2022\/mar\/05\/ukraine-effect-aeroflot-to-halt-international-flights-uk-goes-after-russian-oligarchs-with-putin-l-2426786.html\" target=\"_blank\">(READ FULL STORY HERE)<\/a><\/strong><\/p>\n","date":"2022-03-05 19:45:54","pin":"0","status":"1"},{"title":"'If Russia is destroyed, we will be next': China seeks to unify public in support for Moscow","content":"<p>As the West condemns Russia, President Vladimir Putin has vocal supporters in China, where the ruling Communist Party tells its people they are fellow targets of US-led harassment. <strong><a href=\"https:\/\/www.newindianexpress.com\/world\/2022\/mar\/05\/if-russia-is-destroyed-we-will-be-next-china-seeks-to-unify-public-in-support-for-moscow-2426783.html\" target=\"_blank\">(READ FULL STORY HERE)<\/a><\/strong><\/p>\n","date":"2022-03-05 19:47:19","pin":"0","status":"1"},{"title":"WATCH | 'If anything happens to us Mission Ganga will be failure', say Sumy Univ. students","content":"<p><iframe allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\" frameborder=\"0\" height=\"450\" src=\"https:\/\/www.youtube.com\/embed\/z3174wByvHI\" title=\"YouTube video player\" width=\"100%\"><\/iframe><\/p>\n","date":"2022-03-05 20:21:31","pin":"0","status":"1"},{"title":"Putin warns against Ukraine no-fly zone","content":"<ul>\n\t<li>Russian President Vladimir Putin says Moscow would consider any third-party declaration of a no-fly zone over Ukraine as &ldquo;participation in the armed conflict.&rdquo;<\/li>\n\t<li>Speaking at a meeting with female pilots on Saturday, Putin said Russia would view &ldquo;any move in this direction&rdquo; as an intervention that &ldquo;will pose a threat to our service members.&rdquo;<\/li>\n\t<li>&ldquo;That very second, we will view them as participants of the military conflict, and it would not matter what members they are,&rdquo; the Russian president said.<\/li>\n\t<li>Ukrainian President Volodymyr Zelenskyy has pushed NATO to impose a no-fly zone over his country, warning that &ldquo;all the people who die from this day forward will also die because of you.&rdquo;<\/li>\n\t<li>NATO has said a no-fly zone, which would bar all unauthorized aircraft from flying over Ukraine, could provoke widespread war in Europe with nuclear-armed Russia.<\/li>\n<\/ul>\n","date":"2022-03-05 20:27:38","pin":"0","status":"1"},{"title":"Finland, Sweden to further deepen defense cooperation with NATO","content":"<ul>\n\t<li>Finland and Sweden have pledged to further deepen defense cooperation, including with NATO.<\/li>\n\t<li>Finnish Prime Minister Sanna Marin says that &ldquo;Russia&rsquo;s war against a European nation puts the European security order at risk.&rdquo;<\/li>\n\t<li>Finland and neighboring Sweden for years have resisted joining NATO, but the Russian invasion of Ukraine is changing the dynamic.<\/li>\n\t<li>Recent polls in both countries show more than 50% of Finns and Swedes in support of NATO membership but their governments are more cautious.<\/li>\n\t<li>&ldquo;It&rsquo;s very understandable that the mindset of our citizens is changing due to Russia&rsquo;s attack against Ukraine,&rdquo; said Marin, but refused to comment on whether Finland would ask for a major non-NATO allied status, a designation given to countries with close strategic relationship with the U.S. military.<\/li>\n\t<li>Swedish Prime Minister Magdalena Andersson said cooperation with NATO is &ldquo;maybe closer than ever&rdquo; and that a rapprochement with NATO would be discussed.<\/li>\n<\/ul>\n","date":"2022-03-05 20:29:16","pin":"0","status":"1"},{"title":"Won't impose Martial Law in Russia: Putin","content":"<ul>\n\t<li>Russian President Vladimir Putin says there is nothing that warrants imposing martial law in Russia at this point.<\/li>\n\t<li>Putin&rsquo;s comment on Saturday followed days of speculation that the introduction of martial law could be imminent.<\/li>\n\t<li>Putin said that &ldquo;martial law is imposed in a country ... in the event of external aggression, including in specific areas of hostilities. But we don&rsquo;t have such a situation, and I hope we won&rsquo;t.&rdquo;<\/li>\n<\/ul>\n","date":"2022-03-05 20:40:02","pin":"0","status":"1"},{"title":"Italian state broadcaster shuts operations in Russia","content":"<ul>\n\t<li>Italian state broadcaster Rai is suspending reporting by its correspondents in Russia. Rai&#39;s measure, effective Saturday, follows similar moves by some other foreign media.<\/li>\n\t<li>Rai said the measure is necessary to &ldquo;safeguard the safety of its journalists in the place as well as the maximum freedom of information about the country.&quot;<\/li>\n\t<li>Russia on Friday passed a law foreseeing prison sentences of up to 15 years for spreading what is deemed to be fake information about its armed forces.<\/li>\n<\/ul>\n","date":"2022-03-05 20:41:07","pin":"0","status":"1"},{"title":"'We will leave no stone unturned for safe evacuation of students': Indian envoy to Ukraine","content":"<p>Indian envoy to Ukraine Partha Satpathy on Saturday said no stone will be left unturned for the safe evacuation of Indian students from the conflict-stricken eastern Ukrainian city of Sumy as he hailed the unparalleled strength and fortitude displayed by the young citizens in dealing with the adversities.<strong><a href=\"https:\/\/www.newindianexpress.com\/nation\/2022\/mar\/05\/we-will-leave-no-stone-unturned-for-safe-evacuation-of-studentsindian-envoy-to-ukraine-2426800.html\" target=\"_blank\"> (READ FULL STORY HERE)<\/a><\/strong><\/p>\n","date":"2022-03-05 21:00:55","pin":"0","status":"1"},{"title":"After MEA advisory, Indians in Sumy say 'confused' whether to leave for border; supplies running out","content":"<p>As evacuation from the shelling-battered city remains a challenge for Indian authorities, the students said they could no longer cope with the nail-biting cold, depleting food supplies and having to melt snow to get drinking water.<strong><a href=\"https:\/\/www.newindianexpress.com\/nation\/2022\/mar\/05\/after-mea-advisory-indians-in-sumy-say-confused-whether-to-leave-for-border-supplies-running-out-2426802.html\" target=\"_blank\"> (READ FULL STORY HERE)<\/a><\/strong><\/p>\n","date":"2022-03-05 21:04:34","pin":"0","status":"1"},{"title":"Five Punjabi students return from Ukraine, thank their stars, country's embassy","content":"<p>They returned to their home towns, heaving a sigh of relief and thanking their stars that they managed to come out of Ukrainian city Kharkiv amid heavy shelling by the Russian forces. <strong><a href=\"https:\/\/www.newindianexpress.com\/nation\/2022\/mar\/05\/five-punjabi-students-return-from-ukraine-thank-their-stars-countrys-embassy-2426803.html\" target=\"_blank\">(READ FULL STORY HERE)<\/a><\/strong><\/p>\n","date":"2022-03-05 21:05:40","pin":"0","status":"1"},{"title":"More and more media companies shut down operations at Russia","content":"<ul>\n\t<li>German public broadcasters ARD and ZDF say they are suspending reporting from their Moscow studios after Russia passed a law foreseeing prison sentences of up to 15 years for spreading what is deemed to be fake information about its armed forces.<\/li>\n\t<li>The measure was signed into law by President Vladimir Putin on Friday and already prompted some foreign media including the BBC and Bloomberg to say they were suspending operations within Russia.<\/li>\n\t<li>ARD and ZDF said in a statement that they are examining the consequences of the new legislation and suspending reporting from the Moscow studios for now.<\/li>\n\t<li>The passing of the law comes amid a broader crackdown on media outlets and social media in Russia.<\/li>\n<\/ul>\n","date":"2022-03-05 21:17:04","pin":"0","status":"1"},{"title":"Spanish clothing giant suspends operations in Russia","content":"<ul>\n\t<li>Spanish clothing giant Inditex has decided to &ldquo;temporarily suspend&rdquo; all its activity in Russia, including over 500 stores and its online sales.<\/li>\n\t<li>In a statement to Spanish stock market regulator CNMV, the parent company of Zara, Massimo Dutti and other fashion chains says that &ldquo;under the current circumstances it cannot guarantee the continuity of its operations and the commercial conditions in the Russian Federation.&rdquo;<\/li>\n\t<li>It added that the company will focus on developing &ldquo;a special support plan&rdquo; for the more than 9,000 people it employs in Russia. Inditex said that Russia accounts for 8.5% of the group&rsquo;s business.<\/li>\n\t<li>It said the move doesn&rsquo;t significantly impact its investment there because all its Russian shops operate on rented premises.<\/li>\n\t<li>Major western companies, including H&amp;M, Apple, Mercedes-Benz and BP, have halted their sales or operations in Russia since the country started its invasion of Ukraine.<\/li>\n<\/ul>\n","date":"2022-03-05 21:18:22","pin":"0","status":"1"},{"title":"Zelenskyy: Ukrainian forces holding key cities","content":"<ul>\n\t<li>Ukrainian President Volodymyr Zelenskyy said Ukrainian forces were holding key cities in the central and southeastern part of the country Saturday, while the Russians were trying to block and keep encircled Kharkiv, Mykolaiv, Chernihiv and Sumy.<\/li>\n\t<li>&ldquo;We&rsquo;re inflicting losses on the occupants they could not see in their worst nightmare,&rdquo; Zelenskyy said.<\/li>\n\t<li>He alleged that 10,000 Russian troops were killed in the 10 days of the war, a claim that could not be independently verified.<\/li>\n\t<li>The Russian military doesn&#39;t offer regular updates on their casualties. Only once, on Wednesday, they revealed a death toll of nearly 500. &ldquo;This is horrible,&rdquo; Zelenskyy said.<\/li>\n\t<li>&ldquo;Guys 18, 20 years old ... soldiers who weren&rsquo;t even explained what they were going to fight for.&rdquo;<\/li>\n<\/ul>\n","date":"2022-03-05 21:38:04","pin":"0","status":"1"},{"title":"Ukraine government releases video of Russian jet crash","content":"<ul>\n\t<li>Video released Saturday by the Ukrainian government shows a Russian military plane falling from the sky and crashing, as onlookers on the ground cheer.<\/li>\n\t<li>Firefighters sprayed water on flames and smoke at a structure next to the debris of the plane, which bore a red star and the number 24.<\/li>\n<\/ul>\n","date":"2022-03-05 21:38:53","pin":"0","status":"1"},{"title":"News from Ukraine","content":"<ul>\n\t<li>The head of Ukraine&rsquo;s Supreme Court has appealed for Russia&rsquo;s top court to be excluded from a body of Central and Eastern Europe&rsquo;s chief justices because of Russia&rsquo;s invasion of Ukraine.<\/li>\n\t<li>Ukraine&rsquo;s top court president, Vsevolod Kniaziev, said the Supreme Court of Russia should be excluded from the Conference of Chief Justices of Central &amp; Eastern Europe &ldquo;as it represents a country that brought terror, death and crimes against humanity in Ukraine.&rdquo;<\/li>\n\t<li>Kniaziev&rsquo;s letter of appeal was received Saturday by Malgorzata Manowska, the president of the Supreme Court in Poland, which borders Ukraine. Manowska&rsquo;s office said she will urgently pass the appeal on to the chief justices&rsquo; conference, a platform of cooperation that works to enhance judicial standards.<\/li>\n<\/ul>\n","date":"2022-03-05 21:39:32","pin":"0","status":"1"},{"title":"Zelenskyy to US: Please send more planes","content":"<ul>\n\t<li>Ukrainian President Volodymyr Zelenskyy made a &ldquo;desperate plea&rdquo; to U.S. senators on Saturday to send more planes to help the country fight the Russian invasion.<\/li>\n\t<li>Zelenskyy made the request on a call joined by more than 300 people, including senators, some House lawmakers and aides. Senate Majority Leader Chuck Schumer, a Democrat from New York, said in a statement that Zelenskyy made a &ldquo;desperate plea for Eastern European countries to provide Russian-made planes to Ukraine.&quot;<\/li>\n\t<li>&ldquo;I will do all I can to help the administration to facilitate their transfer,&rdquo; Schumer said.<\/li>\n\t<li>Schumer told Zelenskyy the U.S. lawmakers are inspired by him and by the strength and courage of the Ukrainian people, according to another person on the call who was granted anonymity to discuss it.<\/li>\n\t<li>The U.S. Congress also is working on a $10 billion package of military and humanitarian aide, and Schumer told Zelenskyy that lawmakers hope to send it quickly to Ukraine, the person said.<\/li>\n\t<li>Zelenskyy told senators he needs planes and drones more than other security tools, according to a senior Senate aide granted anonymity to discuss the private meeting.<\/li>\n<\/ul>\n","date":"2022-03-05 22:23:16","pin":"0","status":"1"},{"title":"US asks its nationals to leave Russia ASAP","content":"<ul>\n\t<li>The U.S. State Department has updated an earlier travel advisory and is now recommending that U.S. citizens leave Russia immediately.<\/li>\n\t<li>The notice offers this guidance: &ldquo;If you wish to depart Russia, you should make arrangements on your own as soon as possible. If you plan to stay in Russia, understand the U.S. Embassy has severe limitations on its ability to assist U.S. citizens, and conditions, including transportation options, may change suddenly.&rdquo;<\/li>\n\t<li>The department already has advised Americans not to travel to Russia.<\/li>\n\t<li>That warning cites &ldquo;the unprovoked and unjustified attack by Russian military forces in Ukraine&rdquo; and &ldquo;the potential for harassment against U.S. citizens by Russian government security officials,&rdquo; among other things.<\/li>\n\t<li>The American ambassador in Moscow, John Sullivan, has scheduled a virtual town hall on Wednesday for U.S. citizens in Russia &ldquo;in light of the rapidly developing situation&rdquo; from the Russian invasion.<\/li>\n<\/ul>\n","date":"2022-03-05 22:24:18","pin":"0","status":"1"},{"title":"Israeli prime minister meets with Putin","content":"<ul>\n\t<li>Israel&rsquo;s prime minister was meeting with Russian President Vladimir Putin in Moscow on Saturday.<\/li>\n\t<li>Israeli Prime Minister Naftali Bennett&#39;s office confirmed the meeting at the Kremlin, which came just days after Bennett spoke over the phone with both Russia and Ukrainian leaders.<\/li>\n\t<li>Bennett&#39;s office said he departed early Saturday morning for Moscow, accompanied by Russian-speaking Cabinet minister Zeev Elkin.<\/li>\n\t<li>Both men are observant Jews and wouldn&rsquo;t normally travel on the Sabbath. Israel is one of the few countries that has good working relations with both sides.<\/li>\n\t<li>The country has delivered humanitarian aid to Ukraine, but also maintains ties with Moscow to make sure that Israeli and Russian warplanes do not come into conflict in neighboring Syria.<\/li>\n<\/ul>\n","date":"2022-03-05 23:06:29","pin":"0","status":"1"},{"title":"Radiation levels normal at Zaporizhzhia nuclear power plant","content":"<ul>\n\t<li>Technical safety systems are intact and radiation levels are normal at the Zaporizhzhia nuclear power plant following a Russian attack that led to a fire at the site, according to the country&#39;s nuclear regulator.<\/li>\n\t<li>Two out of the six reactors at the plant, Europe&rsquo;s biggest, are now operating after Russian forces took control of the site, the nuclear regulator told the International Atomic Energy Agency.<\/li>\n\t<li>The regulator said it has been able to keep in touch with staff at the plant.<\/li>\n\t<li>Ukrainian nuclear officials told the IAEA that one telephone communication line was lost but another was still working, as was cellphone communication.<\/li>\n\t<li>They said the facility&rsquo;s training center, located separately from the reactors, suffered &ldquo;significant damage&rdquo; early Friday and that there was also damage to the site&rsquo;s laboratory building and an administrative structure.<\/li>\n<\/ul>\n","date":"2022-03-05 23:07:37","pin":"0","status":"1"},{"title":"Russian airliner gets permission to take back Russian diplomats from US","content":"<ul>\n\t<li>A Russian airliner has received an exception to the U.S. airspace ban in order to return Russian diplomats expelled from the U.S to Russia.<\/li>\n\t<li>The Ilyushin Il-62 is flying from St. Petersburg to Washington Dulles International Airport outside the U.S. Capitol.<\/li>\n\t<li>A U.S. government official confirmed it had been granted a waiver from the airspace restriction put in place in retaliation for Russia&rsquo;s invasion of Ukraine in order to retrieve the Russian diplomats.<\/li>\n\t<li>The U.S. expelled 12 Russians at its mission to the United Nations accusing them of being intelligence operatives.<\/li>\n<\/ul>\n","date":"2022-03-05 23:08:44","pin":"0","status":"1"},{"title":"Another Russian airline halts all international flights","content":"<ul>\n\t<li>Another Russian airline, low cost carrier Pobeda, said it would halt all international flights starting March 8, in accordance with recommendations from the Russia&rsquo;s state aviation agency.<\/li>\n\t<li>Rosaviatsiya on Saturday recommended that all Russian airlines with foreign-leased planes halt both passenger and cargo flights abroad.<\/li>\n\t<li>It cited a high risk of foreign-leased planes being impounded as part of Western sanctions that ban leasing of planes to Russia. Rosaviatsiya&rsquo;s recommendation doesn&rsquo;t apply to Russian airlines that use Russian planes or foreign planes that aren&rsquo;t at risk of being impounded.<\/li>\n\t<li>However, shortly after the recommendation was released, Russia&rsquo;s flagship carrier Aeroflot said it would suspend international flights starting March 8, including those carried out by its subsidiary airline Rossia. Several hours later, Pobeda followed suit.<\/li>\n\t<li>Earlier this week, Russia&rsquo;s biggest private airline S7 also announced halting international flights starting from March 5.<\/li>\n\t<li>At the same time, foreign airlines from countries that have not imposed sanctions on Russia and have not shut down their airspace for Russian planes will still be allowed to fly in and out of Russia.<\/li>\n<\/ul>\n","date":"2022-03-05 23:11:57","pin":"0","status":"1"},{"title":"'Spent three days at bunker without food, water': Bengal students narrate their Ukraine ordeal","content":"<p>Nur Hassan, a student from Kaliachak in Malda, recalled how he along with 50 other students from India, had to hire a bus on March 1 from his institute in Kyiv to reach the Romanian border after undergoing numerous checks by the Ukrainian army. <strong><a href=\"https:\/\/www.newindianexpress.com\/nation\/2022\/mar\/05\/spent-three-days-at-bunker-without-food-water-bengal-students-narrate-their-ukraine-ordeal-2426845.html\" target=\"_blank\">(READ FULL STORY HERE)<\/a><\/strong><\/p>\n","date":"2022-03-06 00:05:57","pin":"0","status":"1"},{"title":"21 Indian sailors stuck at Mykolaiv port in war-hit Ukraine: Shipping agency","content":"<p>As many as 21 Indian sailors on board a merchant ship are stuck for quite some time at the Port of Mykolaiv in war-hit Ukraine but all of them are &quot;safe&quot; and in &quot;regular contact&quot; with their families and the ship manning agency, according to the agency founder and CEO Sanjay Prashar. <strong><a href=\"https:\/\/www.newindianexpress.com\/nation\/2022\/mar\/05\/21-indian-sailors-stuck-at-mykolaiv-port-in-war-hit-ukraine-shipping-agency-2426842.html\" target=\"_blank\">(READ FULL STORY HERE)<\/a><\/strong><\/p>\n","date":"2022-03-06 00:07:20","pin":"0","status":"1"},{"title":"Ukraine crisis will have consequences for India-Russia ties: Envoy","content":"<p>The current crisis in Ukraine will have consequences for the whole world, including for Russia-India relations, and the extent of its impact cannot be envisaged now, Russian Ambassador Denis Alipov said on Saturday. At the same time, he said India can take advantage of the situation to bolster economic ties with Russia as Moscow&#39;s Western partners have refused to cooperate with it.<strong><a href=\"https:\/\/www.newindianexpress.com\/nation\/2022\/mar\/06\/ukraine-crisis-will-have-consequencesfor-india-russia-ties-envoy-2426855.html\" target=\"_blank\"> (READ FULL STORY HERE)<\/a><\/strong><\/p>\n","date":"2022-03-06 00:47:09","pin":"0","status":"1"},{"title":"Charities struggle to deliver humanitarian aid into Ukraine, thanks to blocked ports, treacherous roads","content":"<p>The International Committee of the Red Cross has expressed worry that Russian attacks being carried out in densely populated areas are imperiling children, the sick and the elderly.<strong><a href=\"https:\/\/www.newindianexpress.com\/world\/2022\/mar\/06\/charities-struggle-to-deliver-humanitarian-aid-into-ukraine-thanks-to-blocked-portstreacherous-ro-2426854.html\" target=\"_blank\"> (READ FULL STORY HERE)<\/a><\/strong><\/p>\n","date":"2022-03-06 00:49:50","pin":"0","status":"1"},{"title":"Ukraine-Russia third round of talks on Monday","content":"<ul>\n\t<li>The next round of talks between Ukraine and Russia will be held on Monday, Ukrainian official Davyd Arakhamia said Saturday.<\/li>\n\t<li>Arakhamia is head of the parliamentary faction of President Volodymyr Zelenskyy&rsquo;s Servant of the People party and a member of Ukraine&rsquo;s delegation at the talks.<\/li>\n\t<li>Monday&#39;s will be the third round of talks as the two sides try to negotiate a cease-fire and safe passage corridors for civilians.<\/li>\n<\/ul>\n","date":"2022-03-06 00:51:50","pin":"0","status":"1"},{"title":"Two nuclear plants occupied by Russians, third one under danger too","content":"<ul>\n\t<li>Russian forces have now seized two Ukrainian nuclear power plants and are advancing toward a third, Ukraine&rsquo;s president said during a call with U.S. senators Saturday.<\/li>\n\t<li>Volodymyr Zelenskyy said the third plant currently under threat is the Yuzhnoukrainsk nuclear power plant, located 120 kilometers (75 miles) north of Mykolaiv, one of several cities the Russians were trying to keep encircled Saturday.<\/li>\n\t<li>One of the plants under the Russians&#39; control is the Zaporizhzhia nuclear plant in the southeastern city of Enerhodar, the biggest nuclear power plant in Europe.<\/li>\n\t<li>The other is Chernobyl, which is not active but is still staffed and maintained.<\/li>\n\t<li>Previous Russian shelling sparked a fire at the Zaporizhzhia plant that was extinguished without a release of radiation. Technical safety systems are intact and radiation levels are still normal at the Zaporizhzhia plant, according to the country&rsquo;s nuclear regulator, the International Atomic Energy Agency said Saturday.<\/li>\n\t<li>Two out of the six reactors at the plant, Europe&rsquo;s biggest, are now operating after Russian forces took control of the site, the nuclear regulator told the IAEA.<\/li>\n\t<li>Ukraine has four nuclear plants with a total of 15 reactors.<\/li>\n<\/ul>\n","date":"2022-03-06 00:54:05","pin":"1","status":"1"},{"title":"Need to sanction Russia's energy sector: Ukraine President to US","content":"<ul>\n\t<li>Ukraine President Volodymyr Zelenskyy urged U.S. lawmakers to sanction Russia&rsquo;s oil and gas sector and suspend credit card access, and backed an idea to ban Russian oil imports to the U.S. that&rsquo;s been gaining support in Congress.<\/li>\n\t<li>Sen. Lindsey Graham, a Republican from South Carolina, said Zelenskyy emphasized during a private call Saturday with the U.S. lawmakers that the energy sector needs to be sanctioned.<\/li>\n\t<li>&ldquo;Anything that could hurt the Russian economy will help the Ukrainian people and may make this war more difficult&rdquo; for Russian President Vladimir Putin, Graham said in a video.<\/li>\n\t<li>During the call, Democratic Sen. Joe Manchin of West Virginia asked Zelenskyy about the idea of banning Russian oil to the U.S., according to two people granted anonymity to discuss the private call.<\/li>\n\t<li>Zelenskyy indicated he was 100% on board with banning Russian oil to the U.S. and told the senators it would be very helpful, the people said.<\/li>\n\t<li>Zelensky also asked them to suspend access to Visa and Mastercard credit cards in Russia, according to another person granted anonymity to discuss the call.<\/li>\n<\/ul>\n","date":"2022-03-06 00:55:33","pin":"0","status":"1"},{"title":"Special flight carrying 182 Indians reaches Mumbai from Bucharest","content":"<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\">A special flight, carrying 182 Indian civilians from <a href=\"https:\/\/twitter.com\/hashtag\/Ukraine?src=hash&amp;ref_src=twsrc%5Etfw\">#Ukraine<\/a>, reaches Mumbai from Bucharest in Romania<a href=\"https:\/\/twitter.com\/hashtag\/OperationGanga?src=hash&amp;ref_src=twsrc%5Etfw\">#OperationGanga<\/a> <a href=\"https:\/\/t.co\/d7rDPXrUSt\">pic.twitter.com\/d7rDPXrUSt<\/a><\/p>\n&mdash; ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1500213287514181632?ref_src=twsrc%5Etfw\">March 5, 2022<\/a><\/blockquote>\n<script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2022-03-06 02:34:46","pin":"0","status":"1"},{"title":"Russia blockades city, denies humanitarian corridor: Mariupol Mayor","content":"<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\">&quot;Mariupol Mayor: Russia blockades city, denies humanitarian corridor. According to Mayor Vadym Boychenko, the city has been left without water and electricity, while 400,000 city residents are held hostage by the Russians,&quot; reports The Kyiv Independent<\/p>\n&mdash; ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1500262346006360064?ref_src=twsrc%5Etfw\">March 6, 2022<\/a><\/blockquote>\n<script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2022-03-06 06:27:25","pin":"0","status":"1"},{"title":"China tells US to not fuel flames in Ukraine","content":"<p>Chinese Foreign Minister Wang Yi told U.S. Secretary of State Antony Blinken that China opposes any moves that &ldquo;add fuel to the flames&rdquo; in Ukraine, AP reported.<\/p>\n\n<p>The two spoke by phone on Saturday, the Chinese Foreign Ministry said.<\/p>\n\n<p>China has broken with the U.S., Europe and others that have imposed sanctions on Russia after its invasion of Ukraine. China says that the sovereignty and territorial integrity of all nations should be respected, but that sanctions create new issues and disrupt the process of political settlement.<\/p>\n","date":"2022-03-06 07:36:02","pin":"0","status":"1"}]}