{"details":[{"title":"Indian Ambassador TS Tirumurti addresses United Nations Security Council","content":"<p>&quot;It is important that humanitarian action is always guided by the principles of neutrality, impartiality, and independence. We have assisted nationals from other countries in their return to their respective countries. Despite our urgings to both sides, safe corridor for our students stranded in Sumy did not materialize. We have managed to facilitate the safe return of over 20,000 Indians from Ukraine. India has demanded safe and uninterrupted passage for all innocent civilians, Indian nationals from Ukraine,&quot; he said.<\/p>\n","date":"2022-03-08 07:55:43","pin":"0","status":"1"},{"title":"Russia sets cease-fire for evacuations but battles continue","content":"<p>Ukrainian officials accused Moscow of resorting to &quot;medieval siege&quot; tactics in places, and in one of the most desperately encircled cities, the southern port of Mariupol, there were no immediate signs of an evacuation. Russian President Vladimir Putin&#39;s forces continued to pummel some cities with rockets even after the announcement of corridors, and fierce fighting raged in places, indicating there would be no wider cessation of hostilities. <strong><a href=\"https:\/\/www.newindianexpress.com\/live\/2022\/mar\/06\/putin-says-ukraines-future-in-doubt-as-cease-fires-collapse-2427012.html\" target=\"_blank\">(READ THE HIGHLIGHTS HERE)<\/a><\/strong><\/p>\n","date":"2022-03-08 07:56:39","pin":"0","status":"1"},{"title":"Ukraine says Russian general killed","content":"<ul>\n\t<li>A Russian general was killed in the fighting around Kharkiv, Ukraine&rsquo;s second-largest city, which Russian forces have been trying to seize since the invasion began, the Ukrainian military intelligence agency said.<\/li>\n\t<li>It identified him as Maj. Gen. Vitaly Gerasimov, 45, and said he had fought with Russian forces in Syria and Chechnya and had taken part in the seizure of Crimea in 2014.<\/li>\n\t<li>It was not possible to confirm the death independently. Russia has not commented. Another Russian general was killed earlier in the fighting.<\/li>\n\t<li>A local officers&rsquo; organization in Russia confirmed the death in Ukraine of Maj. Gen. Andrei Sukhovetsky, the commanding general of the Russian 7th Airborne Division.<\/li>\n\t<li>Sukhovetsky also took part in Russia&rsquo;s military campaign in Syria.<\/li>\n<\/ul>\n","date":"2022-03-08 07:57:45","pin":"0","status":"1"},{"title":"Australia announces sanctions for Russians","content":"<ul>\n\t<li>The Australian government says it is placing sanctions on Moscow&rsquo;s &ldquo;propagandists and purveyors of disinformation&rdquo; who legitimatize Russia&rsquo;s invasion as the &ldquo;de-Nazification&rdquo; of Ukraine.<\/li>\n\t<li>Foreign Minister Marise Payne said in a statement on Tuesday her government was sanctioning 10 &ldquo;people of strategic interest to Russia&rdquo; for their role in encouraging hostility toward Ukraine.<\/li>\n\t<li>&ldquo;This includes driving and disseminating false narratives about the &lsquo;de-Nazification&rsquo; of Ukraine, making erroneous allegations of genocide against ethnic Russians in eastern Ukraine, and promoting the recognition of the so-called Donetsk People&rsquo;s Republic and Luhansk People&rsquo;s Republic as independent,&rdquo; Payne said, referring to separatist regions of Ukraine.<\/li>\n\t<li>Russia&rsquo;s invasion of Ukraine had been accompanied by a widespread disinformation campaign, both within Russia and internationally, she said.<\/li>\n\t<li>&ldquo;Tragically for Russia, President (Vladimir) Putin has shut down independent voices and locked everyday Russians into a world characterized by lies and disinformation,&rdquo; Payne said.<\/li>\n<\/ul>\n","date":"2022-03-08 07:58:43","pin":"0","status":"1"},{"title":"Ukraine staring the brink of the humanitarian catastrophe of potentially global nature: Ambassador to UN","content":"<ul>\n\t<li>Ukraine&rsquo;s U.N. ambassador says 12 days of an all-out invasion by Russia has brought Ukraine to &ldquo;the brink of the humanitarian catastrophe of potentially global nature.&rdquo;<\/li>\n\t<li>Sergiy Kyslytsya, speaking Monday at a U.N. Security Council meeting on the crisis, accused Russia of blocking numerous attempts by Ukrainian authorities to evacuate civilians through humanitarian corridors.<\/li>\n\t<li>He said Russians shelled depots with evacuation buses near Mariupol and blew up the railway near Irpin in the Kyiv region to prevent evacuation by train.<\/li>\n\t<li>He said Russia bombed and launched missiles at those cities and others like Kharkiv on Monday.<\/li>\n\t<li>Kyslytsya said Russia must stop violating cease-fire arrangements and allow safe passage through humanitarian corridors, end disinformation, and implement the U.N. General Assembly&rsquo;s resolution calling for an immediate stop to the fighting.<\/li>\n\t<li>Ukraine as a major wheat producer has been &ldquo;one of the guarantors of global food security&rdquo; but this has been challenged by the war and &ldquo;the implications at the global level will be catastrophic,&rdquo; he said.<\/li>\n\t<li>Kyslytsya said Russian shelling had destroyed schools and hospitals and killed and wounded doctors.<\/li>\n\t<li>He said that the country was running low on critical medical supplies. He urged U.N. humanitarian agencies to respond quickly.<\/li>\n<\/ul>\n","date":"2022-03-08 08:00:37","pin":"0","status":"1"},{"title":"Direct talks between Russia and Ukraine Presidents on cards?","content":"<ul>\n\t<li>Ukrainian Foreign Minister Dmytro Kuleba says when he meets with Russian Foreign Minister Sergey Lavrov in Turkey on Thursday he will propose direct talks between the Ukrainian and Russian presidents.<\/li>\n\t<li>&ldquo;We want talks between the president of Ukraine and Vladimir Putin since he is the one who makes the final decisions,&rdquo; Kuleba said early Tuesday on Ukrainian television.<\/li>\n\t<li>President Volodymyr Zelenskyy often proposed direct talks with Putin in the runup to the war and said he called the Kremlin on the eve of the Russian invasion but got no reply. Putin has agreed to speak only with Western leaders.<\/li>\n\t<li>Kuleba spoke after a conversation late Monday with U.S. Secretary of State Antony Blinken. &ldquo;Grateful to the U.S. for standing by Ukraine,&rdquo; Kuleba said on Twitter.<\/li>\n\t<li>&ldquo;We are coordinating intensively on crucial further steps to increase pressure on Russia.&rdquo;<\/li>\n<\/ul>\n","date":"2022-03-08 08:01:37","pin":"0","status":"1"},{"title":"Nuclear facility damaged at Kharkiv","content":"<blockquote class=\"twitter-tweet\" data-conversation=\"none\">\n<p dir=\"ltr\" lang=\"en\">IAEA says it has received reports of artillery shells damaging a nuclear research facility in Ukraine&#39;s besieged second city Kharkiv.<br \/>\n<br \/>\nNo increase in radiation levels have been reported at the site<a href=\"https:\/\/t.co\/gs6pbTwH1M\">https:\/\/t.co\/gs6pbTwH1M<\/a> <a href=\"https:\/\/t.co\/ZdBXVPDBdS\">pic.twitter.com\/ZdBXVPDBdS<\/a><\/p>\n&mdash; AFP News Agency (@AFP) <a href=\"https:\/\/twitter.com\/AFP\/status\/1501023490035843072?ref_src=twsrc%5Etfw\">March 8, 2022<\/a><\/blockquote>\n<script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2022-03-08 08:29:49","pin":"0","status":"1"},{"title":"Ukraine war ripple effect: Indian students in Belarus head home","content":"<p>With the war in Ukraine entering its 12th day on Monday and tensions between Kyiv and Moscow showing no signs of easing, the students said there is panic in Belarus and their families in India too are concerned about their wellbeing. <strong><a href=\"https:\/\/www.newindianexpress.com\/nation\/2022\/mar\/08\/ukraine-war-ripple-effect-indian-students-in-belarus-head-home-2427651.html\" target=\"_blank\">(READ FULL STORY HERE)<\/a><\/strong><\/p>\n","date":"2022-03-08 08:42:20","pin":"0","status":"1"},{"title":"Lakshadweep student trolled for video of situation on ground in war zone in Ukraine","content":"<p>Aousaf Hussain, a fourth-year student of Kharkiv National Medical University, was criticised by persons from Kerala and Lakshadweep for going out and getting food for his friends who are living in a bunker in Kharkiv. <strong><a href=\"https:\/\/www.newindianexpress.com\/nation\/2022\/mar\/08\/lakshadweep-student-trolled-forvideo-of-situation-on-ground-in-war-zone-in-ukraine-2427617.html\" target=\"_blank\">(READ FULL STORY HERE)<\/a><\/strong><\/p>\n","date":"2022-03-08 08:43:04","pin":"0","status":"1"},{"title":"Despite repeated urgings, no safe corridor for students stranded in Sumy: India tells UNSC","content":"<p>&quot;India has been consistent in calling for an immediate end to all hostilities,&quot; India&#39;s Permanent Representative to the UN Ambassador T S Tirumurti told the UN Security Council meeting Monday on the humanitarian situation in Ukraine.<strong><a href=\"https:\/\/www.newindianexpress.com\/world\/2022\/mar\/08\/despite-repeated-urgings-no-safe-corridor-for-students-stranded-in-sumy-india-tells-unsc-2427652.html\" target=\"_blank\"> (READ FULL STORY HERE)<\/a><\/strong><\/p>\n","date":"2022-03-08 08:44:00","pin":"1","status":"1"},{"title":"Lviv struggling to feed people fleeing war","content":"<ul>\n\t<li>The mayor of Lviv said the city in far western Ukraine is struggling to feed and house the tens of thousands of people who have fled here from war-torn regions of the country.<\/li>\n\t<li>&ldquo;We really need support,&rdquo; Mayor Andriy Sadovyi said. More than 200,000 Ukrainians displaced from their homes are now in Lviv, filling up sports halls, schools, hospitals and church buildings.<\/li>\n\t<li>The historical city once popular with tourists had a population of 700,000 before the war.<\/li>\n\t<li>The mayor said the city needs big tents equipped with kitchens so food can be prepared.<\/li>\n\t<li>Hundreds of thousands more people could arrive if humanitarian corridors are opened up from cities now under siege by Russian troops.<\/li>\n\t<li>The embassies of the U.S. and EU countries also moved to Lviv from Kyiv before the invasion. Lviv is the main transit point for those fleeing just across the border to Poland.<\/li>\n\t<li>Many of the 1.7 million Ukrainians now abroad passed through the city. The United Nations has called the situation the fastest-growing refugee crisis in Europe since World War II.<\/li>\n<\/ul>\n","date":"2022-03-08 08:45:00","pin":"0","status":"1"},{"title":"Haunting to see Ukrainians fleeing from their country in fear: US delegation member","content":"<ul>\n\t<li>Rhode Island U.S. Rep. David Cicilline said Monday it was &ldquo;haunting&rdquo; to see Ukrainians fleeing from their country in fear when he visited the border of Ukraine and Poland.<\/li>\n\t<li>Cicilline told The Associated Press Monday night, about an hour after returning to the U.S., that he saw &ldquo;young children crying and mothers just literally running from their country because they were attacked,&rdquo; and lines of people waiting for help in the freezing cold with no heavy coats.<\/li>\n\t<li>&ldquo;It&rsquo;s just horrible, the suffering that is being caused because of this brutality by (Russian President) Vladimir Putin,&rdquo; he said.<\/li>\n\t<li>&ldquo;It&rsquo;s hard to describe. It&rsquo;s hard to get it out of your head. It&rsquo;s some of the worst stuff I&rsquo;ve seen.&rdquo;<\/li>\n\t<li>Cicilline was part of a bipartisan delegation to the border led by U.S. Rep. Gregory Meeks, chair of the House Foreign Affairs Committee, and Rep. Michael McCaul, the ranking Republican on the committee. They got there Saturday morning.<\/li>\n<\/ul>\n","date":"2022-03-08 08:46:41","pin":"0","status":"1"},{"title":"Russia will carry out a cease-fire on Tuesday morning:  Ambassador Vassily Nebenzia","content":"<ul>\n\t<li>Russia&rsquo;s U.N. Ambassador Vassily Nebenzia says Russia will carry out a cease-fire on Tuesday morning at 10 a.m. Moscow time and open humanitarian corridors to evacuate citizens from Kiev, Chernigov, Sumy and Mariupol.<\/li>\n\t<li>He took the floor at the end of a U.N. Security Council meeting on the humanitarian crisis in Ukraine on Monday to make the announcement.<\/li>\n\t<li>&ldquo;This proposal doesn&rsquo;t have any demands about the citizens being sent necessarily to Russia, into Russian territory,&rdquo; he said.<\/li>\n\t<li>&ldquo;There&rsquo;s also evacuation offered towards Ukrainian cities to the west of Kyiv, and ultimately it will be the choice of the people themselves where they want to be evacuated to,&rdquo; Nebenzia said.<\/li>\n<\/ul>\n","date":"2022-03-08 09:02:36","pin":"0","status":"1"},{"title":"Got Russian tanks, Russian Grad rockets, Russian mines instead of humanitarian corridors: Volodymyr Zelenskyy","content":"<ul>\n\t<li>President Volodymyr Zelenskyy said instead of an agreement on humanitarian corridors, what Ukraine got on Monday was &ldquo;Russian tanks, Russian Grad rockets, Russian mines.&rdquo;<\/li>\n\t<li>&ldquo;They even mined the roads that were the agreed routes for taking food and medicine to the people, to the children, of Mariupol,&rdquo; Zelenskyy said in what has become a daily video address close to midnight.<\/li>\n\t<li>On Monday night he spoke from behind the ornate desk in his official office, visual proof that he remains in Kyiv.<\/li>\n\t<li>During talks on Monday, the Russians proposed evacuation routes leading to Russia and its ally Belarus, rather than to areas of western Ukraine that remain peaceful.<\/li>\n\t<li>&ldquo;It&rsquo;s just cynicism,&rdquo; Zelenskyy said.<\/li>\n\t<li>By opening a small corridor to Russia, he said, Moscow is looking only for a propaganda victory.<\/li>\n\t<li>He said that on the 12th day of the war, the Ukrainian army is counter-attacking and inflicting extremely painful losses on the enemy.<\/li>\n\t<li>&ldquo;Battles are underway in the centre, in the north and in the south of the country &ndash; Mariupol and Kharkiv, Chernihiv and Sumy, Odesa and Kyiv, Mykolaiv and Zhytomyr.&rdquo;<\/li>\n<\/ul>\n","date":"2022-03-08 09:06:03","pin":"0","status":"1"},{"title":"Honour Ukraine’s proposals 'for time-bound humanitarian safe passage in specific, agreed-upon locations': US to Russia","content":"<ul>\n\t<li>The U.S. ambassador to the United Nations is calling on Russia to honour Ukraine&rsquo;s proposals &ldquo;for time-bound humanitarian safe passage in specific, agreed-upon locations&rdquo; and unequivocally commit to immediate humanitarian access in the country.<\/li>\n\t<li>At a U.N. Security Council meeting on the escalating humanitarian crisis in the country, Linda Thomas-Greenfield also called for the establishment of a system on the ground to facilitate the safe movement of aid convoys and flights so food, medicine and other supplies can get into Ukraine to reach those most in need.<\/li>\n\t<li>The U.S. envoy urged countries that have pledged over $1.5 billion in humanitarian support for Ukraine to quickly turn the pledges into funds, saying &ldquo;as long as Russia pursues its relentless and brutal campaign, the need for assistance will only increase.&rdquo;<\/li>\n\t<li>Thomas-Greenfield said Russian President Vladimir Putin &ldquo;has a plan to brutalize Ukraine&rdquo; and the last two weeks have shown that &ldquo;the Ukrainian people are not going to give up.&rdquo;<\/li>\n\t<li>Thomas-Greenfield said the United States will continue to stand with the Ukrainian people, &ldquo;but president Putin is clearly willing to sacrifice the lives of thousands of Russian soldiers to achieve his personal ambition.&rdquo;<\/li>\n<\/ul>\n","date":"2022-03-08 09:34:58","pin":"0","status":"1"},{"title":"Pooja at Kerala temple invoking the Lords blessings for good sense to prevail upon Russia, Ukraine Presidents","content":"<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\">Aikyamatyasooktha pooja performed at Trikkakara Vamanamoorthy temple in Kerala invoking the Lords blessings for good sense to prevail upon Vladimir Putin and <a href=\"https:\/\/twitter.com\/hashtag\/Ukraine?src=hash&amp;ref_src=twsrc%5Etfw\">#Ukraine<\/a> president Volodymyr Zelenskyy.<a href=\"https:\/\/twitter.com\/NewIndianXpress?ref_src=twsrc%5Etfw\">@NewIndianXpress<\/a> <a href=\"https:\/\/twitter.com\/xpresskerala?ref_src=twsrc%5Etfw\">@xpresskerala<\/a> <a href=\"https:\/\/twitter.com\/MOS_MEA?ref_src=twsrc%5Etfw\">@MOS_MEA<\/a> <a href=\"https:\/\/twitter.com\/IndiainUkraine?ref_src=twsrc%5Etfw\">@IndiainUkraine<\/a> <a href=\"https:\/\/twitter.com\/hashtag\/indianstudentsinukraine?src=hash&amp;ref_src=twsrc%5Etfw\">#indianstudentsinukraine<\/a> <a href=\"https:\/\/t.co\/JPpp1ZeR1d\">pic.twitter.com\/JPpp1ZeR1d<\/a><\/p>\n&mdash; Manoj Viswanathan (@Manojexpress) <a href=\"https:\/\/twitter.com\/Manojexpress\/status\/1501045009964883971?ref_src=twsrc%5Etfw\">March 8, 2022<\/a><\/blockquote>\n<script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2022-03-08 09:36:03","pin":"0","status":"1"},{"title":"UNICEF urges the U.N. Security Council to remind all parties of their legal obligation to protect youngsters","content":"<ul>\n\t<li>Calling what&rsquo;s happening to the 7.5 million children of Ukraine &ldquo;a moral outrage,&rdquo; the head of the U.N. children&rsquo;s agency urged the U.N. Security Council to remind all parties of their legal obligation to protect youngsters and spare them from attack.<\/li>\n\t<li>UNICEF Executive Director Catherine Russell told a council meeting Monday that at least 27 children have been killed and 42 injured since Russia invaded Ukraine on Feb. 24, according to the U.N. human rights office, and &ldquo;countless more have been severely traumatized.&rdquo;<\/li>\n\t<li>With the escalation of the conflict, she said, homes, schools, orphanages and hospitals have come under attack as well as water and sanitation facilities, which provide key civilian needs.<\/li>\n\t<li>She also expressed deep concern at the safety and well-being of nearly 100,000 children, half of them with disabilities, who live in Ukrainian institutions and boarding schools.<\/li>\n\t<li>She called on the parties to refrain from fighting near these facilities and to avoid the use of explosive weapons in populated areas.<\/li>\n\t<li>Russell said children must be protected from the brutality of war, saying the image of a mother, her two children and a friend trying to flee to safety lying dead on a street after being hit by a mortar &ldquo;must shock the conscience of the world.&rdquo;<\/li>\n\t<li>For children fleeing Ukraine, she said, UNICEF has started operating &ldquo;Blue Dot&rdquo; safe places at border crossings where youngsters are first registered and which provide &ldquo;a one-stop safe space for children and their families.&rdquo;<\/li>\n<\/ul>\n","date":"2022-03-08 10:01:59","pin":"0","status":"1"},{"title":"Russian jets bombard Ukraine cities","content":"<ul>\n\t<li>Russian aircraft bombed cities in eastern and central Ukraine overnight, Ukrainian officials said. Shelling pounded suburbs of the capital, Kyiv.<\/li>\n\t<li>In Sumy and Okhtyrka, to the east of Kyiv near the Russian border, bombs fell on residential buildings and destroyed a power plant, regional leader Dmytro Zhivitsky said.<\/li>\n\t<li>He said there were dead and wounded but gave no figures.<\/li>\n\t<li>Bombs also hit oil depots in Zhytomyr and the neighboring town of Cherniakhiv, located west of Kyiv. In Bucha, a Kyiv suburb, the mayor reported heavy artillery fire.<\/li>\n\t<li>&ldquo;We can&rsquo;t even gather up the bodies because the shelling from heavy weapons doesn&rsquo;t stop day or night,&rdquo; Mayor Anatol Fedoruk said.<\/li>\n\t<li>&ldquo;Dogs are pulling apart the bodies on the city streets. It&rsquo;s a nightmare.&rdquo;<\/li>\n\t<li>The Ukrainian government is demanding the opening of humanitarian corridors to allow people to safely leave Sumy, Zhytomyr, Kharkiv, Mariupol and suburbs of Kyiv, including Bucha.<\/li>\n<\/ul>\n","date":"2022-03-08 10:09:53","pin":"0","status":"1"},{"title":"Nissan plans to halt production in Russia","content":"<ul>\n\t<li>Japanese automaker Nissan is planning to halt production at its plant in Russia because of &ldquo;logistical challenges.&rdquo; Nissan Motor Co. did not provide a specific date but said Tuesday production will stop &ldquo;soon.&rdquo;<\/li>\n\t<li>Its plant in St. Petersburg produced 45,000 vehicles last year, including the X-Trail sport utility vehicle.<\/li>\n\t<li>The Yokohama-based manufacturer said the safety of its employees is its top priority.<\/li>\n\t<li>Nissan earlier stopped exports to Russia.<\/li>\n<\/ul>\n","date":"2022-03-08 10:18:29","pin":"0","status":"1"},{"title":"Ukraine aid growing as lawmakers shape big budget bill amid growing crisis","content":"<p>The apparent growth of the Ukraine aid also illustrated eleventh-hour negotiations underway among lawmakers as they try to complete the long-overdue $1.5 trillion government spending measure by Friday. The legislation would increase spending for defence and domestic programs, though lawmakers haven&#39;t said yet by how much. <strong><a href=\"https:\/\/www.newindianexpress.com\/world\/2022\/mar\/08\/ukraine-aid-growing-as-lawmakers-shape-big-budget-bill-amid-growing-crisis-2427670.html\" target=\"_blank\">(READ FULL STORY HERE)<\/a><\/strong><\/p>\n","date":"2022-03-08 10:54:34","pin":"0","status":"1"},{"title":"EXPLAINER | All you need to know about humanitarian corridors, from Syria to Ukraine","content":"<p>Russia has announced the establishment of safe corridors to allow civilians to leave, but there appeared to be few takers. Evacuation routes led mostly to Russia and its ally Belarus, drawing withering criticism from Ukraine and others. <strong><a href=\"https:\/\/www.newindianexpress.com\/world\/2022\/mar\/08\/explainer--all-you-need-to-know-about-humanitarian-corridors-from-syria-to-ukraine-2427675.html\" target=\"_blank\">(READ FULL STORY HERE)<\/a><\/strong><\/p>\n","date":"2022-03-08 11:21:55","pin":"0","status":"1"},{"title":"CAATSA sanctions on India would be 'extraordinarily foolhardy': Senator Cruz","content":"<p>CAATSA is a tough US law that authorises the administration to impose sanctions on countries that purchase major defence hardware from Russia in response to Russia&#39;s annexation of Crimea in 2014 and its alleged meddling in the 2016 US presidential elections.<strong><a href=\"https:\/\/www.newindianexpress.com\/world\/2022\/mar\/08\/caatsa-sanctions-on-india-would-be-extraordinarily-foolhardy-senator-cruz-2427687.html\" target=\"_blank\"> (READ FULL STORY HERE)<\/a><\/strong><\/p>\n","date":"2022-03-08 11:22:33","pin":"0","status":"1"},{"title":"Tamil Nadu youth, rejected twice by Indian Army, now joins Ukrainian troops","content":"<p>Intelligence reports received by the Union government have revealed that the Tamil youth, Sainikhesh Ravichandran of Thudaliyur in Coimbatore is a student of Aerospace engineering at Kharkiv National University in Ukraine. <strong><a href=\"https:\/\/www.newindianexpress.com\/states\/tamil-nadu\/2022\/mar\/08\/tamil-nadu-youth-rejected-twice-by-indian-army-nowjoins-ukrainian-troops-2427693.html\" target=\"_blank\">(READ FULL STORY HERE)<\/a><\/strong><\/p>\n","date":"2022-03-08 11:51:09","pin":"0","status":"1"},{"title":"At Romania hotel, ballroom welcomes refugees fleeing Ukraine","content":"<p>As Olga Okhrimenko walked into a bustling ballroom-turned-refugee shelter at a four-star Romanian hotel, her corgi, Knolly, strained at the leash anxiously seeking the warmth inside. It had taken them three days to flee Ukraine by car, bus and taxi in the bitter cold. <strong><a href=\"https:\/\/www.newindianexpress.com\/world\/2022\/mar\/08\/at-romania-hotel-ballroom-welcomes-refugees-fleeing-ukraine-2427699.html\" target=\"_blank\">(READ FULL STORY HERE)<\/a><\/strong><\/p>\n","date":"2022-03-08 12:08:25","pin":"0","status":"1"},{"title":"Pakistan sends plane to evacuate 300 who fled","content":"<ul>\n\t<li>Pakistan sent an aircraft to Poland on Tuesday to evacuate more than 300 Pakistanis who escaped fighting in Ukraine.<\/li>\n\t<li>Pakistan International Airlines says most of them are students.<\/li>\n\t<li>Pakistan has refused to condemn Russia&rsquo;s invasion of Ukraine, even as it has denounced war as a solution to differences and called for negotiations and a cease-fire.<\/li>\n\t<li>Prime Minister Imran Khan met with President Vladimir Putin at the Kremlin just hours after the Russian leader sent tanks into Ukraine on Feb. 24.<\/li>\n\t<li>Pakistan abstained from last week&rsquo;s U.N. General Assembly vote condemning Russia&rsquo;s invasion of Ukraine.<\/li>\n<\/ul>\n","date":"2022-03-08 12:09:33","pin":"0","status":"1"},{"title":"Will stay in Kyiv, not afraid of Russians: President Zelensky","content":"<ul>\n\t<li>Ukraine President Volodymyr Zelensky on Tuesday said that he was in Kyiv and will stay there as he was not afraid.<\/li>\n\t<li>The statement came amid the Russian troops intensifying shelling in several Ukrainian cities. They were also inching closer to the capital Kyiv from the north and west.<\/li>\n\t<li>&quot;I stay in Kyiv. On Bankova Street. I&#39;m not hiding. And I&#39;m not afraid of anyone,&quot; Zelensky said in a video on his official Instagram handle.<\/li>\n\t<li>He said that he would do as much as it takes to &#39;win this patriotic war&#39;.<\/li>\n<\/ul>\n","date":"2022-03-08 12:20:43","pin":"0","status":"1"},{"title":"India has 'compulsions' with Russia and territorial issues with China: Former US diplomat Keshap","content":"<p>India has &quot;compulsions&quot; with Russia and territorial issues with China in its neighbourhood, a former American diplomat has told US lawmakers in response to a question on a string of abstentions at the United Nations by New Delhi against Russia&#39;s massive military offensive in Ukraine. <strong><a href=\"https:\/\/www.newindianexpress.com\/world\/2022\/mar\/08\/india-has-compulsions-with-russia-and-territorial-issues-with-china-former-us-diplomat-keshap-2427713.html\" target=\"_blank\">(READ FULL STORY HERE)<\/a><\/strong><\/p>\n","date":"2022-03-08 13:23:50","pin":"0","status":"1"},{"title":"Massive corporate exodus from Russia post Ukraine war","content":"<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\">230 companies have left Russia since the invasion of Ukraine, according to the Yale School of Management.<br \/>\nAnother 30 companies have remained in the country, including major hotel and fast food chains, as well as consumer brands <a href=\"https:\/\/twitter.com\/mea?ref_src=twsrc%5Etfw\">@mea<\/a> <a href=\"https:\/\/twitter.com\/NewIndianXpress?ref_src=twsrc%5Etfw\">@NewIndianXpress<\/a><\/p>\n&mdash; Yeshi Seli (@YeshiSeli) <a href=\"https:\/\/twitter.com\/YeshiSeli\/status\/1501102311401492481?ref_src=twsrc%5Etfw\">March 8, 2022<\/a><\/blockquote>\n<script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2022-03-08 13:27:41","pin":"0","status":"1"},{"title":"Russia, Ukraine accuse each other of impeding humanitarian corridors for safe passage of citizens","content":"<p>Russia and Ukraine have accused each other at the UN of impeding humanitarian corridors that would allow safe passage of citizens and foreigners caught in the raging conflict, even as India urged both sides to facilitate uninterrupted passage for all civilians, including stranded Indians in Ukraine.<\/p>\n\n<p>Permanent Representative of Ukraine to the UN Ambassador Sergiy Kyslytsya told the UN Security Council briefing on the humanitarian situation in Ukraine on Monday that &quot;Ukraine deeply regrets that more than 2,000 citizens of India, China, Turkey, Pakistan and other countries suffer today along with Ukrainians from Russian aggression.&quot;<\/p>\n\n<p>He said the government of Ukraine was in contact 24\/7 with diplomatic missions and consulates of foreign countries to ensure that their citizens can safely return to their countries as soon as possible.<\/p>\n","date":"2022-03-08 14:52:32","pin":"0","status":"1"},{"title":"Ukraine refugees to top 2 mn 'today' or 'tomorrow': UN","content":"<p>The number of refugees fleeing the war in Ukraine is expected to top two million in the next two days, the head of the UN refugee agency said Tuesday.<\/p>\n\n<p>&quot;I do think that we will pass the two million mark today or maybe at the latest tomorrow. So, it doesn&#39;t stop,&quot; Filippo Grandi, the UN High Commissioner for Refugees, told reporters in Oslo. On Monday, the UNHCR put the number of refugees at more than 1.7 million.<\/p>\n\n<p>Grandi made his remarks at a press conference, after visiting Moldova, Poland and Romania, all of which have received refugees pouring across the border from Ukraine since Russia invaded the country on February 24.<\/p>\n","date":"2022-03-08 15:05:07","pin":"0","status":"1"},{"title":"Air strike kills nine in Ukrainian city Sumy","content":"<p>An air strike killed at least nine people, including two children, in the Ukrainian city of Sumy, where a humanitarian corridor was to be set up Tuesday, authorities said.<\/p>\n\n<p>The corridor from Sumy to Poltava is designed to evacuate civilians, including Chinese, Indians and other foreigners, but Ukraine&#39;s vice prime minister accused Russia of planning to disrupt the route.<\/p>\n\n<p>The air strike in Sumy, near the Russian border east of the Ukrainian capital Kyiv, took place late Monday, Ukraine&#39;s rescue services said.<\/p>\n\n<p>&quot;Enemy planes insidiously attacked apartment buildings,&quot; they said on Telegram after arriving on the scene at 11:00 pm.<\/p>\n","date":"2022-03-08 15:06:16","pin":"0","status":"1"},{"title":"Asian shares extend losses as oil prices push higher","content":"<p>Shares fell in Asia on Tuesday after Wall Street logged its biggest drop in more than a year as markets were jolted by another surge in oil prices.<\/p>\n\n<p>Benchmarks declined in Tokyo, Sydney, Hong Kong, Seoul and Shanghai following a 3 per cent tumble for the S&amp;P 500.<\/p>\n\n<p>The surge in the price of oil past USD 130 per barrel on Monday was triggered by the possibility the US might bar crude imports from Russia. Oil prices steadied later in the day and were moderately higher early Tuesday. <a href=\"https:\/\/www.newindianexpress.com\/world\/2022\/mar\/08\/asian-shares-extend-losses-as-oil-prices-push-higher-2427735.html\"><strong>(Read more)<\/strong><\/a><\/p>\n","date":"2022-03-08 15:10:17","pin":"0","status":"1"},{"title":"UK Defense Secretary: Russia growing desperate","content":"<p>Britain&#39;s defense secretary said on Tuesday that there are reports Ukrainian special forces destroyed over 20 Russian helicopters on the ground overnight as Russia&#39;s invasion of Ukraine continues to face logistical problems and fierce resistance.<\/p>\n\n<p>Russia&#39;s advance toward the capital, Kyiv, continues to face pressure from Ukrainian forces around the nearby towns of Hostomel, Bucha, Vorzel and Irpin, the UK Defense Ministry said in an intelligence update released late Monday.<\/p>\n\n<p>In addition, a lengthy Russian column remains stuck on the road north of Kyiv.<\/p>\n\n<p>Defense Secretary Ben Wallace said Russian forces are becoming more and more desperate in the face of such military and supply holdups, leading to &quot;indiscriminate shelling&quot;&nbsp;of civilians.<\/p>\n\n<p>&quot;We&#39;ve also recognised that probably the biggest single casualties, so far in the war, are Russian military soldiers who have been let down by appalling leaders, appalling leadership and appalling plans. And now you see them, literally, at large scales dying.&quot;<\/p>\n","date":"2022-03-08 15:14:34","pin":"0","status":"1"},{"title":"Visuals from Kyiv","content":"<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\">Visuals from the outskirts of the Ukrainian capital, Kyiv, where people are lining up in front of departmental stores to restock necessities.<a href=\"https:\/\/twitter.com\/hashtag\/RussiaUkraineConflict?src=hash&amp;ref_src=twsrc%5Etfw\">#RussiaUkraineConflict<\/a> <a href=\"https:\/\/t.co\/nlc3yiwQqM\">pic.twitter.com\/nlc3yiwQqM<\/a><\/p>\n&mdash; ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1501134517570277379?ref_src=twsrc%5Etfw\">March 8, 2022<\/a><\/blockquote>\n<script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2022-03-08 15:32:48","pin":"0","status":"1"},{"title":"Ousted Ukrainian President urges Zelensky to 'stop bloodshed'","content":"<p>Viktor Yanukovych, the fourth President of Ukraine who was ousted from power during the 2014 protests, have urged the country&#39;s incumbent leader Volodymyr Zelensky to &quot;stop the bloodshed&quot;.<\/p>\n\n<p>Yanukovych, who currently lives in Russia in exile, said he wanted to &quot;address Volodymyr Zelensky in a presidential capacity and even a little bit in a fatherly one&quot;, Ukrayinska Pravda reported citing the Moscow-based RIA Novosti news agency.<\/p>\n\n<p>&quot;I understand that you have many &#39;advisors&#39; but it is your personal responsibility to stop bloodshed and reach a peace agreement. Ukraine, Donbas, and Russia all expect you to do this. The people of Ukraine and your partners in the West will be grateful to you,&quot; the pro-Moscow former leader said.<\/p>\n","date":"2022-03-08 15:35:44","pin":"0","status":"1"},{"title":"Ukraine's Zelensky denounces unkept \"promises\" by West","content":"<p>Ukraine&#39;s Zelensky denounces unkept &quot;promises&quot; by West&nbsp;<br \/>\n&nbsp;<\/p>\n","date":"2022-03-08 15:36:32","pin":"0","status":"0"},{"title":"Ukraine's Zelensky denounces unkept \"promises\" by West","content":"<p>President Volodymyr Zelensky on Tuesday denounced what he called unkept &quot;promises&quot; by the West to protect Ukraine from Russian attacks.<\/p>\n\n<p>&quot;It&#39;s been 13 days we&#39;ve been hearing promises, 13 days we&#39;ve been told we&#39;ll be helped in the air, that there will be planes, that they will be delivered to us,&quot; Zelensky said on a video broadcast on Telegram.&nbsp;<\/p>\n\n<p>&quot;But the responsibility for that rests also on those who were not capable to take a decision in the West for 13 days,&quot; Zelensky added. &quot;On those who have not secured the Ukrainian skies from the Russian assassins.&quot;<\/p>\n","date":"2022-03-08 15:36:32","pin":"0","status":"1"},{"title":"75 Indian sailors, evacuated","content":"<p>Indian Embassy in Kyiv, &quot;Intervened to evacuate 75 Indian sailors stranded in Mykolaiv Port.&quot;<\/p>\n\n<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\">Indian Embassy in Kyiv,Ukraine: &quot;Mission intervened to evacuate 75 Indian sailors stranded in Mykolaiv Port. Y&#39;day buses evacuated 57sailors including 2 Lebanese &amp;3 Syrians. Route constraints precluded evacuation of balance 23sailors. Mission&#39;s attempting their evacuation today.&quot; <a href=\"https:\/\/t.co\/o6GZwxfXc8\">pic.twitter.com\/o6GZwxfXc8<\/a><\/p>\n&mdash; ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1501135727383695362?ref_src=twsrc%5Etfw\">March 8, 2022<\/a><\/blockquote>\n<script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2022-03-08 15:38:35","pin":"0","status":"0"},{"title":"75 Indian sailors, evacuated","content":"<p>Indian Embassy in Kyiv, &quot;Intervened to evacuate 75 Indian sailors stranded in Mykolaiv Port.&quot;<\/p>\n\n<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\">Indian Embassy in Kyiv,Ukraine: &quot;Mission intervened to evacuate 75 Indian sailors stranded in Mykolaiv Port. Y&#39;day buses evacuated 57sailors including 2 Lebanese &amp;3 Syrians. Route constraints precluded evacuation of balance 23sailors. Mission&#39;s attempting their evacuation today.&quot; <a href=\"https:\/\/t.co\/o6GZwxfXc8\">pic.twitter.com\/o6GZwxfXc8<\/a><\/p>\n&mdash; ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1501135727383695362?ref_src=twsrc%5Etfw\">March 8, 2022<\/a><\/blockquote>\n<script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2022-03-08 15:38:35","pin":"0","status":"1"},{"title":"Death toll from air strike in Ukraine's Sumy rises to 21","content":"<p>Twenty-one people, including two children, were killed in air strikes on the besieged northeast Ukrainian city of Sumy, the authorities said.<\/p>\n\n<p>&quot;The bodies of 21 people, including two children&quot; were found at the site of Monday&#39;s strikes, the regional public prosecutor said on Facebook. A previous toll given by the emergency services was nine dead.<\/p>\n","date":"2022-03-08 15:51:45","pin":"0","status":"1"},{"title":"German prosecutors launch probe into Ukraine war crimes","content":"<p>Germany&#39;s federal prosecutor has opened an investigation into possible war crimes by Russian troops since the invasion of Ukraine, a source in his office told AFP Tuesday, confirming earlier media reports.<\/p>\n\n<p>&quot;We will collect and secure all evidence of war crimes,&quot; Justice Minister Marco Buschmann told the Passauer Neue Presse newspaper, adding that the federal prosecution had opened a so-called structural investigation to begin gathering evidence.<\/p>\n","date":"2022-03-08 16:03:57","pin":"0","status":"1"},{"title":"Ukraine defence minister says Russia violating Mariupol corridor","content":"<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\">Minister of Foreign Affairs of Ukraine, Dmytro Kuleba tweets, &quot;Russia holds 300,000 civilians hostage in Mariupol, prevents humanitarian evacuation despite agreements with ICRC mediation. One child died of dehydration yesterday!...&quot;<a href=\"https:\/\/twitter.com\/hashtag\/RussiaUkraineConflict?src=hash&amp;ref_src=twsrc%5Etfw\">#RussiaUkraineConflict<\/a> <a href=\"https:\/\/t.co\/Xav5NjDG90\">pic.twitter.com\/Xav5NjDG90<\/a><\/p>\n&mdash; ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1501146270219784192?ref_src=twsrc%5Etfw\">March 8, 2022<\/a><\/blockquote>\n<script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2022-03-08 16:10:07","pin":"0","status":"1"},{"title":"China's Xi urges 'maximum restraint' over Ukraine crisis in call with Macron, Scholz: state media","content":"<p>China&#39;s Xi urges &#39;maximum restraint&#39; over Ukraine crisis in call with Macron, Scholz: state media<\/p>\n","date":"2022-03-08 16:38:34","pin":"0","status":"1"},{"title":"Shell says it will stop buying Russian oil, natural gas","content":"<p>Energy giant Shell says it will stop buying Russian oil and natural gas as well as shut down its service stations and other operations in the country amid international pressure for companies to sever ties over the invasion of Ukraine.<\/p>\n\n<p>Shell says in a statement Tuesday that it would withdraw from all Russian hydrocarbons, including crude oil, petroleum products, natural gas and liquefied natural gas, &quot;in a phased manner&quot;.<\/p>\n\n<p>The decision comes just days after Ukraine&#39;s foreign minister criticised Shell for continuing to buy Russian oil, lashing out at the company for continuing to do business with President Vladimir Putin&#39;s government.<\/p>\n\n<p>&quot;We are acutely aware that our decision last week to purchase a cargo of Russian crude oil to be refined into products like petrol and diesel, despite being made with security of supplies at the forefront of our thinking,&nbsp;was not the right one and we are sorry,&quot; Shell CEO Ben van Beurden said.<\/p>\n","date":"2022-03-08 16:41:30","pin":"0","status":"1"},{"title":"Adidas latest to close Russia stores following invasion","content":"<p>German sportswear group Adidas is temporarily closing its stores in Russia and shut its online shop, joining a growing list of companies suspending their activities following the invasion of Ukraine.&nbsp;<\/p>\n\n<p>Adidas said in a statement late Monday that it would &quot;suspend the operations of our stores and our e-commerce site in Russia until further notice&quot; but continue to pay its employees.<\/p>\n","date":"2022-03-08 17:26:12","pin":"0","status":"1"},{"title":"WATCH: Tamil Nadu youth, rejected twice by Indian Army, now joins Ukrainian troops","content":"<p><iframe allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\" frameborder=\"0\" height=\"315\" src=\"https:\/\/www.youtube.com\/embed\/ZzL1hZSDLZ8\" title=\"YouTube video player\" width=\"560\"><\/iframe><\/p>\n","date":"2022-03-08 17:39:31","pin":"0","status":"1"},{"title":"410 Indians airlifted from Romania's Suceava in 2 civilian flights","content":"<p>Two civilian flights from Suceava in Romania airlifted 410 Indians nationals to India on Tuesday, the civil aviation ministry said.<\/p>\n\n<p>The Ukrainian airspace has been shut since February 24 due to the Russian military offensive.<\/p>\n\n<p>The Indian citizens stuck in Ukraine are being airlifted once they cross to neighbouring countries such as Romania, Hungary, Slovakia and Poland.<\/p>\n\n<p>&quot;Under &#39;Operation Ganga&#39; to rescue Indian citizens from Ukraine&#39;s neighbouring countries, 410 Indians have been airlifted today (March 8) by 2 special civilian flights from Suceava,&quot; a ministry statement said. <a href=\"https:\/\/www.newindianexpress.com\/nation\/2022\/mar\/08\/410-indians-airlifted-from-romanias-suceava-in-2-civilian-flights-2427777.html\"><strong>(Read more)<\/strong><\/a><\/p>\n","date":"2022-03-08 17:42:25","pin":"0","status":"1"},{"title":"Humanitarian Corridor for evacuation of stranded people announced","content":"<blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Humanitarian Corridor for evacuation of stranded people announced in various parts of Ukraine from 1000 hrs on 8 March...All stranded Indians are urged to make use of this opportunity &amp; evacuate using trains\/vehicles or other available means of transport: Embassy of India in Kyiv <a href=\"https:\/\/t.co\/xSxjkyS97E\">pic.twitter.com\/xSxjkyS97E<\/a><\/p>&mdash; ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1501166856237105154?ref_src=twsrc%5Etfw\">March 8, 2022<\/a><\/blockquote> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2022-03-08 17:50:34","pin":"0","status":"1"},{"title":"Ukraine says 400 civilian deaths recorded","content":"<p>Ukrainian Defence Minister Oleksiy Reznikov has released new estimates of casualties and damage from the Russian war, saying Russian military actions have killed 38 children and wounded more than 70.<\/p>\n\n<p>Overall at least 400 civilian deaths have been recorded and 800 wounded, though &quot;these data are definitely incomplete,&quot; he said in a video address. It was not immediately possible to verify the figures.<\/p>\n\n<p>He said Russian strikes have destroyed more than 200 Ukrainian schools, 34 hospitals and 1,500 residential buildings. He estimated some 10,000 foreign students, notably from India, China and the Persian Gulf are trapped by the fighting, and described attacks on British and Swiss journalists. He claimed that Ukrainian forces have killed more than 11,000 Russian troops.<\/p>\n\n<p>&quot;Russian invaders fire on humanitarian corridors through which civilians are trying to escape,&quot; he said, without saying where.<\/p>\n","date":"2022-03-08 18:18:36","pin":"0","status":"1"},{"title":"Japan slaps more sanctions on Russians","content":"<p>Japan says it has suspended the assets of 32 more Russian and Belarusian individuals as part of international sanctions against Russia.<\/p>\n\n<p>The additional sanctions announced Tuesday target 20 Russians including head of the Chechen Republic Ramzan Kadyrov, deputy chiefs of staff and a press secretary for President Vladamir Putin&#39;s govenment, and deputy chairmen of the state parliament.<\/p>\n\n<p>The list also includes business executives with close ties to Putin and his administration such as Volga Group, Transneft, the Private Military Company Wagner and USM Holdings, according to a statement jointly issued by the foreign, finance and trade ministries.<\/p>\n","date":"2022-03-08 18:19:33","pin":"0","status":"1"},{"title":"India starts evacuation of its citizens from Ukraine's Sumy to Poltava","content":"<p>Happy to inform that we have been able to move out all Indian students from Sumy. They are currently en route to Poltava, from where they will board trains to western Ukraine. Flights under Operation Ganga are being prepared to bring them home: Ministry of External Affairs&nbsp;<\/p>\n","date":"2022-03-08 18:45:17","pin":"0","status":"1"},{"title":"Women's Day overshadowed in Russia, Ukraine","content":"<p>Tuesday is International Women&#39;s Day, an important official holiday in Russia and Ukraine dating from the Soviet era. Women are normally feted with flowers and chocolates and speeches, but this year the holiday was overshadowed in Ukraine by war, and in Russia by economic chaos.<\/p>\n","date":"2022-03-08 19:34:05","pin":"0","status":"1"},{"title":"US President Joe Biden to ban Russian oil imports over Ukraine war","content":"<p>President Joe Biden has decided to ban Russian oil imports, toughening the toll on Russia&#39;s economy in retaliation for its invasion of Ukraine, according to a person familiar with the matter.<\/p>\n","date":"2022-03-08 19:53:45","pin":"0","status":"1"},{"title":"Around 12,000 Russian forces killed since military operation started: Ukraine","content":"<p>Ukraine&#39;s Ministry of Foreign Affairs said that around 12,000 Russian forces have been killed since the invasion of Ukraine started. According to the MFA data, 1036 armoured vehicles of different types, 48 aircraft, 80 helicopters, 303 tanks, 120 artillery pieces and 56 MLRs were hit during the combat.<\/p>\n","date":"2022-03-08 20:06:19","pin":"0","status":"1"},{"title":"Ukrainian President Zelenskyy denounces unkept 'promises' by West","content":"<p>Ukrainian President Volodymyr Zelenskyy on Tuesday denounced Western powers for not approving necessary decisions against Russian military operations in Ukraine and also not saving the country from the missiles and bomb attacks.<\/p>\n","date":"2022-03-08 20:23:57","pin":"0","status":"1"},{"title":"Shell to withdraw from Russian oil, gas in phased manner","content":"<p>Amid &#39;Russia&#39;s atrocities&#39; in Ukraine, Shell plc, a multinational oil and gas company based in the UK, on Tuesday announced its intent to withdraw from its involvement in all Russian hydrocarbons, including crude oil, petroleum products, gas and liquefied natural gas.<\/p>\n","date":"2022-03-08 20:45:33","pin":"0","status":"1"},{"title":"Operation Ganga: About 18,000 Indians brought back from Ukraine by special flights so far","content":"<p>Under &#39;Operation Ganga&#39; to rescue Indian citizens from Ukraine&#39;s neighbouring countries, about 18 thousand Indians have been brought back by special flights so far.<\/p>\n","date":"2022-03-08 21:05:43","pin":"0","status":"1"},{"title":"India asks its stranded Indians to leave Ukraine using humanitarian corridors","content":"<p>Indian Embassy in Ukraine issued an advisory for Indian nationals stranded in Ukraine urging them to leave the conflict-ridden country using the humanitarian corridors using trains or any other means of transport from 10 am on Tuesday.<\/p>\n","date":"2022-03-08 21:29:56","pin":"0","status":"1"},{"title":"Moved out all Indian students from Ukraine's Sumy: MEA","content":"<p>The Ministry of External Affairs on Tuesday announced that it had evacuated all Indian students from Ukraine&#39;s Sumy.<\/p>\n","date":"2022-03-08 21:59:04","pin":"0","status":"1"},{"title":"Ukraine-Russia conflict shows conventional war could happen: Indian Army Chief General MM Naravane","content":"<p>The ongoing conflict between Ukraine and Russia shows that a conventional war could happen, Indian Army Chief Gen MM Naravane said on Tuesday.<\/p>\n","date":"2022-03-08 22:20:44","pin":"0","status":"1"},{"title":"US bans Russian oil imports over Ukraine invasion, says Joe Biden","content":"<p>US President Joe Biden announced a ban on US imports of Russian oil, in the administration&#39;s most far-reaching action yet to punish Moscow for invading Ukraine.<\/p>\n","date":"2022-03-08 22:47:55","pin":"0","status":"1"},{"title":"'No to War': Gandhian organisations in Delhi hold demonstration over Russia-Ukraine conflict","content":"<p>A group of Gandhian organisations held a demonstration against the ongoing Ukraine-Russia war in the national capital here on Tuesday, hoping for the violence to stop.<\/p>\n","date":"2022-03-08 23:10:08","pin":"0","status":"1"},{"title":"PM Narendra Modi speaks to Dutch counterpart Mark Rutte over Ukraine crisis","content":"<p>Prime Minister Narendra Modi spoke to his Netherlands counterpart Mark Rutte on Tuesday as the two leaders discussed the ongoing situation in war-hit Ukraine and shared their concerns over the continuing humanitarian situation there.<\/p>\n","date":"2022-03-08 23:27:42","pin":"0","status":"1"},{"title":"Ukraine 'will not give up': Volodymyr Zelenskyy","content":"<p>Ukrainian President Volodymyr Zelenskyy evoked British wartime leader Winston Churchill as he told the U.K. Parliament that his country would fight Russia&#39;s invasion to the end in Ukraine&#39;s cities, fields and riverbanks.<\/p>\n","date":"2022-03-09 00:02:12","pin":"0","status":"1"},{"title":"Two more Assam students evacuated from Ukraine","content":"<p>Two more Assam students, stranded in war-torn Ukraine, have arrived in New Delhi, Chief Minister Himanta Biswa Sarma said on Tuesday. One student arrived at the Delhi airport while another at Hindon airbase in Ghaziabad, the chief minister said.<\/p>\n","date":"2022-03-09 00:26:04","pin":"0","status":"1"},{"title":"Recognise Russia as 'terrorist country': Ukraine President to UK Parliament","content":"<p>Ukraine&#39;s President Volodymyr Zelenskyy on Tuesday called on British MPs to recognise Russia as a &#39;terrorist country&#39;&nbsp;following President Vladimir Putin&#39;s attack on his nation and called for tougher sanctions to &#39;make sure our skies are safe&#39;.<\/p>\n","date":"2022-03-09 01:03:46","pin":"0","status":"1"},{"title":"IAEA loses contact with safeguards monitoring systems at Chernobyl","content":"<p>The International Atomic Energy Agency has on March 8 said that it has lost contact with the systems at Chernobyl that monitor nuclear material at the radioactive waste facilities at Chernobyl.<\/p>\n\n<p>The sites taken over by the Russian forces on February 24 have stopped transmitting data, the nuclear energy monitoring agency said.<\/p>\n","date":"2022-03-09 08:19:09","pin":"0","status":"1"},{"title":"","content":"<p><span class=\"css-901oao css-16my406 r-poiln3 r-bcqeeo r-qvutc0\">Foreign volunteers will be able to obtain Ukrainian citizenship if they want to, First Deputy Interior Minister Yevhen Yenin said on March 9, Kyiv Independent reported.<\/span><\/p>\n","date":"2022-03-09 08:47:18","pin":"0","status":"1"}]}