{"details":[{"title":"Putin says Ukraine's future in doubt as cease-fires collapse","content":"<p>Russian President Vladimir Putin warned Saturday that Ukrainian statehood is in jeopardy and likened the West&#39;s sanctions on Russia to &ldquo;declaring war,&rdquo; while a promised cease-fire in the besieged port city of Mariupol collapsed amid scenes of terror.<\/p>\n\n<p>Bereft mothers mourned slain children, wounded soldiers were fitted with tourniquets and doctors worked by the light of their cellphones as bleakness and desperation pervaded.<\/p>\n\n<p><a href=\"https:\/\/www.newindianexpress.com\/world\/2022\/mar\/06\/putin-says-ukraines-future-in-doubt-as-cease-fires-collapse-2427013.html\" target=\"_blank\"><strong>Read More<\/strong><\/a><\/p>\n\n<div style=\"text-align:center\">\n<figure class=\"image\" style=\"display:inline-block\"><img alt=\"\" height=\"200\" src=\"https:\/\/images.newindianexpress.com\/uploads\/user\/ckeditor_images\/article\/2022\/3\/6\/Ukraine_AP(8).jpg\" width=\"400\" \/>\n<figcaption>A couple sit on the ruble of a destroyed bridge after crossing the Irpin river in the outskirts of Kyiv, Ukraine, Saturday, March 5, 2022. (Photo | AP)<\/figcaption>\n<\/figure>\n<\/div>\n","date":"2022-03-06 08:09:42","pin":"0","status":"1"},{"title":"Mastercard and Visa suspending operations in Russia","content":"<p>Mastercard said cards issued by Russian banks will no longer be supported by its network and any card issued outside the country will not work at Russian stores or ATMs in the latest blow to the country&rsquo;s financial system after its invasion of Ukraine, AP reported.<\/p>\n\n<p>Visa said it&rsquo;s working with clients and partners in Russia to cease all Visa transactions over the coming days.<\/p>\n\n<p>The suspensions are a follow-up to more limited moves earlier in the week to block Russian financial institutions from the networks that serve as arteries for the payments system.<\/p>\n","date":"2022-03-06 08:11:32","pin":"0","status":"1"},{"title":"Russia bombs 500 kilo heavy bombs in Chernihiv city","content":"<p>Russia has dropped powerful bombs on residential areas of the city of Chernihiv, a regional official said Saturday, according to an AP report.<\/p>\n\n<p>Vyacheslav Chaus posted a photo of what he said was an undetonated FAB-500, a Soviet-designed 500-kilogram (1,100-pound) air-dropped bomb.<\/p>\n\n<p>The city of Chernihiv, located north of Kyiv and with a population of 290,000, has come under heavy fire from Russian forces. Officials said 17 people in the region were killed in the shelling.<\/p>\n","date":"2022-03-06 08:14:19","pin":"0","status":"1"},{"title":"China tells US to not fuel flames in Ukraine","content":"<p>Chinese Foreign Minister Wang Yi told U.S. Secretary of State Antony Blinken that China opposes any moves that &ldquo;add fuel to the flames&rdquo; in Ukraine.<\/p>\n\n<p>The two spoke by phone on Saturday, the Chinese Foreign Ministry said.<\/p>\n\n<p>China says that the sovereignty and territorial integrity of all nations should be respected, but that sanctions create new issues and disrupt the process of political settlement.<\/p>\n","date":"2022-03-06 08:15:58","pin":"0","status":"1"},{"title":"","content":"<p>The war in Ukraine and associated sanctions will have a substantial impact on the global economy, warned the International Monetary Fund in a statement on Sunday, March 6.<\/p>\n\n<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\">[4\/4] The ongoing war &amp; associated sanctions will have a severe impact on the global economy. We are continuing to assess the evolving situation &amp; provide timely policy advice, financial support, and technical assistance to our members.<br \/>\nFull statement<a href=\"https:\/\/t.co\/HXuv5qNS2V\">https:\/\/t.co\/HXuv5qNS2V<\/a><\/p>\n&mdash; IMF (@IMFNews) <a href=\"https:\/\/twitter.com\/IMFNews\/status\/1500197002994495494?ref_src=twsrc%5Etfw\">March 5, 2022<\/a><\/blockquote>\n<script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2022-03-06 08:23:33","pin":"0","status":"1"},{"title":"Any countries imposing no-fly zone over Ukraine party to conflict: Putin","content":"<p>As Ukrainian leader Volodymyr Zelensky has pleaded with the West to support a no-fly zone as his besieged country resists Moscow&#39;s invasion, Russian President Vladimir Putin warned Saturday that any country imposing a no-fly zone over Ukraine would be considered by Moscow to have entered the conflict.<\/p>\n\n<p>Putin warned that a no-fly zone would have &quot;colossal and catastrophic consequences not only for Europe but also the whole world&quot;.<\/p>\n\n<p>Ukraine&#39;s allies have so far ruled out such a move, fearing it would escalate into a wider war with nuclear-armed Russia.<\/p>\n\n<p><a href=\"https:\/\/www.newindianexpress.com\/world\/2022\/mar\/06\/putin-warns-against-imposing-no-fly-zone-over-ukraine-2427015.html\" target=\"_blank\"><strong>Read more<\/strong><\/a><\/p>\n\n<div style=\"text-align:center\">\n<figure class=\"image\" style=\"display:inline-block\"><img alt=\"\" height=\"200\" src=\"https:\/\/images.newindianexpress.com\/uploads\/user\/ckeditor_images\/article\/2022\/3\/6\/Putin_AP(1).jpg\" width=\"400\" \/>\n<figcaption>Russian President Vladimir Putin sits in the cockpit of an airplane simulator as he visits Aeroflot Aviation School outside Moscow, Russia, Saturday, March 5, 2022. (Photo | AP)<\/figcaption>\n<\/figure>\n<\/div>\n","date":"2022-03-06 08:26:46","pin":"0","status":"1"},{"title":"","content":"<p><strong>Russian forces in Ukraine may have entered a possibly brief operational pause<\/strong> as they prepare to resume operations against Kyiv, Kharkiv, Mykolayiv, and possibly Odesa in the next 24-48 hours, according to The Institute for the Study of War, an American policy research organization.<\/p>\n\n<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\"><a href=\"https:\/\/twitter.com\/hashtag\/Russian?src=hash&amp;ref_src=twsrc%5Etfw\">#Russian<\/a> forces in <a href=\"https:\/\/twitter.com\/hashtag\/Ukraine?src=hash&amp;ref_src=twsrc%5Etfw\">#Ukraine<\/a> may have entered a possibly brief operational pause as they prepare to resume operations against <a href=\"https:\/\/twitter.com\/hashtag\/Kyiv?src=hash&amp;ref_src=twsrc%5Etfw\">#Kyiv<\/a>, <a href=\"https:\/\/twitter.com\/hashtag\/Kharkiv?src=hash&amp;ref_src=twsrc%5Etfw\">#Kharkiv<\/a>, <a href=\"https:\/\/twitter.com\/hashtag\/Mykolayiv?src=hash&amp;ref_src=twsrc%5Etfw\">#Mykolayiv<\/a>, and possibly <a href=\"https:\/\/twitter.com\/hashtag\/Odesa?src=hash&amp;ref_src=twsrc%5Etfw\">#Odesa<\/a> in the next 24-48 hours. Read the latest from <a href=\"https:\/\/twitter.com\/TheStudyofWar?ref_src=twsrc%5Etfw\">@TheStudyofWar<\/a> and <a href=\"https:\/\/twitter.com\/criticalthreats?ref_src=twsrc%5Etfw\">@criticalthreats<\/a>:<a href=\"https:\/\/t.co\/5neCMG8col\">https:\/\/t.co\/5neCMG8col<\/a> <a href=\"https:\/\/t.co\/xGBXtwtJm2\">pic.twitter.com\/xGBXtwtJm2<\/a><\/p>\n&mdash; ISW (@TheStudyofWar) <a href=\"https:\/\/twitter.com\/TheStudyofWar\/status\/1500237198519676928?ref_src=twsrc%5Etfw\">March 5, 2022<\/a><\/blockquote>\n<script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2022-03-06 08:38:04","pin":"0","status":"1"},{"title":"Ukrainians continue to flee as Russian aggression continues","content":"<p>Thousands of Ukrainians continue to flee their homeland as the Russian war on Ukraine reached its 11th day.<\/p>\n\n<p>According to the figures released today by the United Nation&rsquo;s Refugee Agency (UNHCR), 1.37 million people have fled Ukraine into neighbouring European countries since Feb 24, after Putin&#39;s forces started their offensive on their former Soviet neighbour.<\/p>\n\n<div style=\"text-align:center\">\n<figure class=\"image\" style=\"display:inline-block\"><img alt=\"\" height=\"200\" src=\"https:\/\/images.newindianexpress.com\/uploads\/user\/ckeditor_images\/article\/2022\/3\/6\/Ukraine_AP(9).jpg\" width=\"400\" \/>\n<figcaption>People cross on an improvised path under a bridge that was destroyed by a Russian airstrike, while fleeing the town of Irpin, Ukraine, Saturday, March 5, 2022. (Photo | AP)<\/figcaption>\n<\/figure>\n<\/div>\n","date":"2022-03-06 08:50:04","pin":"0","status":"1"},{"title":"","content":"<p><strong>Thousands of Ukrainians continue to flee their homeland as the Russian war on Ukraine reached its 11th day<\/strong><\/p>\n\n<div style=\"text-align:center\">\n<figure class=\"image\" style=\"display:inline-block\"><img alt=\"\" height=\"200\" src=\"https:\/\/images.newindianexpress.com\/uploads\/user\/ckeditor_images\/article\/2022\/3\/6\/Ukraine_AP(10).jpg\" width=\"400\" \/>\n<figcaption>Aleksander, 41, presses his palms against the window as he says goodbye to his daughter Anna, 5, on a train to Lviv at the Kyiv station, Ukraine, Friday, March 4. 2022. Aleksander has to stay behind to fight in the war while his family leaves the country to seek refuge in a neighboring country.<br \/>\n(Photo | AP)<\/figcaption>\n<\/figure>\n<\/div>\n","date":"2022-03-06 09:02:02","pin":"0","status":"1"},{"title":"","content":"<p><strong>Thousands of Ukrainians continue to flee their homeland as the Russian war on Ukraine reached its 11th day<\/strong><\/p>\n\n<div style=\"text-align:center\">\n<figure class=\"image\" style=\"display:inline-block\"><img alt=\"\" height=\"200\" src=\"https:\/\/images.newindianexpress.com\/uploads\/user\/ckeditor_images\/article\/2022\/3\/6\/Ukraine_AP(11).jpg\" width=\"400\" \/>\n<figcaption>People leave the town of Bucha, close to Kyiv, Ukraine, Friday, March 4, 2022. (Photo | AP)<\/figcaption>\n<\/figure>\n<\/div>\n","date":"2022-03-06 09:04:49","pin":"0","status":"1"},{"title":"","content":"<p><strong>Thousands of Ukrainians continue to flee their homeland as the Russian war on Ukraine reached its 11th day<\/strong><\/p>\n\n<div style=\"text-align:center\">\n<figure class=\"image\" style=\"display:inline-block\"><img alt=\"\" height=\"200\" src=\"https:\/\/images.newindianexpress.com\/uploads\/user\/ckeditor_images\/article\/2022\/3\/6\/Ukraine_AP(12).jpg\" width=\"400\" \/>\n<figcaption>The remains of a missile lie on a street in Vydubychi district of Kyiv, Ukraine, Friday, March 4, 2022. (Photo | AP)<\/figcaption>\n<\/figure>\n<\/div>\n","date":"2022-03-06 09:07:01","pin":"0","status":"1"},{"title":"Putin threatens Ukraine 'statehood' as Moscow sanctions tighten","content":"<p>Putin has threatened the existence of Ukrainian statehood as his army&#39;s invasion of the neighbour faces stiff resistance and his economy is increasingly asphyxiated by sanctions.<\/p>\n\n<p>&quot;The current (Ukrainian) authorities must understand that if they continue to do what they are doing, they are putting in question the future of Ukrainian statehood,&quot; Putin said on Saturday.&nbsp;<\/p>\n\n<p>&quot;And if this happens, they will be fully responsible.&quot;&nbsp;<\/p>\n","date":"2022-03-06 10:32:34","pin":"0","status":"1"},{"title":"Ukraine says, engaged in \"fierce battles\" with Russian forces","content":"<p>In a Facebook post on Sunday the Ukraine military said it was&nbsp;engaged in &quot;fierce battles&quot; with Russian forces for the control of borders at the southern city of Mykolaiv and the Chernihiv in the north.<\/p>\n\n<p>&quot;The main efforts are focused on defending the city of Mariupol,&quot; it said, adding an operation by Ukrainian forces was also under way in the eastern part of the Donetsk region.<\/p>\n","date":"2022-03-06 11:28:26","pin":"0","status":"1"},{"title":"A group of Indian students studying in Crimea returns to Delhi","content":"<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\">A group of Indian students studying in Crimea returns to Delhi apprehending tensions amid Russia-Ukraine crisis<br \/>\n<br \/>\nSituation in Crimea is normal, we left to be on the safer side as it lies b\/w Russia &amp; Ukraine. Colleges have allowed us to attend online classes, the students say. <a href=\"https:\/\/t.co\/sznbgoL6a2\">pic.twitter.com\/sznbgoL6a2<\/a><\/p>\n&mdash; ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1500361524166406146?ref_src=twsrc%5Etfw\">March 6, 2022<\/a><\/blockquote>\n<script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2022-03-06 13:10:41","pin":"0","status":"1"},{"title":"Ukraine dominates social media info war with Russia","content":"<p>Ukraine has succeeded in dominating social media in the first days since the Russian invasion, in an intensifying information war with Moscow that Kyiv so far appears to be winning, analysts say. Even as President Volodymyr Zelensky remains bunkered down in Kyiv amid heavy bombardment and the fear of assassination, his government has forced an all-out assault on social media to win supporters for their cause.<\/p>\n","date":"2022-03-06 13:12:03","pin":"0","status":"1"},{"title":"Chennai student delays departure, forgo luggage to bring pet dog from Ukraine","content":"<div style=\"text-align:center\">\n<figure class=\"image\" style=\"display:inline-block\"><img alt=\"\" height=\"450\" src=\"https:\/\/images.newindianexpress.com\/uploads\/user\/ckeditor_images\/article\/2022\/3\/6\/FNJBho2aIAgfptI.png\" width=\"600\" \/>\n<figcaption><em>Chennai student who returned from Ukraine with her pet. (Photo | ANI Twitter)<\/em><\/figcaption>\n<\/figure>\n<\/div>\n","date":"2022-03-06 13:24:06","pin":"0","status":"1"},{"title":"At Ukraine's largest art museum, a race to protect heritage","content":"<p>The director of Ukraine&#39;s largest art museum walked its hallways, supervising as staff packed away its collections to protect their national heritage in case&nbsp;the Russian invasion&nbsp;advances west. In one partially empty gallery of the Andrey Sheptytsky National Museum, employees placed carefully wrapped baroque pieces into cardboard boxes. A few meters away, a group walked down the majestic main staircase carrying a giant piece of sacred art, the 18th century Bohorodchany iconostasis.<\/p>\n\n<div style=\"text-align:center\">\n<figure class=\"image\" style=\"display:inline-block\"><img alt=\"\" height=\"300\" src=\"https:\/\/images.newindianexpress.com\/uploads\/user\/ckeditor_images\/article\/2022\/3\/6\/art_museum.jpg\" width=\"600\" \/>\n<figcaption><em>Workers move the Annunciation to the Blessed Virgin of the Bohorodchany Iconostasis in the Andrey Sheptytsky National Museum. (Photo | AP)<\/em><\/figcaption>\n<\/figure>\n<\/div>\n","date":"2022-03-06 13:55:03","pin":"0","status":"1"},{"title":"Ukraine port city Mariupol to attempt civilian evacuation at 1000 GMT (3.30 pm IST)","content":"<p>The Ukraine port city of Mariupol, which is surrounded by Russian troops, said Sunday it will begin efforts to evacuate its civilian population, after earlier efforts were scuppered by ceasefire violations.<\/p>\n\n<p>&quot;From 1000 GMT (3.30 pm IST)&nbsp;the evacuation of the civilian population begins,&quot; city officials said in a statement, which said a ceasefire was agreed with Russian-led forces surrounding the city.<\/p>\n","date":"2022-03-06 13:56:52","pin":"0","status":"1"},{"title":"Foreigners who fled Ukraine team up to help others escape","content":"<p>Jarred by discriminatory treatment and left to evacuate themselves from Ukraine, people from African, Asian and Latin American countries who succeed in getting out are forming impromptu networks to help thousands of others hoping to flee. Stepping into the gap was an easy decision for Alexander Somto Orah, 25, a Nigerian student in Ukraine who, like some others, described xenophobia and threats of violence as he approached the border with Poland shortly after Russia&#39;s invasion.<\/p>\n","date":"2022-03-06 14:19:37","pin":"0","status":"1"},{"title":"India sends humanitarian assistance to Ukraine","content":"<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\">India sends humanitarian assistance to Ukraine via Poland through an Indian Air Force special flight <a href=\"https:\/\/t.co\/ErTKApnhv8\">pic.twitter.com\/ErTKApnhv8<\/a><\/p>\n&mdash; ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1500393746097389569?ref_src=twsrc%5Etfw\">March 6, 2022<\/a><\/blockquote>\n<script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2022-03-06 14:38:40","pin":"0","status":"1"},{"title":"South Korea to hit Belarus with export controls","content":"<p>South Korea said it will implement export controls against close Moscow ally Belarus for &quot;effectively supporting the Russian invasion of Ukraine&quot;. Without detailing what specific measures would be taken, Seoul&#39;s foreign ministry said the restrictions would be similar to those previously imposed on Russia.<\/p>\n","date":"2022-03-06 14:51:52","pin":"0","status":"1"},{"title":"Elon Musk's Starlink internet now in Ukraine","content":"<p>Ukrainian President Volodymyr Zelenskyy thanked SpaceX chief executive Elon Musk for giving Ukraine access to his company&#39;s satellite-internet system, called Starlink.<\/p>\n\n<p>&quot;I&#39;m grateful to him for supporting Ukraine with words and deeds&quot;&nbsp;Zelenskyy said in a tweet. &quot;Next week we will receive another batch of Starlink systems for destroyed cities.&quot;&nbsp;He joked that they discussed possible space projects, which he would talk about &quot;after the war.&quot; <a href=\"https:\/\/www.newindianexpress.com\/world\/2022\/mar\/06\/elon-musks-starlink-internet-now-in-ukraine-2427062.html\" target=\"_blank\"><strong>(READ MORE)<\/strong><\/a><\/p>\n","date":"2022-03-06 15:01:39","pin":"0","status":"1"},{"title":"Last leg of Operation Ganga today, says Indian Embassy in Hungary","content":"<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\">Important Announcement: Embassy of India begins its last leg of Operation Ganga flights today. All those students staying in their OWN accommodation ( other than arranged by Embassy) are requested to reach @Hungariacitycentre , Rakoczi Ut 90, Budapest between 10 am-12 pm<\/p>\n&mdash; Indian Embassy in Hungary (@IndiaInHungary) <a href=\"https:\/\/twitter.com\/IndiaInHungary\/status\/1500385592596647940?ref_src=twsrc%5Etfw\">March 6, 2022<\/a><\/blockquote>\n<script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2022-03-06 15:03:19","pin":"0","status":"1"},{"title":"Russia strikes Ukrainian military air base with long-range weapons","content":"<p>Russia struck and disabled Ukraine&#39;s Starokostiantyniv military air base with long-range high-precision weapons, Russia&#39;s defence ministry said on Sunday. &ldquo;The Russia armed forces continue to strike the military infrastructure of Ukraine,&rdquo; Russian defence ministry spokesman Igor Konashenkov said. &ldquo;On the morning of March 6, strikes were carried out by high-precision long-range weapons. The Ukrainian air force base near Starokostiantyniv was disabled.&rdquo;<\/p>\n","date":"2022-03-06 15:06:33","pin":"0","status":"1"},{"title":"Mastercard, Visa suspend operations in Russia after invasion","content":"<p>Mastercard and Visa are suspending their operations in Russia, the companies said Saturday, in the latest blow to the country&#39;s financial system after its invasion of Ukraine. Mastercard said cards issued by Russian banks will no longer be supported by its network and any Mastercard issued outside the country will not work at Russian stores or ATMs.<\/p>\n","date":"2022-03-06 15:18:08","pin":"0","status":"1"},{"title":"Russian shops to limit food sales to counter black market","content":"<p>Retailers in Russia will limit sales of essential foodstuffs to limit black market speculation and ensure affordability, the government said Sunday, as sanctions imposed over Moscow&#39;s military incursion into Ukraine began to bite.<\/p>\n","date":"2022-03-06 15:22:16","pin":"0","status":"1"},{"title":"More than 1.5 million refugees flee Ukraine in past 10 days: UN","content":"<p>The number of people fleeing Russia&#39;s invasion of Ukraine has topped 1.5 million, making it Europe&#39;s &quot;fastest growing refugee crisis&quot; since World War II, the United Nations said.&nbsp; &quot;More than 1.5 million refugees from Ukraine have crossed into neighbouring countries in 10 days &mdash;- the fastest growing refugee crisis in Europe since World War II,&quot; it said.<\/p>\n","date":"2022-03-06 15:34:04","pin":"0","status":"1"},{"title":"US, Poland explore deal to supply planes to Ukraine: Reports","content":"<p>Washington is working on a deal with Poland to supply Ukraine with Soviet-era warplanes to bolster Kyiv&#39;s defenses against the Russian invasion, according to US media. Multiple news outlets reported Saturday that US officials told them of the possible deal, in which Poland would send Soviet-era aircraft to Ukraine in return for American F-16 fighter jets.<\/p>\n","date":"2022-03-06 15:42:48","pin":"0","status":"1"},{"title":"'Ukraine crisis leads to disturbing reports of racism against students'","content":"<p>The current Ukraine crisis triggered after the Russian military operation has given rise to &quot;disturbing&quot; reports of racism against students of several nations, including India, who have been attempting to flee the war-torn country, the Nelson Mandela Foundation &nbsp;here said.<\/p>\n","date":"2022-03-06 16:09:35","pin":"0","status":"1"},{"title":"India has excellent diplomatic service, they know what to do: German Envoy to India","content":"<p>India has excellent diplomatic service, they know what to do... It&#39;s not about Ukraine or the EU, it is about the global world order...We all have to stand together against it, said Walter J Lindner, German Envoy to India on Ukraine-Russia crisis.<\/p>\n","date":"2022-03-06 16:18:35","pin":"0","status":"1"},{"title":"Zelensky invites Elon Musk to visit Ukraine","content":"<p>Ukrainian President Volodymyr Zelensky has invited Tesla Founder and CEO Elon Musk to visit his country after the war. A video of the meeting was posted on Zelensky&#39;s Instagram.<\/p>\n\n<p>&quot;Talked to @elonmusk. I&#39;m grateful to him for supporting Ukraine with words and deeds. Next week we will receive another batch of Starlink systems for destroyed cities. Discussed possible space projects. But I&#39;ll talk about this after the war,&quot; Zelensky posted on Twitter.<\/p>\n","date":"2022-03-06 16:52:45","pin":"0","status":"1"},{"title":"Ukraine is Europe's 'fastest growing refugee' crisis since WWII","content":"<p>The number of people fleeing Russia&#39;s invasion of Ukraine has topped 1.5 million, making it Europe&#39;s fastest growing refugee crisis since World War II, the United Nations said on Sunday.&nbsp;&quot;More than 1.5 million refugees from Ukraine have crossed into neighbouring countries in 10 days,&quot; the UN High Commissioner for Refugees Filippo Grande tweeted.<\/p>\n","date":"2022-03-06 17:05:47","pin":"0","status":"1"},{"title":"Starlink 'will not' block Russian news sources: Musk","content":"<p>SpaceX chief&nbsp;Elon&nbsp;Musk said Saturday the company&#39;s Starlink satellite broadband service will not block Russian media outlets &quot;unless at gunpoint.&quot;<\/p>\n\n<p>&quot;Starlink has been told by some governments (not Ukraine) to block Russian news sources. We will not do so unless at gunpoint,&quot; the tech titan tweeted. &quot;Sorry to be a free speech absolutist.&quot;&nbsp;<\/p>\n","date":"2022-03-06 17:18:07","pin":"0","status":"1"},{"title":"Pope deplores Ukraine \"rivers of blood and tears\"","content":"<p>Pope Francis deplored what he termed the &quot;rivers of blood and tears&quot; flowing in Ukraine following the Russian invasion and demanded the creation of humanitarian corridors for refugees. &quot;Rivers of blood and tears are flowing in Ukraine. This is not just a military operation but a war which is sowing death, destruction and misery,&quot; said the pontiff.<\/p>\n","date":"2022-03-06 17:30:23","pin":"0","status":"1"},{"title":"Zelenskyy pushes call for Ukraine no-fly zone","content":"<p>Ukrainian President Voldymyr Zelenskyy is pushing his call for foreign countries to impose a no-fly zone over Ukraine. Establishing a no-fly zone would risk escalating the conflict by involving foreign militaries directly. Although the United States and many Western countries have backed Ukraine with weapons shipments, they have sent no troops.<\/p>\n","date":"2022-03-06 17:43:42","pin":"0","status":"1"},{"title":"Israeli PM vows to continue diplomatic effort","content":"<p>Israel&#39;s prime minister says his country will continue to assist in finding a diplomatic solution to the Ukraine crisis, even if the chances for success are few. Naftali Bennett spoke Sunday to a meeting of his Cabinet, hours after he returned from a surprise meeting with Russian President Vladimir Putin in Moscow, where the two discussed the war with Ukraine.<\/p>\n","date":"2022-03-06 18:00:38","pin":"0","status":"1"},{"title":"Ukrainian makes homemade anti-tank obstacles","content":"<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\">VIDEO: In a narrow backyard at the outskirts of Lviv, Western Ukraine, 36-year-old Taras and his friends are making use of every piece of scrap metal they can lay their hands on for a higher purpose: to build homemade anti-tank obstacles <a href=\"https:\/\/t.co\/ENnaQtiXVM\">pic.twitter.com\/ENnaQtiXVM<\/a><\/p>\n&mdash; AFP News Agency (@AFP) <a href=\"https:\/\/twitter.com\/AFP\/status\/1500448612735672328?ref_src=twsrc%5Etfw\">March 6, 2022<\/a><\/blockquote>\n<script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2022-03-06 18:01:06","pin":"0","status":"1"},{"title":"Ukraine warns Russia preparing to shell port city Odessa","content":"<p>Ukraine&#39;s President Volodymyr Zelensky warned that Russian forces are preparing to shell&nbsp;Odessa, a historic port city on the Black Sea coast. &quot;They are preparing to bomb&nbsp;Odessa. Odessa!&quot; he declared, in a video address.&nbsp;&quot;Russians have always come to&nbsp;Odessa. They have always felt only warmth in&nbsp;Odessa. Only sincerity. And now what? Bombs against&nbsp;Odessa? Artillery against&nbsp;Odessa? Missiles against&nbsp;Odessa?&quot; he demanded. <a href=\"https:\/\/www.newindianexpress.com\/world\/2022\/mar\/06\/ukraine-warns-russia-preparing-to-shell-port-city-odessa-2427081.html\" target=\"_blank\"><strong>(READ MORE)<\/strong><\/a><\/p>\n\n<div style=\"text-align:center\">\n<figure class=\"image\" style=\"display:inline-block\"><img alt=\"\" height=\"300\" src=\"https:\/\/images.newindianexpress.com\/uploads\/user\/imagelibrary\/2022\/3\/2\/original\/Volodymyr_Zelensky_AP123.jpg\" width=\"600\" \/>\n<figcaption><em>Ukraine President Volodymyr Zelensky (Photo | AP)<\/em><\/figcaption>\n<\/figure>\n<\/div>\n","date":"2022-03-06 18:13:08","pin":"0","status":"1"},{"title":"Russia ally Kazakhstan permits large pro-Ukraine rally amid sanctions fears","content":"<p>Russia&#39;s ally Kazakhstan permitted a large peace rally in its biggest city as authorities in the Central Asian country look to distance themselves from Moscow&#39;s sanctions-triggering military invasion of Ukraine.<\/p>\n","date":"2022-03-06 18:26:53","pin":"0","status":"1"},{"title":"2 reactors operational at Zaporizhhzhya nuclear power plant: Ukraine tells IAEA","content":"<p>Ukraine has told the International Atomic Energy Agency&nbsp;that two out of the 6 reactors at the country&#39;s largest Zaporizhhzhya Nuclear Power Stationare working and the radiation levels are normal, days after Russian forces took control of the site in the country&#39;s south-east, IAEA Director General Rafael Grossi has said.<\/p>\n\n<div style=\"text-align:center\">\n<figure class=\"image\" style=\"display:inline-block\"><img alt=\"\" height=\"300\" src=\"https:\/\/images.newindianexpress.com\/uploads\/user\/imagelibrary\/2022\/3\/5\/original\/Nuclefar_plant.jpg\" width=\"600\" \/>\n<figcaption><em>Ukrainian nuclear plant. (Photo | AP)<\/em><\/figcaption>\n<\/figure>\n<\/div>\n","date":"2022-03-06 18:41:49","pin":"0","status":"1"},{"title":"Ukraine official says assault halts evacuations for 2nd time","content":"<p>A Ukrainian official says a second attempt to evacuate civilians from a southern city under siege for a week has failed due to continued Russian shelling. Evacuations from the port city of Mariupol were scheduled to begin at noon local time (10 a.m. GMT) during a 10 a.m. to 9 p.m. local ceasefire, Ukrainian military authorities said earlier.<\/p>\n","date":"2022-03-06 19:02:06","pin":"0","status":"1"},{"title":"Russian strike destroys Ukrainian airport: Zelensky","content":"<p>A barrage of Russian missiles destroyed the airport in Vinnytsia in central Ukraine on Sunday, Ukrainian President Volodymyr Zelensky said. &quot;I have just been informed about a missile strike on Vinnytsia. Eight rockets... The airport was completely destroyed,&quot; he said.<\/p>\n","date":"2022-03-06 19:15:50","pin":"0","status":"1"},{"title":"Second attempt to evacuate civilians from besieged city failed due to Russian shelling: Ukraine official","content":"<div style=\"text-align:center\">\n<figure class=\"image\" style=\"display:inline-block\"><img alt=\"\" src=\"https:\/\/images.newindianexpress.com\/uploads\/user\/imagelibrary\/2022\/3\/4\/original\/indians.jpg\" \/>\n<figcaption><em>Image used for representational purpose. (Photo | ANI)<\/em><\/figcaption>\n<\/figure>\n<\/div>\n","date":"2022-03-06 19:23:15","pin":"0","status":"1"},{"title":"Efforts on to bring 200 students stuck in Ukraine: Karnataka CM Basavaraj Bommai","content":"<p>Karnataka Chief Minister Basavaraj Bommai on Sunday said efforts are on to airlift nearly 200 students from Karnataka who are stranded in the bunkers in Kharkiv in war-torn Ukraine.<\/p>\n","date":"2022-03-06 19:50:57","pin":"0","status":"1"},{"title":"Rijiju reaches Austria en route to India from Slovakia","content":"<p>Union Law Minister Kiren Rijiju has reached Vienna on his way back to India from Slovakia where he coordinated evacuations of Indians from the war-hit Ukraine. In a tweet, the Indian embassy said the ambassador received Rijiju in the Austrian capital.<\/p>\n","date":"2022-03-06 20:00:37","pin":"0","status":"1"},{"title":"PM Narendra Modi attributes 'Operation Ganga' success to India's growing influence","content":"<p>PM Narendra Modi on Sunday attributed the success of Operation Ganga to evacuate citizens stranded in war-torn Ukraine to India&#39;s growing influence in the global arena. He said while big countries of the world are finding it difficult, &quot;it is the growing influence of India that we have brought thousands of students back to our homeland&quot;.<\/p>\n","date":"2022-03-06 20:10:07","pin":"0","status":"1"},{"title":"1,234 Haryana students evacuated from Ukraine: Haryana CM Manohar Lal Khattar","content":"<p>Haryana Chief Minister Manohar Lal Khattar on Sunday said around 1,800 students from the state were stuck in the war-torn Ukraine, of which 1,234 have been evacuated. The CM said this after interacting with students who returned from that country.<\/p>\n","date":"2022-03-06 20:20:29","pin":"0","status":"1"},{"title":"Ukraine crisis: UK PM Boris Johnson outlines 6-point plan","content":"<p>British Prime Minister Boris Johnson on Sunday outlined a six-point plan to resolve the Russia-Ukraine crisis, calling for renewed international efforts to bring an end to the conflict.<\/p>\n","date":"2022-03-06 20:30:02","pin":"0","status":"1"},{"title":"We have successfully evacuated over 15,920 students via 76 flights: Jyotiraditya Scindia","content":"<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\"><a href=\"https:\/\/twitter.com\/hashtag\/OperationGanga?src=hash&amp;ref_src=twsrc%5Etfw\">#OperationGanga<\/a> Update: We have successfully evacuated over 15920 students via 76 flights. Breakup -<br \/>\n<br \/>\nRomania - 6680 (31 flights)<br \/>\nPoland - 2822 (13 flights)<br \/>\nHungary - 5300 (26 flights)<br \/>\nSlovakia - 1118 (6 flights) <a href=\"https:\/\/twitter.com\/HardeepSPuri?ref_src=twsrc%5Etfw\">@HardeepSPuri<\/a> <a href=\"https:\/\/twitter.com\/KirenRijiju?ref_src=twsrc%5Etfw\">@KirenRijiju<\/a> <a href=\"https:\/\/twitter.com\/Gen_VKSingh?ref_src=twsrc%5Etfw\">@Gen_VKSingh<\/a><\/p>\n&mdash; Jyotiraditya M. Scindia (@JM_Scindia) <a href=\"https:\/\/twitter.com\/JM_Scindia\/status\/1500467271671627781?ref_src=twsrc%5Etfw\">March 6, 2022<\/a><\/blockquote>\n<script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2022-03-06 20:39:56","pin":"0","status":"1"},{"title":"Russian war in world's 'breadbasket' threatens food supply","content":"<p>The Russian tanks and missiles besieging Ukraine also are threatening the food supply and livelihoods of people in Europe, Africa and Asia who rely on the vast, fertile farmlands of the Black Sea region ? known as the &quot;breadbasket of the world.&quot;<\/p>\n","date":"2022-03-06 20:56:13","pin":"0","status":"1"},{"title":"Poland says over 900,000 crossed from Ukraine","content":"<p>Poland&#39;s border guard agency says that over 922,000 refugees have crossed the border from Ukraine since February 24, when Russia launched its invasion. The agency said on Twitter that a record one-day number of over 129,000 crossed into Poland on Saturday, and almost 40,000 between midnight and 7 am on Sunday.<\/p>\n","date":"2022-03-06 21:03:20","pin":"0","status":"1"},{"title":"Over 1,000 students back home: Tamil Nadu government","content":"<p>Of the 1,011 Tamil Nadu students who arrived in Delhi from Ukraine so far, 852 of them have reached the state and arrangements are on to bring the remaining 159, the government said on Sunday.<\/p>\n","date":"2022-03-06 21:10:20","pin":"0","status":"1"},{"title":"Indian who sustained bullet injuries in Kyiv will return to India with us tomorrow: VK Singh","content":"<p>Indian student Harjot Singh, who was shot in Kyiv a few days back during the Ukraine-Russia war, is returning to Delhi on Monday, Minister of State for Civil Aviation V K Singh said. <strong>(<a href=\"https:\/\/www.newindianexpress.com\/nation\/2022\/mar\/06\/indian-who-was-shot-in-kyiv-during-ukraine-russia-war-returning-to-india-on-monday-vk-singh-2427099.html\" target=\"_blank\">READ MORE<\/a>)<\/strong><\/p>\n\n<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\">&quot;Harjot Singh, an Indian national who sustained bullet injuries in Kyiv and lost his passport, will return to India with us tomorrow,&quot; tweets Union Minister Gen (Retd) VK Singh<a href=\"https:\/\/twitter.com\/hashtag\/OperationGanga?src=hash&amp;ref_src=twsrc%5Etfw\">#OperationGanga<\/a> <a href=\"https:\/\/twitter.com\/hashtag\/RussiaUkraineCrisis?src=hash&amp;ref_src=twsrc%5Etfw\">#RussiaUkraineCrisis<\/a> <a href=\"https:\/\/t.co\/uKxDjZgf05\">pic.twitter.com\/uKxDjZgf05<\/a><\/p>\n&mdash; ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1500465544201646083?ref_src=twsrc%5Etfw\">March 6, 2022<\/a><\/blockquote>\n<script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2022-03-06 21:20:18","pin":"0","status":"1"},{"title":"Recep Tayyip Erdogan urges cease-fire in call with Vladimir Putin","content":"<p>Turkish President Recep Tayyip Erdogan&#39;s office says he has called for an urgent cease-fire in Ukraine in a telephone conversation with Russian President Vladimir Putin. In a statement following Sunday&#39;s one-hour call, the Turkish presidency said Erdogan had urged a halt to fighting to ?address humanitarian concerns? and ?seek a political solution? to the conflict.<\/p>\n","date":"2022-03-06 21:45:49","pin":"0","status":"1"},{"title":"Blinken vows US support to wary Moldova as Ukraine war rages","content":"<p>US Secretary of State Antony Blinken on Sunday pledged America&#39;s support to the small, Western-leaning former Soviet republic of Moldova that is coping with an influx of refugees from Ukraine and warily watching Russia&#39;s intensifying war with its neighbour.<\/p>\n","date":"2022-03-06 21:58:58","pin":"0","status":"1"},{"title":"Russian troops shell nuclear research facility in Kharkiv: Ukraine","content":"<p>The Kharkiv branch of Ukraine&rsquo;s Security Service reported that Russia used multiple Grad rocket launchers to shell the Kharkiv Institute of Physics and Technology.<\/p>\n","date":"2022-03-06 22:08:40","pin":"0","status":"1"},{"title":"We trying hard to evacuate those still stuck: Assam CM Himanta Biswa Sarma","content":"<p>Ten more students from Assam who were stranded in Ukraine arrived in India on Sunday, taking the total number of students from the state evacuated from the war-ravaged nation to 100.&nbsp;CM Himanta Biswa Sarma shared details of nine students who reached Delhi during the day, while the state&#39;s Directorate of Information and Public Relations (DIPR) informed about the return of another student.<\/p>\n","date":"2022-03-06 22:20:52","pin":"0","status":"1"},{"title":"India continuing efforts to evacuate over 700 students from Sumy","content":"<p>India on Sunday continued its efforts to evacuate over 700 Indian students from the embattled northeastern Ukrainian city of Sumy but with little success as severe shelling and airstrikes continued.<\/p>\n","date":"2022-03-06 22:31:04","pin":"0","status":"1"},{"title":"Plea in SC seeks directions to accommodate medical students returning from Ukraine in Indian colleges","content":"<p>The plea says&nbsp;there is no clarity as to when will normalcy return to Ukraine and whether the students will be able to complete their courses. <strong>(<a href=\"https:\/\/www.newindianexpress.com\/nation\/2022\/mar\/06\/plea-in-sc-seeks-directions-to-accommodate-medical-students-returning-from-ukraine-in-indian-college-2427102.html\" target=\"_blank\">READ MORE<\/a>)<\/strong><\/p>\n","date":"2022-03-06 22:40:27","pin":"0","status":"1"},{"title":"Bihar: Number of returnees from war-torn Ukraine crosses 750","content":"<p>More than 750 students pursuing courses in war-ravaged Ukraine have returned to their homes across 38 districts of Bihar so far, officials said on Sunday. The students have been arriving at the airports in Delhi and Mumbai, by flights arranged as part of ?Operation Ganga&#39;.<\/p>\n","date":"2022-03-06 22:56:46","pin":"0","status":"1"},{"title":"Evacuation from Mariupol blocked by Russian shelling: Donetsk Oblast Governor","content":"<p>Governor Pavlo Kyrylenko said evacuation from Mariupol was disrupted for the second time due to ongoing Russian attacks on the city.<\/p>\n","date":"2022-03-06 23:08:30","pin":"0","status":"1"},{"title":"Indian Embassy officials stationed in Poltava to coordinate safe passage of Indian students stranded in Sumy","content":"<p>A team from the Indian Embassy is stationed in Poltava City to coordinate the safe passage of Indian students stranded in Sumy to the Western borders via Poltava. A confirmed time and date will be issued soon. Indian students are advised to be ready to leave on short notice: Indian Embassy in Ukraine<\/p>\n","date":"2022-03-06 23:15:10","pin":"0","status":"1"},{"title":"Despairing Indian students await rescue from Sumy, melting snow for water but clinging to hope","content":"<p>The wait for the Indian students has got longer as fierce fighting blocks their way to safety across the Russian border. <strong>(<a href=\"https:\/\/www.newindianexpress.com\/nation\/2022\/mar\/06\/despairing-indian-students-await-rescue-from-sumy-melting-snow-for-water-but-clinging-to-hope-2427108.html\" target=\"_blank\">READ MORE<\/a>)<\/strong><\/p>\n","date":"2022-03-06 23:24:23","pin":"0","status":"1"},{"title":"Chhattisgarh: 188 students have returned from Ukraine","content":"<p>The Chhattisgarh government on Sunday said 188 students from the state have returned to the country from war-torn Ukraine. They are being provided food and lodging facilities in Delhi and will be given tickets to return to their hometowns in the state, an official said.<\/p>\n","date":"2022-03-06 23:33:12","pin":"0","status":"1"},{"title":"Russia interfering at nuclear plant, IAEA says","content":"<p>The International Atomic Energy Agency has said Russian forces are tightening their grip on the Zaporizhzhya nuclear plant, Ukraine&#39;s largest, that they seized last week.<\/p>\n","date":"2022-03-06 23:42:40","pin":"0","status":"1"},{"title":"Closing Ukraine's airspace could spark a world war: EU leader Charles Michel","content":"<p>European Union leader Charles Michel said Sunday closing Ukraine&#39;s airspace could spark a world war.<\/p>\n","date":"2022-03-06 23:54:41","pin":"0","status":"1"},{"title":"Israel leader speaks to Putin day after visit","content":"<p>Israel&#39;s prime minister spoke Sunday evening by phone with Russian President Vladimir Putin, a day after his snap trip to Moscow to discuss the more than weeklong Russian invasion of Ukraine.<\/p>\n","date":"2022-03-07 00:15:46","pin":"0","status":"1"},{"title":"Blinken says NATO members have ‘green light’ to send fighter jets to Ukraine","content":"<p>US Secretary of State Antony Blinken says NATO members can send fighter jets to Ukraine, and the US will assist those countries in replacing the aircraft they would be missing as a result, said a CBS news report.<\/p>\n","date":"2022-03-07 00:30:09","pin":"0","status":"1"},{"title":"Last student from Udupi in Ukraine crosses Poltava","content":"<p>Glenwill had moved out of war-torn eastern Ukraine and reached Poltava by Sunday noon and their bus took them to Ternopil.<strong> (<a href=\"https:\/\/www.newindianexpress.com\/states\/karnataka\/2022\/mar\/07\/last-student-from-udupi-in-ukraine-crosses-poltava-2427132.html\" target=\"_blank\">READ MORE<\/a>)<\/strong><\/p>\n","date":"2022-03-07 01:03:21","pin":"0","status":"1"},{"title":"Odisha CM Naveen Patnaik writes to PM Narendra Modi, seeks intervention for Indian medical students from Ukraine","content":"<p>Naveen Patnaik said that large number of medical students from Odisha and other parts of India had to return back home in view of the situation in Ukraine.<strong> (<a href=\"https:\/\/www.newindianexpress.com\/states\/odisha\/2022\/mar\/07\/odisha-cm-patnaik-writes-to-pm-modi-seeks-intervention-for-indian-medical-students-from-ukraine-2427134.html\" target=\"_blank\">READ MORE<\/a>)<\/strong><\/p>\n","date":"2022-03-07 01:14:42","pin":"0","status":"1"},{"title":"1980 Tamil Nadu student yet to reach India, says DMK MP Tiruchi Siva","content":"<p>Tiruchi Siva&nbsp;said that the inflow of students have increased and we are expecting the majority of students to reach back by Monday. <strong>(<a href=\"https:\/\/www.newindianexpress.com\/states\/tamil-nadu\/2022\/mar\/07\/russia-ukraine-war-1980-tamil-nadu-student-yet-to-reach-india-says-dmk-mp-tiruchi-siva-2427135.html\" target=\"_blank\">READ MORE<\/a>)<\/strong><\/p>\n","date":"2022-03-07 01:36:34","pin":"0","status":"1"},{"title":"Russians will try to seize capital Kyiv in next few days: Advisor to Ukraine interior minister","content":"<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\">Vadym Denysenko, advisor to the interior minister of Ukraine: &quot;Russian occupiers gathered sufficient troops near Kyiv and will try to seize the capital in the next few days,&quot; reports The Kyiv Independent<\/p>\n&mdash; ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1500568011887235074?ref_src=twsrc%5Etfw\">March 6, 2022<\/a><\/blockquote>\n<script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2022-03-07 02:09:25","pin":"0","status":"1"},{"title":"Streaming platform Netflix suspends services in Russia","content":"<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\">Netflix joins western companies in suspending services in Russia, a company spokesperson said on March 6: The Kyiv Independent<a href=\"https:\/\/twitter.com\/hashtag\/RussiaUkraine?src=hash&amp;ref_src=twsrc%5Etfw\">#RussiaUkraine<\/a><\/p>\n&mdash; ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1500603899774140420?ref_src=twsrc%5Etfw\">March 6, 2022<\/a><\/blockquote>\n<script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2022-03-07 04:21:16","pin":"0","status":"1"},{"title":"Will punish everyone who committed atrocities in this war: Ukraine President Zelensky","content":"<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\">Zelensky: &quot;We&#39;ll punish everyone who committed atrocities in this war. We&#39;ll find every scum who was shelling our cities, our people, who was shooting the missiles, who was giving orders. You&#39;ll not have a quiet place on this earth &ndash; except for a grave,&quot; reports Kyiv Independent<\/p>\n&mdash; ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1500585021408944134?ref_src=twsrc%5Etfw\">March 6, 2022<\/a><\/blockquote>\n<script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2022-03-07 04:47:14","pin":"0","status":"1"},{"title":"Special flight, carrying 160 Indian evacuees, lands in Delhi from Budapest","content":"<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\"><a href=\"https:\/\/twitter.com\/hashtag\/RussiaUkraine?src=hash&amp;ref_src=twsrc%5Etfw\">#RussiaUkraine<\/a> | A special flight, carrying 160 Indian evacuees from Ukraine, lands in Delhi from Budapest in Hungary.<a href=\"https:\/\/twitter.com\/hashtag\/OperationGanga?src=hash&amp;ref_src=twsrc%5Etfw\">#OperationGanga<\/a> <a href=\"https:\/\/t.co\/wLsIfWHoZl\">pic.twitter.com\/wLsIfWHoZl<\/a><\/p>\n&mdash; ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1500618460245929985?ref_src=twsrc%5Etfw\">March 6, 2022<\/a><\/blockquote>\n<script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2022-03-07 05:28:43","pin":"0","status":"1"},{"title":"Russia recruiting Syrians skilled in urban combat to be sent to Ukraine: Media report","content":"<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\">&quot;WSJ: Russia recruiting Syrians skilled in urban combat to be sent to <a href=\"https:\/\/twitter.com\/hashtag\/Ukraine?src=hash&amp;ref_src=twsrc%5Etfw\">#Ukraine<\/a> to help take Kyiv, as per US officials. WSJ said it&#39;s unclear how many fighters have been identified, but some are already in Russia preparing to enter Ukraine,as per an official&quot;: The Kyiv Independent<\/p>\n&mdash; ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1500624960452444163?ref_src=twsrc%5Etfw\">March 7, 2022<\/a><\/blockquote>\n<script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2022-03-07 06:34:25","pin":"0","status":"1"},{"title":"Russian gymnast sports 'Z' on podium next to Ukrainian medallist","content":"<p>Russian gymnast Ivan Kuliak, who sported an insignia linked to the invasion of Ukraine on a medals podium, was called out for his &quot;shocking behaviour&quot; on March 6.<\/p>\n\n<p>Kuliak&#39;s shirt had the letter &#39;Z&#39; prominently placed as he stood next to Ukraine&#39;s Kovtun Illia, the gold medallist at a Gymnastics World Cup event in Doha.<\/p>\n\n<p>The &#39;Z&#39; has been seen daubed on Russian tanks and vehicles in Ukraine and has come to symbolise support for the invasion.<\/p>\n\n<p><a href=\"https:\/\/www.newindianexpress.com\/world\/2022\/mar\/07\/shocking-behaviour-russian-gymnast-sports-z-on-podium-next-to-ukrainian-medallist-2427297.html\" target=\"_blank\"><strong>Read more<\/strong><\/a><\/p>\n\n<div style=\"text-align:center\">\n<figure class=\"image\" style=\"display:inline-block\"><img alt=\"\" height=\"200\" src=\"https:\/\/images.newindianexpress.com\/uploads\/user\/imagelibrary\/2022\/3\/7\/original\/Ivan_Kuliak.jpg\" width=\"400\" \/>\n<figcaption>Russian gymnast Ivan Kuliak at the podium of a Gymnastics World Cup event with the letter &#39;Z&#39; plastered on his chest. (Photo | YouTube screengrab)<\/figcaption>\n<\/figure>\n<\/div>\n","date":"2022-03-07 08:33:08","pin":"0","status":"1"},{"title":"Oil prices hike as Ukraine conflict deepens","content":"<p>The price of oil jumped more than $10 a barrel Monday as the conflict in Ukraine deepened amid mounting calls for harsher sanctions against Russia, according to an AP report.<\/p>\n\n<p>The surge followed a warning from Russian President Vladimir Putin that Ukrainian statehood was imperiled as Russian forces battered strategic locations.<\/p>\n","date":"2022-03-07 08:36:45","pin":"0","status":"1"},{"title":"US lawmakers exploring Russian oil import ban","content":"<p>US House of Representatives Speaker Nancy Pelosi said the House was exploring legislation to further isolate Russia from the global economy, including banning the import of its oil and energy products into the US.<\/p>\n\n<p>Amid rising gasoline prices in the U.S., the Biden administration has yet to call for an oil import ban on Russia.<\/p>\n\n<p><a href=\"https:\/\/www.newindianexpress.com\/world\/2022\/mar\/07\/us-lawmakers-exploring-russian-oil-import-ban-amid-deepening-conflict-2427299.html\" target=\"_blank\"><strong>Read more<\/strong><\/a><\/p>\n","date":"2022-03-07 08:42:13","pin":"0","status":"1"},{"title":"Russia forces probably made minimal advances over the weekend: UK Defence Ministry","content":"<p>The UK Defence Ministry in a recent report estimated that the Russian forces made minimal ground advances over the weekend in Ukraine.<\/p>\n\n<p>The Ministry noted that in the past 24 hours,<span class=\"css-901oao css-16my406 r-poiln3 r-bcqeeo r-qvutc0\"> a &quot;high level of Russian air and artillery strikes&quot; have continued to hit military and civilian sites in Ukrainian cities.<\/span><\/p>\n\n<p>&quot;<span class=\"css-901oao css-16my406 r-poiln3 r-bcqeeo r-qvutc0\">Recent strikes have targeted Kharkiv, Mykolaiv and Chernihiv, and been particularly heavy in Mariupol,&quot; the report said.<\/span><\/p>\n\n<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\">Latest Defence Intelligence update on the situation in Ukraine - 06 March 2022<br \/>\n<br \/>\nFind out more about the UK government&#39;s response: <a href=\"https:\/\/t.co\/eiocXaCcoT\">https:\/\/t.co\/eiocXaCcoT<\/a><br \/>\n<br \/>\n<a href=\"https:\/\/twitter.com\/hashtag\/StandWithUkraine?src=hash&amp;ref_src=twsrc%5Etfw\">#StandWithUkraine<\/a> <a href=\"https:\/\/t.co\/MOPCAhea6i\">pic.twitter.com\/MOPCAhea6i<\/a><\/p>\n&mdash; Ministry of Defence (@DefenceHQ) <a href=\"https:\/\/twitter.com\/DefenceHQ\/status\/1500598902042542080?ref_src=twsrc%5Etfw\">March 6, 2022<\/a><\/blockquote>\n<script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2022-03-07 08:56:05","pin":"0","status":"1"},{"title":"Two of the 'Big Four' accounting firms pull out of Russia","content":"<p>KPMG and PricewaterhouseCoopers both said Sunday, March 6, they would end their relationships with their Russia-based member firms. KPMG said it was also pulling out of Belarus, according to an AP report.<\/p>\n\n<p><a href=\"https:\/\/www.newindianexpress.com\/world\/2022\/mar\/07\/two-of-the-big-four-accounting-firms-pull-out-of-russia-2427301.html\" target=\"_blank\"><strong>Read more<\/strong><\/a><\/p>\n","date":"2022-03-07 08:58:39","pin":"0","status":"1"},{"title":"Russian forces switch off mobile networks and internet at the Zaporizhzhya Nuclear Power Plant","content":"<p>Ukraine&rsquo;s nuclear regulator had informed the International Atomic Energy Agency on Sunday, March 6, that it had started having major problems in communicating with staff operating the Zaporizhzhya nuclear power plant.<\/p>\n\n<p>According to an IAEA <a href=\"https:\/\/www.iaea.org\/newscenter\/pressreleases\/update-13-iaea-director-general-statement-on-situation-in-ukraine\" target=\"_blank\">press release<\/a>, the power plant is being worked by Ukrainian staff working in shifts but any action of plant management &ndash; including measures related to the technical operation of the six reactor units &ndash; requires prior approval by the Russian commander.<\/p>\n","date":"2022-03-07 09:08:34","pin":"0","status":"1"},{"title":"","content":"<p><strong>PM Modi to speak with Ukrainian President Zelenskyy today<\/strong><\/p>\n","date":"2022-03-07 09:13:08","pin":"0","status":"1"},{"title":"China says most of its citizens evacuated from Ukraine","content":"<p>Beijing&#39;s embassy in Ukraine announced Monday that most of the approximately 6,000 Chinese nationals previously in the country had been evacuated, as Russia stepped up the shelling of multiple cities, according to AFP.<\/p>\n\n<p>In the weeks leading up to the conflict, Chinese state media dismissed US warnings of an imminent&nbsp;Russian invasion. Unlike many Western nations, Beijing waited until after war broke out on February 24 to tell its citizens to evacuate.<\/p>\n\n<p>India, too, waited till February 24 to issue an advisory to its citizens. The Indian government is currently in the process of flying its citizens out of Ukraine&#39;s neighbouring countries as they reach Ukraine&#39;s borders.<\/p>\n\n<p><a href=\"https:\/\/www.newindianexpress.com\/world\/2022\/mar\/07\/china-says-most-of-its-citizens-evacuated-from-ukraine-2427302.html\" target=\"_blank\"><strong>Read more<\/strong><\/a><\/p>\n","date":"2022-03-07 09:21:39","pin":"0","status":"1"},{"title":"Equity markets plunge; Oil prices hit 14-year-high","content":"<p>Stock markets in Asia tumbled on Monday, March 7, as investors grow increasingly worried about the impact of the Ukraine war on the global economy, an AFP report read.<\/p>\n\n<p>Bombay stock market index, Sensex, dropped close to 2.5 per cent in early trade while stocks in Hong Kong tumbled more than four per cent in the first few minutes of trade.<\/p>\n\n<p>Oil prices rocketed to nearly $140 -- highest since 2008 -- on concerns about supplies being choked off from eastern Europe as world leaders impose tough sanctions on Russia, the world&#39;s third-biggest crude producer.<\/p>\n","date":"2022-03-07 09:35:59","pin":"0","status":"1"},{"title":"'Moment of choice': Australian PM presses China to act against Russia","content":"<p>Australia&#39;s prime minister called Russia&#39;s invasion of Ukraine &quot;a moment of choice for China&quot; Monday, urging Beijing to end its tacit political and economic support for the war.<\/p>\n\n<p>Scott Morrison pressed China to shape the actions of its Russian ally and prove that Beijing is committed to global peace and the principle of sovereignty.<\/p>\n\n<p>The address -- delivered remotely as the prime minister isolated at home with Covid-19 -- served as a preview of his election stump speech, with Australians set to go to the polls within the next three months.<\/p>\n\n<p><a href=\"https:\/\/www.newindianexpress.com\/world\/2022\/mar\/07\/ukraine-war-a-moment-of-choice-for-china-australian-pm-2427309.html\" target=\"_blank\"><strong>Read more<\/strong><\/a><\/p>\n","date":"2022-03-07 09:52:17","pin":"0","status":"1"},{"title":"Ukraine asks UN's International Court of Justice to halt Russian invasion","content":"<p>Kyiv lodged an urgent case at the International Court of Justice (ICJ) on February 27, saying that Russia had illegally justified its war by falsely alleging genocide in Ukraine&#39;s Donetsk and Lugansk regions, AFP reported.<\/p>\n\n<p>Kyiv has asked the court to take provisional measures ordering Russia to &quot;immediately suspend the military operations&quot;, pending a full judgment that could take years.<\/p>\n\n<p><a href=\"https:\/\/www.newindianexpress.com\/world\/2022\/mar\/07\/ukraine-asks-un-court-to-end-russia-invasion-2427316.html\" target=\"_blank\"><strong>Read more<\/strong><\/a><\/p>\n\n<div style=\"text-align:center\">\n<figure class=\"image\" style=\"display:inline-block\"><img alt=\"\" height=\"200\" src=\"https:\/\/images.newindianexpress.com\/uploads\/user\/ckeditor_images\/article\/2022\/3\/7\/Ukraine_AP(13).jpg\" width=\"400\" \/>\n<figcaption>A factory and a store burn after being bombarded in Irpin, on the outskirts of Kyiv, Ukraine, Sunday, March 6, 2022. (Photo | AP)<\/figcaption>\n<\/figure>\n<\/div>\n","date":"2022-03-07 10:05:49","pin":"0","status":"1"},{"title":"","content":"<p><strong>Netflix, TikTok block services in Russia to avoid US government crackdown<\/strong><\/p>\n","date":"2022-03-07 10:21:33","pin":"0","status":"1"},{"title":"","content":"<p>Members of the Ukrainian armed forces and long-term partners Lesia Ivashchenko and Valerii Fylymonov got married on Sunday, March 6, at a checkpoint in Kyiv.<\/p>\n\n<div style=\"text-align:center\">\n<figure class=\"image\" style=\"display:inline-block\"><img alt=\"\" height=\"200\" src=\"https:\/\/images.newindianexpress.com\/uploads\/user\/ckeditor_images\/article\/2022\/3\/7\/Ukraine_AP(14).jpg\" width=\"400\" \/>\n<figcaption>A soldier holds a helmet as a wedding crown during the wedding ceremony for members of the Ukrainian Territorial Defence Forces Lesia Ivashchenko and Valerii Fylymonov, at a checkpoint in Kyiv, Ukraine, Sunday, March 6, 2022. (Photo | AP)<\/figcaption>\n<\/figure>\n<\/div>\n","date":"2022-03-07 10:39:30","pin":"0","status":"1"},{"title":"","content":"<p><strong>PM Modi to speak to Russian President Vladimir Putin and Ukrainian President Volodymyr Zelenskyy today<\/strong><\/p>\n","date":"2022-03-07 10:51:44","pin":"0","status":"1"},{"title":"Australian missiles \"on the ground\" in Ukraine","content":"<p>Australia last week promised Ukraine $50 million in missiles, ammunition and other military hardware to fight Russian invaders, according to an AP report.<\/p>\n\n<p>Morrison said on Monday: &ldquo;Our missiles are on the ground now.&rdquo;<\/p>\n","date":"2022-03-07 11:08:03","pin":"0","status":"1"},{"title":"","content":"<p><strong>BREAKING<\/strong>: Russian army announces opening of several humanitarian corridors in Ukraine including <strong>Kyiv<\/strong>, <strong>Mariupol<\/strong>, <strong>Kharkiv<\/strong> and <strong>Sumy<\/strong>, where severe fighting is underway.<\/p>\n\n<p>&quot;Russian forces, for humanitarian purposes, are declaring a &#39;regime of silence&#39; from 10:00 am on 7 March and the opening of humanitarian corridors,&quot; the Russian defence ministry said in a statement.<\/p>\n\n<p><a href=\"https:\/\/www.newindianexpress.com\/world\/2022\/mar\/07\/russia-announces-opening-of-several-humanitarian-corridors-in-ukraine-2427345.html\" target=\"_blank\"><strong>Read more<\/strong><\/a><\/p>\n","date":"2022-03-07 11:28:46","pin":"0","status":"1"},{"title":"PM Modi speaks to Ukrainian President Zelenskyy","content":"<p><span class=\"css-901oao css-16my406 r-poiln3 r-bcqeeo r-qvutc0\">Prime Minister Modi spoke on phone to President Volodymyr Zelensky of Ukraine, according to ANI.<\/span><\/p>\n\n<p><span class=\"css-901oao css-16my406 r-poiln3 r-bcqeeo r-qvutc0\">The phone call lasted for about 35 minutes. The two leaders discussed the evolving situation in Ukraine. PM appreciated the continuing direct dialogue between Russia &amp; Ukraine, ANI reported, citing Government of India sources.<\/span><\/p>\n","date":"2022-03-07 12:26:00","pin":"0","status":"1"},{"title":"Japan reportedly in discussions with US, Europe to ban Russian oil imports","content":"<p>Japan is discussing a ban on oil imports from Russia with the United States and European countries, Kyodo news reported.<\/p>\n\n<p>The report comes after US secretary of state Antony Blinken said on Sunday the United States and European allies were exploring the possibility.<\/p>\n","date":"2022-03-07 12:34:26","pin":"0","status":"1"},{"title":"UPDATE: PM Modi speaks to Zelenskyy, requests help to evacuate Indians trapped in Ukraine","content":"<p>Prime Minister Narendra Modi on Monday spoke to Ukrainian President Volodymyr Zelenskyy and sought his &quot;support&quot; in the evacuation of Indian students stuck in northeastern Ukraine&#39;s Sumy city.<\/p>\n\n<p>In a phone conversation that lasted for around 35 minutes, Prime Minister Modi thanked President Zelenskyy for the help extended by his government, PTI reported, citing official sources.<\/p>\n","date":"2022-03-07 12:59:10","pin":"0","status":"1"},{"title":"","content":"<p><span class=\"css-901oao css-16my406 r-poiln3 r-bcqeeo r-qvutc0\">The <strong>Indian embassy<\/strong> in Ukraine said on March 6 it had a team stationed in Poltava to coordinate the safe passage of nearly 700 Indian students stranded in Sumy, reported The Kyiv Independent.<\/span><\/p>\n\n<p>Poltava is located 175 km and 143 km to the South West of Sumy and Kharkiv respectively.<\/p>\n\n<p><span class=\"css-901oao css-16my406 r-poiln3 r-bcqeeo r-qvutc0\">Over the weekend India&#39;s Ministry of External Affairs also asked both sides for a temporary ceasefire to evacuate students.<\/span><\/p>\n","date":"2022-03-07 13:04:08","pin":"0","status":"1"},{"title":"Russia is probably targeting Ukraine’s communications infrastructure, says UK Defence Ministry","content":"<ul>\n\t<li><span class=\"css-901oao css-16my406 r-poiln3 r-bcqeeo r-qvutc0\">Russia is probably targeting Ukraine&rsquo;s communications infrastructure in order to reduce Ukrainian citizens&rsquo; access to reliable news and information, said a UK Defence ministry report released on Monday, March 7.<\/span><\/li>\n\t<li><span class=\"css-901oao css-16my406 r-poiln3 r-bcqeeo r-qvutc0\">&quot;Russia reportedly struck a TV tower in Kharkiv yesterday, suspending broadcasting output. This follows a similar strike on a TV tower in Kyiv on 01 March 2022.<\/span>&quot;<\/li>\n\t<li>There have also been reports of internet disturbances from across Ukrainereported by Internet monitoring organisation NetBlocks.<\/li>\n<\/ul>\n\n<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\">Latest Defence Intelligence update on the situation in Ukraine - 07 March 2022<br \/>\n<br \/>\nFind out more about the UK government&#39;s response: <a href=\"https:\/\/t.co\/D3NG9b9zMX\">https:\/\/t.co\/D3NG9b9zMX<\/a><br \/>\n<br \/>\n<a href=\"https:\/\/twitter.com\/hashtag\/StandWithUkraine?src=hash&amp;ref_src=twsrc%5Etfw\">#StandWithUkraine<\/a> <a href=\"https:\/\/t.co\/lIjezjELsE\">pic.twitter.com\/lIjezjELsE<\/a><\/p>\n&mdash; Ministry of Defence (@DefenceHQ) <a href=\"https:\/\/twitter.com\/DefenceHQ\/status\/1500727508014088192?ref_src=twsrc%5Etfw\">March 7, 2022<\/a><\/blockquote>\n<script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2022-03-07 13:21:04","pin":"0","status":"1"},{"title":"","content":"<p>China&#39;s Foreign Minister says Russia Beijing&#39;s &#39;most important strategic partner&#39; amid refusal to condemn Ukraine war, reports AP.<\/p>\n","date":"2022-03-07 13:39:08","pin":"0","status":"1"},{"title":"China open to mediating on Ukraine, says friendship with Russia 'rock-solid'","content":"<p>China&#39;s Foreign Minister Wang Yi said ties with Moscow constituted &quot;one of the most crucial bilateral relationships in the world&quot;. <strong><a href=\"https:\/\/www.newindianexpress.com\/world\/2022\/mar\/07\/china-says-russia-its-chief-strategic-partner-despite-war-2427364.html\">(Read more)<\/a><\/strong><\/p>\n","date":"2022-03-07 14:07:55","pin":"0","status":"1"},{"title":"Grateful for the support to the Ukrainian people: Ukrainian Pres to PM Modi","content":"<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\">Informed Indian PM Modi about Ukraine countering Russian aggression. India appreciates the assistance to its citizens during the war &amp; Ukraine&#39;s commitment to direct peaceful dialogue at the highest level. Grateful for the support to the Ukrainian people: Ukrainian Pres Zelensky <a href=\"https:\/\/t.co\/jbpSs6EuTe\">pic.twitter.com\/jbpSs6EuTe<\/a><\/p>\n&mdash; ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1500751890824728579?ref_src=twsrc%5Etfw\">March 7, 2022<\/a><\/blockquote>\n<script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2022-03-07 14:17:17","pin":"0","status":"1"},{"title":"Airstrike at airport in Ukraine's Vinnytsia kills nine","content":"<p>Airstrike at airport in Ukraine&#39;s Vinnytsia kills nine: Rescuers.&nbsp;<\/p>\n","date":"2022-03-07 14:29:35","pin":"0","status":"1"},{"title":"Russia shuns Ukraine conflict hearing at top UN court: Judge","content":"<p>Russia has declined to attend a hearing at the UN&#39;s top court on Monday at which Ukraine is asking for an immediate order to halt the conflict, the head judge said.<\/p>\n\n<p>&quot;The court regrets the non-appearance of the Russian federation in these oral proceedings,&quot; International Court of Justice President Joan Donoghue said.<\/p>\n","date":"2022-03-07 14:48:49","pin":"0","status":"1"},{"title":"Gas prices rocket to record peaks on supply fears","content":"<p>Europe and UK natural gas prices hit record highs Monday on supply fears, as the European Union and the United States mull sanctions on Russian energy.<\/p>\n\n<p>Europe reference Dutch TTF gas price surged more than 60 percent to 345 euros per megawatt hour in morning deals and UK gas hit 800 pence per therm.<\/p>\n","date":"2022-03-07 14:58:37","pin":"0","status":"1"},{"title":"Was difficult as they weren't giving preference to Indians, says returnees","content":"<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\">Delhi: &quot;Urge GoI to evacuate students stuck in Sumy at the earliest...We were struggling for food in Kharkiv. Stayed in bunkers from Feb 24- Mar 2, left on Mar 2. Boarding train was difficult as they weren&#39;t giving preference to Indians,&quot; said Priya after returning from <a href=\"https:\/\/twitter.com\/hashtag\/Ukraine?src=hash&amp;ref_src=twsrc%5Etfw\">#Ukraine<\/a> <a href=\"https:\/\/t.co\/RkyI6Kir1b\">pic.twitter.com\/RkyI6Kir1b<\/a><\/p>\n&mdash; ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1500756674638127110?ref_src=twsrc%5Etfw\">March 7, 2022<\/a><\/blockquote>\n<script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2022-03-07 15:01:38","pin":"0","status":"1"},{"title":"Kyiv rejects Moscow-proposed corridors to Belarus, Russia","content":"<p>Ukraine on Monday rejected Moscow&#39;s offer of humanitarian corridors to Russia and Belarus, Deputy Prime Minister Iryna Vereshchuk said.&nbsp;<\/p>\n\n<p>&quot;This is not an acceptable option,&quot; she said, after Russia proposed the passage for civilians from Kharkiv, Kyiv, Mariupol and Sumy. The civilians &quot;aren&#39;t going to go to Belarus and then take a plane to Russia&quot;.<\/p>\n","date":"2022-03-07 15:10:24","pin":"0","status":"1"},{"title":"UK PM Johnson invites world leaders to build coalition against Putin","content":"<p>British Prime Minister Boris Johnson hosts Canadian Prime Minister Justin Trudeau and Dutch PM Mark Rutte at Downing Street in London on Monday, as the trio visit a Royal Air Force (RAF) base to meet members of the UK armed forces.<\/p>\n\n<p>Downing Street said it marks the start of a week of &quot;focussed engagement&quot; with world leaders to mobilise a global outcry at the &quot;atrocities of Russian aggression&quot; into practical support for Ukraine.<\/p>\n\n<p>The three prime ministers will convene for separate bilateral meetings and a joint trilateral meeting to discuss the next steps to counter attacks ordered by Russian President Vladimir Putin on Ukrainian cities. <a href=\"https:\/\/www.newindianexpress.com\/world\/2022\/mar\/07\/uk-pm-johnson-invites-world-leaders-to-build-coalition-against-putin-2427375.html\"><strong>(Read more)<\/strong><\/a><\/p>\n","date":"2022-03-07 15:16:01","pin":"0","status":"1"},{"title":"Putin assures PM Modi of all possible cooperation in safe evacuation of Indians from Ukraine's Sumy","content":"<p>Russian President Vladimir Putin assures PM Narendra Modi of all possible cooperation in safe evacuation of Indians from Ukraine&#39;s Sumy, says Government of India.<\/p>\n","date":"2022-03-07 15:41:07","pin":"0","status":"1"},{"title":"Modi urges Putin to hold direct talks with Zelenskyy","content":"<p>Modi urges Putin to hold direct talks with Ukrainian Prez Zelenskyy in addition to ongoing negotiations between their teams: Sources.<\/p>\n\n<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\">PM Modi spoke on the phone to Russian President Putin. The phone call lasted for about 50 min. They discussed the evolving situation in Ukraine. President Putin briefed PM Modi on the status of negotiations between the Ukrainian and Russian teams: GoI Sources<br \/>\n<br \/>\n(File pics) <a href=\"https:\/\/t.co\/KCGv8Sz894\">pic.twitter.com\/KCGv8Sz894<\/a><\/p>\n&mdash; ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1500768903332773889?ref_src=twsrc%5Etfw\">March 7, 2022<\/a><\/blockquote>\n<script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2022-03-07 15:42:08","pin":"0","status":"1"},{"title":"China's trade up in Jan-Feb, before Russia invaded Ukraine","content":"<p>China&#39;s exports rose by double digits in January and February before Russia&#39;s attack on Ukraine roiled the global economy.&nbsp;Forecasters say China and other oil importers will be hurt by surging prices due to Putin&#39;s war. <a href=\"https:\/\/www.newindianexpress.com\/world\/2022\/mar\/07\/chinas-trade-up-in-jan-feb-before-russia-invaded-ukraine-2427385.html\"><strong>(Read more)<\/strong><\/a><\/p>\n","date":"2022-03-07 16:06:54","pin":"0","status":"1"},{"title":"Indian doctor refuses to leave Ukraine without his pet jaguar and panther","content":"<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\"><strong>Read more :&nbsp;<\/strong><a href=\"https:\/\/www.newindianexpress.com\/states\/andhra-pradesh\/2022\/mar\/07\/ukraine-war-andhra-nativedoctor-refuses-to-flee-donbas-without-his-two-pet-panthers-2427213.html\">Ukraine war: Andhra native doctor refuses to flee Donbas without his two pet panthers<\/a><\/p>\n\n<p dir=\"ltr\" lang=\"en\">Donbas | An Indian doctor Girikumar Patil famously known as Jaguar Kumar refuses to leave Ukraine without his pet jaguar &amp; panther<br \/>\n<br \/>\n&quot;I called Embassy but didn&#39;t get a proper response. My place is surrounded by Russians but I&#39;m trying my best. I treat them like my kids,&quot; he says <a href=\"https:\/\/t.co\/Ou5bT4bsN3\">pic.twitter.com\/Ou5bT4bsN3<\/a><\/p>\n&mdash; ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1500771687172022272?ref_src=twsrc%5Etfw\">March 7, 2022<\/a><\/blockquote>\n<script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2022-03-07 16:07:39","pin":"0","status":"1"},{"title":"Over 1.5 million flee Ukraine, war triggers Europe's fastest-growing refugee crisis since WW II","content":"<p><iframe allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\" frameborder=\"0\" height=\"315\" src=\"https:\/\/www.youtube.com\/embed\/zOVqTDZCN2I\" title=\"YouTube video player\" width=\"560\"><\/iframe><\/p>\n","date":"2022-03-07 16:24:18","pin":"0","status":"1"},{"title":"'Around 3,000 citizens are still in neighbouring countries'","content":"<p>Out of 20,000 Indian citizens,we&#39;ve been able to evacuate more than 16,000 citizens. Around 3,000 citizens are still there in the neighbouring countries of Ukraine. Around 600 students are there in Sumy. The Embassy is making arrangements to evacuate them, says&nbsp;MoS MEA V Muraleedharan.<\/p>\n","date":"2022-03-07 16:26:42","pin":"0","status":"1"},{"title":"Russia-Ukraine delegation meeting could begin in under 2 hours","content":"<p>Russia-Ukraine delegation meeting could begin in under 2 hours. The Russian delegation is currently waiting in Brest, Belarus: Russian media RT<\/p>\n","date":"2022-03-07 16:27:09","pin":"0","status":"1"},{"title":"EU commission to table proposals tomorrow","content":"<p>Tomorrow EU commission will table proposals on how to quickly get rid of our dependency on Russian fossil fuels, said&nbsp;President EU Commission.<\/p>\n\n<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\">Tomorrow EU commission will table proposals on how to quickly get rid of our dependency on Russian fossil fuels. This means diversifying suppliers, switching to LNG &amp; pipeline gas, repowering the EU by investing in renewables &amp; improving energy efficiency: President EU Commission <a href=\"https:\/\/t.co\/FNpVkKYMPV\">pic.twitter.com\/FNpVkKYMPV<\/a><\/p>\n&mdash; ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1500781215481491461?ref_src=twsrc%5Etfw\">March 7, 2022<\/a><\/blockquote>\n<script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2022-03-07 16:28:21","pin":"0","status":"1"},{"title":"Mayor of town near Kyiv killed by Russian fire","content":"<p>Russian forces have killed the mayor of Gostomel, a town near the Ukrainian capital Kyiv that is home to a strategic airport, city authorities said on Monday.<\/p>\n\n<p>&quot;The head of Gostomel, Yuri Illich Prylypko, died while distributing bread to the hungry and medicine to the sick,&quot; the city said on its Facebook page.<\/p>\n\n<p>Prylypko was shot dead along with two others, it said, without specifying when.&nbsp;&quot;No-one forced him to go under the occupiers&#39; bullets,&quot; it said. &quot;He died for his people, for Gostomel. He died a hero.&quot;&nbsp;<\/p>\n\n<p>Gostomel, northwest of Kyiv, is home to the strategic Antonov military airport, which was the site of fierce battles between Ukrainian and Russian forces in the first days of the war.<\/p>\n","date":"2022-03-07 16:29:10","pin":"0","status":"1"},{"title":"Ukraine sets export quotas on key agricultural products","content":"<p>Ukraine, one of the world&#39;s top wheat producers, has set export restrictions on the crop and other agricultural products amid Russia&#39;s military invasion, the Interfax Ukraine news agency reported.<\/p>\n\n<p>According to a government decree published Sunday evening, a license issued by the authorities is now required in order to export wheat, poultry meat, eggs and sunflower oil.&nbsp;<\/p>\n\n<p>Quotas were also introduced for the export of cattle and beef, salt, sugar, oats, buckwheat, rye and millet.<\/p>\n\n<p>The conflict has pushed wheat prices higher as Russia is the world&#39;s top exporter of the cereal and Ukraine is the fourth according to estimates by the US Department of Agriculture (USDA).<\/p>\n","date":"2022-03-07 16:30:01","pin":"0","status":"1"},{"title":"Streets in Ukraine's capital city wear a deserted look","content":"<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\">Streets in Ukraine&#39;s capital city Kyiv wear a deserted look amid <a href=\"https:\/\/twitter.com\/hashtag\/RussiaUkraineCrisis?src=hash&amp;ref_src=twsrc%5Etfw\">#RussiaUkraineCrisis<\/a> <a href=\"https:\/\/t.co\/IlSgWokvpL\">pic.twitter.com\/IlSgWokvpL<\/a><\/p>\n&mdash; ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1500797292991098887?ref_src=twsrc%5Etfw\">March 7, 2022<\/a><\/blockquote>\n<script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2022-03-07 17:14:11","pin":"0","status":"1"},{"title":"Fujifilm Holdings to donate USD 2 mn to support humanitarian efforts in war-torn Ukraine","content":"<p>Fujifilm Holdings on Monday announced a donation of USD 2 million to support humanitarian efforts in Ukraine and its neighbouring countries engaged in aid to the people of the warn-torn country.<\/p>\n\n<p>The company, in a statement, said it will donate USD 1 million to the United Nations High Commissioner for Refugees (UNHCR) and the United Nations Children&#39;s Fund (UNICEF) for use in supporting humanitarian relief efforts.<\/p>\n\n<p>In addition, the company will donate medical equipment worth USD 1 million, including Fujifilm&#39;s portable X-ray system and hand-held wireless ultrasound devices, for medical care provided to the affected population in Ukraine.<\/p>\n","date":"2022-03-07 17:28:03","pin":"0","status":"1"},{"title":"Ukrainian, Russian foreign ministers to meet on March 10","content":"<p>Ukrainian, Russian foreign ministers to meet in Turkey on March 10. Minister Dmytro Kuleba and Russian Foreign Minister Sergey Lavrov have agreed to meet in Turkey&rsquo;s coastal Antalya province, as per their Turkish counterpart Mevlut Cavusoglu: The Kyiv Independent<\/p>\n","date":"2022-03-07 17:45:34","pin":"0","status":"1"},{"title":"1,314 Indians airlifted today by 7 special civilian flights from Ukraine’s neighbouring countries","content":"<p>Under Operation Ganga to rescue Indian citizens, 1314 Indians have been airlifted today by seven special civilian flights from Ukraine&rsquo;s neighbouring countries. With this, more than 17,400 Indians have been brought back since the seven flights began on 22nd Feb: Ministry of Civil Aviation<\/p>\n\n<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\">Among the special Civilian flights today, 4 have landed in New Delhi while 2 reached Mumbai. One flight is expected late in the evening. There were 5 flights from Budapest, and one each from Bucharest and Suceava: Ministry of Civil Aviation <a href=\"https:\/\/twitter.com\/hashtag\/OperationGanga?src=hash&amp;ref_src=twsrc%5Etfw\">#OperationGanga<\/a><\/p>\n&mdash; ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1500804670364995587?ref_src=twsrc%5Etfw\">March 7, 2022<\/a><\/blockquote>\n<script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2022-03-07 17:52:32","pin":"0","status":"1"},{"title":"Moscow allows Russians to repay debts to 'hostile' nations in rubles","content":"<p>Moscow will temporarily allow Russian companies and individuals to repay debts to foreign creditors from a new list of &quot;hostile&quot; nations in rubles, the government said Monday.<\/p>\n\n<p>The list includes the United States, European Union member states, Australia, Britain, Canada, Monaco, South Korea, Switzerland and Japan.<\/p>\n","date":"2022-03-07 17:55:34","pin":"0","status":"1"},{"title":"More than 1.7 mn people flee war in Ukraine: UNHCR","content":"<p>More than 1.7 million people have fled Ukraine since Russia launched its full-scale invasion on February 24, according to the latest data from the United Nations on Monday.<\/p>\n\n<p>UNICEF, the UN children&#39;s agency, believes around half of them are youngsters.<\/p>\n\n<p>Authorities and the UN expect the flow to intensify as the Russian army advances deeper into Ukraine, particularly as it approaches the capital, Kyiv.&nbsp;More than 37 million people lived under the Kyiv government&#39;s control before last week&#39;s invasion.<\/p>\n","date":"2022-03-07 18:00:22","pin":"0","status":"1"},{"title":"Odessa, pearl of the Black Sea, in Russia's sights","content":"<p>Odessa, which Ukraine fears could be the next target of Russia&#39;s offensive in the south, is the country&#39;s main port and is vital for its economy.<\/p>\n\n<p>But the city of one million people close to the Romanian and Moldovan borders also holds a special place in the Russian imagination.<\/p>\n\n<p>A cosmopolitan port with stunning 19th-century architecture, sandy beaches and a Mediterranean climate, it has a Russian-speaking majority from its days as the empire&#39;s second port.&nbsp;<\/p>\n\n<p>Ukrainian President Volodymyr Zelensky warned on Sunday that Moscow was &quot;preparing to bomb Odessa&quot;, saying, &quot;It will be a war crime... a historical crime.&quot;<\/p>\n","date":"2022-03-07 18:01:07","pin":"0","status":"1"},{"title":"Train carrying relief material leaves from Lviv for Kyiv","content":"<p>Amid escalating tensions between Russia and Ukraine, a passengerless train carrying relief material left from Lviv for Kyiv after a ceasefire was declared by the Russian military on Monday.<\/p>\n\n<p>The relief material included water bottles, milk packs, medicines and other essential items. All the sleeper classes were empty.<\/p>\n\n<p>The train is moving very carefully since there were reports stating that the train could be a target of Russian aggression. Meanwhile, Kyiv station wore a deserted look when the train reached there.<\/p>\n","date":"2022-03-07 18:16:46","pin":"0","status":"1"},{"title":"JK Rowling promises up to £1 mn for children in Ukraine","content":"<p>&quot;Harry Potter&quot; author J.K. Rowling on Monday promised to match donations up to &pound;1 million ($1.3 million, 1.2 million euros) to a charity she co-founded to help children in Ukraine.<\/p>\n\n<p>The writer set up Lumos in 2005 &quot;to end the systematic institutionalisation of children&quot;, including in the Zhytomyr region west of the Ukrainian capital, Kyiv.<\/p>\n\n<p>The charity said the area, where more than 1,500 children were trapped in orphanages even before the invasion, was now under attack from Russian forces.<\/p>\n\n<p>It wants an urgent end to military action to protect the estimated 100,000 children living in institutions in Ukraine and to prevent more family separations.<\/p>\n","date":"2022-03-07 18:35:50","pin":"0","status":"1"},{"title":"IAF flight carrying Indian national who sustained bullet injury reaches near Delhi","content":"<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\">Indian Air Force flight carrying Indian evacuees including Harjot Singh, an Indian national who sustained bullet injuries in Kyiv, Ukraine arrives at Hindan airbase near Delhi from Rzeszow, Poland <a href=\"https:\/\/t.co\/qHZBIE5twW\">pic.twitter.com\/qHZBIE5twW<\/a><\/p>\n&mdash; ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1500819396050440196?ref_src=twsrc%5Etfw\">March 7, 2022<\/a><\/blockquote>\n<script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2022-03-07 18:39:40","pin":"0","status":"1"},{"title":"Russian negotiator accuses Ukraine of blocking humanitarian corridors","content":"<p>Russia&#39;s chief negotiator in talks between Moscow and Kyiv accused Ukraine of blocking humanitarian corridors for civilians escaping advancing Russian forces, calling it a &quot;war crime&quot;.&nbsp;<\/p>\n\n<p>&quot;The nationalists who have seized positions in cities continue to hold civilians there,&quot; Russia&#39;s chief negotiator Vladimir Medinsky told state television. He accused Kyiv of using the civilians as &quot;a human shield&quot; and said that &quot;this is undoubtedly a war crime.&quot;<\/p>\n\n<p>He added the latest round of talks between the warring countries, taking place on the Poland-Belarus border, are focused around the corridors.&nbsp;<\/p>\n","date":"2022-03-07 18:40:49","pin":"0","status":"1"},{"title":"Moscow-Kyiv talks to focus on humanitarian corridors","content":"<p>Moscow-Kyiv talks to focus on humanitarian corridors: Russian negotiator<\/p>\n","date":"2022-03-07 19:05:54","pin":"0","status":"1"},{"title":"EU chief tells Putin to ensure Ukraine 'humanitarian safe passage'","content":"<p>EU chief Charles Michel on Monday urged Russian President Vladimir Putin in a call to end his invasion of Ukraine and allow safe passage for civilians.&nbsp;<\/p>\n\n<p>&quot;Called on President (Putin) to immediately stop hostilities and ensure humanitarian safe passage and access to assistance,&quot; Michel said on Twitter.&nbsp;<\/p>\n\n<p>&quot;Stressed need to ensure safety and security of nuclear facilities amidst hostilities in Ukraine. Agreed to maintain further contacts.&quot;<\/p>\n","date":"2022-03-07 19:06:36","pin":"0","status":"1"},{"title":"Ukraine delegation arrives for talks with Russia","content":"<p>Ukraine delegation arrives at Belarus-Poland border for talks with Russia<\/p>\n","date":"2022-03-07 19:07:37","pin":"0","status":"1"},{"title":"People are running from Ukraine to Poland due to war","content":"<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\">People are running from <a href=\"https:\/\/twitter.com\/hashtag\/Ukraine?src=hash&amp;ref_src=twsrc%5Etfw\">#Ukraine<\/a> to Poland due to war. As of now, over 10 lakh people have come to Poland. Poland is always ready to help. We are welcoming Indians with a warm heart. Poland and India are brothers: Adam Burakowski, Poland Ambassador to India at Hindan airbase <a href=\"https:\/\/t.co\/8iSXr3YNFO\">pic.twitter.com\/8iSXr3YNFO<\/a><\/p>\n&mdash; ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1500827349797175298?ref_src=twsrc%5Etfw\">March 7, 2022<\/a><\/blockquote>\n<script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2022-03-07 19:08:26","pin":"0","status":"1"},{"title":"Ukraine ripple effect: Indian students in Belarus head home","content":"<p>Fearing a spillover of the war in Ukraine, Indians studying in neighbouring Belarus are getting ready to leave for India despite assurances from universities and local authorities to the contrary.<\/p>\n","date":"2022-03-07 19:42:02","pin":"0","status":"1"},{"title":"Indian student who was shot in Kyiv arrives in Delhi on IAF flight","content":"<p>An Indian Air Force flight carrying Indian student Harjot Singh, who was shot in Ukrainian capital Kyiv a few days ago, landed at the Hindon airbase here Monday evening, officials said.<\/p>\n","date":"2022-03-07 19:52:58","pin":"0","status":"1"},{"title":"Stung by criticism, UK's Johnson speeds up Russia sanctions","content":"<p>U.K. lawmakers are set to pass a bill on Monday aimed at toughening sanctions on Russia and rooting out ill-gotten money from the British economy.<\/p>\n","date":"2022-03-07 20:13:48","pin":"0","status":"1"},{"title":"UN office puts civilian death toll at 406","content":"<p>The UN human rights office says it has been able to confirm the deaths of 406 civilians in Ukraine since the beginning of the Russian invasion. It said that another 801 injured civilians had been confirmed as of midnight Sunday.<\/p>\n","date":"2022-03-07 20:22:07","pin":"0","status":"1"},{"title":"Macron keeps an open line to Putin as war in Ukraine rages","content":"<p>While most of the world is shunning President Vladimir Putin over Russia&#39;s invasion of Ukraine, one of the few leaders keeping an open line of communication is French President Emmanuel Macron.<\/p>\n","date":"2022-03-07 20:35:43","pin":"0","status":"1"},{"title":"China calls Russia its chief 'strategic partner' despite war","content":"<p>China&#39;s foreign minister on Monday called Russia his country&#39;s most important strategic partner&nbsp;as Beijing continues to refuse to condemn the invasion of Ukraine despite growing pressure from the U.S. and European Union to use its influence to rein Moscow in.<\/p>\n","date":"2022-03-07 20:56:34","pin":"0","status":"1"},{"title":"16,000 Indians brought back from Ukraine: Union Minister Muraleedharan","content":"<p>Union Minister of State for External Affairs, V Muraleedharan, on Monday said the Centre was able to bring back around 16,000 Indians from the war-torn Ukraine so far and hope to evacuate the rest in days to come.<\/p>\n","date":"2022-03-07 21:12:46","pin":"0","status":"1"},{"title":"Delegations from Russia, Ukraine start third round of conflict talks","content":"<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\"><a href=\"https:\/\/twitter.com\/hashtag\/BREAKING?src=hash&amp;ref_src=twsrc%5Etfw\">#BREAKING<\/a> Delegations from Russia, Ukraine start third round of conflict talks: Belarus news agency <a href=\"https:\/\/t.co\/y6ccCFKSMJ\">pic.twitter.com\/y6ccCFKSMJ<\/a><\/p>\n&mdash; AFP News Agency (@AFP) <a href=\"https:\/\/twitter.com\/AFP\/status\/1500852154269147136?ref_src=twsrc%5Etfw\">March 7, 2022<\/a><\/blockquote>\n<script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2022-03-07 21:31:10","pin":"0","status":"1"},{"title":"EU 'needs to be prepared for five million' refugees from Ukraine, says top diplomat Borell","content":"<p>The European Union should be ready for five million people fleeing Ukraine amid ongoing conflict with Russia, according to European Union foreign policy chief Josep Borrell.<\/p>\n","date":"2022-03-07 21:52:59","pin":"0","status":"1"},{"title":"Russian forces destroyed over 1500 residential buildings, 202 schools, 34 hospitals: Ukraine","content":"<p>Nearly 202 schools, 34 hospitals and over 1500 residential buildings have been destroyed by Russian forces since the beginning of their military operation in Ukraine, claimed Ukrainian President Volodymyr Zelenskyy&#39;s aide Mykhailo Podolyak on Monday.<\/p>\n","date":"2022-03-07 22:16:05","pin":"0","status":"1"},{"title":"IRC confirms humanitarian corridor prepared by Russia for civilians from Mariupol was full of mines","content":"<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\">The International Red Cross has confirmed that the &ldquo;humanitarian corridor&rdquo; prepared by Russia for civilians from <a href=\"https:\/\/twitter.com\/hashtag\/Mariupol?src=hash&amp;ref_src=twsrc%5Etfw\">#Mariupol<\/a> was full of mines.<br \/>\nThis is terrible!<a href=\"https:\/\/twitter.com\/hashtag\/Russia?src=hash&amp;ref_src=twsrc%5Etfw\">#Russia<\/a> was preparing a massacre. This is the genocide of <a href=\"https:\/\/twitter.com\/hashtag\/Ukrainians?src=hash&amp;ref_src=twsrc%5Etfw\">#Ukrainians<\/a>!<br \/>\nIt is good that we managed to avoid it this time.<\/p>\n&mdash; Inna Sovsun (@InnaSovsun) <a href=\"https:\/\/twitter.com\/InnaSovsun\/status\/1500871283596218376?ref_src=twsrc%5Etfw\">March 7, 2022<\/a><\/blockquote>\n<script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2022-03-07 22:37:11","pin":"0","status":"1"},{"title":"700-km road journey for injured Indian student before boarding flight; embassy hails driver","content":"<p>Harjot Singh, the Indian student who sustained bullet injuries in Kyiv, was taken by road from the Ukranian capital to a border transit point 700 kilometres away under challenging circumstances so that he can board an evacuation flight to return home.<\/p>\n","date":"2022-03-07 22:52:39","pin":"0","status":"1"},{"title":"China says Taiwan, Ukraine issues 'not comparable'","content":"<p>Amid fears that China could initiate military action in Taiwan on the lines of Russia&rsquo;s offensive in Ukraine, Chinese Foreign Minister Wang Yi on Monday asserted that the Taiwan question differs in nature from the Ukraine issue and the two are not comparable.<\/p>\n","date":"2022-03-07 23:14:34","pin":"0","status":"1"},{"title":"UK PM Boris Johnson defends treatment of Ukraine refugees","content":"<p>British Prime Minister Boris Johnson has defended his government&#39;s treatment of Ukrainians fleeing war, after France accused U.K. authorities of &ldquo;inhumane&rdquo; behavior towards the refugees.<\/p>\n","date":"2022-03-07 23:35:17","pin":"0","status":"1"},{"title":"Three more Assam students arrived in Delhi from Ukraine: CM Himanta Biswa Sarma","content":"<p>Three more students of Assam, who were stranded in war-torn Ukraine, have arrived in New Delhi, taking the total evacuees who hailed from the state to 104, Chief Minister Himanta Biswa Sarma said on Monday.<\/p>\n","date":"2022-03-07 23:55:10","pin":"0","status":"1"},{"title":"Pakistan ???????PM Imran Khan discusses Russia-Ukraine war with European Council President","content":"<p>Pakistan Prime Minister Imran Khan discussed the Russia-Ukraine war with European Council President Charles Michel on Monday, expressing outrage at the continued military conflict.<\/p>\n","date":"2022-03-08 00:15:11","pin":"0","status":"1"},{"title":"Russia sets cease-fire for evacuations but battles continue","content":"<p>Russia announced yet another limited cease-fire and the establishment of safe corridors to allow civilians to flee some besieged Ukrainian cities Monday. But the evacuation routes led mostly to Russia and its ally Belarus, drawing withering criticism from Ukraine and others.<\/p>\n","date":"2022-03-08 01:11:55","pin":"0","status":"1"}]}