{"details":[{"title":"No longer pressing for NATO membership for Ukraine: President Zelensky","content":"<p>Ukraine President Volodymyr Zelensky said he is no longer pressing for NATO membership for Ukraine, a delicate issue that was one of Russia&#39;s stated reasons for invading its pro-Western neighbor.<\/p>\n","date":"2022-03-09 09:02:23","pin":"1","status":"1"},{"title":"Foreign volunteers can get Ukrainian citizenship","content":"<p><span class=\"css-901oao css-16my406 r-poiln3 r-bcqeeo r-qvutc0\">Foreign volunteers will be able to obtain Ukrainian citizenship if they want to, First Deputy Interior Minister Yevhen Yenin said on March 9, The Kyiv Independent reported.<\/span><\/p>\n\n<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\">Foreign volunteers will be able to obtain Ukrainian citizenship if they want to, First Deputy Interior Minister Yevhen Yenin said on March 9.<br \/>\n<br \/>\nTwenty thousand foreign volunteers have joined Ukrainian forces to fight Russia since March 6.<\/p>\n&mdash; The Kyiv Independent (@KyivIndependent) <a href=\"https:\/\/twitter.com\/KyivIndependent\/status\/1501392340405178369?ref_src=twsrc%5Etfw\">March 9, 2022<\/a><\/blockquote>\n<script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2022-03-09 09:25:47","pin":"0","status":"1"},{"title":"US companies including McDonald's, Coca Cola halt operations in Russia","content":"<p>McDonald&#39;s, Coca-Cola and Starbucks on Tuesday bowed to public pressure and suspended their operations in Russia, joining the international corporate chorus of outrage over Moscow&#39;s invasion of Ukraine, AFP reported.<\/p>\n\n<p>Several of these companies, symbols of American cultural influence in the world, have been the subject of boycott calls on social media as investors have also begun to ask questions about their presence.<\/p>\n\n<p><a href=\"https:\/\/www.newindianexpress.com\/world\/2022\/mar\/09\/mcdonalds-coca-cola-join-us-firms-halting-russia-operations-2428073.html\" target=\"_blank\"><strong>Read more<\/strong><\/a><\/p>\n","date":"2022-03-09 09:28:42","pin":"0","status":"1"},{"title":"Ukraine aid grows to near $14 billion in $1.5 trillion US government spending bill","content":"<p>A U.S. aid package for Ukraine and its Eastern European allies grew to around $14 billion on Tuesday as lawmakers put finishing touches on a $1.5 trillion government-wide spending bill that leaders hope Congress will enact by week&#39;s end, AP reported.<\/p>\n\n<p>The bipartisan rallying behind the Ukraine aid package was just one manifestation of Congress&#39; eagerness to help that country, but not all of it has been harmonious.<\/p>\n\n<p><a href=\"https:\/\/www.newindianexpress.com\/world\/2022\/mar\/09\/ukraine-aid-grows-to-near-14-billion-in-15-trillion-in-us-government-spending-bill-2428080.html\" target=\"_blank\"><strong>Read more<\/strong><\/a><\/p>\n","date":"2022-03-09 10:07:00","pin":"0","status":"1"},{"title":"IAEA says it lost contact with Chernobyl nuclear data systems","content":"<p>The International Atomic Energy Agency has on March 8 said that it has lost contact with the systems at Chernobyl that monitor nuclear material at the radioactive waste facilities at Chernobyl.<\/p>\n\n<p>The sites taken over by the Russian forces on February 24 have stopped transmitting data, the nuclear energy monitoring agency said.<\/p>\n\n<p><a href=\"https:\/\/www.newindianexpress.com\/world\/2022\/mar\/09\/iaea-says-it-lost-contact-with-chernobyl-nuclear-data-systems-2428075.html\" target=\"_blank\"><strong>Read more<\/strong><\/a><\/p>\n","date":"2022-03-09 10:15:00","pin":"0","status":"1"},{"title":"One civilian killed in overnight shelling in Okhtyr","content":"<p>Sumy mayor Dmytro Zhyvytskyi in a Facebook post said that one person was killed and fourteen were injured following shelling in Okhtyr overnight.<\/p>\n\n<div style=\"text-align:center\">\n<figure class=\"image\" style=\"display:inline-block\"><img alt=\"\" height=\"200\" src=\"https:\/\/images.newindianexpress.com\/uploads\/user\/ckeditor_images\/article\/2022\/3\/9\/Sumy_FB.jpg\" width=\"400\" \/>\n<figcaption>An image of the damaged caused by Russian shelling in Okhtyr posted by the mayor of Sumy city on Facebook.<\/figcaption>\n<\/figure>\n<\/div>\n\n<p><iframe allow=\"autoplay; clipboard-write; encrypted-media; picture-in-picture; web-share\" allowfullscreen=\"true\" frameborder=\"0\" height=\"714\" scrolling=\"no\" src=\"https:\/\/www.facebook.com\/plugins\/post.php?href=https%3A%2F%2Fwww.facebook.com%2FZhyvytskyy%2Fposts%2F377073484420957&amp;show_text=true&amp;width=500\" style=\"border:none;overflow:hidden\" width=\"500\"><\/iframe><\/p>\n","date":"2022-03-09 10:59:10","pin":"0","status":"1"},{"title":"Kyiv in control despite Russian attacks overnight: Ukrainian armed forces","content":"<p>The General Staff of the Armed Forces of Ukraine, in a recent update, said that it continues to hold Kyiv despite overnight attacks by the Russian armed forces.<\/p>\n\n<p>The <a href=\"https:\/\/www.facebook.com\/100069073844828\/posts\/271970551782071\/?d=n\" target=\"_blank\">update<\/a> also said that the fighting is continuing in North and NorthWest directions with &#39;combat operations in Polisky and Volyn operational districts that are on the Ukraine border. The fighting is also going on in the settlements of Nizhyn, Ivanytsia, Trostyanets and in the city of Chernihiv.<\/p>\n","date":"2022-03-09 11:10:00","pin":"0","status":"1"},{"title":"","content":"<p>Regional governor Dmytro Zhyvytskyy said a humanitarian corridor out of the besieged Ukrainian city of Sumy will continue to function on Wednesday, according to a Reuters report.<\/p>\n\n<p>About 5,000 people reportedly left Sumy on Tuesday, March 8, after Russia and Ukraine agreed on the corridor.<\/p>\n\n<p>Sumy is a northeastern Ukrainian city close to the Russian border.<\/p>\n\n<div style=\"text-align:center\">\n<figure class=\"image\" style=\"display:inline-block\"><img alt=\"\" height=\"200\" src=\"https:\/\/images.newindianexpress.com\/uploads\/user\/ckeditor_images\/article\/2022\/3\/9\/Ukraine_AP(16).jpg\" width=\"400\" \/>\n<figcaption>An elderly lady is carried in a shopping cart after being evacuated from Irpin, on the outskirts of Kyiv, Ukraine, Tuesday, March 8, 2022. (Photo | AP)<\/figcaption>\n<\/figure>\n<\/div>\n","date":"2022-03-09 11:22:04","pin":"0","status":"1"},{"title":"","content":"<p>The New York Times has decided to move its reporters in Russia out of the country. This will be the first time in a hundred years when the organisation won&#39;t have its reporters on the ground in Russia.<\/p>\n\n<p>The American news outlet in a statement said that Russia has effectively criminalised independent news reporting about the war by pushing a new law that makes it a crime to describe the Russian invasion of Ukraine as a &quot;war.&quot; It seeks to punish violators with up to 15 years in prison.<\/p>\n\n<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\">Very sad day for the history of <a href=\"https:\/\/twitter.com\/nytimes?ref_src=twsrc%5Etfw\">@nytimes<\/a> in Moscow. Pulling all its correspondents out of the country. We have had reporters there continuously since 1921, with one or two short interruptions due to visa hiccoughs. Not Stalin, not the Cold War, nothing drove us out. <a href=\"https:\/\/t.co\/LcSwFqeAeU\">pic.twitter.com\/LcSwFqeAeU<\/a><\/p>\n&mdash; Neil MacFarquhar (@NeilMacFarquhar) <a href=\"https:\/\/twitter.com\/NeilMacFarquhar\/status\/1501234123297505281?ref_src=twsrc%5Etfw\">March 8, 2022<\/a><\/blockquote>\n<script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2022-03-09 11:52:46","pin":"0","status":"1"},{"title":"Russian forces are failing to make any breakthroughs in the NorthWest of Kyiv: UK Defence Intelligence","content":"<p>UK&#39;s defence ministry in a report said that the Russian forces, despite fighting continuously in the NorthWest of the capital, Kyiv, have been failing to make any significant breakthroughs.<\/p>\n\n<p>The report also said that the Ukrainian air defences &quot;appear to have enjoyed considerable success against Russia&#39;s modern combat aircraft, probably preventing them achieving any degree of control of the air.&quot;<\/p>\n\n<p>It also said that the Ukrainian cities of Kharkiv, Chernihiv, Sumy and Mariupol continue to be encircled and shelled by the Russian forces.<\/p>\n\n<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\">Latest Defence Intelligence update on the situation in Ukraine - 09 March 2022<br \/>\n<br \/>\nFind out more about the UK government&#39;s response: <a href=\"https:\/\/t.co\/DjAjI4vbCk\">https:\/\/t.co\/DjAjI4vbCk<\/a><br \/>\n<br \/>\n<a href=\"https:\/\/twitter.com\/hashtag\/StandWithUkraine?src=hash&amp;ref_src=twsrc%5Etfw\">#StandWithUkraine<\/a> <a href=\"https:\/\/t.co\/eAqudcHW05\">pic.twitter.com\/eAqudcHW05<\/a><\/p>\n&mdash; Ministry of Defence (@DefenceHQ) <a href=\"https:\/\/twitter.com\/DefenceHQ\/status\/1501438467103989762?ref_src=twsrc%5Etfw\">March 9, 2022<\/a><\/blockquote>\n<script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2022-03-09 12:38:30","pin":"0","status":"1"},{"title":"","content":"<p><strong>Russia says its forces will stop firing from 10 am Moscow time to provide humanitarian corridors<\/strong> out of Kyiv and four other Ukrainian cities.<\/p>\n\n<p>This will let Ukrainians looking to escape shelling in Kyiv, Chernihiv, Sumy, Kharkiv and Mariupol to evacuate.<\/p>\n\n<p>However, Guardian reported that officials in Kyiv accused the Russians of shelling a refugee corridor intended for residents trying to escape Mariupol.<\/p>\n","date":"2022-03-09 13:06:17","pin":"0","status":"1"},{"title":"Russia, Ukraine agree day-long evacuation corridors: Ukraine official","content":"<p>Russia and Ukraine on Wednesday agreed a day-long ceasefire around a series of evacuation corridors to allow civilians to escape the fighting, Deputy Prime Minister Iryna Vereshchuk said.&nbsp;<\/p>\n\n<p>Vereshchuk said Moscow vowed to respect the truce from 9 am to 9 pm around six areas that have been heavily hit by fighting, including regions around Kyiv, in Zaporizhzhia in the south, and some parts of Ukraine&#39;s northeast.<\/p>\n\n<p>Civilians in areas around the capital, including Irpin and Bucha to the northwest, will be evacuated into Kyiv to escape fierce bombardment by Russian forces.&nbsp;<\/p>\n","date":"2022-03-09 14:15:19","pin":"0","status":"1"},{"title":"Russia, Ukraine agree day-long evacuation corridors: Ukraine official","content":"<p>Russia, Ukraine agree day-long evacuation corridors: Ukraine official<\/p>\n","date":"2022-03-09 14:56:55","pin":"0","status":"0"},{"title":"Air raid sirens in Ukraine capital; Russians pressure cities","content":"<p>Air raid sirens blared over Ukraine&#39;s capital on Wednesday as officials said they were bolstering defenses in key cities threatened by Russian forces.<\/p>\n\n<p>Thousands of people are thought to have been killed, both civilians and soldiers, in almost two weeks of fighting since President Vladimir Putin&#39;s forces invaded. <a href=\"https:\/\/www.newindianexpress.com\/world\/2022\/mar\/09\/ukraine-war-air-raid-sirens-in-capital-russians-pressure-cities-2428132.html\"><strong>(Read more)<\/strong><\/a><\/p>\n","date":"2022-03-09 15:35:50","pin":"0","status":"1"},{"title":"700 Indians evacuated from Sumy may board flight home on Thursday","content":"<p>The last big group of about 700 Indian students evacuated from the northeastern Ukrainian city of Sumy has boarded a special train from Poltava and are likely to board a flight to India from Poland on Thursday.<\/p>\n\n<p>The train will take the students to Lviv in western Ukraine, from where they will be taken to Poland in buses, Anshad Ali, a student coordinator, informed.<\/p>\n","date":"2022-03-09 15:43:17","pin":"0","status":"1"},{"title":"IAEA loses contact with monitoring systems installed at Chernobyl nuclear power plant","content":"<p>The Chernobyl nuclear power plant, which was taken over by Russian forces last month, has stopped transmitting data to the IAEA, the UN atomic watchdog has said, expressing deep concern for the staff working under Russian troops at the nuclear site in northern Ukraine.<\/p>\n\n<p>The Chernobyl site is not currently operational and handling of nuclear material has been halted.&nbsp;<\/p>\n\n<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\">During the spl op in Ukraine, control has been established over the Chernobyl &amp; Zaporozhye nuclear power plants. This was done exclusively to prevent any attempts to stage nuclear provocations, which is a risk that obviously exists: Russian Foreign Ministry Spox Maria Zakharova <a href=\"https:\/\/t.co\/NnBYlTTTxX\">pic.twitter.com\/NnBYlTTTxX<\/a><\/p>\n&mdash; ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1501509955027087365?ref_src=twsrc%5Etfw\">March 9, 2022<\/a><\/blockquote>\n<script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>\n\n<p>The facility holds decommissioned reactors as well as radioactive waste facilities, the International Atomic Energy Agency ( IAEA) said, citing information from Ukraine&#39;s nuclear regulator.<\/p>\n","date":"2022-03-09 16:22:34","pin":"0","status":"1"},{"title":"Shelling and evacuation efforts ongoing","content":"<p>Efforts are ongoing to coordinate safe routes of escape for Ukrainian civilians out of besieged cities as the Russian invasion rounds out its second week.<\/p>\n\n<p>In the time since Russian forces swept into the country, some 2 million people have fled Ukraine, nearly half of them children with most people fleeing to neighboring Poland.<\/p>\n\n<p><img alt=\"\" src=\"https:\/\/images.newindianexpress.com\/uploads\/user\/imagelibrary\/2022\/3\/9\/original\/Ukraine_AP18.jpg\" \/><\/p>\n\n<p>Russian troops have captured swaths of territory in the south, but have faced fierce Ukrainian resistance in other regions.<\/p>\n\n<p>Ukrainian officials say pregnant women, women with children and others will be able to leave the city of Sumy on Wednesday through a humanitarian corridor Russia and Ukraine agreed to.<\/p>\n\n<p>Some 5,000 civilians, including many foreign students, were able to flee the city on Tuesday in buses marked with a red cross logo.<\/p>\n","date":"2022-03-09 16:24:11","pin":"0","status":"1"},{"title":"Last batch of students has left the epicenter of war: Goyal","content":"<p>We&#39;re proud to say that the last batch of students has left the epicenter of war (eastern Ukraine) and is moving towards western Ukraine, they&#39;ll soon enter the neighbouring countries and will be evacuated from there, said Union Minister Piyush Goyal on Operation Ganga.&nbsp;<\/p>\n\n<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\">Unfortunately, Congress &amp; other political parties were spreading misinformation and misleading people instead of helping families of those stranded in Ukraine while PM Modi was constantly worried about Indians stuck in Ukraine: Union min Piyush Goyal on <a href=\"https:\/\/twitter.com\/hashtag\/OperationGanga?src=hash&amp;ref_src=twsrc%5Etfw\">#OperationGanga<\/a> <a href=\"https:\/\/t.co\/3LYupibPZW\">pic.twitter.com\/3LYupibPZW<\/a><\/p>\n&mdash; ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1501510144416305152?ref_src=twsrc%5Etfw\">March 9, 2022<\/a><\/blockquote>\n<script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2022-03-09 16:30:35","pin":"0","status":"1"},{"title":"Canada to send Ukraine another shipment of highly-specialised military equipment","content":"<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\">Just spoke with Pres Zelenskyy. I let him know that Canada will send Ukraine another shipment of highly-specialized military equipment. Discussed sanctions against Russia &amp; humanitarian assistance for Ukraine. Invited him to address Canada&rsquo;s Parliament: Canadian PM Justin Trudeau <a href=\"https:\/\/t.co\/eiEHrZzO32\">pic.twitter.com\/eiEHrZzO32<\/a><\/p>\n&mdash; ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1501502458572730375?ref_src=twsrc%5Etfw\">March 9, 2022<\/a><\/blockquote>\n<script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2022-03-09 16:31:31","pin":"0","status":"1"},{"title":"Russia says 'some progress' in talks with Ukraine","content":"<p>Russia says &#39;some progress&#39; being made in talks with Ukraine, says not trying to &#39;overthrow&#39; Ukraine government.<\/p>\n","date":"2022-03-09 16:32:27","pin":"0","status":"1"},{"title":"Indian students from Sumy on board special train","content":"<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\">Indian students from Sumy on board the special train organised with assistance of Ukrainian authorities. Mission will continue to facilitate their movement westwards. Bringing back our students safely &amp; securely will remain our priority: Embassy of India in Kyiv, <a href=\"https:\/\/twitter.com\/hashtag\/Ukraine?src=hash&amp;ref_src=twsrc%5Etfw\">#Ukraine<\/a> <a href=\"https:\/\/t.co\/3rPlaSKpBE\">pic.twitter.com\/3rPlaSKpBE<\/a><\/p>\n&mdash; ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1501500055987302405?ref_src=twsrc%5Etfw\">March 9, 2022<\/a><\/blockquote>\n<script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2022-03-09 16:33:08","pin":"0","status":"1"},{"title":"Kremlin says US waging 'economic war' on Russia","content":"<p>The Kremlin said Wednesday that the US had launched an economic war against Moscow, describing an onslaught of sanctions against the country over its military incursion into its pro-Western neighbour Ukraine.<\/p>\n\n<p>&quot;The United States has declared economic war on Russia and it is de facto waging this war,&quot; Kremlin spokesman Dmitry Peskov told reporters, with the Russian government scrambling to impose measures to limit the economic fallout of the sanctions.<\/p>\n","date":"2022-03-09 17:05:20","pin":"0","status":"1"},{"title":"Polish jet offer to Ukraine creates 'potentially dangerous scenario': Kremlin","content":"<p>The Kremlin on Wednesday said that a Polish offer to deliver Mig-29 fighter jets to Ukraine via a US airbase could lead to a &quot;dangerous scenario&quot;, as Russian troops continued their advance into Ukraine.&nbsp;<\/p>\n\n<p>&quot;This is a highly undesirable and a potentially dangerous scenario,&quot; Kremlin spokesman Dmitry Peskov said.&nbsp;<\/p>\n","date":"2022-03-09 17:05:42","pin":"0","status":"1"},{"title":"Ukraine leader urges West to resolve Polish jet offer","content":"<p>Ukrainian President Volodymyr Zelensky called on Wednesday for Western powers to urgently decide on a Polish offer that would see his country supplied with fighter jets.&nbsp;<\/p>\n\n<p>&quot;When will there be a decision? Look, we&#39;re at war!&quot; Zelensky said in a video on his Telegram channel. &quot;We ask you again to decide as soon as possible. Send us planes.&quot;<\/p>\n","date":"2022-03-09 17:06:09","pin":"0","status":"1"},{"title":"Power cut at Ukraine's Chernobyl nuclear plant: operator","content":"<p>Power has been entirely cut to the Chernobyl power plant, site of the world&#39;s worst nuclear disaster in 1986, and its security systems, Ukraine&#39;s energy operator Ukrenergo said Wednesday.&nbsp;<\/p>\n\n<p>The nuclear power plant &quot;was fully disconnected from the power grid,&quot; it said in a statement on its Facebook page, adding that military operations meant &quot;there is no possibility to restore the lines&quot;.<\/p>\n","date":"2022-03-09 17:06:52","pin":"0","status":"1"},{"title":"Indian students who left from Sumy yesterday, reached Lviv Railway Station today","content":"<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\"><a href=\"https:\/\/twitter.com\/hashtag\/WATCH?src=hash&amp;ref_src=twsrc%5Etfw\">#WATCH<\/a> | Indian students who left from Sumy, Ukraine yesterday, reached Lviv Railway Station today. They are taking a special train straight to Poland.<br \/>\n<br \/>\nOfficials of the Indian Embassy &amp; Red Cross escorted them.<a href=\"https:\/\/twitter.com\/hashtag\/RussiaUkraineConflict?src=hash&amp;ref_src=twsrc%5Etfw\">#RussiaUkraineConflict<\/a> <a href=\"https:\/\/t.co\/gC0cv1ugXw\">pic.twitter.com\/gC0cv1ugXw<\/a><\/p>\n&mdash; ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1501527675688845314?ref_src=twsrc%5Etfw\">March 9, 2022<\/a><\/blockquote>\n<script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2022-03-09 17:29:48","pin":"0","status":"1"},{"title":"Chornobyl NPP lost all electric supply","content":"<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\">The only electrical grid supplying Chornobyl NPP &amp; all its nuclear facilities occupied by Russian army is damaged. CNPP lost all electric supply. I call on int&#39;l community to urgently demand Russia to cease fire &amp; allow repair units to restore power supply: Ukraine&#39;s Foreign Min <a href=\"https:\/\/t.co\/DtfiuIemcz\">pic.twitter.com\/DtfiuIemcz<\/a><\/p>\n&mdash; ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1501531899281690625?ref_src=twsrc%5Etfw\">March 9, 2022<\/a><\/blockquote>\n<script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2022-03-09 17:56:51","pin":"0","status":"1"},{"title":"'No critical impact on safety' from Chernobyl power loss: IAEA","content":"<p>The UN atomic watchdog said Wednesday it saw &quot;no critical impact on safety&quot; from the loss of power at Ukraine&#39;s Chernobyl nuclear power plant, site of the 1986 disaster.<\/p>\n\n<p>&quot;Ukraine has informed IAEA of power loss,&quot; the International Atomic Energy Agency (IAEA) said in a tweet, adding that &quot;in this case IAEA sees no critical impact on safety&quot;.<\/p>\n","date":"2022-03-09 18:53:44","pin":"0","status":"1"},{"title":"12-hour ceasefire","content":"<p>Moscow and Kyiv agree a 12-hour ceasefire to allow civilians to flee six badly battered areas including the capital Kyiv and the besieged southern port of Mariupol, which has been without water and power for nine days.&nbsp;<\/p>\n","date":"2022-03-09 18:54:11","pin":"0","status":"1"},{"title":"10 dead in Russian attack","content":"<p>At least 10 people are killed as Russian military &quot;opened fire&quot; on homes and other buildings in the eastern Ukrainian town of Severodonetsk, a local official says.<\/p>\n","date":"2022-03-09 18:54:24","pin":"0","status":"1"},{"title":"600 students evacuated from Ukraine's Sumy leave for Poland; may board flight home on Thursday","content":"<p>The last big group of 600 Indian students evacuated from the northeastern Ukrainian city of Sumy has boarded a special train from Lviv for Poland.<\/p>\n","date":"2022-03-09 19:48:45","pin":"0","status":"1"},{"title":"After evacuation from Sumy, Indian students being taken to Poland by train","content":"<p>The Indian students, who were pulled out of the besieged Ukrainian city of Sumy, are being taken to Poland on a train from where they will be brought back to India on a flight.<\/p>\n","date":"2022-03-09 20:15:56","pin":"0","status":"1"},{"title":"Tele-counselling launched for students returning from Ukraine","content":"<p>Tamil Nadu Medical and Family Welfare Minister Ma Subramanian on Wednesday launched tele-counselling on 104 helpline to help the students returning from the war-affected Ukraine to cope up with the stress and move forward.<\/p>\n","date":"2022-03-09 20:37:33","pin":"0","status":"1"},{"title":"Russia-Ukraine war: Desperate Ukrainians seek escape routes","content":"<p>Russia-Ukraine war: Desperate Ukrainians seek escape routes Ukraine banned wheat exports as civilians sought escape routes and concerns intensified over safety at the embattled country&#39;s nuclear plants, including the decommissioned Chernobyl site.<\/p>\n","date":"2022-03-09 20:56:59","pin":"0","status":"1"},{"title":"Canada to send drone cameras to Ukraine","content":"<p>PM Justin Trudeau says he has told Ukrainian President Volodymyr Zelenskyy that Canada will soon send Ukraine highly specialized equipment. Trudeau said during a visit to Berlin that Zelenskyy also accepted an invitation to address the Canadian Parliament during Wednesday&#39;s conversation.<\/p>\n","date":"2022-03-09 21:10:12","pin":"0","status":"1"},{"title":"Besieged Ukraine city of Mariupol buries dead in mass grave","content":"<p>Under steady Russian bombardment, workers in Ukraine&#39;s besieged southern port city of Mariupol are hastily and unceremoniously burying scores of dead Ukrainian civilians and soldiers in a mass grave.<\/p>\n","date":"2022-03-09 21:24:14","pin":"0","status":"1"},{"title":"Dozens buried in mass grave in Mariupol","content":"<p>Mariupol authorities in the besieged southern Ukrainian port city of Mariupol are burying their dead in a mass grave. With the city under steady bombardment, officials had been waiting for a chance to allow individual burials to resume.<\/p>\n","date":"2022-03-09 21:35:18","pin":"0","status":"1"},{"title":"Russian strike hit a children's hospital in Mariupol: Ukraine","content":"<p>Ukrainian officials say a Russian strike hit a children&#39;s hospital and maternity facility in the port city of Mariupol.<\/p>\n","date":"2022-03-09 21:55:46","pin":"0","status":"1"},{"title":"WHO cites attacks on health workers in Ukraine","content":"<p>The World Health Organisation says it has documented 18 attacks on health facilities, workers and ambulances since the Russian invasion of Ukraine began.<\/p>\n","date":"2022-03-09 22:38:42","pin":"0","status":"1"},{"title":"Envoy urges UK to lift visa rules for Ukrainians fleeing war","content":"<p>Ukraine&#39;s ambassador to Britain urged the government on Wednesday to suspend visa requirements for Ukrainians fleeing the war, after the UK acknowledged that fewer than 1,000 visas have been handed out so far.<\/p>\n","date":"2022-03-09 23:26:47","pin":"0","status":"1"},{"title":"PM Modi's talks with Putin, Zelenskyy; intense diplomatic outreach made evacuation of students from Sumy possible: Sources","content":"<p>PM Narendra Modi&#39;s phone talks with Russian and Ukrainian presidents, a series of separate intense diplomatic outreach in Delhi, Kyiv and Moscow and round-the-clock groundwork by three teams of Indian officials in Ukraine made the evacuation of students from the city of Sumy possible, people familiar with the operation said on Wednesday.<\/p>\n","date":"2022-03-10 00:10:31","pin":"0","status":"1"},{"title":"Last evacuation flight under Op Ganga likely to be on Thursday","content":"<p>India is set to wind up on Thursday its evacuation mission &#39;Operation Ganga&#39; that was launched 12 days ago to bring back Indian nationals following the Russian invasion of Ukraine.<\/p>\n","date":"2022-03-10 00:32:11","pin":"0","status":"1"}]}