{"details":[{"title":"Three more Sena MLAs join Shinde camp in Guwahati","content":"<p>On Wednesday evening, four MLAs, including Maharashtra minister Gulabrao Patil, had flown to Guwahati. Shinde will consult the MLAs with him and then decide when to return to Mumbai, his associate said. <strong><a href=\"https:\/\/www.newindianexpress.com\/nation\/2022\/jun\/23\/maharashtra-political-crisis-three-more-sena-mlas-join-shinde-camp-in-guwahati-2468806.html\" target=\"_blank\">(READ FULL STORY HERE)<\/a><\/strong><\/p>\n","date":"2022-06-23 11:37:30","pin":"0","status":"1"},{"title":"MP Krupal Tumane says he's with Shiv Sena, denies reports of joining rebel camp","content":"<p>Tumane, the Lok Sabha member from Ramtek in Nagpur, said &#39;patience is the need of the hour&#39;. He also said, &quot;Nobody has contacted me, nor I have supported anyone. I am with the Shiv Sena only. Some information is being spread about me, which is absolutely incorrect. Keeping patience is the need of the hour.&quot;<\/p>\n","date":"2022-06-23 11:39:57","pin":"0","status":"1"},{"title":"Shiv Sena MLA who alleged abduction attempts to hold presser today","content":"<p>&quot;CM won&#39;t hold any meeting today, some MLAs are going to Varsha Bungalow for official work. Nitin Deshmukh (who returned to Nagpur from Surat yesterday and alleged abduction attempts) will hold a press conference,&quot; said Shiv Sena leader Sanjay Raut.<\/p>\n","date":"2022-06-23 11:42:57","pin":"0","status":"1"},{"title":"Shiv Sena engaging with rebel MLAs directly, but no hopes of rapprochement: Sources","content":"<p>A senior Sena leader said the only hope is that the party thinks that many MLAs don&#39;t want to go into an election, so if they are disqualified for violating the party line they have to seek re-election. If half the MLAs return, then the government could survive. <strong><a href=\"https:\/\/www.newindianexpress.com\/nation\/2022\/jun\/23\/shiv-sena-engaging-with-rebel-mlas-directly-but-no-hopes-of-rapprochement-sources-2468826.html\" target=\"_blank\">(READ FULL STORY HERE)<\/a><\/strong><\/p>\n","date":"2022-06-23 11:44:07","pin":"0","status":"1"},{"title":"WATCH | NCP huddles at Sharad Pawar's residence","content":"<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\"><a href=\"https:\/\/twitter.com\/hashtag\/WATCH?src=hash&amp;ref_src=twsrc%5Etfw\">#WATCH<\/a> | Mumbai: Leaders of the Nationalist Congress Party (NCP) arrive at the residence of party chief Sharad Pawar for a meeting.<a href=\"https:\/\/twitter.com\/hashtag\/MaharashtraPoliticalCrisis?src=hash&amp;ref_src=twsrc%5Etfw\">#MaharashtraPoliticalCrisis<\/a> <a href=\"https:\/\/t.co\/ttvu2LMIDI\">pic.twitter.com\/ttvu2LMIDI<\/a><\/p>\n&mdash; ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1539851921317474304?ref_src=twsrc%5Etfw\">June 23, 2022<\/a><\/blockquote>\n<script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2022-06-23 11:45:08","pin":"0","status":"1"},{"title":"Trinamool protests out side the Guwahati hotel where the rebel MLAs are staying","content":"<blockquote class=\"twitter-tweet\" data-conversation=\"none\">\n<p dir=\"ltr\" lang=\"en\">Assam | TMC leaders &amp; workers protesting outside Radisson Blu Hotel in Guwahati are being detained by Police<br \/>\n<br \/>\nA worker says, &quot;Around 20 Lakh people in Assam are suffering due to the flood. But CM is busy toppling Maharashtra Govt&quot;<br \/>\n<br \/>\nRebel Maharashtra MLAs are staying at the hotel. <a href=\"https:\/\/t.co\/Si7xf4BdJR\">pic.twitter.com\/Si7xf4BdJR<\/a><\/p>\n&mdash; ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1539849335331966978?ref_src=twsrc%5Etfw\">June 23, 2022<\/a><\/blockquote>\n<script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2022-06-23 11:46:13","pin":"0","status":"1"},{"title":"Amid Eknath Shinde's rebellion, Uddhav to hold meeting with Maharashtra government officials","content":"<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\">Maharashtra chief minister Uddhav Thackeray has scheduled a meeting with various department secretaries at 12.30 pm. Chief minister Uddhav Thackeray will chair the virtual meeting. <a href=\"https:\/\/twitter.com\/NewIndianXpress?ref_src=twsrc%5Etfw\">@NewIndianXpress<\/a> <a href=\"https:\/\/twitter.com\/TheMornStandard?ref_src=twsrc%5Etfw\">@TheMornStandard<\/a><\/p>\n&mdash; Sudhir Suryawanshi (@ss_suryawanshi) <a href=\"https:\/\/twitter.com\/ss_suryawanshi\/status\/1539848686678802433?ref_src=twsrc%5Etfw\">June 23, 2022<\/a><\/blockquote>\n<script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2022-06-23 11:48:40","pin":"0","status":"1"},{"title":"WATCH | Assam Minister arrives in Guwahati hotel to meet dissident Sena MLAs","content":"<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\"><a href=\"https:\/\/twitter.com\/hashtag\/WATCH?src=hash&amp;ref_src=twsrc%5Etfw\">#WATCH<\/a> | Assam Minister Ashok Singhal arrives at Radisson Blu Hotel in Guwahati where rebel Maharashtra MLAs, including Eknath Shinde, are staying. <a href=\"https:\/\/t.co\/QGMNfeenRi\">pic.twitter.com\/QGMNfeenRi<\/a><\/p>\n&mdash; ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1539845633414025216?ref_src=twsrc%5Etfw\">June 23, 2022<\/a><\/blockquote>\n<script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2022-06-23 11:49:42","pin":"0","status":"1"},{"title":"WATCH | Former Maharashtra minister meets rebel Shiv Sena MLAs","content":"<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"in\"><a href=\"https:\/\/twitter.com\/hashtag\/WATCH?src=hash&amp;ref_src=twsrc%5Etfw\">#WATCH<\/a> | Assam: Rebel Maharashtra MLAs camping at Radisson Blu Hotel in Guwahati meet former MoS Home and Shiv Sena leader Deepak Kesarkar. <a href=\"https:\/\/t.co\/SoEQNt9sPZ\">pic.twitter.com\/SoEQNt9sPZ<\/a><\/p>\n&mdash; ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1539843389805408256?ref_src=twsrc%5Etfw\">June 23, 2022<\/a><\/blockquote>\n<script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2022-06-23 11:52:30","pin":"0","status":"1"},{"title":"Guwahati hotel turns into fortress for dissident Shiv Sena MLAs","content":"<ul>\n\t<li>The entry of common people into Radisson Blu hotel has almost been barred for now, with the Guwahati police taking over the security from its private guards.<\/li>\n\t<li>Apart from personnel from nearby Jalukbari police station, dozens of jawans from reserve battalions and commando units of the Assam Police are keeping a tight vigil on the hotel, which is around 15 km from Lokpriya Gopinath Bordoloi International (LGBI) Airport.<\/li>\n\t<li>A source in the BJP, of which Shiv Sena is a former ally, said that the decision to shift the legislators to Guwahati was taken on security grounds.<\/li>\n\t<li>Outside the plush hotel, at Gotanagar on the outskirts of the city, traffic policemen were seen busy ensuring a hassle-free vehicular movement on the road adjoining the five-star property.<\/li>\n\t<li>Security personnel, under the presence of senior officials, were checking on every guest before allowing them entry into Radisson Blu, and the ones without a reservation were asked to return.<\/li>\n\t<li>Media persons in hordes waited outside the hotel, even as the police stayed tight-lipped over the queries made by them, while also thwarting them from taking a peek into the development inside.<\/li>\n\t<li>Hotel officials, too, declined any comment when contacted.<\/li>\n\t<li>This is perhaps the first time MLAs from a western state were flown to a northeastern state, following their rebellion against the party leadership.<\/li>\n<\/ul>\n","date":"2022-06-23 12:08:17","pin":"0","status":"1"},{"title":"WATCH | Shiv Sena leaders arrive at Uddhav's home","content":"<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\"><a href=\"https:\/\/twitter.com\/hashtag\/WATCH?src=hash&amp;ref_src=twsrc%5Etfw\">#WATCH<\/a> | Shiv Sena leaders arrive at the family residence of CM Uddhav Thackeray &#39;Matoshree&#39; in Mumbai, amid <a href=\"https:\/\/twitter.com\/hashtag\/MaharashtraPoliticalCrisis?src=hash&amp;ref_src=twsrc%5Etfw\">#MaharashtraPoliticalCrisis<\/a> <a href=\"https:\/\/t.co\/CMollN6Q2n\">pic.twitter.com\/CMollN6Q2n<\/a><\/p>\n&mdash; ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1539859437401169921?ref_src=twsrc%5Etfw\">June 23, 2022<\/a><\/blockquote>\n<script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2022-06-23 12:09:53","pin":"0","status":"1"},{"title":"Did a film screening foretell the Eknath Shinde-Uddhav Thackeray split?","content":"<p>Both Uddhav and Shinde had come for the screening of the movie based on the life of the late Shiv Sena leader Anand Dighe. Actor Kshitish Date portrayed Shinde in the film. Interestingly, Uddhav decided to leave midway, a departure the CM explained later as unavoidable since he could not bring himself to see the death of Anand Dighe -- even on screen. <strong><a href=\"https:\/\/www.newindianexpress.com\/nation\/2022\/jun\/22\/did-a-film-screening-foretell-the-eknath-shinde-uddhav-thackeray-split-2468490.html\" target=\"_blank\">(READ FULL STORY HERE)<\/a><\/strong><\/p>\n","date":"2022-06-23 12:14:01","pin":"0","status":"1"},{"title":"In 56 years, Shiv Sena faces fourth rebellion, first under Uddhav's watch","content":"<p>The present revolt, which started taking shape post-Monday midnight after Legislative Council poll results, throws a big challenge before Maharashtra Chief Minister and Sena president Uddhav Thackeray as the three previous revolts took place when his father Bal Thackeray was still around.<strong><a href=\"https:\/\/www.newindianexpress.com\/nation\/2022\/jun\/22\/in-56-years-shiv-sena-faces-fourthrebellion-firstunder-uddhavs-watch-2468497.html\" target=\"_blank\"> (READ FULL STORY HER<\/a>E)<\/strong><\/p>\n","date":"2022-06-23 12:15:26","pin":"0","status":"1"},{"title":"MVA continues to put forward brave face amid Maharashtra political crisis","content":"<p>&#39;I don&#39;t think the Floor Test stage has been reached. Whatever stage we reach, we will speak about it then&#39;: Maharashtra minister and NCP leader Jayant Patil.<\/p>\n","date":"2022-06-23 12:17:21","pin":"0","status":"1"},{"title":"BJP to jump into action?","content":"<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\"><a href=\"https:\/\/twitter.com\/hashtag\/WATCH?src=hash&amp;ref_src=twsrc%5Etfw\">#WATCH<\/a> | BJP leaders arrive at the residence of party leader Devendra Fadnavis, in Mumbai.<a href=\"https:\/\/twitter.com\/hashtag\/MaharashtraPoliticalCrisis?src=hash&amp;ref_src=twsrc%5Etfw\">#MaharashtraPoliticalCrisis<\/a> <a href=\"https:\/\/t.co\/wlWt3ElDIp\">pic.twitter.com\/wlWt3ElDIp<\/a><\/p>\n&mdash; ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1539864712979939328?ref_src=twsrc%5Etfw\">June 23, 2022<\/a><\/blockquote>\n<script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2022-06-23 12:27:09","pin":"0","status":"1"},{"title":"NCP planning to sit in Opposition?","content":"<p>&quot;If government stays we will be in power, if government goes we will sit in Opposition. I don&#39;t think that to form govt in one state, you can show your strength in another state. He (rebel Shiv Sena MLA Eknath Shinde) has to come here to show his MLAs to Governor. Thereafter Governor will take the necessary decision,&quot; says NCP&#39;s Jayant Patil on political instability in MVA.<\/p>\n","date":"2022-06-23 12:35:36","pin":"0","status":"1"},{"title":"Will Fadnavis return as Maharashtra CM?","content":"<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\"><a href=\"https:\/\/twitter.com\/hashtag\/MaharashtraPoliticalTurmoil?src=hash&amp;ref_src=twsrc%5Etfw\">#MaharashtraPoliticalTurmoil<\/a> | BJP puts up a poster, which reads &quot;Goddess Mauli, may your blessings continue to be upon us and Devendra ji come to offer prayers to you in Pandharpur, after becoming the CM.&quot;<br \/>\n<br \/>\nVisuals from Aurangabad. <a href=\"https:\/\/t.co\/UCLpNRxUGl\">pic.twitter.com\/UCLpNRxUGl<\/a><\/p>\n&mdash; ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1539872322168819713?ref_src=twsrc%5Etfw\">June 23, 2022<\/a><\/blockquote>\n<script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2022-06-23 12:58:50","pin":"0","status":"1"},{"title":"'Despite having a Shiv Sena CM, party MLAs never got oppurtunity to visit Uddhav: Rebel Shiv Sena MLA's letter","content":"<p>Here is what the letter says:<\/p>\n\n<ul>\n\t<li>Despite having a Shiv Sena CM in the state the party MLAs didn&#39;t use to get the opportunity to visit Varsha Bungalow (CM&#39;s residence).<\/li>\n\t<li>People around the CM used to decide if we can meet him or not. We felt we were insulted. CM never used to be in the Secretariat, instead, he used to be in Matoshree (Thackeray residence).<\/li>\n\t<li>We used to call people around the CM but they never used to attend our calls. We were fed up with all these things and persuaded Eknath Shinde to take this step.<\/li>\n\t<li>While we weren&#39;t able to meet the CM, people from our &#39;real opposition&#39;-- the Congress and the NCP used to get opportunities to meet him and even funds were given to them related to work in their constituencies.<\/li>\n\t<li>When Hindutva and Ram Mandir are crucial issues for the party, then why did the party stop us from visiting Ayodhya? MLAs were called and were stopped from going to Ayodhya during Aaditya Thackeray&#39;s visit to Ayodhya.<\/li>\n<\/ul>\n","date":"2022-06-23 13:14:38","pin":"0","status":"1"},{"title":"Update from Uddhav camp","content":"<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\">Narhari Zirwal, the acting speaker of Maharashtra state assembly accepted Shiv Sena MLA Ajay Chaudhari as a new legislator party leader for Shiv Sena while rejected Ekanth Shinde as CLP leader proposal submitted by rebelled Sena MLA&#39;s. <a href=\"https:\/\/twitter.com\/NewIndianXpress?ref_src=twsrc%5Etfw\">@NewIndianXpress<\/a><\/p>\n&mdash; Sudhir Suryawanshi (@ss_suryawanshi) <a href=\"https:\/\/twitter.com\/ss_suryawanshi\/status\/1539875991581069312?ref_src=twsrc%5Etfw\">June 23, 2022<\/a><\/blockquote>\n<script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2022-06-23 13:17:07","pin":"0","status":"1"},{"title":"Screenshot of the letter sent from rebel Shiv Sena MLAs to Uddhav","content":"<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\">Estranged leader Eknath Shinde writes to Maharashtra chief minister Uddhav Thackeray complaining that Varsha bungalow door was never opened for them. The coterie of Thackeray never allowed them to meet him &amp; coterie was dominating the party affair and interfering in govt as well. <a href=\"https:\/\/t.co\/IVoC0BNjsy\">pic.twitter.com\/IVoC0BNjsy<\/a><\/p>\n&mdash; Sudhir Suryawanshi (@ss_suryawanshi) <a href=\"https:\/\/twitter.com\/ss_suryawanshi\/status\/1539871704557707266?ref_src=twsrc%5Etfw\">June 23, 2022<\/a><\/blockquote>\n<script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2022-06-23 13:18:06","pin":"0","status":"1"},{"title":"WATCH | Show of strength from Eknath Shinde camp","content":"<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"in\"><a href=\"https:\/\/twitter.com\/hashtag\/WATCH?src=hash&amp;ref_src=twsrc%5Etfw\">#WATCH<\/a> | Assam | 42 rebel MLAs from Maharashtra - 35 from Shiv Sena and 7 Independent MLAs - seen together at Radisson Blu Hotel in Guwahati.<a href=\"https:\/\/twitter.com\/hashtag\/MaharashtraPoliticalCrisis?src=hash&amp;ref_src=twsrc%5Etfw\">#MaharashtraPoliticalCrisis<\/a> <a href=\"https:\/\/t.co\/6MPgq42a3V\">pic.twitter.com\/6MPgq42a3V<\/a><\/p>\n&mdash; ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1539889101620379648?ref_src=twsrc%5Etfw\">June 23, 2022<\/a><\/blockquote>\n<script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2022-06-23 14:06:44","pin":"0","status":"1"},{"title":"Eknath Shinde's removal as Sena group leader in Maharashtra Assembly valid: Deputy Speaker","content":"<ul>\n\t<li>Maharashtra Legislative Assembly&#39;s Deputy Speaker Narhari Zirwal on Thursday said he has approved the appointment of Ajay Choudhary as the Shiv Sena&#39;s group leader in the House, replacing rebel legislator Eknath Shinde.<\/li>\n\t<li>The Shiv Sena on Tuesday removed Shinde as the party&#39;s group leader in the Assembly, hours after he revolted and travelled to Surat in Gujarat with some Shiv Sena MLAs, triggering a crisis in the tripartite Maha Vikas Aghadi (MVA-comprising the Sena, NCP and Congress) government in Maharashtra.<\/li>\n\t<li>Speaking to reporters here on Thursday, Zirwal said, &quot;I have received a letter from the Shiv Sena, informing me that it is appointing Ajay Choudhary as the party&#39;s leader in the Assembly and removing Shinde from the post with immediate effect. &quot;<\/li>\n\t<li>&quot;I have accepted the letter, which was sent by Chief Minister Uddhav Thackeray,&quot;&nbsp;the deputy speaker said, adding that Shinde&#39;s removal as the Sena group leader in the Assembly was valid.<\/li>\n\t<li>Notably, Shinde had on Wednesday given a letter to the Assembly&#39;s deputy speaker, signed by 35 Sena MLAs, replacing Sunil Prabhu with Bharat Gogavale as the chief whip of the Shiv Sena legislature party.<\/li>\n\t<li>Asked about Shinde&#39;s letter, Zirwal said, &quot;The Independents have no role in such party affairs. One (Shiv Sena) MLA, Nitin Deshmukh (who had accompanied rebel leader to Surat), has claimed that he has not signed the letter issued by Shinde. I will study it, seek the advice of legal experts and then decide (on it).&quot;<\/li>\n<\/ul>\n","date":"2022-06-23 14:23:41","pin":"0","status":"1"},{"title":"'More MLAs will return return Shiv Sena fold soon': Party sources","content":"<p>13 MLAs are still with Maharashtra CM and Shiv Sena. They are in constant touch with Uddhav Thackeray, claim Shiv Sena Sources. Meanwhile, party MP Vinayak Raut said, &quot;at least 18 MLAs in Guwahati have contacted Shiv Sena leaders in Mumbai and several of those will return soon.&quot;<\/p>\n","date":"2022-06-23 14:25:32","pin":"0","status":"1"},{"title":"Uddhav will come back to official residence of Maharashtra CM very soon: Shiv Sena","content":"Uddhav Thackeray will come back to Varsha Bungalow very soon. 21 MLAs in Guwahati have contacted us and when they return to Mumbai, they will be with us: Shiv Sena leader Sanjay Raut.","date":"2022-06-23 14:37:06","pin":"0","status":"1"},{"title":"Now, another Shiv Sena MLA brings 'kidnapping' allegation against Eknath Shinde camp","content":"<p>&quot;We were trapped and taken to Surat, I walked a kilometre to run away from there. We will not ditch Shiv Sena which has made us MLA&quot;, says Kailash Patil, Shiv Sena MLA.<\/p>\n","date":"2022-06-23 14:48:15","pin":"0","status":"0"},{"title":"'Come back to Mumbai, discuss your issues with CM': Shiv Sena to its rebel MLAs","content":"<p>&quot;MLAs should not communicate from Guwahati, they should come back to Mumbai and discuss all this with CM. We are ready to consider exiting out of MVA if this is the will of all MLAs, but for that, they have to come here and discuss it with the CM&quot;: Shiv Sena leader Sanjay Raut.<\/p>\n","date":"2022-06-23 15:02:01","pin":"0","status":"1"},{"title":"'Eknath Shinde went against leadership to secure rights of Shiv Sena MLAs': Rebel legislator writes to Uddhav","content":"<p>While the Shiv Sena legislators had no access to the chief minister, the Congress and NCP, which are the &quot;real opponents&quot; of the Sena, were getting all the attention, he claimed in the letter, dated June 22. <strong><a href=\"https:\/\/www.newindianexpress.com\/nation\/2022\/jun\/23\/eknath-shinde-went-against-leadership-to-secure-rightsof-shiv-sena-mlas-rebel-legislator-writes-2468875.html\" target=\"_blank\">(READ FULL STORY HERE)<\/a><\/strong><\/p>\n","date":"2022-06-23 15:04:40","pin":"0","status":"1"},{"title":"Maharashtra Deputy Speaker approves Eknath Shinde's removal as Shiv Sena group leader in Assembly","content":"<p>The Shiv Sena on Tuesday removed Shinde as the party&#39;s group leader in the Assembly, hours after he revolted and travelled to Surat in Gujarat with some Shiv Sena MLAs, triggering a crisis in the tripartite Maha Vikas Aghadi (MVA-comprising the Sena, NCP and Congress) government in Maharashtra. <strong><a href=\"https:\/\/www.newindianexpress.com\/nation\/2022\/jun\/23\/maharashtra-crisis-maharashtra-deputy-speaker-approves-eknath-shindes-removal-as-shiv-sena-group-l-2468878.html\" target=\"_blank\">(READ FULL STORY HERE)<\/a><\/strong><\/p>\n","date":"2022-06-23 15:16:19","pin":"0","status":"1"},{"title":"Shiv Sena MLA, who 'escaped' from Surat, addresses media","content":"<p>&quot;We were forcibly taken to Surat, I tried to run away but was caught by Surat police. Despite having no complications, doctors told me that I had a heart attack. 300-350 police personnel were keeping an eye on us. Before me, MLA Prakash Abitkar tried to get away from them but he could not. We got to know about the conspiracy against the MVA government as soon as we reached Surat&#39;s hotel&quot;, said Nitin Deshmukh.<\/p>\n","date":"2022-06-23 15:25:00","pin":"0","status":"1"},{"title":"Congress calls for meeting after Sanjay Raut says Shiv Sena ready to exit MVA","content":"<p>Congress calls meeting of its leaders at Sahyadri guest house at 4pm, today, after Shiv Sena leader Sanjay Raut said of mulling exiting MVA, if all party MLAs want that. Senior Congress leaders incl HK Patil, Balasaheb Thorat, Nana Patole and Ashok Chavan to attend it.<\/p>\n","date":"2022-06-23 15:26:11","pin":"0","status":"1"},{"title":"Shiv Sena ready to walk out of MVA government, says Raut; asks rebel MLAs to return to Mumbai to discuss issue with CM","content":"<ul>\n\t<li>Amid a rebellion by Shiv Sena leader Eknath Shinde, party MP Sanjay Raut on Thursday said the Sena is ready to quit the Maha Vikas Aghadi (MVA) government in Maharashtra if the group of rebel legislators camping in Assam returns to Mumbai in 24 hours and discusses the issue with Chief Minister Uddhav Thackeray.<\/li>\n\t<li>Shinde is currently camping with 37 rebel MLAs of the Sena and nine independents in Guwahati, which has plunged the party-led state government into a crisis. The NCP and Congress also share power in the Uddhav Thackeray-led dispensation.<\/li>\n\t<li>&quot;You say you are real Shiv Sainiks and will not quit the party. We are ready to consider your demand provided you come back to Mumbai in 24 hours and discuss the issue with CM Uddhav Thackeray. Your demand will be considered positively. Don&#39;t write letters on Twitter and WhatsApp,&quot; Raut told reporters in Mumbai.<\/li>\n\t<li>&quot;The rebels who are out of Mumbai have raised the issue of Hindutva. If all these MLAs feel that Shiv Sena should walk out of the MVA, show guts to come back to Mumbai. You say you have issues only with the government and also say that you are true Shiv Sainiks. Your demand will be considered. But come and talk with Uddhav Thackeray,&quot; he added.<\/li>\n\t<li>CM Thackeray had on Wednesday offered to quit the top post amid the rebellion by Shinde and later also vacated his official residence in south Mumbai before moving to his family home in suburban Bandra.<\/li>\n<\/ul>\n","date":"2022-06-23 15:28:18","pin":"0","status":"1"},{"title":"Eknath Shinde camp hits back at MLA Nitin Deshmukh","content":"<blockquote class=\"twitter-tweet\" data-conversation=\"none\">\n<p dir=\"ltr\" lang=\"en\"><a href=\"https:\/\/twitter.com\/hashtag\/MaharashtraPoliticalCrisis?src=hash&amp;ref_src=twsrc%5Etfw\">#MaharashtraPoliticalCrisis<\/a> | After allegations of Shiv Sena MLA Nitin Deshmukh that he was forcibly taken to Surat, rebel leader Eknath Shinde camp releases earlier pictures of Nitin Deshmukh with other rebel MLAs <a href=\"https:\/\/t.co\/VQ6lWuP8cY\">pic.twitter.com\/VQ6lWuP8cY<\/a><\/p>\n&mdash; ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1539911609623379968?ref_src=twsrc%5Etfw\">June 23, 2022<\/a><\/blockquote>\n<script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2022-06-23 15:36:38","pin":"0","status":"1"},{"title":"Here is what MVA stakeholders have to say about Shiv Sena's 'exit' talks from alliance","content":"<ul>\n\t<li>&quot;We&#39;re with them (Shiv Sena) to stop BJP from coming to power. This game is happening due to ED. Congress is ready for Floor test. We&#39;re with MVA and will remain. If they (Shiv Sena) want to form an alliance with anyone, we don&#39;t have a problem&quot;: Maharashtra Congress chief Nana Patole.<\/li>\n\t<li>&quot;Maharashtra Vikas Aghadi is a government established for the development and welfare of Maharashtra. We will stand firmly with Uddhavji Thackeray till the end,&quot; tweets NCP leader Jayant Patil.<\/li>\n<\/ul>\n","date":"2022-06-23 16:00:43","pin":"0","status":"1"},{"title":"NCP on Sanjay Raut's statement on Shiv Sena is 'mulling' stepping out of MVA","content":"<p>&quot;They may have thought of something and said it. We will speak to them. They have not said anything to us directly. We won&#39;t comment on it yet,&quot; said NCP leader Jayant Patil.<\/p>\n","date":"2022-06-23 16:36:58","pin":"0","status":"1"},{"title":"Congress on Maharashtra crisis","content":"<p>&quot;BJP and Centre fully responsible for destabilising a stable govt in Maharashtra to form their own govt in the state. They&#39;re also doing this for Presidential polls. I want to say that we all (Congress, NCP, Shiv Sena) will strengthen Maha Vikas Aghadi,&quot; said senior party leader Mallikarjun Kharge.<\/p>\n","date":"2022-06-23 16:45:40","pin":"0","status":"1"},{"title":"'We have confidence in CM Uddhav Thackeray': Congress on rebellion in Shiv Sena ranks","content":"<p>The Congress, which along with the NCP shares power in the Uddhav Thackeray-led dispensation in Maharashtra, also expressed confidence that the BJP&#39;s attempt to &#39;topple a stable government&#39; will not succeed. <strong><a href=\"https:\/\/www.newindianexpress.com\/nation\/2022\/jun\/23\/we-have-confidence-in-cm-uddhav-thackeray-congress-on-rebellion-in-shiv-sena-ranks-2468901.html\" target=\"_blank\">(READ FULL STORY HERE)<\/a><\/strong><\/p>\n","date":"2022-06-23 16:51:35","pin":"0","status":"1"},{"title":"As Eknath Shinde's rebellion corner Shiv Sena, floor test back in focus","content":"<p>Former Maharashtra advocate general Shrihari Aney said the group of rebel MLAs led by Shinde can assert that it doesn&#39;t support the present Maha Vikas Aghadi (MVA) government (comprising the Sena, NCP and Congress), and that the dispensation has lost majority, which will result in a no-confidence motion. <strong><a href=\"https:\/\/www.newindianexpress.com\/world\/2022\/jun\/23\/maharashtra-crisis-as-eknath-shindes-rebellion-corner-shiv-sena-floor-test-back-in-focus-2468902.html\" target=\"_blank\">(READ FULL STORY HERE)<\/a><\/strong><\/p>\n","date":"2022-06-23 17:00:00","pin":"0","status":"1"},{"title":"NCP's reaction on Sanjay Raut's claims of Shiv Sena 'mulling' exit from MVA","content":"<p>&quot;If some people want to go out, then they&#39;ll somehow find reason to do that...even in governments run by single party there can be internal tussles, here there are three different parties, there could be differences,that doesn&#39;t mean government should be destabilised. We are in Sharad Pawar-led MVA and are with CM Uddhav Thackeray. If at all we aren&#39;t in power, we know how to fight while being in opposition,&quot; said NCP leader Chhagan Bhujbal.<\/p>\n","date":"2022-06-23 17:16:44","pin":"0","status":"1"},{"title":"Mamata attacks BJP amid Maharashtra crisis","content":"<p>&quot;We want justice for Uddhav Thackeray and all. Today (BJP) you&#39;re in power and using money, muscle, mafia power. But one day you have to go. Someone can break your party too. This is wrong and I don&rsquo;t support it. Instead of Assam, sent them (rebel MLAs) to Bengal. We&#39;ll give them good hospitality. After Maharashtra, they will topple other governments also. We want justice for people, constitution,&quot; the Bengal CM and the Trinamool supremo said on Thursday, while hitting out at the saffron party.<\/p>\n","date":"2022-06-23 17:28:27","pin":"0","status":"1"},{"title":"Would be surprised if Uddhav does U-turn, says Prithviraj Chavan on Raut's offer to rebel Shiv Sena MLAs","content":"<ul>\n\t<li>Congress leader Prithviraj Chavan said on Thursday that he did not think that Maharashtra Chief Minister Uddhav Thackeray would do an &quot;about-turn&quot; and agree to the rebel Shiv Sena MLAs&#39; demand that the Sena pull out of the ruling MVA alliance.<\/li>\n\t<li>Chavan was reacting to Sena MP Sanjay Raut&#39;s statement earlier in the day that the Sena was &quot;ready to consider&quot; the demand of the MLAs led by Eknath Shinde that it should end the Maha Vikas Aghadi alliance with the NCP and Congress.<\/li>\n\t<li>&quot;Does Sena want to join hands with the BJP in Maharashtra? The motives of Shiv Sena are not yet clear,&quot; Chavan, a former chief minister, told reporters when asked about Raut&#39;s comment.<\/li>\n\t<li>&quot;I have not heard Uddhav Thackeray sounding like this in his Wednesday evening&#39;s public address. I would be surprised if Uddhav Thackeray does such an about-turn in less than 24 hours. I don&#39;t think that Thackeray would do that,&quot; he said.<\/li>\n\t<li>It was not even clear whether Raut was articulating the Sena&#39;s official stand,&quot; Chavan added.<\/li>\n\t<li>&quot;There is not even clarity about which faction of the Shiv Sena should be considered as authentic face of the party,&quot; the Congress leader added.<\/li>\n<\/ul>\n","date":"2022-06-23 17:29:43","pin":"0","status":"1"},{"title":"Eknath Shinde, prominent NCP leader in touch with BJP to form Maharashtra govt: Sources","content":"<p>Rebel Shiv Sena leader Eknath Shinde is in touch with a top state BJP leader to form government in Maharashtra after toppling the Uddhav Thackeray regime, sources said, adding that a prominent NCP leader has also contacted BJP&#39;s top central leadership to form a coalition government in the state.<\/p>\n\n<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\">1.Rebelled Shiv Sena leader Eknath Shinde is in touch with top BJP leader of Maharashtra to form the govt wid Sena rebels &amp; BJP.<br \/>\n2. NCP prominent leader is in touch with top central leadership of BJP to form the NCP &amp; BJP govt in Maharashtra. <a href=\"https:\/\/twitter.com\/hashtag\/CHECKMATE?src=hash&amp;ref_src=twsrc%5Etfw\">#CHECKMATE<\/a><\/p>\n&mdash; Sudhir Suryawanshi (@ss_suryawanshi) <a href=\"https:\/\/twitter.com\/ss_suryawanshi\/status\/1539932871687012353?ref_src=twsrc%5Etfw\">June 23, 2022<\/a><\/blockquote>\n<script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2022-06-23 18:09:32","pin":"1","status":"1"},{"title":"Security beefed up at Sena HQ, Matoshree; Mumbai police commissioner meets CM","content":"<p>Mumbai police has beefed up security at the party headquarters Shiv Sena Bhavan and Chief Minister Uddhav Thackeray&#39;s private residence &#39;Matoshree&#39;. City police commissioner Sanjay Pandey met CM Thackeray at Matoshree to discuss the law and order situation, said an official. <strong><a href=\"https:\/\/www.newindianexpress.com\/nation\/2022\/jun\/23\/security-increased-at-sena-hq-matoshree-mumbai-police-commissioner-meets-cm-thackeray-2468923.html\">(READ FULL STORY HERE)<\/a><\/strong><\/p>\n","date":"2022-06-23 18:52:09","pin":"0","status":"1"},{"title":"Uddhav Thackeray, Ajit Pawar clarify Shiv Sena has support of all NCP MLAs","content":"<p>NCP leader Ajit Pawar said all MLAs of NCP are in support and&nbsp;that he never discriminated while allocating the fund to MLAs and various departments. He added that if they have any issues, then they can talk to him directly, and not make any statements in the media. Meanwhile, CM Uddhav Thackeray clarified that he still has NCP&#39;s support and that he will ensure the Shiv Sena rule is sustained in Maharashtra.<\/p>\n\n<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\">NCP leader Ajit Pawar said as per his observation, there is no big leader of BJP is behind Eknath Shinde&#39;s rebellion. <a href=\"https:\/\/twitter.com\/NewIndianXpress?ref_src=twsrc%5Etfw\">@NewIndianXpress<\/a> <a href=\"https:\/\/twitter.com\/TheMornStandard?ref_src=twsrc%5Etfw\">@TheMornStandard<\/a><\/p>\n&mdash; Sudhir Suryawanshi (@ss_suryawanshi) <a href=\"https:\/\/twitter.com\/ss_suryawanshi\/status\/1539964174821986304?ref_src=twsrc%5Etfw\">June 23, 2022<\/a><\/blockquote>\n<script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2022-06-23 19:08:13","pin":"0","status":"1"},{"title":"NCP vows to support to crisis-hit MVA, says it stands by CM Uddhav","content":"<p>The NCP on Thursday asserted it will do all it can to save Maharashtra&#39;s ruling alliance Maha Vikas Aghadi (MVA) and was firmly with Chief Minister Uddhav Thackeray, whose party Shiv Sena is facing a rebellion in its legislative ranks, threatening the stability of his government.<\/p>\n","date":"2022-06-23 19:54:34","pin":"1","status":"1"},{"title":"Whether we have majority or not, it will be proven in the Assembly: NCP chief Sharad Pawar","content":"<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\">he is confident that whether we have majority or not that will be proven on the floor of the house. He said he has seen such kind of situations several times in Maharashtra. <a href=\"https:\/\/twitter.com\/NewIndianXpress?ref_src=twsrc%5Etfw\">@NewIndianXpress<\/a> <a href=\"https:\/\/twitter.com\/TheMornStandard?ref_src=twsrc%5Etfw\">@TheMornStandard<\/a><\/p>\n&mdash; Sudhir Suryawanshi (@ss_suryawanshi) <a href=\"https:\/\/twitter.com\/ss_suryawanshi\/status\/1539977069290995712?ref_src=twsrc%5Etfw\">June 23, 2022<\/a><\/blockquote>\n<script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2022-06-23 19:57:21","pin":"0","status":"1"},{"title":"Some rebel MLAs are facing central agencies but I am unsure of causes of revolt: NCP chief Sharad Pawar","content":"<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\">NCP chief Sharad Pawar said that some of the Rebelled Shiv Sena MLA&#39;s are facing central agencies but not sure whether that is the reason behind their revolt. He said it is true that central agencies are being misused. <a href=\"https:\/\/twitter.com\/NewIndianXpress?ref_src=twsrc%5Etfw\">@NewIndianXpress<\/a><\/p>\n&mdash; Sudhir Suryawanshi (@ss_suryawanshi) <a href=\"https:\/\/twitter.com\/ss_suryawanshi\/status\/1539979139138166787?ref_src=twsrc%5Etfw\">June 23, 2022<\/a><\/blockquote>\n<script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2022-06-23 20:29:56","pin":"0","status":"1"},{"title":"'National party' has termed our revolt as 'historic', assured all help: Eknath Shinde","content":"<p>Shiv Sena leader Eknath Shinde, whose rebellion against the party has pushed the three-party Maha Vikas Aghadi (MVA) government to the brink of collapse, said a &quot;national party&quot; has termed their revolt as &quot;historic&quot; and assured to provide all help to them.<\/p>\n","date":"2022-06-23 20:47:23","pin":"1","status":"1"},{"title":"Sent as negotitator to Surat, Uddhav Thackeray's close aide Ravindra Phatak joins rebels","content":"<p>In yet another setback to the Uddhav Thackeray faction amid the ongoing political crisis, Shiv Sena leader Ravindra Fatak, who was believed to be a close associate of the chief minister and was flown to Surat as an emissary where rebel MLAs were initially camping, has switched sides to join the Eknath Shinde-led faction.<\/p>\n","date":"2022-06-23 21:23:41","pin":"0","status":"1"},{"title":"Shiv Sena minister Dada Bhuse, two others including Uddhav's aide Ravindra Phatak in Guwahati to join rebels","content":"<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"hi\">Shiv Sena minister Dada Bhuse, Sena MLA Sanjay Rathod &amp; Ravindra Phatak in Guwahati to join Eknath Shinde camp..<a href=\"https:\/\/twitter.com\/NewIndianXpress?ref_src=twsrc%5Etfw\">@NewIndianXpress<\/a> <a href=\"https:\/\/twitter.com\/TheMornStandard?ref_src=twsrc%5Etfw\">@TheMornStandard<\/a><\/p>\n&mdash; Sudhir Suryawanshi (@ss_suryawanshi) <a href=\"https:\/\/twitter.com\/ss_suryawanshi\/status\/1540003642618613765?ref_src=twsrc%5Etfw\">June 23, 2022<\/a><\/blockquote>\n<script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2022-06-23 21:41:54","pin":"0","status":"1"},{"title":"Shiv Sena MLA Ajay Chaudhari asks deputy speaker to disqualify 12 rebels including Eknath Shinde","content":"<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\">Shiv Sena MLA and CLP Ajay Chaudhari has asked state Assembly deputy speaker to disqualify 12 rebelled a shiv Sena MLAs including Eknath Shinde, Tanaji Sawant, Bharat Gogawale etc for defying the party whip. They failed to attend two official meeting of party. <a href=\"https:\/\/twitter.com\/NewIndianXpress?ref_src=twsrc%5Etfw\">@NewIndianXpress<\/a><\/p>\n&mdash; Sudhir Suryawanshi (@ss_suryawanshi) <a href=\"https:\/\/twitter.com\/ss_suryawanshi\/status\/1540007987179581441?ref_src=twsrc%5Etfw\">June 23, 2022<\/a><\/blockquote>\n<script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2022-06-23 22:08:42","pin":"0","status":"1"},{"title":"Party cannot scare us by disqualifying 12 of our MLAs: Rebel leader Eknath Shinde","content":"<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\">Ekath Shinde said that Shiv Sena cannot scare them by disqualification 12 Shiv Sena MLA&#39;s. He said as per law, by not attending the party meeting, you cannot disqualify us. <a href=\"https:\/\/twitter.com\/NewIndianXpress?ref_src=twsrc%5Etfw\">@NewIndianXpress<\/a> <a href=\"https:\/\/twitter.com\/TheMornStandard?ref_src=twsrc%5Etfw\">@TheMornStandard<\/a><\/p>\n&mdash; Sudhir Suryawanshi (@ss_suryawanshi) <a href=\"https:\/\/twitter.com\/ss_suryawanshi\/status\/1540020703038406656?ref_src=twsrc%5Etfw\">June 23, 2022<\/a><\/blockquote>\n<script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2022-06-23 23:09:32","pin":"0","status":"1"},{"title":"Shiv Sena workers didn't approve of alliance with Congress, NCP: Goa BJP chief Sadanand Tanavade","content":"<p>Goa BJP chief Sadanand Shet Tanavade on Thursday said that Shiv Sena workers in Maharashtra were angry because of the Uddhav Thackeray-led party&#39;s decision to form alliance with the NCP and Congress.<\/p>\n","date":"2022-06-23 23:23:46","pin":"0","status":"1"},{"title":"37 rebel MLAs write to Dy Speaker, declare Eknath Shinde as their leader","content":"<p>All 37 rebel Shiv Sena MLAs who are camping in Guwahati on Thursday sent a letter to Maharashtra Assembly&#39;s Deputy Speaker Narhari Zirwal, stating that Eknath Shinde will remain their group leader in legislature.<\/p>\n\n<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\"><a href=\"https:\/\/twitter.com\/hashtag\/Maharashtra?src=hash&amp;ref_src=twsrc%5Etfw\">#Maharashtra<\/a> | The letter has the signatures of 37 Shiv Sena MLAs and a copy of the letter has been sent to Deputy Speaker Narhari Zirwal, Governor Bhagat Singh Koshyari, and Secretary to the Legislative Council Rajendra Bhagwat. <a href=\"https:\/\/t.co\/95MtEbSfDA\">pic.twitter.com\/95MtEbSfDA<\/a><\/p>\n&mdash; ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1540035872477028352?ref_src=twsrc%5Etfw\">June 23, 2022<\/a><\/blockquote>\n<script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2022-06-24 00:27:15","pin":"1","status":"1"},{"title":"","content":"<p><strong>MAHARASHTRA CRISIS: FOLLOW LIVE&nbsp;UPDATES OF JUNE 24 <a href=\"http:\/\/newindianexpress.com\/live\/2022\/jun\/24\/maharashtra-crisis-day-4--shivsena-to-send-notices-to-rebel-leaders-2469227.html\" target=\"_blank\">here<\/a><\/strong><\/p>\n","date":"2022-06-25 15:08:17","pin":"0","status":"1"}]}