{"details":[{"title":"Two writ petitions in the SC","content":"<p>The deputy speaker had given the rebels time till 5.30 pm to submit their response in writing.&nbsp;<br \/>\nTwo writ petitions have been filed by the rebels in the SC. Shiv Sena boss and Chief Minister Uddhav Thackeray will be represented by senior advocates Kapil Sibal and Abhishek Singhvi in the SC. <a href=\"https:\/\/www.newindianexpress.com\/nation\/2022\/jun\/26\/maharashtra-crisis-rebel-shiv-sena-mla-eknath-shinde-moves-sc-against-disqualification-notice-2470008.html\" target=\"_blank\"><strong>(READ MORE)<\/strong><\/a><\/p>\n","date":"2022-06-27 09:28:46","pin":"0","status":"1"},{"title":"CM Uddhav Thackeray left with just handful of supporters","content":"<p>Amid political turmoil, except Aaditya Thackeray, all eight ministers who were elected in Maharashtra state assembly, have <a href=\"https:\/\/www.newindianexpress.com\/nation\/2022\/jun\/27\/maharashtra-crisis-chief-minister-uddhav-thackeray-left-with-just-handful-of-supporters-2470197.html\" target=\"_blank\"><strong>left Chief Minister Uddhav Thackeray<\/strong><\/a> and joined the rebel Shiv Sena minister Eknath Shinde camp in Guwahati.<\/p>\n","date":"2022-06-27 09:31:23","pin":"0","status":"1"},{"title":"Who will fund rebel MLAs’ hotel stay","content":"<p>According to sources, the <a href=\"https:\/\/www.newindianexpress.com\/nation\/2022\/jun\/27\/surat-hotel-bills-unpaid-question-mark-on-who-will-fund-rebel-mlas-stay-2470198.html\" target=\"_blank\"><strong>hotel bill is still pending<\/strong><\/a>. The booking was apparently done to block 35 rooms, but no names were disclosed, with the rooms being booked under names like &lsquo;Mr. A&rsquo; for a single room and &lsquo;Mr. and Mrs. A and B&rsquo; for a double room. No documents were kept for record purposes. Also, even in a double-occupancy room, only one MLA stayed.<\/p>\n","date":"2022-06-27 09:32:58","pin":"0","status":"1"},{"title":"Shide speaks to MNS chief Raj Thackeray","content":"<p>Rebel Shiv Sena leader Eknath Shide spoke to MNS chief Raj Thackeray about the recent political situation in the state, confirmed MNS leader. The MNS leader further said that Shinde spoke to Raj Thackeray over the phone twice and also enquired about his health.<\/p>\n\n<p><\/p>\n","date":"2022-06-27 10:24:03","pin":"0","status":"1"},{"title":"\"BJP pulling the strings amid Maharashtra political crisis\"","content":"<p>With the Centre providing Y-plus security to Maharashtra&#39;s rebel Shiv Sena MLAs, the party on Monday claimed it was now evident that the BJP was &quot;pulling the strings&quot; amid the current political turmoil in the state.<\/p>\n\n<p>An editorial in the Sena mouthpiece &#39;Saamana&#39; likened the rebel Sena MLAs led by Eknath Shinde to &quot;big bulls&quot;, and alleged that they have been &quot;sold&quot; for Rs 50 crore.<strong> <a href=\"https:\/\/www.newindianexpress.com\/nation\/2022\/jun\/27\/bjp-pulling-strings-in-maharashtra-claims-shiv-sena-on-y-plus-security-to-rebel-mlas-2470231.html\" target=\"_blank\">(READ HERE)<\/a><\/strong><\/p>\n","date":"2022-06-27 10:30:09","pin":"0","status":"1"},{"title":"I will work for the party till my last breath: Sunil Raut","content":"<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\">Maharashtra | Why will I go to Guwahati? I rather go to Goa to see natural beauty. Will I go to Guwahati to see the faces of those traitors? I am a Shiv Sainik, and I will work for the party till my last breath: Sunil Raut, Shiv Sena <a href=\"https:\/\/t.co\/3IiE5IKWYL\">pic.twitter.com\/3IiE5IKWYL<\/a><\/p>\n&mdash; ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1541281449600753664?ref_src=twsrc%5Etfw\">June 27, 2022<\/a><\/blockquote>\n<script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2022-06-27 10:36:51","pin":"0","status":"1"},{"title":"Balasaheb Thackeray's Sena supporting people linked to Mumbai blast, Dawood Ibrahim, says Shinde","content":"<p>&quot;How can Balasaheb Thackeray&#39;s Shiv Sena support people who had a direct connection with culprits of Mumbai bomb blast, Dawood Ibrahim and those responsible for taking lives of innocent people of Mumbai. That&#39;s why we took such a step, it&#39;s better to die,&quot; Shinde said in a tweet.<\/p>\n","date":"2022-06-27 11:17:31","pin":"0","status":"1"},{"title":"Supreme Court begins hearing petitions","content":"<p>The Bench has started hearing matters listed on the board.<\/p>\n","date":"2022-06-27 11:42:35","pin":"0","status":"1"},{"title":"Shiv Sena's rebels have 'axed their own feet'","content":"<p>Former Goa Congress Chief Girish Chodankar, who suffered political loss after 10 MLAs defected to the BJP in 2019, has equated the move of Shiv Sena&#39;s rebels to &quot;axing one&#39;s own feet&quot; and has called their act as &quot;political suicide&quot;.<\/p>\n","date":"2022-06-27 12:17:23","pin":"0","status":"1"},{"title":"Eknath Shinde calls for meeting of rebel MLAs in Guwahati","content":"<p>Rebel Shiv Sena leader Eknath Shinde has <a href=\"https:\/\/www.newindianexpress.com\/nation\/2022\/jun\/27\/maharashtra-political-crisis-rebel-sena-mla-shinde-calls-for-meeting-of-rebel-mlas-in-guwahati-2470243.html\" target=\"_blank\"><strong>called for a meeting<\/strong><\/a> of MLAs camping with him at a hotel in Assam&#39;s Guwahati at 2 pm, said sources. The meeting is called amid a Supreme Court hearing against the disqualification notices issued by Deputy Speaker Narhari Zirwal against rebel MLAs.<\/p>\n","date":"2022-06-27 12:24:13","pin":"0","status":"1"},{"title":"Shiv Sena ready for both street and legal fight, says Sanjay Raut","content":"<p>Shiv Sena MP Sanjay Raut said his party is ready for a &quot;street fight and a legal battle,&quot; ahead of the crucial hearing in the Supreme Court against the disqualification notice issued by the Maharashtra Assembly&#39;s deputy speaker to rebel party MLAs. <a href=\"https:\/\/www.newindianexpress.com\/nation\/2022\/jun\/27\/maharashtra-political-tussle-shiv-sena-ready-for-both-street-and-legal-fight-says-sanjay-raut-2470247.html\" target=\"_blank\"><strong>(READ MORE)<\/strong><\/a><\/p>\n","date":"2022-06-27 12:53:48","pin":"0","status":"1"},{"title":"Maharashtra cabinet reshuffle","content":"<p>CM Thackeray has <a href=\"https:\/\/www.newindianexpress.com\/nation\/2022\/jun\/27\/pil-filed-in-bombay-hc-against-rebel-sena-leader-eknath-shinde-for-instigating-internal-disorder-2470241.html\" target=\"_blank\"><strong>handed over portfolios<\/strong><\/a> of nine rebel ministers, who are currently camping in Guwahati, to other ministers. The portfolios of the rebel ministers were being handed over to other ministers for ease of administration, an official statement said. Nine Maharashtra ministers have so far joined the rebel camp led by Eknath Shinde.<\/p>\n","date":"2022-06-27 13:29:08","pin":"0","status":"1"},{"title":"'Didn't approach HC as MLAs have been threatened': Lawyer representing Eknath Shinde camp tells SC","content":"<ul>\n\t<li>Senior advocate Neeraj Kishan Kaul, appearing for Eknath Shinde and others, tells the Supreme Court that the Deputy Speaker cannot proceed with the disqualification proceedings when the resolution seeking his removal is pending.<\/li>\n\t<li>He also said that threats have been given to these MLAs and it was said that the bodies of 40 MLAs will arrive back. Kaul said Shinde and other MLAs didn&#39;t approach HC was that a minority of the legislative party is subverting the state machinery, attacking our houses.<\/li>\n\t<li>They&#39;re saying that our dead bodies will return from Assam. The atmosphere is not conducive for us to exercise our rights in Mumbai.<\/li>\n\t<li>Kaul added they didn&#39;t approach the High Court as Supreme Court had passed the order in many cases like floor test, and disqualification. The reply came on the SC questioning why Shinde didn&#39;t approach the High Court with his plea against disqualification notices issued to him and other rebel MLAs.<\/li>\n<\/ul>\n","date":"2022-06-27 14:06:40","pin":"0","status":"1"},{"title":"Amid Eknath Shinde vs Uddhav Thackeray, ED now summons Sanjay Raut for questioning","content":"<p>The Rajya Sabha MP, who has been asked to depose before the Enforcement Directorate at its office in south Mumbai and record his statement under the Prevention of Money Laundering Act (PMLA), termed the summons a conspiracy and said, &quot;Arrest me&quot;. <strong><a href=\"https:\/\/www.newindianexpress.com\/nation\/2022\/jun\/27\/amid-eknath-shinde-vs-uddhav-thackeray-ed-now-summons-sanjay-raut-for-questioning-2470256.html\" target=\"_blank\">(READ FULL STORY HERE)<\/a><\/strong><\/p>\n","date":"2022-06-27 14:22:54","pin":"0","status":"1"},{"title":"Rebel Maharashtra minister's supporters and Shiv Sena workers try to confront each other; cops intervene","content":"<ul>\n\t<li>The supporters of rebel Maharashtra minister Rajendra Patil-Yadravkar, who is camping with the Eknath Shinde-led group in Guwahati, and some Shiv Sena workers came face to face with each other in Kolhapur district on Monday.<\/li>\n\t<li>However, police intervened and tried to keep the two groups away from each other to avoid a clash, a senior police official said. The supporters of Yadravkar, an independent MLA from Shirol in Kolhapur, came out to back him in Jaysingpur town, one of the supporters said.<\/li>\n\t<li>A group of Shiv Sena workers also tried to stage a protest near the spot. Kolhapur Superintendent of Police Shailesh Balkawade told PTI that Yadravkar&#39;s had supporters gathered outside the MLA&#39;s office.<\/li>\n\t<li>The police stopped the Shiv Sena workers, who were approaching the spot, about 200 metres away, he said.<\/li>\n\t<li>&quot;Heavy security has been deployed. The police are ensuring the two sides do not clash,&quot; Balkawade said.<\/li>\n<\/ul>\n","date":"2022-06-27 14:53:00","pin":"0","status":"1"},{"title":"'Consitution bars court's scrutiny when the Speaker is deciding the issue': MVA lawyer in SC","content":"<p>Senior advocate Abhishek Manu Singhvi, appearing for Uddhav Thackeray group, tells Supreme Court that Article 212 of the Constitution bars court&#39;s scrutiny when the Speaker is deciding the issue. All internal management is barred from judicial scrutiny, he says.<\/p>\n","date":"2022-06-27 14:54:49","pin":"0","status":"1"},{"title":"'Won't kneel down': Sanjay Raut on ED notice","content":"<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\">I knew ED is going to summon me, I won&#39;t kneel down. No matter what the rebel MLAs do, I&#39;ll not go to Guwahati. I&#39;m Balasaheb&#39;s Shiv Sainik &amp; I&#39;ll stay with my party. I&#39;ll not appear before ED tomorrow. I will seek time from ED, but will definitely go: Shiv Sena MP Sanjay Raut <a href=\"https:\/\/t.co\/96YODJsWmy\">pic.twitter.com\/96YODJsWmy<\/a><\/p>\n&mdash; ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1541349668214280192?ref_src=twsrc%5Etfw\">June 27, 2022<\/a><\/blockquote>\n<script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2022-06-27 14:55:28","pin":"0","status":"1"},{"title":"Eknath Shinde camp hits out at Raut","content":"<p>&quot;Sanjay Raut is trying to finish the party on the orders of Sharad Pawar. NCP leaders would fire the gun using Raut&rsquo;s shoulder. We won&rsquo;t be finished, we won&rsquo;t stop and won&rsquo;t pull back until we take Maharashtra to new heights,&quot; said Shiv Sena rebel MLA Deepak Kesarkar.<\/p>\n","date":"2022-06-27 14:56:21","pin":"0","status":"1"},{"title":"'Speaker rejected the notice since its authenticity is not verified': Lawyer in SC","content":"<ul>\n\t<li>The apex court said that 14 days is the time frame for the Speaker to put up notice before the House. Here MLAs have served notice calling upon him to put resolution under Article 179.<\/li>\n\t<li>Senior Adv Rajeev Dhavan, who is appearing for Deputy Speaker , said in reply that Speaker has rejected the notice saying its authenticity is not verified.<\/li>\n<\/ul>\n","date":"2022-06-27 14:59:26","pin":"0","status":"1"},{"title":"SC issues notice to Deputy Speaker, Centre on plea against rebel Shiv Sena MLAs' disqualification","content":"<ul>\n\t<li>Supreme Court issues notice to Deputy Speaker, Secretary of Maharashtra State Legislative Assembly, Centre and others on pleas filed by rebel MLAs against the disqualification notice issued by the Deputy Speaker Narhari Zirwal against Eknath Shinde and 15 other rebel legislators.<\/li>\n\t<li>Supreme Court also issues notice to Shiv Sena leaders Ajay Chaudhary, Sunil Prabhu and asks them to file a reply within five days. Supreme Court lists the plea for hearing on July 11th.<\/li>\n<\/ul>\n","date":"2022-06-27 15:07:00","pin":"1","status":"1"},{"title":"'Adequate security has been given to the rebel Shiv Sena MLAs': Uddhav government in SC","content":"<p>On request of providing security to 39 MLAs alleging threat, SC records statement of standing counsel of Maharashtra government that adequate steps have already been taken and the state government will further ensure that no harm is caused to the life, liberty, or property of the MLAs.<\/p>\n","date":"2022-06-27 15:32:07","pin":"0","status":"1"},{"title":"Apex court gives more relief to Shinde camp","content":"<p>Supreme Court, in an interim direction, allows Eknath Shinde and other rebel MLAs to file a reply to the disqualification notice issued to them by Deputy Speaker by July 11th, 5.30 pm. Earlier, Deputy Speaker had granted them time to file a reply by today.<\/p>\n","date":"2022-06-27 15:32:52","pin":"0","status":"1"}]}