{"details":[{"title":"Rajapaksa will resign today as promised: Speaker","content":"<p>Sri Lanka&#39;s Parliament Speaker Mahinda Yapa Abeywardena said President Gotabaya Rajapaksa has informed him over telephone that he will resign on Wednesday as promised.&nbsp;He said the vote for the new president will take place on July 20 and urged citizens to remain calm.<\/p>\n","date":"2022-07-13 15:35:08","pin":"0","status":"1"},{"title":"Committee formed to control situation","content":"<ul>\n\t<li>According to local news media reports, a committee, comprising the Chief of Defence Staff, Tri-forces Commanders, and the Inspector General of Police has been appointed to control the current situation in Lanka, said&nbsp;acting President Ranil Wickremesinghe.<\/li>\n\t<li>He further accused protesters of resorting to fascism, adding that the emergency rule and curfew will be in place to prevent these efforts and to restore normalcy in the country.<\/li>\n<\/ul>\n","date":"2022-07-13 15:38:36","pin":"0","status":"1"},{"title":"Sri Lanka anti-government protesters break into state TV station","content":"<ul>\n\t<li>Sri Lanka&#39;s anti-government protesters broke into the main state television station Wednesday and briefly took over broadcasts, footage showed.<\/li>\n\t<li>An unidentified man barged into the studio of Rupavahini network during a live programme and ordered that only protest-related news should be broadcast. The transmission was cut off and replaced with a recorded programme.<\/li>\n<\/ul>\n","date":"2022-07-13 15:39:17","pin":"0","status":"1"},{"title":"Visuals of protesters storming the PM office","content":"<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\"><a href=\"https:\/\/twitter.com\/hashtag\/WATCH?src=hash&amp;ref_src=twsrc%5Etfw\">#WATCH<\/a> | Sri Lanka: Inside visuals from the premises of Sri Lanka&#39;s Prime Minister&#39;s office in Colombo after it was stormed by protestors <a href=\"https:\/\/t.co\/nEoc9zsoBk\">pic.twitter.com\/nEoc9zsoBk<\/a><\/p>\n&mdash; ANI (@ANI) <a href=\"https:\/\/twitter.com\/ANI\/status\/1547155548604596226?ref_src=twsrc%5Etfw\">July 13, 2022<\/a><\/blockquote>\n<script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2022-07-13 15:45:43","pin":"0","status":"1"},{"title":"Don't fall ill, warn Lanka doctors due to drug shortage","content":"<p>Don&#39;t fall ill or get into accidents, the advice doctors in Sri Lanka are giving patients as the country&#39;s economic crisis leaves its health care system short of drugs and other vital supplies. <strong><a href=\"https:\/\/www.newindianexpress.com\/world\/2022\/jul\/13\/dont-fall-ill-sri-lanka-doctors-warn-of-drug-shortage-2476107.html\">(Read more)<\/a><\/strong><\/p>\n","date":"2022-07-13 15:58:59","pin":"0","status":"1"},{"title":"Timeline: How Sri Lanka fell apart!","content":"<p>It&#39;s the economy stupid. Bill Clinton&#39;s famous line sums up the crisis that went on to drive the all-powerful Rajapaksa family out of Sri Lanka.<\/p>\n\n<p>The Emerald Isles, home to 22 million people, has suffered months of lengthy blackouts, acute food and fuel shortages, and galloping inflation in its most painful downturn on record.<\/p>\n\n<p>A <a href=\"https:\/\/www.newindianexpress.com\/world\/2022\/jul\/13\/sri-lanka-crisis-timeline-a-country-in-tatters-2476097.html\" target=\"_blank\"><strong>timeline of how it all unravelled<\/strong><\/a>.<\/p>\n","date":"2022-07-13 15:59:59","pin":"0","status":"1"},{"title":"Military helicopters fly over protest site","content":"<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\">Military helicopters low fly-by over GotaGoGama protest site in Colombo<a href=\"https:\/\/twitter.com\/hashtag\/SLnews?src=hash&amp;ref_src=twsrc%5Etfw\">#SLnews<\/a> <a href=\"https:\/\/twitter.com\/hashtag\/News1st?src=hash&amp;ref_src=twsrc%5Etfw\">#News1st<\/a> <a href=\"https:\/\/twitter.com\/hashtag\/SriLanka?src=hash&amp;ref_src=twsrc%5Etfw\">#SriLanka<\/a> <a href=\"https:\/\/twitter.com\/hashtag\/lka?src=hash&amp;ref_src=twsrc%5Etfw\">#lka<\/a> <a href=\"https:\/\/twitter.com\/hashtag\/MilitaryHelicopters?src=hash&amp;ref_src=twsrc%5Etfw\">#MilitaryHelicopters<\/a> <a href=\"https:\/\/twitter.com\/hashtag\/LowFlyByeOver?src=hash&amp;ref_src=twsrc%5Etfw\">#LowFlyByeOver<\/a> <a href=\"https:\/\/twitter.com\/hashtag\/GotaGoGama?src=hash&amp;ref_src=twsrc%5Etfw\">#GotaGoGama<\/a> <a href=\"https:\/\/twitter.com\/hashtag\/ProtestSite?src=hash&amp;ref_src=twsrc%5Etfw\">#ProtestSite<\/a> <a href=\"https:\/\/twitter.com\/hashtag\/Colombo?src=hash&amp;ref_src=twsrc%5Etfw\">#Colombo<\/a> <a href=\"https:\/\/twitter.com\/hashtag\/SriLankans?src=hash&amp;ref_src=twsrc%5Etfw\">#SriLankans<\/a> <a href=\"https:\/\/t.co\/mSgXLEhRUi\">pic.twitter.com\/mSgXLEhRUi<\/a><\/p>\n&mdash; Newsfirst.lk Sri Lanka (@NewsfirstSL) <a href=\"https:\/\/twitter.com\/NewsfirstSL\/status\/1547123341932232705?ref_src=twsrc%5Etfw\">July 13, 2022<\/a><\/blockquote>\n<script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2022-07-13 16:01:23","pin":"0","status":"1"},{"title":"Acting President Wickremesinghe defiant in TV address","content":"<ul>\n\t<li>Acting President Ranil Wickremesinghe in a televised address said he had instructed security forces to restore order, but troops were seen backing down at his office leaving gates open for protesters to stroll in, <em>AFP<\/em> reported.<\/li>\n\t<li>&quot;I have ordered military commanders and the police chief to do what is necessary to restore order,&quot; Wickremesinghe said.<\/li>\n\t<li>&quot;Those who stormed into my office want to stop me from discharging my responsibilities as acting president.&quot;<\/li>\n\t<li>His private home was set ablaze on Saturday after protesters captured the president&#39;s office and home on Saturday.<\/li>\n\t<li>&quot;We can&#39;t tear up our constitution. We can&rsquo;t allow fascists to take over. We must end this fascist threat to democracy,&quot; he said adding that the state buildings occupied by protesters must be returned to state custody.<\/li>\n<\/ul>\n","date":"2022-07-13 16:07:14","pin":"0","status":"1"},{"title":"Will not comment: Maldives Foreign Ministry on Rajapaksa's arrival","content":"<p>The Maldives&#39; Foreign Ministry on Wednesday refused to comment on embattled Sri Lankan President Gotabaya Rajapaksa&#39;s arrival in the country along with his wife and two security officers on board a military aircraft that took off from Colombo&#39;s main international airport. <a href=\"https:\/\/www.newindianexpress.com\/world\/2022\/jul\/13\/maldives-foreign-ministry-denies-commenting-on-sri-lankan-prez-rajapaksas-presence-in-male-2476108.html\"><strong>(Read more)<\/strong><\/a><\/p>\n","date":"2022-07-13 16:08:46","pin":"0","status":"1"},{"title":"Emergency party leaders meeting called","content":"<p>Sri Lankan Speaker Mahinda Yapa Abeywardene calls for emergency Party Leaders meeting at 5:30 pm, according to Sri Lankan media reports.<\/p>\n\n<p><\/p>\n","date":"2022-07-13 17:12:02","pin":"0","status":"1"},{"title":"Maldives National Party unhappy over Rajapaksa's arrival","content":"<p>The Maldives National Party expressed &quot;unhappiness&quot; over the Maldivian government&#39;s decision to allow Sri Lankan President Gotabaya Rajapaksa to travel to the country, and said it will move a motion, seeking the explanation from the Solih dispensation. <a href=\"https:\/\/www.newindianexpress.com\/world\/2022\/jul\/13\/maldives-national-party-expresses-unhappiness-over-govts-decision-to-allow-rajapaksas-visit-2476124.html\"><strong>(Read more)<\/strong><\/a><\/p>\n","date":"2022-07-13 17:38:30","pin":"0","status":"0"},{"title":"Lanka IOC steps up fuel supplies; to maintain separate stockpile for ambulances","content":"<ul>\n\t<li>Lanka IOC has asked all its 216 petrol pumps in Sri Lanka to maintain a separate fuel stockpile for supply to ambulances in the crisis-hit island nation.&nbsp;<\/li>\n\t<li>Lanka IOC has ramped up operations to meet the increased fuel demand. It is selling some 1.5 million litres of petrol and diesel from its petrol pumps daily.&nbsp;With depleted foreign exchange reserves, Ceylon Petroleum Corporation&nbsp;is facing problems importing oil.<\/li>\n<\/ul>\n","date":"2022-07-13 18:15:57","pin":"0","status":"1"},{"title":"Sri Lankan military calls for political resolution to maintain law and order","content":"<ul>\n\t<li>Sri Lanka&#39;s military and the police requested the Speaker to call an all-party leaders&#39; meeting and inform them of the steps they will take to ensure a political resolution to the &quot;current conflict&quot; in the run-up to the appointment of a new president.<\/li>\n\t<li>In a statement, Chief of Defence Staff General Shavendra Silva made &quot;a special appeal&quot; to the people, especially the youth, to support the three forces&nbsp;and the police to maintain law and order in the county.<\/li>\n\t<li>He urged protesters not to vandalise state or private property.<\/li>\n\t<li>&quot;We, the tri-forces commanders and the Inspector General of police have requested the Speaker (Mahinda Yapa Abeywardena) to call an all-party leaders meeting and inform us of the steps they will take to ensure a political resolution to current conflict in the run up to the appointment of a new president,&quot; Silva said.<\/li>\n<\/ul>\n","date":"2022-07-13 18:40:00","pin":"0","status":"1"},{"title":"Rajapaksa to leave for Singapore from Maldives","content":"<p>Gotabaya Rajapaksa, who landed in the Maldivian capital Male on a Sri Lankan Air Force plane, will be leaving for Singapore on Wednesday. Rajapaksa who left for the Maldives early this morning is to leave for Singapore later Wednesday, sources in the Maldives told the Daily Mirror. <a href=\"https:\/\/www.newindianexpress.com\/world\/2022\/jul\/13\/former-sri-lankan-president-rajapaksa-to-leave-for-singapore-from-maldives-2476131.html\"><strong>(Read more)<\/strong><\/a><\/p>\n","date":"2022-07-13 18:57:21","pin":"0","status":"1"},{"title":"26-year-old protestor dies","content":"<p>A 26 year old protestor who was hospitalized after being tear-gassed outside the Prime Minister&#39;s office in Flower Road today has died after developing breathing difficulties.<\/p>\n","date":"2022-07-13 20:03:52","pin":"0","status":"1"},{"title":"'Take steps to ensure law and order': Sri Lanka's ruling SLPP party to acting President Wickremesinghe","content":"<p>Sri Lanka is witnessing an escalating political crisis and a fresh wave of protests triggered by the fleeing of embattled President Gotabaya Rajapaksa from the country to the Maldives.<strong><a href=\"https:\/\/www.newindianexpress.com\/world\/2022\/jul\/13\/take-steps-to-ensure-law-and-order-sri-lankas-ruling-slpp-party-to-acting-president-wickremesing-2476145.html\" target=\"_blank\"> (READ FULL STORY HERE)<\/a><\/strong><\/p>\n","date":"2022-07-13 20:06:29","pin":"0","status":"1"},{"title":"Economy collapses, protests swell, President flees: Sri Lanka's turmoil explained","content":"<p>President Gotabaya Rajapaksa has said he will resign, after months of protests against his government over the worst economic crisis in the nation&#39;s history. <strong><a href=\"https:\/\/www.newindianexpress.com\/world\/2022\/jul\/13\/economy-collapses-protests-swell-president-flees-sri-lankas-turmoil-explained-2476143.html\" target=\"_blank\">(READ FULL STORY HERE)<\/a><\/strong><\/p>\n","date":"2022-07-13 20:07:21","pin":"0","status":"1"},{"title":"'Gota Go Home!': A brief history of the rise, fall of Sri Lanka's President","content":"<p>From being a &quot;war hero&quot; to becoming a symbol of hatred who pushed the island nation into an economic and constitutional crisis and fled the country hours before he was supposed to step down in the face of a public revolt, Rajapaksa&#39;s political destiny has turned a full circle. <strong><a href=\"https:\/\/www.newindianexpress.com\/world\/2022\/jul\/13\/gota-go-home-a-brief-history-of-the-rise-fall-of-sri-lankas-president-2476146.html\" target=\"_blank\">(READ FULL STORY HERE)<\/a><\/strong><\/p>\n","date":"2022-07-13 20:16:51","pin":"0","status":"1"},{"title":"'Appoint a PM acceptable to both the Government and Opposition': Wickremesinghe to Sri Lanka Speaker","content":"Acting President and Prime Minister Ranil Wickremesinghe has informed Speaker Mahinda Yapa Abeywardena to nominate a Prime Minister who is acceptable to both the Government and Opposition.","date":"2022-07-13 20:30:39","pin":"0","status":"1"},{"title":"Sri Lanka crisis will have 'big impact' on Chinese investments, bilateral ties: Experts","content":"<p>&quot;In the short run, there will be a big impact on China&#39;s relations with Sri Lanka because the influence of the Rajapaksa family in Sri Lanka&#39;s political circles will be undermined and a political comeback will be unlikely in the near future,&quot; Lin Minwang, a South Asia expert at Fudan University in Shanghai said as quoted by Hong Kong-based South China Morning Post on Tuesday.<strong><a href=\"https:\/\/www.newindianexpress.com\/world\/2022\/jul\/13\/sri-lanka-crisis-will-have-big-impact-on-chinese-investments-bilateral-ties-experts-2476151.html\" target=\"_blank\"> (READ FULL STORY HERE)<\/a><\/strong><\/p>\n","date":"2022-07-13 20:32:20","pin":"0","status":"1"},{"title":"WATCH | Latest scenes from the island nation","content":"<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\">Police fire tear gas &amp; use water canons to disperse protestors near Speaker&#39;s residence close to Parliament<br \/>\n<br \/>\n???? Mamith Dissanayake <a href=\"https:\/\/t.co\/bG3WfadRlB\">pic.twitter.com\/bG3WfadRlB<\/a><\/p>\n&mdash; NewsWire ???????? (@NewsWireLK) <a href=\"https:\/\/twitter.com\/NewsWireLK\/status\/1547240297985216513?ref_src=twsrc%5Etfw\">July 13, 2022<\/a><\/blockquote>\n<script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2022-07-13 21:01:33","pin":"0","status":"1"},{"title":"Gotabaya issues Gazette appointing Ranil as Acting President","content":"<p>Gazette Extraordinary issued by the President Gotabaya Rajapaksa, appointing Prime Minister Ranil Wickremesinghe to exercise, perform &amp; discharge the powers, duties &amp; functions of the Office of President with effect from July 13, 2022.<\/p>\n","date":"2022-07-13 21:21:33","pin":"0","status":"1"},{"title":"Sri Lanka's opposition leaders ask PM Wickremesinghe to quit ahead of President's resignation","content":"<ul>\n\t<li>Sri Lanka&#39;s opposition leaders have asked Prime Minister Ranil Wickremesinghe to quit ahead of the resignation of President Gotabaya Rajapaksa who has promised to step down on Wednesday, according to a media report.<\/li>\n\t<li>Tamil National Alliance (TNA) MP M. A. Sumanthiran said on Wednesday that the decision was taken at an all-party meeting which was attended by leaders excluding those from the Government, News 1st channel reported.<\/li>\n\t<li>He said two unanimous decisions were taken at the meeting, and one was for Wickremesinghe to resign immediately, while the other was for the speaker to sack the Prime Minister before the President&#39;s resignation takes effect, the channel reported.<\/li>\n\t<li>Meanwhile, Chief Opposition Whip Lakshman Kiriella from the Samagi Jana Balavegaya said the Commanders of the three-armed forces were also present at the meeting.<\/li>\n\t<li>&quot;The Prime Minister was avoiding the party leaders,&quot; he said.<\/li>\n\t<li>The Commanders informed that the protesters were near the gates of parliament, and wanted permission to repel them by using force, he said.<\/li>\n\t<li>&quot;We said we cannot agree to such a request,&quot;&nbsp;he said, adding that at the last party leaders meeting the call was for the President and the Prime Minister to resign.<\/li>\n\t<li>The leaders have asked the speaker to sack Wickremesinghe to take up the post of Acting President, and thereafter Parliament is prepared to work with him.<\/li>\n\t<li>President Rajapaksa on Wednesday fled to the Maldives from where he appointed Prime Minister Wickremesinghe as the acting President, escalating the political crisis and triggering a fresh wave of protests in the country reeling under the worst financial crisis in decades.<\/li>\n\t<li>Speaker Mahinda Yapa Abeywardena has said that President Rajapaksa has informed him over the telephone that he will resign today as promised.<\/li>\n\t<li>He said the vote for the new president will take place on July 20. Wickremesinghe, who is now acting President, has declared a state of emergency in the country and a curfew in the Western province has been imposed as protesters gathered near his office at Flower Road in Colombo.<\/li>\n<\/ul>\n","date":"2022-07-13 21:37:56","pin":"1","status":"1"},{"title":"'Military crackdown on protesters could worsen situation': Experts on Sri Lanka crisis","content":"<p>It is very important that political anarchy is avoided in Sri Lanka and all the stakeholders must work together to restore political stability, they said.<strong><a href=\"https:\/\/www.newindianexpress.com\/world\/2022\/jul\/13\/military-crackdown-on-protesters-could-worsen-situation-experts-on-sri-lanka-crisis-2476188.html\" target=\"_blank\"> (READ FULL STORY HERE)<\/a><\/strong><\/p>\n","date":"2022-07-13 22:26:04","pin":"0","status":"1"},{"title":"35 hurt in clashes near Parliament","content":"<p>So far 35&nbsp;persons hospitalized following clashes at Polduwa junction near Parliament: Hospital sources.<\/p>\n","date":"2022-07-13 22:42:10","pin":"0","status":"1"},{"title":"WATCH | Visuals from Sri Lanka's state-owned television channel Rupavahini's headquarter earlier Wednesday","content":"<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\">A video released by Sri Lanka Rupavahini Corporation shows a few protestors entering the premises and engaging the staff in conversation demanding for all scheduled programs to be halted and for only aragalaya content to be aired on TV. <a href=\"https:\/\/twitter.com\/hashtag\/DailyMirror?src=hash&amp;ref_src=twsrc%5Etfw\">#DailyMirror<\/a> <a href=\"https:\/\/twitter.com\/hashtag\/SriLanka?src=hash&amp;ref_src=twsrc%5Etfw\">#SriLanka<\/a> <a href=\"https:\/\/twitter.com\/hashtag\/SLnews?src=hash&amp;ref_src=twsrc%5Etfw\">#SLnews<\/a> <a href=\"https:\/\/t.co\/l9RBzPVUAM\">pic.twitter.com\/l9RBzPVUAM<\/a><\/p>\n&mdash; DailyMirror (@Dailymirror_SL) <a href=\"https:\/\/twitter.com\/Dailymirror_SL\/status\/1547259342151225346?ref_src=twsrc%5Etfw\">July 13, 2022<\/a><\/blockquote>\n<script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2022-07-13 22:43:22","pin":"0","status":"1"},{"title":"WATCH | Protestors accuse government forces of beating them","content":"<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\">&ldquo;They mercilessly beat us up,&rdquo; a protestor speaks from Parliament road. <a href=\"https:\/\/twitter.com\/hashtag\/DailyMirror?src=hash&amp;ref_src=twsrc%5Etfw\">#DailyMirror<\/a> <a href=\"https:\/\/twitter.com\/hashtag\/SriLanka?src=hash&amp;ref_src=twsrc%5Etfw\">#SriLanka<\/a> <a href=\"https:\/\/twitter.com\/hashtag\/SLnews?src=hash&amp;ref_src=twsrc%5Etfw\">#SLnews<\/a> <a href=\"https:\/\/t.co\/sd7wh8mTt2\">pic.twitter.com\/sd7wh8mTt2<\/a><\/p>\n&mdash; DailyMirror (@Dailymirror_SL) <a href=\"https:\/\/twitter.com\/Dailymirror_SL\/status\/1547260526799065091?ref_src=twsrc%5Etfw\">July 13, 2022<\/a><\/blockquote>\n<script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2022-07-13 22:44:12","pin":"0","status":"1"},{"title":"Even ambulances didn't get spared from the violence","content":"<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\">Please don&#39;t do this ????<br \/>\nOne of SuwaSeriya ambulance reportedly attacked and in another the staff were harassed at the protest near Diyatha Uyana.<br \/>\nStop Violence ????<a href=\"https:\/\/twitter.com\/hashtag\/LKA?src=hash&amp;ref_src=twsrc%5Etfw\">#LKA<\/a> <a href=\"https:\/\/twitter.com\/hashtag\/SriLanka?src=hash&amp;ref_src=twsrc%5Etfw\">#SriLanka<\/a> <a href=\"https:\/\/twitter.com\/hashtag\/SriLankaCrisis?src=hash&amp;ref_src=twsrc%5Etfw\">#SriLankaCrisis<\/a> <a href=\"https:\/\/twitter.com\/hashtag\/SriLankaProtests?src=hash&amp;ref_src=twsrc%5Etfw\">#SriLankaProtests<\/a> <a href=\"https:\/\/t.co\/beefe5846h\">pic.twitter.com\/beefe5846h<\/a><\/p>\n&mdash; Sri Lanka Tweet ???????? ???? (@SriLankaTweet) <a href=\"https:\/\/twitter.com\/SriLankaTweet\/status\/1547265868614483968?ref_src=twsrc%5Etfw\">July 13, 2022<\/a><\/blockquote>\n<script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script>","date":"2022-07-13 22:45:09","pin":"0","status":"1"},{"title":"Curfew till Thursday early morning","content":"<p>An islandwide curfew has been imposed until 5:00am on the Thursday the 14th of July 2022.<\/p>\n","date":"2022-07-13 22:45:42","pin":"0","status":"1"}]}